Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/**
 * \file IfxGtm_reg.h
 * \brief
 * \copyright Copyright (c) 2015 Infineon Technologies AG. All rights reserved.
 *
 * Version: tc39x_its_SFR_V1.0.1_1.3_230715.xml dated 28.07.2015
 * Specification: its_V1.0.1_1.3.pdf
 * MAY BE CHANGED BY USER [yes/no]: No
 *
 *                                 IMPORTANT NOTICE
 *
 * Infineon Technologies AG (Infineon) is supplying this file for use
 * exclusively with Infineon's microcontroller products. This file can be freely
 * distributed within development tools that are supporting such microcontroller
 * products.
 *
 * THIS SOFTWARE IS PROVIDED "AS IS".  NO WARRANTIES, WHETHER EXPRESS, IMPLIED
 * OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF
 * MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE.
 * INFINEON SHALL NOT, IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL,
 * OR CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.
 *
 * \defgroup IfxLld_Gtm_Cfg Gtm address
 * \ingroup IfxLld_Gtm
 *
 * \defgroup IfxLld_Gtm_Cfg_BaseAddress Base address
 * \ingroup IfxLld_Gtm_Cfg
 *
 * \defgroup IfxLld_Gtm_Cfg_Gtm 2-GTM
 * \ingroup IfxLld_Gtm_Cfg
 *
 */
#ifndef IFXGTM_REG_H
#define IFXGTM_REG_H 1
/******************************************************************************/
#include "IfxGtm_regdef.h"
/******************************************************************************/
/** \addtogroup IfxLld_Gtm_Cfg_BaseAddress
 * \{  */

/** \\brief  GTM object */
#define MODULE_GTM /*lint --e(923)*/ ((*(Ifx_GTM *)0xF0100000u))
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Gtm_Cfg_Gtm
 * \{  */

/** \\brief  9FFA0, ADC Trigger 3Output Select 1 Register */
#define GTM_ADCTRIG4OUT0               /*lint --e(923)*/ (*(volatile Ifx_GTM_ADCTRIG4OUT0 *)0xF019FFA0u)

/** \\brief  9FFA4, ADC Trigger 1 Output Select 1 Register */
#define GTM_ADCTRIG4OUT1               /*lint --e(923)*/ (*(volatile Ifx_GTM_ADCTRIG4OUT1 *)0xF019FFA4u)

/** \\brief  C, GTM AEI Timeout exception address register */
#define GTM_AEI_ADDR_XPT               /*lint --e(923)*/ (*(volatile Ifx_GTM_AEI_ADDR_XPT *)0xF010000Cu)

/** \\brief  2C, GTM AEI Non zero status register */
#define GTM_AEI_STA_XPT                /*lint --e(923)*/ (*(volatile Ifx_GTM_AEI_STA_XPT *)0xF010002Cu)

/** \\brief  18080, AFD 0 FIFO 0 buffer access register */
#define GTM_AFD0_CH0_BUF_ACC           /*lint --e(923)*/ (*(volatile Ifx_GTM_AFD_CH_BUF_ACC *)0xF0118080u)

/** \\brief  18090, AFD 0 FIFO 0 buffer access register */
#define GTM_AFD0_CH1_BUF_ACC           /*lint --e(923)*/ (*(volatile Ifx_GTM_AFD_CH_BUF_ACC *)0xF0118090u)

/** \\brief  180A0, AFD 0 FIFO 0 buffer access register */
#define GTM_AFD0_CH2_BUF_ACC           /*lint --e(923)*/ (*(volatile Ifx_GTM_AFD_CH_BUF_ACC *)0xF01180A0u)

/** \\brief  180B0, AFD 0 FIFO 0 buffer access register */
#define GTM_AFD0_CH3_BUF_ACC           /*lint --e(923)*/ (*(volatile Ifx_GTM_AFD_CH_BUF_ACC *)0xF01180B0u)

/** \\brief  180C0, AFD 0 FIFO 0 buffer access register */
#define GTM_AFD0_CH4_BUF_ACC           /*lint --e(923)*/ (*(volatile Ifx_GTM_AFD_CH_BUF_ACC *)0xF01180C0u)

/** \\brief  180D0, AFD 0 FIFO 0 buffer access register */
#define GTM_AFD0_CH5_BUF_ACC           /*lint --e(923)*/ (*(volatile Ifx_GTM_AFD_CH_BUF_ACC *)0xF01180D0u)

/** \\brief  180E0, AFD 0 FIFO 0 buffer access register */
#define GTM_AFD0_CH6_BUF_ACC           /*lint --e(923)*/ (*(volatile Ifx_GTM_AFD_CH_BUF_ACC *)0xF01180E0u)

/** \\brief  180F0, AFD 0 FIFO 0 buffer access register */
#define GTM_AFD0_CH7_BUF_ACC           /*lint --e(923)*/ (*(volatile Ifx_GTM_AFD_CH_BUF_ACC *)0xF01180F0u)

/** \\brief  1C080, AFD 0 FIFO 0 buffer access register */
#define GTM_AFD1_CH0_BUF_ACC           /*lint --e(923)*/ (*(volatile Ifx_GTM_AFD_CH_BUF_ACC *)0xF011C080u)

/** \\brief  1C090, AFD 0 FIFO 0 buffer access register */
#define GTM_AFD1_CH1_BUF_ACC           /*lint --e(923)*/ (*(volatile Ifx_GTM_AFD_CH_BUF_ACC *)0xF011C090u)

/** \\brief  1C0A0, AFD 0 FIFO 0 buffer access register */
#define GTM_AFD1_CH2_BUF_ACC           /*lint --e(923)*/ (*(volatile Ifx_GTM_AFD_CH_BUF_ACC *)0xF011C0A0u)

/** \\brief  1C0B0, AFD 0 FIFO 0 buffer access register */
#define GTM_AFD1_CH3_BUF_ACC           /*lint --e(923)*/ (*(volatile Ifx_GTM_AFD_CH_BUF_ACC *)0xF011C0B0u)

/** \\brief  1C0C0, AFD 0 FIFO 0 buffer access register */
#define GTM_AFD1_CH4_BUF_ACC           /*lint --e(923)*/ (*(volatile Ifx_GTM_AFD_CH_BUF_ACC *)0xF011C0C0u)

/** \\brief  1C0D0, AFD 0 FIFO 0 buffer access register */
#define GTM_AFD1_CH5_BUF_ACC           /*lint --e(923)*/ (*(volatile Ifx_GTM_AFD_CH_BUF_ACC *)0xF011C0D0u)

/** \\brief  1C0E0, AFD 0 FIFO 0 buffer access register */
#define GTM_AFD1_CH6_BUF_ACC           /*lint --e(923)*/ (*(volatile Ifx_GTM_AFD_CH_BUF_ACC *)0xF011C0E0u)

/** \\brief  1C0F0, AFD 0 FIFO 0 buffer access register */
#define GTM_AFD1_CH7_BUF_ACC           /*lint --e(923)*/ (*(volatile Ifx_GTM_AFD_CH_BUF_ACC *)0xF011C0F0u)

/** \\brief  20080, AFD 0 FIFO 0 buffer access register */
#define GTM_AFD2_CH0_BUF_ACC           /*lint --e(923)*/ (*(volatile Ifx_GTM_AFD_CH_BUF_ACC *)0xF0120080u)

/** \\brief  20090, AFD 0 FIFO 0 buffer access register */
#define GTM_AFD2_CH1_BUF_ACC           /*lint --e(923)*/ (*(volatile Ifx_GTM_AFD_CH_BUF_ACC *)0xF0120090u)

/** \\brief  200A0, AFD 0 FIFO 0 buffer access register */
#define GTM_AFD2_CH2_BUF_ACC           /*lint --e(923)*/ (*(volatile Ifx_GTM_AFD_CH_BUF_ACC *)0xF01200A0u)

/** \\brief  200B0, AFD 0 FIFO 0 buffer access register */
#define GTM_AFD2_CH3_BUF_ACC           /*lint --e(923)*/ (*(volatile Ifx_GTM_AFD_CH_BUF_ACC *)0xF01200B0u)

/** \\brief  200C0, AFD 0 FIFO 0 buffer access register */
#define GTM_AFD2_CH4_BUF_ACC           /*lint --e(923)*/ (*(volatile Ifx_GTM_AFD_CH_BUF_ACC *)0xF01200C0u)

/** \\brief  200D0, AFD 0 FIFO 0 buffer access register */
#define GTM_AFD2_CH5_BUF_ACC           /*lint --e(923)*/ (*(volatile Ifx_GTM_AFD_CH_BUF_ACC *)0xF01200D0u)

/** \\brief  200E0, AFD 0 FIFO 0 buffer access register */
#define GTM_AFD2_CH6_BUF_ACC           /*lint --e(923)*/ (*(volatile Ifx_GTM_AFD_CH_BUF_ACC *)0xF01200E0u)

/** \\brief  200F0, AFD 0 FIFO 0 buffer access register */
#define GTM_AFD2_CH7_BUF_ACC           /*lint --e(923)*/ (*(volatile Ifx_GTM_AFD_CH_BUF_ACC *)0xF01200F0u)

/** \\brief  2C0, ARU 0 dynamic routing control register */
#define GTM_ARU_0_DYN_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_ARU_0_DYN_CTRL *)0xF01002C0u)

/** \\brief  2E8, ARU 0 read ID for dynamic routing */
#define GTM_ARU_0_DYN_RDADDR           /*lint --e(923)*/ (*(volatile Ifx_GTM_ARU_0_DYN_RDADDR *)0xF01002E8u)

/** \\brief  2D0, ARU 0 higher bits of DYN_ROUTE register */
#define GTM_ARU_0_DYN_ROUTE_HIGH       /*lint --e(923)*/ (*(volatile Ifx_GTM_ARU_0_DYN_ROUTE_HIGH *)0xF01002D0u)

/** \\brief  2C8, ARU 0 lower bits of DYN_ROUTE register */
#define GTM_ARU_0_DYN_ROUTE_LOW        /*lint --e(923)*/ (*(volatile Ifx_GTM_ARU_0_DYN_ROUTE_LOW *)0xF01002C8u)

/** \\brief  2E0, ARU 0 shadow register for ARU_[z]_DYN_ROUTE_HIGH */
#define GTM_ARU_0_DYN_ROUTE_SR_HIGH    /*lint --e(923)*/ (*(volatile Ifx_GTM_ARU_0_DYN_ROUTE_SR_HIGH *)0xF01002E0u)

/** \\brief  2D8, ARU 0 shadow register for ARU_[z]_DYN_ROUTE_LOW */
#define GTM_ARU_0_DYN_ROUTE_SR_LOW     /*lint --e(923)*/ (*(volatile Ifx_GTM_ARU_0_DYN_ROUTE_SR_LOW *)0xF01002D8u)

/** \\brief  2C4, ARU 1 dynamic routing control register */
#define GTM_ARU_1_DYN_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_ARU_1_DYN_CTRL *)0xF01002C4u)

/** \\brief  2EC, ARU 1 read ID for dynamic routing */
#define GTM_ARU_1_DYN_RDADDR           /*lint --e(923)*/ (*(volatile Ifx_GTM_ARU_1_DYN_RDADDR *)0xF01002ECu)

