Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  2D4, ARU 1 higher bits of DYN_ROUTE register */
#define GTM_ARU_1_DYN_ROUTE_HIGH       /*lint --e(923)*/ (*(volatile Ifx_GTM_ARU_1_DYN_ROUTE_HIGH *)0xF01002D4u)

/** \\brief  2CC, ARU 1 lower bits of DYN_ROUTE register */
#define GTM_ARU_1_DYN_ROUTE_LOW        /*lint --e(923)*/ (*(volatile Ifx_GTM_ARU_1_DYN_ROUTE_LOW *)0xF01002CCu)

/** \\brief  2E4, ARU 1 shadow register for ARU_[z]_DYN_ROUTE_HIGH */
#define GTM_ARU_1_DYN_ROUTE_SR_HIGH    /*lint --e(923)*/ (*(volatile Ifx_GTM_ARU_1_DYN_ROUTE_SR_HIGH *)0xF01002E4u)

/** \\brief  2DC, ARU 1 shadow register for ARU_[z]_DYN_ROUTE_LOW */
#define GTM_ARU_1_DYN_ROUTE_SR_LOW     /*lint --e(923)*/ (*(volatile Ifx_GTM_ARU_1_DYN_ROUTE_SR_LOW *)0xF01002DCu)

/** \\brief  280, ARU access register */
#define GTM_ARU_ARU_ACCESS             /*lint --e(923)*/ (*(volatile Ifx_GTM_ARU_ARU_ACCESS *)0xF0100280u)

/** \\brief  2FC, ARU caddr counter value */
#define GTM_ARU_CADDR                  /*lint --e(923)*/ (*(volatile Ifx_GTM_ARU_CADDR *)0xF01002FCu)

/** \\brief  2B4, ARU caddr counter end value */
#define GTM_ARU_CADDR_END              /*lint --e(923)*/ (*(volatile Ifx_GTM_ARU_CADDR_END *)0xF01002B4u)

/** \\brief  2BC, ARU enable dynamic routing */
#define GTM_ARU_CTRL                   /*lint --e(923)*/ (*(volatile Ifx_GTM_ARU_CTRL *)0xF01002BCu)

/** \\brief  284, ARU access register upper data word */
#define GTM_ARU_DATA_H                 /*lint --e(923)*/ (*(volatile Ifx_GTM_ARU_DATA_H *)0xF0100284u)

/** \\brief  288, ARU access register lower data word */
#define GTM_ARU_DATA_L                 /*lint --e(923)*/ (*(volatile Ifx_GTM_ARU_DATA_L *)0xF0100288u)

/** \\brief  28C, ARU debug access channel 0 */
#define GTM_ARU_DBG_ACCESS0            /*lint --e(923)*/ (*(volatile Ifx_GTM_ARU_DBG_ACCESS0 *)0xF010028Cu)

/** \\brief  298, ARU debug access channel 1 */
#define GTM_ARU_DBG_ACCESS1            /*lint --e(923)*/ (*(volatile Ifx_GTM_ARU_DBG_ACCESS1 *)0xF0100298u)

/** \\brief  290, ARU debug access 0 transfer register upper data word */
#define GTM_ARU_DBG_DATA0_H            /*lint --e(923)*/ (*(volatile Ifx_GTM_ARU_DBG_DATA0_H *)0xF0100290u)

/** \\brief  294, ARU debug access 0 transfer register lower data word */
#define GTM_ARU_DBG_DATA0_L            /*lint --e(923)*/ (*(volatile Ifx_GTM_ARU_DBG_DATA0_L *)0xF0100294u)

/** \\brief  29C, ARU debug access 1 transfer register upper data word */
#define GTM_ARU_DBG_DATA1_H            /*lint --e(923)*/ (*(volatile Ifx_GTM_ARU_DBG_DATA1_H *)0xF010029Cu)

/** \\brief  2A0, ARU debug access 1 transfer register lower data word */
#define GTM_ARU_DBG_DATA1_L            /*lint --e(923)*/ (*(volatile Ifx_GTM_ARU_DBG_DATA1_L *)0xF01002A0u)

/** \\brief  2A8, ARU interrupt enable register */
#define GTM_ARU_IRQ_EN                 /*lint --e(923)*/ (*(volatile Ifx_GTM_ARU_IRQ_EN *)0xF01002A8u)

/** \\brief  2AC, ARU force interrupt register */
#define GTM_ARU_IRQ_FORCINT            /*lint --e(923)*/ (*(volatile Ifx_GTM_ARU_IRQ_FORCINT *)0xF01002ACu)

/** \\brief  2B0, ARU interrupt mode register */
#define GTM_ARU_IRQ_MODE               /*lint --e(923)*/ (*(volatile Ifx_GTM_ARU_IRQ_MODE *)0xF01002B0u)

/** \\brief  2A4, ARU interrupt notification register */
#define GTM_ARU_IRQ_NOTIFY             /*lint --e(923)*/ (*(volatile Ifx_GTM_ARU_IRQ_NOTIFY *)0xF01002A4u)

/** \\brief  E804C, ATOM AGC action time base register */
#define GTM_ATOM0_AGC_ACT_TB           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_ACT_TB *)0xF01E804Cu)

/** \\brief  E8044, ATOM AGC enable/disable control register */
#define GTM_ATOM0_AGC_ENDIS_CTRL       /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_ENDIS_CTRL *)0xF01E8044u)

/** \\brief  E8048, ATOM AGC enable/disable status register */
#define GTM_ATOM0_AGC_ENDIS_STAT       /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_ENDIS_STAT *)0xF01E8048u)

/** \\brief  E8058, ATOM AGC force update control register */
#define GTM_ATOM0_AGC_FUPD_CTRL        /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_FUPD_CTRL *)0xF01E8058u)

/** \\brief  E8040, ATOM AGC global control register */
#define GTM_ATOM0_AGC_GLB_CTRL         /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_GLB_CTRL *)0xF01E8040u)

/** \\brief  E805C, ATOM AGC internal trigger control register */
#define GTM_ATOM0_AGC_INT_TRIG         /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_INT_TRIG *)0xF01E805Cu)

/** \\brief  E8050, ATOM AGC output enable control register */
#define GTM_ATOM0_AGC_OUTEN_CTRL       /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_OUTEN_CTRL *)0xF01E8050u)

/** \\brief  E8054, ATOM AGC output enable status register */
#define GTM_ATOM0_AGC_OUTEN_STAT       /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_OUTEN_STAT *)0xF01E8054u)

/** \\brief  E8010, ATOM channel 0 CCU0 compare register */
#define GTM_ATOM0_CH0_CM0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0 *)0xF01E8010u)

/** \\brief  E8014, ATOM channel 0 CCU1 compare register */
#define GTM_ATOM0_CH0_CM1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1 *)0xF01E8014u)

/** \\brief  E8018, ATOM channel 0 CCU0 counter register */
#define GTM_ATOM0_CH0_CN0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0 *)0xF01E8018u)

/** \\brief  E8024, ATOM channel 0 interrupt enable register */
#define GTM_ATOM0_CH0_IRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN *)0xF01E8024u)

/** \\brief  E8028, ATOM channel 0 software interrupt generation */
#define GTM_ATOM0_CH0_IRQ_FORCINT      /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT *)0xF01E8028u)

/** \\brief  E802C, ATOM channel 0 interrupt mode configuration register */
#define GTM_ATOM0_CH0_IRQ_MODE         /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE *)0xF01E802Cu)

/** \\brief  E8020, ATOM channel 0 interrupt notification register */
#define GTM_ATOM0_CH0_IRQ_NOTIFY       /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY *)0xF01E8020u)

/** \\brief  E8000, ATOM channel 0 ARU read address register */
#define GTM_ATOM0_CH0_RDADDR           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR *)0xF01E8000u)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM0_CH0_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL *)0xF01E8004u)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM0_CH0_SOMI             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI *)0xF01E8004u)

/** Alias (User Manual Name) for GTM_ATOM0_CH0_SOMI.
 * To use register names with standard convension, please use GTM_ATOM0_CH0_SOMI.
 */
#define GTM_ATOM0_CH0_CTRL_SOMI        (GTM_ATOM0_CH0_SOMI)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM0_CH0_SOMC             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC *)0xF01E8004u)

/** Alias (User Manual Name) for GTM_ATOM0_CH0_SOMC.
 * To use register names with standard convension, please use GTM_ATOM0_CH0_SOMC.
 */
#define GTM_ATOM0_CH0_CTRL_SOMC        (GTM_ATOM0_CH0_SOMC)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM0_CH0_SOMP             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP *)0xF01E8004u)

/** Alias (User Manual Name) for GTM_ATOM0_CH0_SOMP.
 * To use register names with standard convension, please use GTM_ATOM0_CH0_SOMP.
 */
#define GTM_ATOM0_CH0_CTRL_SOMP        (GTM_ATOM0_CH0_SOMP)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM0_CH0_SOMS             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS *)0xF01E8004u)

/** Alias (User Manual Name) for GTM_ATOM0_CH0_SOMS.
 * To use register names with standard convension, please use GTM_ATOM0_CH0_SOMS.
 */
#define GTM_ATOM0_CH0_CTRL_SOMS        (GTM_ATOM0_CH0_SOMS)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM0_CH0_SOMB             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB *)0xF01E8004u)

/** Alias (User Manual Name) for GTM_ATOM0_CH0_SOMB.
 * To use register names with standard convension, please use GTM_ATOM0_CH0_SOMB.
 */
#define GTM_ATOM0_CH0_CTRL_SOMB        (GTM_ATOM0_CH0_SOMB)

/** \\brief  E8008, ATOM channel 0 CCU0 compare shadow register */
#define GTM_ATOM0_CH0_SR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0 *)0xF01E8008u)

/** \\brief  E800C, ATOM channel 0 CCU1 compare shadow register */
#define GTM_ATOM0_CH0_SR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1 *)0xF01E800Cu)

/** \\brief  E801C, ATOM channel 0 status register */
#define GTM_ATOM0_CH0_STAT             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT *)0xF01E801Cu)

/** \\brief  E8090, ATOM channel 0 CCU0 compare register */
#define GTM_ATOM0_CH1_CM0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0 *)0xF01E8090u)

/** \\brief  E8094, ATOM channel 0 CCU1 compare register */
#define GTM_ATOM0_CH1_CM1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1 *)0xF01E8094u)

/** \\brief  E8098, ATOM channel 0 CCU0 counter register */
#define GTM_ATOM0_CH1_CN0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0 *)0xF01E8098u)

/** \\brief  E80A4, ATOM channel 0 interrupt enable register */
#define GTM_ATOM0_CH1_IRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN *)0xF01E80A4u)

/** \\brief  E80A8, ATOM channel 0 software interrupt generation */
#define GTM_ATOM0_CH1_IRQ_FORCINT      /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT *)0xF01E80A8u)

/** \\brief  E80AC, ATOM channel 0 interrupt mode configuration register */
#define GTM_ATOM0_CH1_IRQ_MODE         /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE *)0xF01E80ACu)

/** \\brief  E80A0, ATOM channel 0 interrupt notification register */
#define GTM_ATOM0_CH1_IRQ_NOTIFY       /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY *)0xF01E80A0u)

