Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  E8108, ATOM channel 0 CCU0 compare shadow register */
#define GTM_ATOM0_CH2_SR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0 *)0xF01E8108u)

/** \\brief  E810C, ATOM channel 0 CCU1 compare shadow register */
#define GTM_ATOM0_CH2_SR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1 *)0xF01E810Cu)

/** \\brief  E811C, ATOM channel 0 status register */
#define GTM_ATOM0_CH2_STAT             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT *)0xF01E811Cu)

/** \\brief  E8190, ATOM channel 0 CCU0 compare register */
#define GTM_ATOM0_CH3_CM0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0 *)0xF01E8190u)

/** \\brief  E8194, ATOM channel 0 CCU1 compare register */
#define GTM_ATOM0_CH3_CM1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1 *)0xF01E8194u)

/** \\brief  E8198, ATOM channel 0 CCU0 counter register */
#define GTM_ATOM0_CH3_CN0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0 *)0xF01E8198u)

/** \\brief  E81A4, ATOM channel 0 interrupt enable register */
#define GTM_ATOM0_CH3_IRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN *)0xF01E81A4u)

/** \\brief  E81A8, ATOM channel 0 software interrupt generation */
#define GTM_ATOM0_CH3_IRQ_FORCINT      /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT *)0xF01E81A8u)

/** \\brief  E81AC, ATOM channel 0 interrupt mode configuration register */
#define GTM_ATOM0_CH3_IRQ_MODE         /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE *)0xF01E81ACu)

/** \\brief  E81A0, ATOM channel 0 interrupt notification register */
#define GTM_ATOM0_CH3_IRQ_NOTIFY       /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY *)0xF01E81A0u)

/** \\brief  E8180, ATOM channel 0 ARU read address register */
#define GTM_ATOM0_CH3_RDADDR           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR *)0xF01E8180u)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM0_CH3_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL *)0xF01E8184u)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM0_CH3_SOMI             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI *)0xF01E8184u)

/** Alias (User Manual Name) for GTM_ATOM0_CH3_SOMI.
 * To use register names with standard convension, please use GTM_ATOM0_CH3_SOMI.
 */
#define GTM_ATOM0_CH3_CTRL_SOMI        (GTM_ATOM0_CH3_SOMI)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM0_CH3_SOMC             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC *)0xF01E8184u)

/** Alias (User Manual Name) for GTM_ATOM0_CH3_SOMC.
 * To use register names with standard convension, please use GTM_ATOM0_CH3_SOMC.
 */
#define GTM_ATOM0_CH3_CTRL_SOMC        (GTM_ATOM0_CH3_SOMC)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM0_CH3_SOMP             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP *)0xF01E8184u)

/** Alias (User Manual Name) for GTM_ATOM0_CH3_SOMP.
 * To use register names with standard convension, please use GTM_ATOM0_CH3_SOMP.
 */
#define GTM_ATOM0_CH3_CTRL_SOMP        (GTM_ATOM0_CH3_SOMP)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM0_CH3_SOMS             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS *)0xF01E8184u)

/** Alias (User Manual Name) for GTM_ATOM0_CH3_SOMS.
 * To use register names with standard convension, please use GTM_ATOM0_CH3_SOMS.
 */
#define GTM_ATOM0_CH3_CTRL_SOMS        (GTM_ATOM0_CH3_SOMS)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM0_CH3_SOMB             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB *)0xF01E8184u)

/** Alias (User Manual Name) for GTM_ATOM0_CH3_SOMB.
 * To use register names with standard convension, please use GTM_ATOM0_CH3_SOMB.
 */
#define GTM_ATOM0_CH3_CTRL_SOMB        (GTM_ATOM0_CH3_SOMB)

/** \\brief  E8188, ATOM channel 0 CCU0 compare shadow register */
#define GTM_ATOM0_CH3_SR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0 *)0xF01E8188u)

/** \\brief  E818C, ATOM channel 0 CCU1 compare shadow register */
#define GTM_ATOM0_CH3_SR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1 *)0xF01E818Cu)

/** \\brief  E819C, ATOM channel 0 status register */
#define GTM_ATOM0_CH3_STAT             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT *)0xF01E819Cu)

/** \\brief  E8210, ATOM channel 0 CCU0 compare register */
#define GTM_ATOM0_CH4_CM0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0 *)0xF01E8210u)

/** \\brief  E8214, ATOM channel 0 CCU1 compare register */
#define GTM_ATOM0_CH4_CM1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1 *)0xF01E8214u)

/** \\brief  E8218, ATOM channel 0 CCU0 counter register */
#define GTM_ATOM0_CH4_CN0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0 *)0xF01E8218u)

/** \\brief  E8224, ATOM channel 0 interrupt enable register */
#define GTM_ATOM0_CH4_IRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN *)0xF01E8224u)

/** \\brief  E8228, ATOM channel 0 software interrupt generation */
#define GTM_ATOM0_CH4_IRQ_FORCINT      /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT *)0xF01E8228u)

/** \\brief  E822C, ATOM channel 0 interrupt mode configuration register */
#define GTM_ATOM0_CH4_IRQ_MODE         /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE *)0xF01E822Cu)

/** \\brief  E8220, ATOM channel 0 interrupt notification register */
#define GTM_ATOM0_CH4_IRQ_NOTIFY       /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY *)0xF01E8220u)

/** \\brief  E8200, ATOM channel 0 ARU read address register */
#define GTM_ATOM0_CH4_RDADDR           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR *)0xF01E8200u)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM0_CH4_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL *)0xF01E8204u)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM0_CH4_SOMI             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI *)0xF01E8204u)

/** Alias (User Manual Name) for GTM_ATOM0_CH4_SOMI.
 * To use register names with standard convension, please use GTM_ATOM0_CH4_SOMI.
 */
#define GTM_ATOM0_CH4_CTRL_SOMI        (GTM_ATOM0_CH4_SOMI)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM0_CH4_SOMC             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC *)0xF01E8204u)

