Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** Alias (User Manual Name) for GTM_ATOM0_CH7_SOMS.
 * To use register names with standard convension, please use GTM_ATOM0_CH7_SOMS.
 */
#define GTM_ATOM0_CH7_CTRL_SOMS        (GTM_ATOM0_CH7_SOMS)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM0_CH7_SOMB             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB *)0xF01E8384u)

/** Alias (User Manual Name) for GTM_ATOM0_CH7_SOMB.
 * To use register names with standard convension, please use GTM_ATOM0_CH7_SOMB.
 */
#define GTM_ATOM0_CH7_CTRL_SOMB        (GTM_ATOM0_CH7_SOMB)

/** \\brief  E8388, ATOM channel 0 CCU0 compare shadow register */
#define GTM_ATOM0_CH7_SR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0 *)0xF01E8388u)

/** \\brief  E838C, ATOM channel 0 CCU1 compare shadow register */
#define GTM_ATOM0_CH7_SR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1 *)0xF01E838Cu)

/** \\brief  E839C, ATOM channel 0 status register */
#define GTM_ATOM0_CH7_STAT             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT *)0xF01E839Cu)

/** \\brief  ED04C, ATOM AGC action time base register */
#define GTM_ATOM10_AGC_ACT_TB          /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_ACT_TB *)0xF01ED04Cu)

/** \\brief  ED044, ATOM AGC enable/disable control register */
#define GTM_ATOM10_AGC_ENDIS_CTRL      /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_ENDIS_CTRL *)0xF01ED044u)

/** \\brief  ED048, ATOM AGC enable/disable status register */
#define GTM_ATOM10_AGC_ENDIS_STAT      /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_ENDIS_STAT *)0xF01ED048u)

/** \\brief  ED058, ATOM AGC force update control register */
#define GTM_ATOM10_AGC_FUPD_CTRL       /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_FUPD_CTRL *)0xF01ED058u)

/** \\brief  ED040, ATOM AGC global control register */
#define GTM_ATOM10_AGC_GLB_CTRL        /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_GLB_CTRL *)0xF01ED040u)

/** \\brief  ED05C, ATOM AGC internal trigger control register */
#define GTM_ATOM10_AGC_INT_TRIG        /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_INT_TRIG *)0xF01ED05Cu)

/** \\brief  ED050, ATOM AGC output enable control register */
#define GTM_ATOM10_AGC_OUTEN_CTRL      /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_OUTEN_CTRL *)0xF01ED050u)

/** \\brief  ED054, ATOM AGC output enable status register */
#define GTM_ATOM10_AGC_OUTEN_STAT      /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_OUTEN_STAT *)0xF01ED054u)

/** \\brief  ED010, ATOM channel 0 CCU0 compare register */
#define GTM_ATOM10_CH0_CM0             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0 *)0xF01ED010u)

/** \\brief  ED014, ATOM channel 0 CCU1 compare register */
#define GTM_ATOM10_CH0_CM1             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1 *)0xF01ED014u)

/** \\brief  ED018, ATOM channel 0 CCU0 counter register */
#define GTM_ATOM10_CH0_CN0             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0 *)0xF01ED018u)

/** \\brief  ED024, ATOM channel 0 interrupt enable register */
#define GTM_ATOM10_CH0_IRQ_EN          /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN *)0xF01ED024u)

/** \\brief  ED028, ATOM channel 0 software interrupt generation */
#define GTM_ATOM10_CH0_IRQ_FORCINT     /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT *)0xF01ED028u)

/** \\brief  ED02C, ATOM channel 0 interrupt mode configuration register */
#define GTM_ATOM10_CH0_IRQ_MODE        /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE *)0xF01ED02Cu)

/** \\brief  ED020, ATOM channel 0 interrupt notification register */
#define GTM_ATOM10_CH0_IRQ_NOTIFY      /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY *)0xF01ED020u)

/** \\brief  ED000, ATOM channel 0 ARU read address register */
#define GTM_ATOM10_CH0_RDADDR          /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR *)0xF01ED000u)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM10_CH0_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL *)0xF01ED004u)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM10_CH0_SOMI             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI *)0xF01ED004u)

/** Alias (User Manual Name) for GTM_ATOM10_CH0_SOMI.
 * To use register names with standard convension, please use GTM_ATOM10_CH0_SOMI.
 */
#define GTM_ATOM10_CH0_CTRL_SOMI        (GTM_ATOM10_CH0_SOMI)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM10_CH0_SOMC             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC *)0xF01ED004u)

/** Alias (User Manual Name) for GTM_ATOM10_CH0_SOMC.
 * To use register names with standard convension, please use GTM_ATOM10_CH0_SOMC.
 */
#define GTM_ATOM10_CH0_CTRL_SOMC        (GTM_ATOM10_CH0_SOMC)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM10_CH0_SOMP             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP *)0xF01ED004u)

/** Alias (User Manual Name) for GTM_ATOM10_CH0_SOMP.
 * To use register names with standard convension, please use GTM_ATOM10_CH0_SOMP.
 */
#define GTM_ATOM10_CH0_CTRL_SOMP        (GTM_ATOM10_CH0_SOMP)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM10_CH0_SOMS             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS *)0xF01ED004u)

/** Alias (User Manual Name) for GTM_ATOM10_CH0_SOMS.
 * To use register names with standard convension, please use GTM_ATOM10_CH0_SOMS.
 */
#define GTM_ATOM10_CH0_CTRL_SOMS        (GTM_ATOM10_CH0_SOMS)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM10_CH0_SOMB             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB *)0xF01ED004u)

/** Alias (User Manual Name) for GTM_ATOM10_CH0_SOMB.
 * To use register names with standard convension, please use GTM_ATOM10_CH0_SOMB.
 */
#define GTM_ATOM10_CH0_CTRL_SOMB        (GTM_ATOM10_CH0_SOMB)

/** \\brief  ED008, ATOM channel 0 CCU0 compare shadow register */
#define GTM_ATOM10_CH0_SR0             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0 *)0xF01ED008u)

/** \\brief  ED00C, ATOM channel 0 CCU1 compare shadow register */
#define GTM_ATOM10_CH0_SR1             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1 *)0xF01ED00Cu)

/** \\brief  ED01C, ATOM channel 0 status register */
#define GTM_ATOM10_CH0_STAT            /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT *)0xF01ED01Cu)

