Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  ED090, ATOM channel 0 CCU0 compare register */
#define GTM_ATOM10_CH1_CM0             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0 *)0xF01ED090u)

/** \\brief  ED094, ATOM channel 0 CCU1 compare register */
#define GTM_ATOM10_CH1_CM1             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1 *)0xF01ED094u)

/** \\brief  ED098, ATOM channel 0 CCU0 counter register */
#define GTM_ATOM10_CH1_CN0             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0 *)0xF01ED098u)

/** \\brief  ED0A4, ATOM channel 0 interrupt enable register */
#define GTM_ATOM10_CH1_IRQ_EN          /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN *)0xF01ED0A4u)

/** \\brief  ED0A8, ATOM channel 0 software interrupt generation */
#define GTM_ATOM10_CH1_IRQ_FORCINT     /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT *)0xF01ED0A8u)

/** \\brief  ED0AC, ATOM channel 0 interrupt mode configuration register */
#define GTM_ATOM10_CH1_IRQ_MODE        /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE *)0xF01ED0ACu)

/** \\brief  ED0A0, ATOM channel 0 interrupt notification register */
#define GTM_ATOM10_CH1_IRQ_NOTIFY      /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY *)0xF01ED0A0u)

/** \\brief  ED080, ATOM channel 0 ARU read address register */
#define GTM_ATOM10_CH1_RDADDR          /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR *)0xF01ED080u)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM10_CH1_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL *)0xF01ED084u)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM10_CH1_SOMI             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI *)0xF01ED084u)

/** Alias (User Manual Name) for GTM_ATOM10_CH1_SOMI.
 * To use register names with standard convension, please use GTM_ATOM10_CH1_SOMI.
 */
#define GTM_ATOM10_CH1_CTRL_SOMI        (GTM_ATOM10_CH1_SOMI)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM10_CH1_SOMC             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC *)0xF01ED084u)

/** Alias (User Manual Name) for GTM_ATOM10_CH1_SOMC.
 * To use register names with standard convension, please use GTM_ATOM10_CH1_SOMC.
 */
#define GTM_ATOM10_CH1_CTRL_SOMC        (GTM_ATOM10_CH1_SOMC)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM10_CH1_SOMP             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP *)0xF01ED084u)

/** Alias (User Manual Name) for GTM_ATOM10_CH1_SOMP.
 * To use register names with standard convension, please use GTM_ATOM10_CH1_SOMP.
 */
#define GTM_ATOM10_CH1_CTRL_SOMP        (GTM_ATOM10_CH1_SOMP)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM10_CH1_SOMS             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS *)0xF01ED084u)

/** Alias (User Manual Name) for GTM_ATOM10_CH1_SOMS.
 * To use register names with standard convension, please use GTM_ATOM10_CH1_SOMS.
 */
#define GTM_ATOM10_CH1_CTRL_SOMS        (GTM_ATOM10_CH1_SOMS)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM10_CH1_SOMB             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB *)0xF01ED084u)

/** Alias (User Manual Name) for GTM_ATOM10_CH1_SOMB.
 * To use register names with standard convension, please use GTM_ATOM10_CH1_SOMB.
 */
#define GTM_ATOM10_CH1_CTRL_SOMB        (GTM_ATOM10_CH1_SOMB)

/** \\brief  ED088, ATOM channel 0 CCU0 compare shadow register */
#define GTM_ATOM10_CH1_SR0             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0 *)0xF01ED088u)

/** \\brief  ED08C, ATOM channel 0 CCU1 compare shadow register */
#define GTM_ATOM10_CH1_SR1             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1 *)0xF01ED08Cu)

/** \\brief  ED09C, ATOM channel 0 status register */
#define GTM_ATOM10_CH1_STAT            /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT *)0xF01ED09Cu)

/** \\brief  ED110, ATOM channel 0 CCU0 compare register */
#define GTM_ATOM10_CH2_CM0             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0 *)0xF01ED110u)

/** \\brief  ED114, ATOM channel 0 CCU1 compare register */
#define GTM_ATOM10_CH2_CM1             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1 *)0xF01ED114u)

/** \\brief  ED118, ATOM channel 0 CCU0 counter register */
#define GTM_ATOM10_CH2_CN0             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0 *)0xF01ED118u)

/** \\brief  ED124, ATOM channel 0 interrupt enable register */
#define GTM_ATOM10_CH2_IRQ_EN          /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN *)0xF01ED124u)

/** \\brief  ED128, ATOM channel 0 software interrupt generation */
#define GTM_ATOM10_CH2_IRQ_FORCINT     /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT *)0xF01ED128u)

/** \\brief  ED12C, ATOM channel 0 interrupt mode configuration register */
#define GTM_ATOM10_CH2_IRQ_MODE        /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE *)0xF01ED12Cu)

/** \\brief  ED120, ATOM channel 0 interrupt notification register */
#define GTM_ATOM10_CH2_IRQ_NOTIFY      /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY *)0xF01ED120u)

/** \\brief  ED100, ATOM channel 0 ARU read address register */
#define GTM_ATOM10_CH2_RDADDR          /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR *)0xF01ED100u)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM10_CH2_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL *)0xF01ED104u)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM10_CH2_SOMI             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI *)0xF01ED104u)

/** Alias (User Manual Name) for GTM_ATOM10_CH2_SOMI.
 * To use register names with standard convension, please use GTM_ATOM10_CH2_SOMI.
 */
#define GTM_ATOM10_CH2_CTRL_SOMI        (GTM_ATOM10_CH2_SOMI)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM10_CH2_SOMC             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC *)0xF01ED104u)

