Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  ED218, ATOM channel 0 CCU0 counter register */
#define GTM_ATOM10_CH4_CN0             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0 *)0xF01ED218u)

/** \\brief  ED224, ATOM channel 0 interrupt enable register */
#define GTM_ATOM10_CH4_IRQ_EN          /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN *)0xF01ED224u)

/** \\brief  ED228, ATOM channel 0 software interrupt generation */
#define GTM_ATOM10_CH4_IRQ_FORCINT     /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT *)0xF01ED228u)

/** \\brief  ED22C, ATOM channel 0 interrupt mode configuration register */
#define GTM_ATOM10_CH4_IRQ_MODE        /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE *)0xF01ED22Cu)

/** \\brief  ED220, ATOM channel 0 interrupt notification register */
#define GTM_ATOM10_CH4_IRQ_NOTIFY      /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY *)0xF01ED220u)

/** \\brief  ED200, ATOM channel 0 ARU read address register */
#define GTM_ATOM10_CH4_RDADDR          /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR *)0xF01ED200u)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM10_CH4_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL *)0xF01ED204u)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM10_CH4_SOMI             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI *)0xF01ED204u)

/** Alias (User Manual Name) for GTM_ATOM10_CH4_SOMI.
 * To use register names with standard convension, please use GTM_ATOM10_CH4_SOMI.
 */
#define GTM_ATOM10_CH4_CTRL_SOMI        (GTM_ATOM10_CH4_SOMI)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM10_CH4_SOMC             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC *)0xF01ED204u)

/** Alias (User Manual Name) for GTM_ATOM10_CH4_SOMC.
 * To use register names with standard convension, please use GTM_ATOM10_CH4_SOMC.
 */
#define GTM_ATOM10_CH4_CTRL_SOMC        (GTM_ATOM10_CH4_SOMC)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM10_CH4_SOMP             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP *)0xF01ED204u)

/** Alias (User Manual Name) for GTM_ATOM10_CH4_SOMP.
 * To use register names with standard convension, please use GTM_ATOM10_CH4_SOMP.
 */
#define GTM_ATOM10_CH4_CTRL_SOMP        (GTM_ATOM10_CH4_SOMP)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM10_CH4_SOMS             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS *)0xF01ED204u)

/** Alias (User Manual Name) for GTM_ATOM10_CH4_SOMS.
 * To use register names with standard convension, please use GTM_ATOM10_CH4_SOMS.
 */
#define GTM_ATOM10_CH4_CTRL_SOMS        (GTM_ATOM10_CH4_SOMS)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM10_CH4_SOMB             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB *)0xF01ED204u)

/** Alias (User Manual Name) for GTM_ATOM10_CH4_SOMB.
 * To use register names with standard convension, please use GTM_ATOM10_CH4_SOMB.
 */
#define GTM_ATOM10_CH4_CTRL_SOMB        (GTM_ATOM10_CH4_SOMB)

/** \\brief  ED208, ATOM channel 0 CCU0 compare shadow register */
#define GTM_ATOM10_CH4_SR0             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0 *)0xF01ED208u)

/** \\brief  ED20C, ATOM channel 0 CCU1 compare shadow register */
#define GTM_ATOM10_CH4_SR1             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1 *)0xF01ED20Cu)

/** \\brief  ED21C, ATOM channel 0 status register */
#define GTM_ATOM10_CH4_STAT            /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT *)0xF01ED21Cu)

/** \\brief  ED290, ATOM channel 0 CCU0 compare register */
#define GTM_ATOM10_CH5_CM0             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0 *)0xF01ED290u)

/** \\brief  ED294, ATOM channel 0 CCU1 compare register */
#define GTM_ATOM10_CH5_CM1             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1 *)0xF01ED294u)

/** \\brief  ED298, ATOM channel 0 CCU0 counter register */
#define GTM_ATOM10_CH5_CN0             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0 *)0xF01ED298u)

/** \\brief  ED2A4, ATOM channel 0 interrupt enable register */
#define GTM_ATOM10_CH5_IRQ_EN          /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN *)0xF01ED2A4u)

/** \\brief  ED2A8, ATOM channel 0 software interrupt generation */
#define GTM_ATOM10_CH5_IRQ_FORCINT     /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT *)0xF01ED2A8u)

/** \\brief  ED2AC, ATOM channel 0 interrupt mode configuration register */
#define GTM_ATOM10_CH5_IRQ_MODE        /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE *)0xF01ED2ACu)

/** \\brief  ED2A0, ATOM channel 0 interrupt notification register */
#define GTM_ATOM10_CH5_IRQ_NOTIFY      /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY *)0xF01ED2A0u)

/** \\brief  ED280, ATOM channel 0 ARU read address register */
#define GTM_ATOM10_CH5_RDADDR          /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR *)0xF01ED280u)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM10_CH5_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL *)0xF01ED284u)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM10_CH5_SOMI             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI *)0xF01ED284u)

/** Alias (User Manual Name) for GTM_ATOM10_CH5_SOMI.
 * To use register names with standard convension, please use GTM_ATOM10_CH5_SOMI.
 */
#define GTM_ATOM10_CH5_CTRL_SOMI        (GTM_ATOM10_CH5_SOMI)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM10_CH5_SOMC             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC *)0xF01ED284u)

/** Alias (User Manual Name) for GTM_ATOM10_CH5_SOMC.
 * To use register names with standard convension, please use GTM_ATOM10_CH5_SOMC.
 */
#define GTM_ATOM10_CH5_CTRL_SOMC        (GTM_ATOM10_CH5_SOMC)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM10_CH5_SOMP             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP *)0xF01ED284u)

