Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** Alias (User Manual Name) for GTM_ATOM10_CH5_SOMP.
 * To use register names with standard convension, please use GTM_ATOM10_CH5_SOMP.
 */
#define GTM_ATOM10_CH5_CTRL_SOMP        (GTM_ATOM10_CH5_SOMP)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM10_CH5_SOMS             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS *)0xF01ED284u)

/** Alias (User Manual Name) for GTM_ATOM10_CH5_SOMS.
 * To use register names with standard convension, please use GTM_ATOM10_CH5_SOMS.
 */
#define GTM_ATOM10_CH5_CTRL_SOMS        (GTM_ATOM10_CH5_SOMS)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM10_CH5_SOMB             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB *)0xF01ED284u)

/** Alias (User Manual Name) for GTM_ATOM10_CH5_SOMB.
 * To use register names with standard convension, please use GTM_ATOM10_CH5_SOMB.
 */
#define GTM_ATOM10_CH5_CTRL_SOMB        (GTM_ATOM10_CH5_SOMB)

/** \\brief  ED288, ATOM channel 0 CCU0 compare shadow register */
#define GTM_ATOM10_CH5_SR0             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0 *)0xF01ED288u)

/** \\brief  ED28C, ATOM channel 0 CCU1 compare shadow register */
#define GTM_ATOM10_CH5_SR1             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1 *)0xF01ED28Cu)

/** \\brief  ED29C, ATOM channel 0 status register */
#define GTM_ATOM10_CH5_STAT            /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT *)0xF01ED29Cu)

/** \\brief  ED310, ATOM channel 0 CCU0 compare register */
#define GTM_ATOM10_CH6_CM0             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0 *)0xF01ED310u)

/** \\brief  ED314, ATOM channel 0 CCU1 compare register */
#define GTM_ATOM10_CH6_CM1             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1 *)0xF01ED314u)

/** \\brief  ED318, ATOM channel 0 CCU0 counter register */
#define GTM_ATOM10_CH6_CN0             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0 *)0xF01ED318u)

/** \\brief  ED324, ATOM channel 0 interrupt enable register */
#define GTM_ATOM10_CH6_IRQ_EN          /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN *)0xF01ED324u)

/** \\brief  ED328, ATOM channel 0 software interrupt generation */
#define GTM_ATOM10_CH6_IRQ_FORCINT     /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT *)0xF01ED328u)

/** \\brief  ED32C, ATOM channel 0 interrupt mode configuration register */
#define GTM_ATOM10_CH6_IRQ_MODE        /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE *)0xF01ED32Cu)

/** \\brief  ED320, ATOM channel 0 interrupt notification register */
#define GTM_ATOM10_CH6_IRQ_NOTIFY      /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY *)0xF01ED320u)

/** \\brief  ED300, ATOM channel 0 ARU read address register */
#define GTM_ATOM10_CH6_RDADDR          /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR *)0xF01ED300u)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM10_CH6_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL *)0xF01ED304u)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM10_CH6_SOMI             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI *)0xF01ED304u)

/** Alias (User Manual Name) for GTM_ATOM10_CH6_SOMI.
 * To use register names with standard convension, please use GTM_ATOM10_CH6_SOMI.
 */
#define GTM_ATOM10_CH6_CTRL_SOMI        (GTM_ATOM10_CH6_SOMI)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM10_CH6_SOMC             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC *)0xF01ED304u)

/** Alias (User Manual Name) for GTM_ATOM10_CH6_SOMC.
 * To use register names with standard convension, please use GTM_ATOM10_CH6_SOMC.
 */
#define GTM_ATOM10_CH6_CTRL_SOMC        (GTM_ATOM10_CH6_SOMC)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM10_CH6_SOMP             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP *)0xF01ED304u)

/** Alias (User Manual Name) for GTM_ATOM10_CH6_SOMP.
 * To use register names with standard convension, please use GTM_ATOM10_CH6_SOMP.
 */
#define GTM_ATOM10_CH6_CTRL_SOMP        (GTM_ATOM10_CH6_SOMP)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM10_CH6_SOMS             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS *)0xF01ED304u)

/** Alias (User Manual Name) for GTM_ATOM10_CH6_SOMS.
 * To use register names with standard convension, please use GTM_ATOM10_CH6_SOMS.
 */
#define GTM_ATOM10_CH6_CTRL_SOMS        (GTM_ATOM10_CH6_SOMS)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM10_CH6_SOMB             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB *)0xF01ED304u)

/** Alias (User Manual Name) for GTM_ATOM10_CH6_SOMB.
 * To use register names with standard convension, please use GTM_ATOM10_CH6_SOMB.
 */
#define GTM_ATOM10_CH6_CTRL_SOMB        (GTM_ATOM10_CH6_SOMB)

/** \\brief  ED308, ATOM channel 0 CCU0 compare shadow register */
#define GTM_ATOM10_CH6_SR0             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0 *)0xF01ED308u)

/** \\brief  ED30C, ATOM channel 0 CCU1 compare shadow register */
#define GTM_ATOM10_CH6_SR1             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1 *)0xF01ED30Cu)

/** \\brief  ED31C, ATOM channel 0 status register */
#define GTM_ATOM10_CH6_STAT            /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT *)0xF01ED31Cu)

/** \\brief  ED390, ATOM channel 0 CCU0 compare register */
#define GTM_ATOM10_CH7_CM0             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0 *)0xF01ED390u)

/** \\brief  ED394, ATOM channel 0 CCU1 compare register */
#define GTM_ATOM10_CH7_CM1             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1 *)0xF01ED394u)

/** \\brief  ED398, ATOM channel 0 CCU0 counter register */
#define GTM_ATOM10_CH7_CN0             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0 *)0xF01ED398u)

/** \\brief  ED3A4, ATOM channel 0 interrupt enable register */
#define GTM_ATOM10_CH7_IRQ_EN          /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN *)0xF01ED3A4u)

