Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  ED3A8, ATOM channel 0 software interrupt generation */
#define GTM_ATOM10_CH7_IRQ_FORCINT     /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT *)0xF01ED3A8u)

/** \\brief  ED3AC, ATOM channel 0 interrupt mode configuration register */
#define GTM_ATOM10_CH7_IRQ_MODE        /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE *)0xF01ED3ACu)

/** \\brief  ED3A0, ATOM channel 0 interrupt notification register */
#define GTM_ATOM10_CH7_IRQ_NOTIFY      /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY *)0xF01ED3A0u)

/** \\brief  ED380, ATOM channel 0 ARU read address register */
#define GTM_ATOM10_CH7_RDADDR          /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR *)0xF01ED380u)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM10_CH7_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL *)0xF01ED384u)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM10_CH7_SOMI             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI *)0xF01ED384u)

/** Alias (User Manual Name) for GTM_ATOM10_CH7_SOMI.
 * To use register names with standard convension, please use GTM_ATOM10_CH7_SOMI.
 */
#define GTM_ATOM10_CH7_CTRL_SOMI        (GTM_ATOM10_CH7_SOMI)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM10_CH7_SOMC             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC *)0xF01ED384u)

/** Alias (User Manual Name) for GTM_ATOM10_CH7_SOMC.
 * To use register names with standard convension, please use GTM_ATOM10_CH7_SOMC.
 */
#define GTM_ATOM10_CH7_CTRL_SOMC        (GTM_ATOM10_CH7_SOMC)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM10_CH7_SOMP             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP *)0xF01ED384u)

/** Alias (User Manual Name) for GTM_ATOM10_CH7_SOMP.
 * To use register names with standard convension, please use GTM_ATOM10_CH7_SOMP.
 */
#define GTM_ATOM10_CH7_CTRL_SOMP        (GTM_ATOM10_CH7_SOMP)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM10_CH7_SOMS             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS *)0xF01ED384u)

/** Alias (User Manual Name) for GTM_ATOM10_CH7_SOMS.
 * To use register names with standard convension, please use GTM_ATOM10_CH7_SOMS.
 */
#define GTM_ATOM10_CH7_CTRL_SOMS        (GTM_ATOM10_CH7_SOMS)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM10_CH7_SOMB             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB *)0xF01ED384u)

/** Alias (User Manual Name) for GTM_ATOM10_CH7_SOMB.
 * To use register names with standard convension, please use GTM_ATOM10_CH7_SOMB.
 */
#define GTM_ATOM10_CH7_CTRL_SOMB        (GTM_ATOM10_CH7_SOMB)

/** \\brief  ED388, ATOM channel 0 CCU0 compare shadow register */
#define GTM_ATOM10_CH7_SR0             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0 *)0xF01ED388u)

/** \\brief  ED38C, ATOM channel 0 CCU1 compare shadow register */
#define GTM_ATOM10_CH7_SR1             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1 *)0xF01ED38Cu)

/** \\brief  ED39C, ATOM channel 0 status register */
#define GTM_ATOM10_CH7_STAT            /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT *)0xF01ED39Cu)

/** \\brief  AC, GTM ATOM 10 Output Level */
#define GTM_ATOM10_OUT                 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM10_OUT *)0xF01000ACu)

/** \\brief  ED84C, ATOM AGC action time base register */
#define GTM_ATOM11_AGC_ACT_TB          /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_ACT_TB *)0xF01ED84Cu)

/** \\brief  ED844, ATOM AGC enable/disable control register */
#define GTM_ATOM11_AGC_ENDIS_CTRL      /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_ENDIS_CTRL *)0xF01ED844u)

/** \\brief  ED848, ATOM AGC enable/disable status register */
#define GTM_ATOM11_AGC_ENDIS_STAT      /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_ENDIS_STAT *)0xF01ED848u)

/** \\brief  ED858, ATOM AGC force update control register */
#define GTM_ATOM11_AGC_FUPD_CTRL       /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_FUPD_CTRL *)0xF01ED858u)

/** \\brief  ED840, ATOM AGC global control register */
#define GTM_ATOM11_AGC_GLB_CTRL        /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_GLB_CTRL *)0xF01ED840u)

/** \\brief  ED85C, ATOM AGC internal trigger control register */
#define GTM_ATOM11_AGC_INT_TRIG        /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_INT_TRIG *)0xF01ED85Cu)

/** \\brief  ED850, ATOM AGC output enable control register */
#define GTM_ATOM11_AGC_OUTEN_CTRL      /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_OUTEN_CTRL *)0xF01ED850u)

/** \\brief  ED854, ATOM AGC output enable status register */
#define GTM_ATOM11_AGC_OUTEN_STAT      /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_OUTEN_STAT *)0xF01ED854u)

/** \\brief  ED810, ATOM channel 0 CCU0 compare register */
#define GTM_ATOM11_CH0_CM0             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0 *)0xF01ED810u)

/** \\brief  ED814, ATOM channel 0 CCU1 compare register */
#define GTM_ATOM11_CH0_CM1             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1 *)0xF01ED814u)

/** \\brief  ED818, ATOM channel 0 CCU0 counter register */
#define GTM_ATOM11_CH0_CN0             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0 *)0xF01ED818u)

/** \\brief  ED824, ATOM channel 0 interrupt enable register */
#define GTM_ATOM11_CH0_IRQ_EN          /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN *)0xF01ED824u)

/** \\brief  ED828, ATOM channel 0 software interrupt generation */
#define GTM_ATOM11_CH0_IRQ_FORCINT     /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT *)0xF01ED828u)

/** \\brief  ED82C, ATOM channel 0 interrupt mode configuration register */
#define GTM_ATOM11_CH0_IRQ_MODE        /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE *)0xF01ED82Cu)

/** \\brief  ED820, ATOM channel 0 interrupt notification register */
#define GTM_ATOM11_CH0_IRQ_NOTIFY      /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY *)0xF01ED820u)

/** \\brief  ED800, ATOM channel 0 ARU read address register */
#define GTM_ATOM11_CH0_RDADDR          /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR *)0xF01ED800u)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM11_CH0_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL *)0xF01ED804u)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM11_CH0_SOMI             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI *)0xF01ED804u)

/** Alias (User Manual Name) for GTM_ATOM11_CH0_SOMI.
 * To use register names with standard convension, please use GTM_ATOM11_CH0_SOMI.
 */
#define GTM_ATOM11_CH0_CTRL_SOMI        (GTM_ATOM11_CH0_SOMI)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM11_CH0_SOMC             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC *)0xF01ED804u)

/** Alias (User Manual Name) for GTM_ATOM11_CH0_SOMC.
 * To use register names with standard convension, please use GTM_ATOM11_CH0_SOMC.
 */
#define GTM_ATOM11_CH0_CTRL_SOMC        (GTM_ATOM11_CH0_SOMC)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM11_CH0_SOMP             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP *)0xF01ED804u)

/** Alias (User Manual Name) for GTM_ATOM11_CH0_SOMP.
 * To use register names with standard convension, please use GTM_ATOM11_CH0_SOMP.
 */
#define GTM_ATOM11_CH0_CTRL_SOMP        (GTM_ATOM11_CH0_SOMP)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM11_CH0_SOMS             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS *)0xF01ED804u)

