Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** Alias (User Manual Name) for GTM_ATOM11_CH0_SOMS.
 * To use register names with standard convension, please use GTM_ATOM11_CH0_SOMS.
 */
#define GTM_ATOM11_CH0_CTRL_SOMS        (GTM_ATOM11_CH0_SOMS)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM11_CH0_SOMB             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB *)0xF01ED804u)

/** Alias (User Manual Name) for GTM_ATOM11_CH0_SOMB.
 * To use register names with standard convension, please use GTM_ATOM11_CH0_SOMB.
 */
#define GTM_ATOM11_CH0_CTRL_SOMB        (GTM_ATOM11_CH0_SOMB)

/** \\brief  ED808, ATOM channel 0 CCU0 compare shadow register */
#define GTM_ATOM11_CH0_SR0             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0 *)0xF01ED808u)

/** \\brief  ED80C, ATOM channel 0 CCU1 compare shadow register */
#define GTM_ATOM11_CH0_SR1             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1 *)0xF01ED80Cu)

/** \\brief  ED81C, ATOM channel 0 status register */
#define GTM_ATOM11_CH0_STAT            /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT *)0xF01ED81Cu)

/** \\brief  ED890, ATOM channel 0 CCU0 compare register */
#define GTM_ATOM11_CH1_CM0             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0 *)0xF01ED890u)

/** \\brief  ED894, ATOM channel 0 CCU1 compare register */
#define GTM_ATOM11_CH1_CM1             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1 *)0xF01ED894u)

/** \\brief  ED898, ATOM channel 0 CCU0 counter register */
#define GTM_ATOM11_CH1_CN0             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0 *)0xF01ED898u)

/** \\brief  ED8A4, ATOM channel 0 interrupt enable register */
#define GTM_ATOM11_CH1_IRQ_EN          /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN *)0xF01ED8A4u)

/** \\brief  ED8A8, ATOM channel 0 software interrupt generation */
#define GTM_ATOM11_CH1_IRQ_FORCINT     /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT *)0xF01ED8A8u)

/** \\brief  ED8AC, ATOM channel 0 interrupt mode configuration register */
#define GTM_ATOM11_CH1_IRQ_MODE        /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE *)0xF01ED8ACu)

/** \\brief  ED8A0, ATOM channel 0 interrupt notification register */
#define GTM_ATOM11_CH1_IRQ_NOTIFY      /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY *)0xF01ED8A0u)

/** \\brief  ED880, ATOM channel 0 ARU read address register */
#define GTM_ATOM11_CH1_RDADDR          /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR *)0xF01ED880u)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM11_CH1_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL *)0xF01ED884u)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM11_CH1_SOMI             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI *)0xF01ED884u)

/** Alias (User Manual Name) for GTM_ATOM11_CH1_SOMI.
 * To use register names with standard convension, please use GTM_ATOM11_CH1_SOMI.
 */
#define GTM_ATOM11_CH1_CTRL_SOMI        (GTM_ATOM11_CH1_SOMI)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM11_CH1_SOMC             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC *)0xF01ED884u)

/** Alias (User Manual Name) for GTM_ATOM11_CH1_SOMC.
 * To use register names with standard convension, please use GTM_ATOM11_CH1_SOMC.
 */
#define GTM_ATOM11_CH1_CTRL_SOMC        (GTM_ATOM11_CH1_SOMC)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM11_CH1_SOMP             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP *)0xF01ED884u)

/** Alias (User Manual Name) for GTM_ATOM11_CH1_SOMP.
 * To use register names with standard convension, please use GTM_ATOM11_CH1_SOMP.
 */
#define GTM_ATOM11_CH1_CTRL_SOMP        (GTM_ATOM11_CH1_SOMP)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM11_CH1_SOMS             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS *)0xF01ED884u)

/** Alias (User Manual Name) for GTM_ATOM11_CH1_SOMS.
 * To use register names with standard convension, please use GTM_ATOM11_CH1_SOMS.
 */
#define GTM_ATOM11_CH1_CTRL_SOMS        (GTM_ATOM11_CH1_SOMS)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM11_CH1_SOMB             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB *)0xF01ED884u)

/** Alias (User Manual Name) for GTM_ATOM11_CH1_SOMB.
 * To use register names with standard convension, please use GTM_ATOM11_CH1_SOMB.
 */
#define GTM_ATOM11_CH1_CTRL_SOMB        (GTM_ATOM11_CH1_SOMB)

/** \\brief  ED888, ATOM channel 0 CCU0 compare shadow register */
#define GTM_ATOM11_CH1_SR0             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0 *)0xF01ED888u)

/** \\brief  ED88C, ATOM channel 0 CCU1 compare shadow register */
#define GTM_ATOM11_CH1_SR1             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1 *)0xF01ED88Cu)

/** \\brief  ED89C, ATOM channel 0 status register */
#define GTM_ATOM11_CH1_STAT            /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT *)0xF01ED89Cu)

/** \\brief  ED910, ATOM channel 0 CCU0 compare register */
#define GTM_ATOM11_CH2_CM0             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0 *)0xF01ED910u)

/** \\brief  ED914, ATOM channel 0 CCU1 compare register */
#define GTM_ATOM11_CH2_CM1             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1 *)0xF01ED914u)

/** \\brief  ED918, ATOM channel 0 CCU0 counter register */
#define GTM_ATOM11_CH2_CN0             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0 *)0xF01ED918u)

/** \\brief  ED924, ATOM channel 0 interrupt enable register */
#define GTM_ATOM11_CH2_IRQ_EN          /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN *)0xF01ED924u)

/** \\brief  ED928, ATOM channel 0 software interrupt generation */
#define GTM_ATOM11_CH2_IRQ_FORCINT     /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT *)0xF01ED928u)

/** \\brief  ED92C, ATOM channel 0 interrupt mode configuration register */
#define GTM_ATOM11_CH2_IRQ_MODE        /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE *)0xF01ED92Cu)

/** \\brief  ED920, ATOM channel 0 interrupt notification register */
#define GTM_ATOM11_CH2_IRQ_NOTIFY      /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY *)0xF01ED920u)

/** \\brief  ED900, ATOM channel 0 ARU read address register */
#define GTM_ATOM11_CH2_RDADDR          /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR *)0xF01ED900u)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM11_CH2_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL *)0xF01ED904u)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM11_CH2_SOMI             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI *)0xF01ED904u)

/** Alias (User Manual Name) for GTM_ATOM11_CH2_SOMI.
 * To use register names with standard convension, please use GTM_ATOM11_CH2_SOMI.
 */
#define GTM_ATOM11_CH2_CTRL_SOMI        (GTM_ATOM11_CH2_SOMI)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM11_CH2_SOMC             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC *)0xF01ED904u)

