Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  EDA18, ATOM channel 0 CCU0 counter register */
#define GTM_ATOM11_CH4_CN0             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0 *)0xF01EDA18u)

/** \\brief  EDA24, ATOM channel 0 interrupt enable register */
#define GTM_ATOM11_CH4_IRQ_EN          /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN *)0xF01EDA24u)

/** \\brief  EDA28, ATOM channel 0 software interrupt generation */
#define GTM_ATOM11_CH4_IRQ_FORCINT     /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT *)0xF01EDA28u)

/** \\brief  EDA2C, ATOM channel 0 interrupt mode configuration register */
#define GTM_ATOM11_CH4_IRQ_MODE        /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE *)0xF01EDA2Cu)

/** \\brief  EDA20, ATOM channel 0 interrupt notification register */
#define GTM_ATOM11_CH4_IRQ_NOTIFY      /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY *)0xF01EDA20u)

/** \\brief  EDA00, ATOM channel 0 ARU read address register */
#define GTM_ATOM11_CH4_RDADDR          /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR *)0xF01EDA00u)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM11_CH4_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL *)0xF01EDA04u)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM11_CH4_SOMI             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI *)0xF01EDA04u)

/** Alias (User Manual Name) for GTM_ATOM11_CH4_SOMI.
 * To use register names with standard convension, please use GTM_ATOM11_CH4_SOMI.
 */
#define GTM_ATOM11_CH4_CTRL_SOMI        (GTM_ATOM11_CH4_SOMI)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM11_CH4_SOMC             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC *)0xF01EDA04u)

/** Alias (User Manual Name) for GTM_ATOM11_CH4_SOMC.
 * To use register names with standard convension, please use GTM_ATOM11_CH4_SOMC.
 */
#define GTM_ATOM11_CH4_CTRL_SOMC        (GTM_ATOM11_CH4_SOMC)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM11_CH4_SOMP             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP *)0xF01EDA04u)

/** Alias (User Manual Name) for GTM_ATOM11_CH4_SOMP.
 * To use register names with standard convension, please use GTM_ATOM11_CH4_SOMP.
 */
#define GTM_ATOM11_CH4_CTRL_SOMP        (GTM_ATOM11_CH4_SOMP)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM11_CH4_SOMS             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS *)0xF01EDA04u)

/** Alias (User Manual Name) for GTM_ATOM11_CH4_SOMS.
 * To use register names with standard convension, please use GTM_ATOM11_CH4_SOMS.
 */
#define GTM_ATOM11_CH4_CTRL_SOMS        (GTM_ATOM11_CH4_SOMS)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM11_CH4_SOMB             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB *)0xF01EDA04u)

/** Alias (User Manual Name) for GTM_ATOM11_CH4_SOMB.
 * To use register names with standard convension, please use GTM_ATOM11_CH4_SOMB.
 */
#define GTM_ATOM11_CH4_CTRL_SOMB        (GTM_ATOM11_CH4_SOMB)

/** \\brief  EDA08, ATOM channel 0 CCU0 compare shadow register */
#define GTM_ATOM11_CH4_SR0             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0 *)0xF01EDA08u)

/** \\brief  EDA0C, ATOM channel 0 CCU1 compare shadow register */
#define GTM_ATOM11_CH4_SR1             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1 *)0xF01EDA0Cu)

/** \\brief  EDA1C, ATOM channel 0 status register */
#define GTM_ATOM11_CH4_STAT            /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT *)0xF01EDA1Cu)

/** \\brief  EDA90, ATOM channel 0 CCU0 compare register */
#define GTM_ATOM11_CH5_CM0             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0 *)0xF01EDA90u)

/** \\brief  EDA94, ATOM channel 0 CCU1 compare register */
#define GTM_ATOM11_CH5_CM1             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1 *)0xF01EDA94u)

/** \\brief  EDA98, ATOM channel 0 CCU0 counter register */
#define GTM_ATOM11_CH5_CN0             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0 *)0xF01EDA98u)

/** \\brief  EDAA4, ATOM channel 0 interrupt enable register */
#define GTM_ATOM11_CH5_IRQ_EN          /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN *)0xF01EDAA4u)

/** \\brief  EDAA8, ATOM channel 0 software interrupt generation */
#define GTM_ATOM11_CH5_IRQ_FORCINT     /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT *)0xF01EDAA8u)

/** \\brief  EDAAC, ATOM channel 0 interrupt mode configuration register */
#define GTM_ATOM11_CH5_IRQ_MODE        /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE *)0xF01EDAACu)

/** \\brief  EDAA0, ATOM channel 0 interrupt notification register */
#define GTM_ATOM11_CH5_IRQ_NOTIFY      /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY *)0xF01EDAA0u)

/** \\brief  EDA80, ATOM channel 0 ARU read address register */
#define GTM_ATOM11_CH5_RDADDR          /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR *)0xF01EDA80u)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM11_CH5_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL *)0xF01EDA84u)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM11_CH5_SOMI             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI *)0xF01EDA84u)

/** Alias (User Manual Name) for GTM_ATOM11_CH5_SOMI.
 * To use register names with standard convension, please use GTM_ATOM11_CH5_SOMI.
 */
#define GTM_ATOM11_CH5_CTRL_SOMI        (GTM_ATOM11_CH5_SOMI)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM11_CH5_SOMC             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC *)0xF01EDA84u)

/** Alias (User Manual Name) for GTM_ATOM11_CH5_SOMC.
 * To use register names with standard convension, please use GTM_ATOM11_CH5_SOMC.
 */
#define GTM_ATOM11_CH5_CTRL_SOMC        (GTM_ATOM11_CH5_SOMC)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM11_CH5_SOMP             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP *)0xF01EDA84u)

