Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** Alias (User Manual Name) for GTM_ATOM11_CH5_SOMP.
 * To use register names with standard convension, please use GTM_ATOM11_CH5_SOMP.
 */
#define GTM_ATOM11_CH5_CTRL_SOMP        (GTM_ATOM11_CH5_SOMP)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM11_CH5_SOMS             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS *)0xF01EDA84u)

/** Alias (User Manual Name) for GTM_ATOM11_CH5_SOMS.
 * To use register names with standard convension, please use GTM_ATOM11_CH5_SOMS.
 */
#define GTM_ATOM11_CH5_CTRL_SOMS        (GTM_ATOM11_CH5_SOMS)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM11_CH5_SOMB             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB *)0xF01EDA84u)

/** Alias (User Manual Name) for GTM_ATOM11_CH5_SOMB.
 * To use register names with standard convension, please use GTM_ATOM11_CH5_SOMB.
 */
#define GTM_ATOM11_CH5_CTRL_SOMB        (GTM_ATOM11_CH5_SOMB)

/** \\brief  EDA88, ATOM channel 0 CCU0 compare shadow register */
#define GTM_ATOM11_CH5_SR0             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0 *)0xF01EDA88u)

/** \\brief  EDA8C, ATOM channel 0 CCU1 compare shadow register */
#define GTM_ATOM11_CH5_SR1             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1 *)0xF01EDA8Cu)

/** \\brief  EDA9C, ATOM channel 0 status register */
#define GTM_ATOM11_CH5_STAT            /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT *)0xF01EDA9Cu)

/** \\brief  EDB10, ATOM channel 0 CCU0 compare register */
#define GTM_ATOM11_CH6_CM0             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0 *)0xF01EDB10u)

/** \\brief  EDB14, ATOM channel 0 CCU1 compare register */
#define GTM_ATOM11_CH6_CM1             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1 *)0xF01EDB14u)

/** \\brief  EDB18, ATOM channel 0 CCU0 counter register */
#define GTM_ATOM11_CH6_CN0             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0 *)0xF01EDB18u)

/** \\brief  EDB24, ATOM channel 0 interrupt enable register */
#define GTM_ATOM11_CH6_IRQ_EN          /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN *)0xF01EDB24u)

/** \\brief  EDB28, ATOM channel 0 software interrupt generation */
#define GTM_ATOM11_CH6_IRQ_FORCINT     /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT *)0xF01EDB28u)

/** \\brief  EDB2C, ATOM channel 0 interrupt mode configuration register */
#define GTM_ATOM11_CH6_IRQ_MODE        /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE *)0xF01EDB2Cu)

/** \\brief  EDB20, ATOM channel 0 interrupt notification register */
#define GTM_ATOM11_CH6_IRQ_NOTIFY      /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY *)0xF01EDB20u)

/** \\brief  EDB00, ATOM channel 0 ARU read address register */
#define GTM_ATOM11_CH6_RDADDR          /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR *)0xF01EDB00u)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM11_CH6_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL *)0xF01EDB04u)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM11_CH6_SOMI             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI *)0xF01EDB04u)

/** Alias (User Manual Name) for GTM_ATOM11_CH6_SOMI.
 * To use register names with standard convension, please use GTM_ATOM11_CH6_SOMI.
 */
#define GTM_ATOM11_CH6_CTRL_SOMI        (GTM_ATOM11_CH6_SOMI)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM11_CH6_SOMC             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC *)0xF01EDB04u)

/** Alias (User Manual Name) for GTM_ATOM11_CH6_SOMC.
 * To use register names with standard convension, please use GTM_ATOM11_CH6_SOMC.
 */
#define GTM_ATOM11_CH6_CTRL_SOMC        (GTM_ATOM11_CH6_SOMC)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM11_CH6_SOMP             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP *)0xF01EDB04u)

/** Alias (User Manual Name) for GTM_ATOM11_CH6_SOMP.
 * To use register names with standard convension, please use GTM_ATOM11_CH6_SOMP.
 */
#define GTM_ATOM11_CH6_CTRL_SOMP        (GTM_ATOM11_CH6_SOMP)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM11_CH6_SOMS             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS *)0xF01EDB04u)

/** Alias (User Manual Name) for GTM_ATOM11_CH6_SOMS.
 * To use register names with standard convension, please use GTM_ATOM11_CH6_SOMS.
 */
#define GTM_ATOM11_CH6_CTRL_SOMS        (GTM_ATOM11_CH6_SOMS)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM11_CH6_SOMB             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB *)0xF01EDB04u)

/** Alias (User Manual Name) for GTM_ATOM11_CH6_SOMB.
 * To use register names with standard convension, please use GTM_ATOM11_CH6_SOMB.
 */
#define GTM_ATOM11_CH6_CTRL_SOMB        (GTM_ATOM11_CH6_SOMB)

/** \\brief  EDB08, ATOM channel 0 CCU0 compare shadow register */
#define GTM_ATOM11_CH6_SR0             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0 *)0xF01EDB08u)

/** \\brief  EDB0C, ATOM channel 0 CCU1 compare shadow register */
#define GTM_ATOM11_CH6_SR1             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1 *)0xF01EDB0Cu)

/** \\brief  EDB1C, ATOM channel 0 status register */
#define GTM_ATOM11_CH6_STAT            /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT *)0xF01EDB1Cu)

/** \\brief  EDB90, ATOM channel 0 CCU0 compare register */
#define GTM_ATOM11_CH7_CM0             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0 *)0xF01EDB90u)

/** \\brief  EDB94, ATOM channel 0 CCU1 compare register */
#define GTM_ATOM11_CH7_CM1             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1 *)0xF01EDB94u)

/** \\brief  EDB98, ATOM channel 0 CCU0 counter register */
#define GTM_ATOM11_CH7_CN0             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0 *)0xF01EDB98u)

/** \\brief  EDBA4, ATOM channel 0 interrupt enable register */
#define GTM_ATOM11_CH7_IRQ_EN          /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN *)0xF01EDBA4u)

/** \\brief  EDBA8, ATOM channel 0 software interrupt generation */
#define GTM_ATOM11_CH7_IRQ_FORCINT     /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT *)0xF01EDBA8u)

