Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  EDBAC, ATOM channel 0 interrupt mode configuration register */
#define GTM_ATOM11_CH7_IRQ_MODE        /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE *)0xF01EDBACu)

/** \\brief  EDBA0, ATOM channel 0 interrupt notification register */
#define GTM_ATOM11_CH7_IRQ_NOTIFY      /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY *)0xF01EDBA0u)

/** \\brief  EDB80, ATOM channel 0 ARU read address register */
#define GTM_ATOM11_CH7_RDADDR          /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR *)0xF01EDB80u)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM11_CH7_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL *)0xF01EDB84u)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM11_CH7_SOMI             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI *)0xF01EDB84u)

/** Alias (User Manual Name) for GTM_ATOM11_CH7_SOMI.
 * To use register names with standard convension, please use GTM_ATOM11_CH7_SOMI.
 */
#define GTM_ATOM11_CH7_CTRL_SOMI        (GTM_ATOM11_CH7_SOMI)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM11_CH7_SOMC             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC *)0xF01EDB84u)

/** Alias (User Manual Name) for GTM_ATOM11_CH7_SOMC.
 * To use register names with standard convension, please use GTM_ATOM11_CH7_SOMC.
 */
#define GTM_ATOM11_CH7_CTRL_SOMC        (GTM_ATOM11_CH7_SOMC)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM11_CH7_SOMP             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP *)0xF01EDB84u)

/** Alias (User Manual Name) for GTM_ATOM11_CH7_SOMP.
 * To use register names with standard convension, please use GTM_ATOM11_CH7_SOMP.
 */
#define GTM_ATOM11_CH7_CTRL_SOMP        (GTM_ATOM11_CH7_SOMP)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM11_CH7_SOMS             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS *)0xF01EDB84u)

/** Alias (User Manual Name) for GTM_ATOM11_CH7_SOMS.
 * To use register names with standard convension, please use GTM_ATOM11_CH7_SOMS.
 */
#define GTM_ATOM11_CH7_CTRL_SOMS        (GTM_ATOM11_CH7_SOMS)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM11_CH7_SOMB             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB *)0xF01EDB84u)

/** Alias (User Manual Name) for GTM_ATOM11_CH7_SOMB.
 * To use register names with standard convension, please use GTM_ATOM11_CH7_SOMB.
 */
#define GTM_ATOM11_CH7_CTRL_SOMB        (GTM_ATOM11_CH7_SOMB)

/** \\brief  EDB88, ATOM channel 0 CCU0 compare shadow register */
#define GTM_ATOM11_CH7_SR0             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0 *)0xF01EDB88u)

/** \\brief  EDB8C, ATOM channel 0 CCU1 compare shadow register */
#define GTM_ATOM11_CH7_SR1             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1 *)0xF01EDB8Cu)

/** \\brief  EDB9C, ATOM channel 0 status register */
#define GTM_ATOM11_CH7_STAT            /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT *)0xF01EDB9Cu)

/** \\brief  E884C, ATOM AGC action time base register */
#define GTM_ATOM1_AGC_ACT_TB           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_ACT_TB *)0xF01E884Cu)

/** \\brief  E8844, ATOM AGC enable/disable control register */
#define GTM_ATOM1_AGC_ENDIS_CTRL       /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_ENDIS_CTRL *)0xF01E8844u)

/** \\brief  E8848, ATOM AGC enable/disable status register */
#define GTM_ATOM1_AGC_ENDIS_STAT       /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_ENDIS_STAT *)0xF01E8848u)

/** \\brief  E8858, ATOM AGC force update control register */
#define GTM_ATOM1_AGC_FUPD_CTRL        /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_FUPD_CTRL *)0xF01E8858u)

/** \\brief  E8840, ATOM AGC global control register */
#define GTM_ATOM1_AGC_GLB_CTRL         /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_GLB_CTRL *)0xF01E8840u)

/** \\brief  E885C, ATOM AGC internal trigger control register */
#define GTM_ATOM1_AGC_INT_TRIG         /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_INT_TRIG *)0xF01E885Cu)

/** \\brief  E8850, ATOM AGC output enable control register */
#define GTM_ATOM1_AGC_OUTEN_CTRL       /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_OUTEN_CTRL *)0xF01E8850u)

/** \\brief  E8854, ATOM AGC output enable status register */
#define GTM_ATOM1_AGC_OUTEN_STAT       /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_OUTEN_STAT *)0xF01E8854u)

/** \\brief  E8810, ATOM channel 0 CCU0 compare register */
#define GTM_ATOM1_CH0_CM0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0 *)0xF01E8810u)

/** \\brief  E8814, ATOM channel 0 CCU1 compare register */
#define GTM_ATOM1_CH0_CM1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1 *)0xF01E8814u)

/** \\brief  E8818, ATOM channel 0 CCU0 counter register */
#define GTM_ATOM1_CH0_CN0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0 *)0xF01E8818u)

/** \\brief  E8824, ATOM channel 0 interrupt enable register */
#define GTM_ATOM1_CH0_IRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN *)0xF01E8824u)

/** \\brief  E8828, ATOM channel 0 software interrupt generation */
#define GTM_ATOM1_CH0_IRQ_FORCINT      /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT *)0xF01E8828u)

/** \\brief  E882C, ATOM channel 0 interrupt mode configuration register */
#define GTM_ATOM1_CH0_IRQ_MODE         /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE *)0xF01E882Cu)

/** \\brief  E8820, ATOM channel 0 interrupt notification register */
#define GTM_ATOM1_CH0_IRQ_NOTIFY       /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY *)0xF01E8820u)

/** \\brief  E8800, ATOM channel 0 ARU read address register */
#define GTM_ATOM1_CH0_RDADDR           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR *)0xF01E8800u)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM1_CH0_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL *)0xF01E8804u)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM1_CH0_SOMI             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI *)0xF01E8804u)

/** Alias (User Manual Name) for GTM_ATOM1_CH0_SOMI.
 * To use register names with standard convension, please use GTM_ATOM1_CH0_SOMI.
 */
#define GTM_ATOM1_CH0_CTRL_SOMI        (GTM_ATOM1_CH0_SOMI)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM1_CH0_SOMC             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC *)0xF01E8804u)

/** Alias (User Manual Name) for GTM_ATOM1_CH0_SOMC.
 * To use register names with standard convension, please use GTM_ATOM1_CH0_SOMC.
 */
#define GTM_ATOM1_CH0_CTRL_SOMC        (GTM_ATOM1_CH0_SOMC)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM1_CH0_SOMP             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP *)0xF01E8804u)

/** Alias (User Manual Name) for GTM_ATOM1_CH0_SOMP.
 * To use register names with standard convension, please use GTM_ATOM1_CH0_SOMP.
 */
#define GTM_ATOM1_CH0_CTRL_SOMP        (GTM_ATOM1_CH0_SOMP)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM1_CH0_SOMS             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS *)0xF01E8804u)

/** Alias (User Manual Name) for GTM_ATOM1_CH0_SOMS.
 * To use register names with standard convension, please use GTM_ATOM1_CH0_SOMS.
 */
#define GTM_ATOM1_CH0_CTRL_SOMS        (GTM_ATOM1_CH0_SOMS)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM1_CH0_SOMB             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB *)0xF01E8804u)

/** Alias (User Manual Name) for GTM_ATOM1_CH0_SOMB.
 * To use register names with standard convension, please use GTM_ATOM1_CH0_SOMB.
 */
#define GTM_ATOM1_CH0_CTRL_SOMB        (GTM_ATOM1_CH0_SOMB)

/** \\brief  E8808, ATOM channel 0 CCU0 compare shadow register */
#define GTM_ATOM1_CH0_SR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0 *)0xF01E8808u)

