Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  E880C, ATOM channel 0 CCU1 compare shadow register */
#define GTM_ATOM1_CH0_SR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1 *)0xF01E880Cu)

/** \\brief  E881C, ATOM channel 0 status register */
#define GTM_ATOM1_CH0_STAT             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT *)0xF01E881Cu)

/** \\brief  E8890, ATOM channel 0 CCU0 compare register */
#define GTM_ATOM1_CH1_CM0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0 *)0xF01E8890u)

/** \\brief  E8894, ATOM channel 0 CCU1 compare register */
#define GTM_ATOM1_CH1_CM1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1 *)0xF01E8894u)

/** \\brief  E8898, ATOM channel 0 CCU0 counter register */
#define GTM_ATOM1_CH1_CN0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0 *)0xF01E8898u)

/** \\brief  E88A4, ATOM channel 0 interrupt enable register */
#define GTM_ATOM1_CH1_IRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN *)0xF01E88A4u)

/** \\brief  E88A8, ATOM channel 0 software interrupt generation */
#define GTM_ATOM1_CH1_IRQ_FORCINT      /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT *)0xF01E88A8u)

/** \\brief  E88AC, ATOM channel 0 interrupt mode configuration register */
#define GTM_ATOM1_CH1_IRQ_MODE         /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE *)0xF01E88ACu)

/** \\brief  E88A0, ATOM channel 0 interrupt notification register */
#define GTM_ATOM1_CH1_IRQ_NOTIFY       /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY *)0xF01E88A0u)

/** \\brief  E8880, ATOM channel 0 ARU read address register */
#define GTM_ATOM1_CH1_RDADDR           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR *)0xF01E8880u)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM1_CH1_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL *)0xF01E8884u)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM1_CH1_SOMI             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI *)0xF01E8884u)

/** Alias (User Manual Name) for GTM_ATOM1_CH1_SOMI.
 * To use register names with standard convension, please use GTM_ATOM1_CH1_SOMI.
 */
#define GTM_ATOM1_CH1_CTRL_SOMI        (GTM_ATOM1_CH1_SOMI)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM1_CH1_SOMC             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC *)0xF01E8884u)

/** Alias (User Manual Name) for GTM_ATOM1_CH1_SOMC.
 * To use register names with standard convension, please use GTM_ATOM1_CH1_SOMC.
 */
#define GTM_ATOM1_CH1_CTRL_SOMC        (GTM_ATOM1_CH1_SOMC)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM1_CH1_SOMP             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP *)0xF01E8884u)

/** Alias (User Manual Name) for GTM_ATOM1_CH1_SOMP.
 * To use register names with standard convension, please use GTM_ATOM1_CH1_SOMP.
 */
#define GTM_ATOM1_CH1_CTRL_SOMP        (GTM_ATOM1_CH1_SOMP)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM1_CH1_SOMS             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS *)0xF01E8884u)

/** Alias (User Manual Name) for GTM_ATOM1_CH1_SOMS.
 * To use register names with standard convension, please use GTM_ATOM1_CH1_SOMS.
 */
#define GTM_ATOM1_CH1_CTRL_SOMS        (GTM_ATOM1_CH1_SOMS)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM1_CH1_SOMB             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB *)0xF01E8884u)

/** Alias (User Manual Name) for GTM_ATOM1_CH1_SOMB.
 * To use register names with standard convension, please use GTM_ATOM1_CH1_SOMB.
 */
#define GTM_ATOM1_CH1_CTRL_SOMB        (GTM_ATOM1_CH1_SOMB)

/** \\brief  E8888, ATOM channel 0 CCU0 compare shadow register */
#define GTM_ATOM1_CH1_SR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0 *)0xF01E8888u)

/** \\brief  E888C, ATOM channel 0 CCU1 compare shadow register */
#define GTM_ATOM1_CH1_SR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1 *)0xF01E888Cu)

/** \\brief  E889C, ATOM channel 0 status register */
#define GTM_ATOM1_CH1_STAT             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT *)0xF01E889Cu)

/** \\brief  E8910, ATOM channel 0 CCU0 compare register */
#define GTM_ATOM1_CH2_CM0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0 *)0xF01E8910u)

/** \\brief  E8914, ATOM channel 0 CCU1 compare register */
#define GTM_ATOM1_CH2_CM1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1 *)0xF01E8914u)

/** \\brief  E8918, ATOM channel 0 CCU0 counter register */
#define GTM_ATOM1_CH2_CN0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0 *)0xF01E8918u)

/** \\brief  E8924, ATOM channel 0 interrupt enable register */
#define GTM_ATOM1_CH2_IRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN *)0xF01E8924u)

/** \\brief  E8928, ATOM channel 0 software interrupt generation */
#define GTM_ATOM1_CH2_IRQ_FORCINT      /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT *)0xF01E8928u)

/** \\brief  E892C, ATOM channel 0 interrupt mode configuration register */
#define GTM_ATOM1_CH2_IRQ_MODE         /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE *)0xF01E892Cu)

/** \\brief  E8920, ATOM channel 0 interrupt notification register */
#define GTM_ATOM1_CH2_IRQ_NOTIFY       /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY *)0xF01E8920u)

/** \\brief  E8900, ATOM channel 0 ARU read address register */
#define GTM_ATOM1_CH2_RDADDR           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR *)0xF01E8900u)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM1_CH2_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL *)0xF01E8904u)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM1_CH2_SOMI             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI *)0xF01E8904u)

/** Alias (User Manual Name) for GTM_ATOM1_CH2_SOMI.
 * To use register names with standard convension, please use GTM_ATOM1_CH2_SOMI.
 */
#define GTM_ATOM1_CH2_CTRL_SOMI        (GTM_ATOM1_CH2_SOMI)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM1_CH2_SOMC             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC *)0xF01E8904u)

/** Alias (User Manual Name) for GTM_ATOM1_CH2_SOMC.
 * To use register names with standard convension, please use GTM_ATOM1_CH2_SOMC.
 */
#define GTM_ATOM1_CH2_CTRL_SOMC        (GTM_ATOM1_CH2_SOMC)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM1_CH2_SOMP             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP *)0xF01E8904u)

