Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** Alias (User Manual Name) for GTM_ATOM1_CH2_SOMP.
 * To use register names with standard convension, please use GTM_ATOM1_CH2_SOMP.
 */
#define GTM_ATOM1_CH2_CTRL_SOMP        (GTM_ATOM1_CH2_SOMP)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM1_CH2_SOMS             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS *)0xF01E8904u)

/** Alias (User Manual Name) for GTM_ATOM1_CH2_SOMS.
 * To use register names with standard convension, please use GTM_ATOM1_CH2_SOMS.
 */
#define GTM_ATOM1_CH2_CTRL_SOMS        (GTM_ATOM1_CH2_SOMS)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM1_CH2_SOMB             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB *)0xF01E8904u)

/** Alias (User Manual Name) for GTM_ATOM1_CH2_SOMB.
 * To use register names with standard convension, please use GTM_ATOM1_CH2_SOMB.
 */
#define GTM_ATOM1_CH2_CTRL_SOMB        (GTM_ATOM1_CH2_SOMB)

/** \\brief  E8908, ATOM channel 0 CCU0 compare shadow register */
#define GTM_ATOM1_CH2_SR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0 *)0xF01E8908u)

/** \\brief  E890C, ATOM channel 0 CCU1 compare shadow register */
#define GTM_ATOM1_CH2_SR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1 *)0xF01E890Cu)

/** \\brief  E891C, ATOM channel 0 status register */
#define GTM_ATOM1_CH2_STAT             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT *)0xF01E891Cu)

/** \\brief  E8990, ATOM channel 0 CCU0 compare register */
#define GTM_ATOM1_CH3_CM0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0 *)0xF01E8990u)

/** \\brief  E8994, ATOM channel 0 CCU1 compare register */
#define GTM_ATOM1_CH3_CM1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1 *)0xF01E8994u)

/** \\brief  E8998, ATOM channel 0 CCU0 counter register */
#define GTM_ATOM1_CH3_CN0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0 *)0xF01E8998u)

/** \\brief  E89A4, ATOM channel 0 interrupt enable register */
#define GTM_ATOM1_CH3_IRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN *)0xF01E89A4u)

/** \\brief  E89A8, ATOM channel 0 software interrupt generation */
#define GTM_ATOM1_CH3_IRQ_FORCINT      /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT *)0xF01E89A8u)

/** \\brief  E89AC, ATOM channel 0 interrupt mode configuration register */
#define GTM_ATOM1_CH3_IRQ_MODE         /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE *)0xF01E89ACu)

/** \\brief  E89A0, ATOM channel 0 interrupt notification register */
#define GTM_ATOM1_CH3_IRQ_NOTIFY       /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY *)0xF01E89A0u)

/** \\brief  E8980, ATOM channel 0 ARU read address register */
#define GTM_ATOM1_CH3_RDADDR           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR *)0xF01E8980u)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM1_CH3_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL *)0xF01E8984u)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM1_CH3_SOMI             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI *)0xF01E8984u)

/** Alias (User Manual Name) for GTM_ATOM1_CH3_SOMI.
 * To use register names with standard convension, please use GTM_ATOM1_CH3_SOMI.
 */
#define GTM_ATOM1_CH3_CTRL_SOMI        (GTM_ATOM1_CH3_SOMI)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM1_CH3_SOMC             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC *)0xF01E8984u)

/** Alias (User Manual Name) for GTM_ATOM1_CH3_SOMC.
 * To use register names with standard convension, please use GTM_ATOM1_CH3_SOMC.
 */
#define GTM_ATOM1_CH3_CTRL_SOMC        (GTM_ATOM1_CH3_SOMC)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM1_CH3_SOMP             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP *)0xF01E8984u)

/** Alias (User Manual Name) for GTM_ATOM1_CH3_SOMP.
 * To use register names with standard convension, please use GTM_ATOM1_CH3_SOMP.
 */
#define GTM_ATOM1_CH3_CTRL_SOMP        (GTM_ATOM1_CH3_SOMP)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM1_CH3_SOMS             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS *)0xF01E8984u)

/** Alias (User Manual Name) for GTM_ATOM1_CH3_SOMS.
 * To use register names with standard convension, please use GTM_ATOM1_CH3_SOMS.
 */
#define GTM_ATOM1_CH3_CTRL_SOMS        (GTM_ATOM1_CH3_SOMS)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM1_CH3_SOMB             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB *)0xF01E8984u)

/** Alias (User Manual Name) for GTM_ATOM1_CH3_SOMB.
 * To use register names with standard convension, please use GTM_ATOM1_CH3_SOMB.
 */
#define GTM_ATOM1_CH3_CTRL_SOMB        (GTM_ATOM1_CH3_SOMB)

/** \\brief  E8988, ATOM channel 0 CCU0 compare shadow register */
#define GTM_ATOM1_CH3_SR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0 *)0xF01E8988u)

/** \\brief  E898C, ATOM channel 0 CCU1 compare shadow register */
#define GTM_ATOM1_CH3_SR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1 *)0xF01E898Cu)

/** \\brief  E899C, ATOM channel 0 status register */
#define GTM_ATOM1_CH3_STAT             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT *)0xF01E899Cu)

/** \\brief  E8A10, ATOM channel 0 CCU0 compare register */
#define GTM_ATOM1_CH4_CM0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0 *)0xF01E8A10u)

/** \\brief  E8A14, ATOM channel 0 CCU1 compare register */
#define GTM_ATOM1_CH4_CM1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1 *)0xF01E8A14u)

/** \\brief  E8A18, ATOM channel 0 CCU0 counter register */
#define GTM_ATOM1_CH4_CN0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0 *)0xF01E8A18u)

/** \\brief  E8A24, ATOM channel 0 interrupt enable register */
#define GTM_ATOM1_CH4_IRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN *)0xF01E8A24u)

/** \\brief  E8A28, ATOM channel 0 software interrupt generation */
#define GTM_ATOM1_CH4_IRQ_FORCINT      /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT *)0xF01E8A28u)

/** \\brief  E8A2C, ATOM channel 0 interrupt mode configuration register */
#define GTM_ATOM1_CH4_IRQ_MODE         /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE *)0xF01E8A2Cu)

