Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  E8A20, ATOM channel 0 interrupt notification register */
#define GTM_ATOM1_CH4_IRQ_NOTIFY       /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY *)0xF01E8A20u)

/** \\brief  E8A00, ATOM channel 0 ARU read address register */
#define GTM_ATOM1_CH4_RDADDR           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR *)0xF01E8A00u)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM1_CH4_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL *)0xF01E8A04u)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM1_CH4_SOMI             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI *)0xF01E8A04u)

/** Alias (User Manual Name) for GTM_ATOM1_CH4_SOMI.
 * To use register names with standard convension, please use GTM_ATOM1_CH4_SOMI.
 */
#define GTM_ATOM1_CH4_CTRL_SOMI        (GTM_ATOM1_CH4_SOMI)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM1_CH4_SOMC             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC *)0xF01E8A04u)

/** Alias (User Manual Name) for GTM_ATOM1_CH4_SOMC.
 * To use register names with standard convension, please use GTM_ATOM1_CH4_SOMC.
 */
#define GTM_ATOM1_CH4_CTRL_SOMC        (GTM_ATOM1_CH4_SOMC)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM1_CH4_SOMP             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP *)0xF01E8A04u)

/** Alias (User Manual Name) for GTM_ATOM1_CH4_SOMP.
 * To use register names with standard convension, please use GTM_ATOM1_CH4_SOMP.
 */
#define GTM_ATOM1_CH4_CTRL_SOMP        (GTM_ATOM1_CH4_SOMP)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM1_CH4_SOMS             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS *)0xF01E8A04u)

/** Alias (User Manual Name) for GTM_ATOM1_CH4_SOMS.
 * To use register names with standard convension, please use GTM_ATOM1_CH4_SOMS.
 */
#define GTM_ATOM1_CH4_CTRL_SOMS        (GTM_ATOM1_CH4_SOMS)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM1_CH4_SOMB             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB *)0xF01E8A04u)

/** Alias (User Manual Name) for GTM_ATOM1_CH4_SOMB.
 * To use register names with standard convension, please use GTM_ATOM1_CH4_SOMB.
 */
#define GTM_ATOM1_CH4_CTRL_SOMB        (GTM_ATOM1_CH4_SOMB)

/** \\brief  E8A08, ATOM channel 0 CCU0 compare shadow register */
#define GTM_ATOM1_CH4_SR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0 *)0xF01E8A08u)

/** \\brief  E8A0C, ATOM channel 0 CCU1 compare shadow register */
#define GTM_ATOM1_CH4_SR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1 *)0xF01E8A0Cu)

/** \\brief  E8A1C, ATOM channel 0 status register */
#define GTM_ATOM1_CH4_STAT             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT *)0xF01E8A1Cu)

/** \\brief  E8A90, ATOM channel 0 CCU0 compare register */
#define GTM_ATOM1_CH5_CM0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0 *)0xF01E8A90u)

/** \\brief  E8A94, ATOM channel 0 CCU1 compare register */
#define GTM_ATOM1_CH5_CM1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1 *)0xF01E8A94u)

/** \\brief  E8A98, ATOM channel 0 CCU0 counter register */
#define GTM_ATOM1_CH5_CN0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0 *)0xF01E8A98u)

/** \\brief  E8AA4, ATOM channel 0 interrupt enable register */
#define GTM_ATOM1_CH5_IRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN *)0xF01E8AA4u)

/** \\brief  E8AA8, ATOM channel 0 software interrupt generation */
#define GTM_ATOM1_CH5_IRQ_FORCINT      /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT *)0xF01E8AA8u)

/** \\brief  E8AAC, ATOM channel 0 interrupt mode configuration register */
#define GTM_ATOM1_CH5_IRQ_MODE         /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE *)0xF01E8AACu)

/** \\brief  E8AA0, ATOM channel 0 interrupt notification register */
#define GTM_ATOM1_CH5_IRQ_NOTIFY       /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY *)0xF01E8AA0u)

/** \\brief  E8A80, ATOM channel 0 ARU read address register */
#define GTM_ATOM1_CH5_RDADDR           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR *)0xF01E8A80u)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM1_CH5_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL *)0xF01E8A84u)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM1_CH5_SOMI             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI *)0xF01E8A84u)

/** Alias (User Manual Name) for GTM_ATOM1_CH5_SOMI.
 * To use register names with standard convension, please use GTM_ATOM1_CH5_SOMI.
 */
#define GTM_ATOM1_CH5_CTRL_SOMI        (GTM_ATOM1_CH5_SOMI)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM1_CH5_SOMC             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC *)0xF01E8A84u)

/** Alias (User Manual Name) for GTM_ATOM1_CH5_SOMC.
 * To use register names with standard convension, please use GTM_ATOM1_CH5_SOMC.
 */
#define GTM_ATOM1_CH5_CTRL_SOMC        (GTM_ATOM1_CH5_SOMC)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM1_CH5_SOMP             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP *)0xF01E8A84u)

/** Alias (User Manual Name) for GTM_ATOM1_CH5_SOMP.
 * To use register names with standard convension, please use GTM_ATOM1_CH5_SOMP.
 */
#define GTM_ATOM1_CH5_CTRL_SOMP        (GTM_ATOM1_CH5_SOMP)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM1_CH5_SOMS             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS *)0xF01E8A84u)

/** Alias (User Manual Name) for GTM_ATOM1_CH5_SOMS.
 * To use register names with standard convension, please use GTM_ATOM1_CH5_SOMS.
 */
#define GTM_ATOM1_CH5_CTRL_SOMS        (GTM_ATOM1_CH5_SOMS)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM1_CH5_SOMB             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB *)0xF01E8A84u)

/** Alias (User Manual Name) for GTM_ATOM1_CH5_SOMB.
 * To use register names with standard convension, please use GTM_ATOM1_CH5_SOMB.
 */
#define GTM_ATOM1_CH5_CTRL_SOMB        (GTM_ATOM1_CH5_SOMB)

/** \\brief  E8A88, ATOM channel 0 CCU0 compare shadow register */
#define GTM_ATOM1_CH5_SR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0 *)0xF01E8A88u)

/** \\brief  E8A8C, ATOM channel 0 CCU1 compare shadow register */
#define GTM_ATOM1_CH5_SR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1 *)0xF01E8A8Cu)

/** \\brief  E8A9C, ATOM channel 0 status register */
#define GTM_ATOM1_CH5_STAT             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT *)0xF01E8A9Cu)

/** \\brief  E8B10, ATOM channel 0 CCU0 compare register */
#define GTM_ATOM1_CH6_CM0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0 *)0xF01E8B10u)

/** \\brief  E8B14, ATOM channel 0 CCU1 compare register */
#define GTM_ATOM1_CH6_CM1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1 *)0xF01E8B14u)

