Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  E8B18, ATOM channel 0 CCU0 counter register */
#define GTM_ATOM1_CH6_CN0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0 *)0xF01E8B18u)

/** \\brief  E8B24, ATOM channel 0 interrupt enable register */
#define GTM_ATOM1_CH6_IRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN *)0xF01E8B24u)

/** \\brief  E8B28, ATOM channel 0 software interrupt generation */
#define GTM_ATOM1_CH6_IRQ_FORCINT      /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT *)0xF01E8B28u)

/** \\brief  E8B2C, ATOM channel 0 interrupt mode configuration register */
#define GTM_ATOM1_CH6_IRQ_MODE         /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE *)0xF01E8B2Cu)

/** \\brief  E8B20, ATOM channel 0 interrupt notification register */
#define GTM_ATOM1_CH6_IRQ_NOTIFY       /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY *)0xF01E8B20u)

/** \\brief  E8B00, ATOM channel 0 ARU read address register */
#define GTM_ATOM1_CH6_RDADDR           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR *)0xF01E8B00u)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM1_CH6_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL *)0xF01E8B04u)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM1_CH6_SOMI             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI *)0xF01E8B04u)

/** Alias (User Manual Name) for GTM_ATOM1_CH6_SOMI.
 * To use register names with standard convension, please use GTM_ATOM1_CH6_SOMI.
 */
#define GTM_ATOM1_CH6_CTRL_SOMI        (GTM_ATOM1_CH6_SOMI)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM1_CH6_SOMC             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC *)0xF01E8B04u)

/** Alias (User Manual Name) for GTM_ATOM1_CH6_SOMC.
 * To use register names with standard convension, please use GTM_ATOM1_CH6_SOMC.
 */
#define GTM_ATOM1_CH6_CTRL_SOMC        (GTM_ATOM1_CH6_SOMC)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM1_CH6_SOMP             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP *)0xF01E8B04u)

/** Alias (User Manual Name) for GTM_ATOM1_CH6_SOMP.
 * To use register names with standard convension, please use GTM_ATOM1_CH6_SOMP.
 */
#define GTM_ATOM1_CH6_CTRL_SOMP        (GTM_ATOM1_CH6_SOMP)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM1_CH6_SOMS             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS *)0xF01E8B04u)

/** Alias (User Manual Name) for GTM_ATOM1_CH6_SOMS.
 * To use register names with standard convension, please use GTM_ATOM1_CH6_SOMS.
 */
#define GTM_ATOM1_CH6_CTRL_SOMS        (GTM_ATOM1_CH6_SOMS)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM1_CH6_SOMB             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB *)0xF01E8B04u)

/** Alias (User Manual Name) for GTM_ATOM1_CH6_SOMB.
 * To use register names with standard convension, please use GTM_ATOM1_CH6_SOMB.
 */
#define GTM_ATOM1_CH6_CTRL_SOMB        (GTM_ATOM1_CH6_SOMB)

/** \\brief  E8B08, ATOM channel 0 CCU0 compare shadow register */
#define GTM_ATOM1_CH6_SR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0 *)0xF01E8B08u)

/** \\brief  E8B0C, ATOM channel 0 CCU1 compare shadow register */
#define GTM_ATOM1_CH6_SR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1 *)0xF01E8B0Cu)

/** \\brief  E8B1C, ATOM channel 0 status register */
#define GTM_ATOM1_CH6_STAT             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT *)0xF01E8B1Cu)

/** \\brief  E8B90, ATOM channel 0 CCU0 compare register */
#define GTM_ATOM1_CH7_CM0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0 *)0xF01E8B90u)

/** \\brief  E8B94, ATOM channel 0 CCU1 compare register */
#define GTM_ATOM1_CH7_CM1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1 *)0xF01E8B94u)

/** \\brief  E8B98, ATOM channel 0 CCU0 counter register */
#define GTM_ATOM1_CH7_CN0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0 *)0xF01E8B98u)

/** \\brief  E8BA4, ATOM channel 0 interrupt enable register */
#define GTM_ATOM1_CH7_IRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN *)0xF01E8BA4u)

/** \\brief  E8BA8, ATOM channel 0 software interrupt generation */
#define GTM_ATOM1_CH7_IRQ_FORCINT      /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT *)0xF01E8BA8u)

/** \\brief  E8BAC, ATOM channel 0 interrupt mode configuration register */
#define GTM_ATOM1_CH7_IRQ_MODE         /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE *)0xF01E8BACu)

/** \\brief  E8BA0, ATOM channel 0 interrupt notification register */
#define GTM_ATOM1_CH7_IRQ_NOTIFY       /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY *)0xF01E8BA0u)

/** \\brief  E8B80, ATOM channel 0 ARU read address register */
#define GTM_ATOM1_CH7_RDADDR           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR *)0xF01E8B80u)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM1_CH7_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL *)0xF01E8B84u)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM1_CH7_SOMI             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI *)0xF01E8B84u)

/** Alias (User Manual Name) for GTM_ATOM1_CH7_SOMI.
 * To use register names with standard convension, please use GTM_ATOM1_CH7_SOMI.
 */
#define GTM_ATOM1_CH7_CTRL_SOMI        (GTM_ATOM1_CH7_SOMI)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM1_CH7_SOMC             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC *)0xF01E8B84u)

/** Alias (User Manual Name) for GTM_ATOM1_CH7_SOMC.
 * To use register names with standard convension, please use GTM_ATOM1_CH7_SOMC.
 */
#define GTM_ATOM1_CH7_CTRL_SOMC        (GTM_ATOM1_CH7_SOMC)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM1_CH7_SOMP             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP *)0xF01E8B84u)

/** Alias (User Manual Name) for GTM_ATOM1_CH7_SOMP.
 * To use register names with standard convension, please use GTM_ATOM1_CH7_SOMP.
 */
#define GTM_ATOM1_CH7_CTRL_SOMP        (GTM_ATOM1_CH7_SOMP)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM1_CH7_SOMS             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS *)0xF01E8B84u)

