Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** Alias (User Manual Name) for GTM_ATOM1_CH7_SOMS.
 * To use register names with standard convension, please use GTM_ATOM1_CH7_SOMS.
 */
#define GTM_ATOM1_CH7_CTRL_SOMS        (GTM_ATOM1_CH7_SOMS)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM1_CH7_SOMB             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB *)0xF01E8B84u)

/** Alias (User Manual Name) for GTM_ATOM1_CH7_SOMB.
 * To use register names with standard convension, please use GTM_ATOM1_CH7_SOMB.
 */
#define GTM_ATOM1_CH7_CTRL_SOMB        (GTM_ATOM1_CH7_SOMB)

/** \\brief  E8B88, ATOM channel 0 CCU0 compare shadow register */
#define GTM_ATOM1_CH7_SR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0 *)0xF01E8B88u)

/** \\brief  E8B8C, ATOM channel 0 CCU1 compare shadow register */
#define GTM_ATOM1_CH7_SR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1 *)0xF01E8B8Cu)

/** \\brief  E8B9C, ATOM channel 0 status register */
#define GTM_ATOM1_CH7_STAT             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT *)0xF01E8B9Cu)

/** \\brief  E904C, ATOM AGC action time base register */
#define GTM_ATOM2_AGC_ACT_TB           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_ACT_TB *)0xF01E904Cu)

/** \\brief  E9044, ATOM AGC enable/disable control register */
#define GTM_ATOM2_AGC_ENDIS_CTRL       /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_ENDIS_CTRL *)0xF01E9044u)

/** \\brief  E9048, ATOM AGC enable/disable status register */
#define GTM_ATOM2_AGC_ENDIS_STAT       /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_ENDIS_STAT *)0xF01E9048u)

/** \\brief  E9058, ATOM AGC force update control register */
#define GTM_ATOM2_AGC_FUPD_CTRL        /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_FUPD_CTRL *)0xF01E9058u)

/** \\brief  E9040, ATOM AGC global control register */
#define GTM_ATOM2_AGC_GLB_CTRL         /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_GLB_CTRL *)0xF01E9040u)

/** \\brief  E905C, ATOM AGC internal trigger control register */
#define GTM_ATOM2_AGC_INT_TRIG         /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_INT_TRIG *)0xF01E905Cu)

/** \\brief  E9050, ATOM AGC output enable control register */
#define GTM_ATOM2_AGC_OUTEN_CTRL       /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_OUTEN_CTRL *)0xF01E9050u)

/** \\brief  E9054, ATOM AGC output enable status register */
#define GTM_ATOM2_AGC_OUTEN_STAT       /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_OUTEN_STAT *)0xF01E9054u)

/** \\brief  E9010, ATOM channel 0 CCU0 compare register */
#define GTM_ATOM2_CH0_CM0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0 *)0xF01E9010u)

/** \\brief  E9014, ATOM channel 0 CCU1 compare register */
#define GTM_ATOM2_CH0_CM1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1 *)0xF01E9014u)

/** \\brief  E9018, ATOM channel 0 CCU0 counter register */
#define GTM_ATOM2_CH0_CN0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0 *)0xF01E9018u)

/** \\brief  E9024, ATOM channel 0 interrupt enable register */
#define GTM_ATOM2_CH0_IRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN *)0xF01E9024u)

/** \\brief  E9028, ATOM channel 0 software interrupt generation */
#define GTM_ATOM2_CH0_IRQ_FORCINT      /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT *)0xF01E9028u)

/** \\brief  E902C, ATOM channel 0 interrupt mode configuration register */
#define GTM_ATOM2_CH0_IRQ_MODE         /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE *)0xF01E902Cu)

/** \\brief  E9020, ATOM channel 0 interrupt notification register */
#define GTM_ATOM2_CH0_IRQ_NOTIFY       /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY *)0xF01E9020u)

/** \\brief  E9000, ATOM channel 0 ARU read address register */
#define GTM_ATOM2_CH0_RDADDR           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR *)0xF01E9000u)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM2_CH0_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL *)0xF01E9004u)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM2_CH0_SOMI             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI *)0xF01E9004u)

/** Alias (User Manual Name) for GTM_ATOM2_CH0_SOMI.
 * To use register names with standard convension, please use GTM_ATOM2_CH0_SOMI.
 */
#define GTM_ATOM2_CH0_CTRL_SOMI        (GTM_ATOM2_CH0_SOMI)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM2_CH0_SOMC             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC *)0xF01E9004u)

/** Alias (User Manual Name) for GTM_ATOM2_CH0_SOMC.
 * To use register names with standard convension, please use GTM_ATOM2_CH0_SOMC.
 */
#define GTM_ATOM2_CH0_CTRL_SOMC        (GTM_ATOM2_CH0_SOMC)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM2_CH0_SOMP             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP *)0xF01E9004u)

/** Alias (User Manual Name) for GTM_ATOM2_CH0_SOMP.
 * To use register names with standard convension, please use GTM_ATOM2_CH0_SOMP.
 */
#define GTM_ATOM2_CH0_CTRL_SOMP        (GTM_ATOM2_CH0_SOMP)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM2_CH0_SOMS             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS *)0xF01E9004u)

/** Alias (User Manual Name) for GTM_ATOM2_CH0_SOMS.
 * To use register names with standard convension, please use GTM_ATOM2_CH0_SOMS.
 */
#define GTM_ATOM2_CH0_CTRL_SOMS        (GTM_ATOM2_CH0_SOMS)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM2_CH0_SOMB             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB *)0xF01E9004u)

/** Alias (User Manual Name) for GTM_ATOM2_CH0_SOMB.
 * To use register names with standard convension, please use GTM_ATOM2_CH0_SOMB.
 */
#define GTM_ATOM2_CH0_CTRL_SOMB        (GTM_ATOM2_CH0_SOMB)

/** \\brief  E9008, ATOM channel 0 CCU0 compare shadow register */
#define GTM_ATOM2_CH0_SR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0 *)0xF01E9008u)

