Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  E900C, ATOM channel 0 CCU1 compare shadow register */
#define GTM_ATOM2_CH0_SR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1 *)0xF01E900Cu)

/** \\brief  E901C, ATOM channel 0 status register */
#define GTM_ATOM2_CH0_STAT             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT *)0xF01E901Cu)

/** \\brief  E9090, ATOM channel 0 CCU0 compare register */
#define GTM_ATOM2_CH1_CM0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0 *)0xF01E9090u)

/** \\brief  E9094, ATOM channel 0 CCU1 compare register */
#define GTM_ATOM2_CH1_CM1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1 *)0xF01E9094u)

/** \\brief  E9098, ATOM channel 0 CCU0 counter register */
#define GTM_ATOM2_CH1_CN0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0 *)0xF01E9098u)

/** \\brief  E90A4, ATOM channel 0 interrupt enable register */
#define GTM_ATOM2_CH1_IRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN *)0xF01E90A4u)

/** \\brief  E90A8, ATOM channel 0 software interrupt generation */
#define GTM_ATOM2_CH1_IRQ_FORCINT      /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT *)0xF01E90A8u)

/** \\brief  E90AC, ATOM channel 0 interrupt mode configuration register */
#define GTM_ATOM2_CH1_IRQ_MODE         /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE *)0xF01E90ACu)

/** \\brief  E90A0, ATOM channel 0 interrupt notification register */
#define GTM_ATOM2_CH1_IRQ_NOTIFY       /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY *)0xF01E90A0u)

/** \\brief  E9080, ATOM channel 0 ARU read address register */
#define GTM_ATOM2_CH1_RDADDR           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR *)0xF01E9080u)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM2_CH1_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL *)0xF01E9084u)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM2_CH1_SOMI             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI *)0xF01E9084u)

/** Alias (User Manual Name) for GTM_ATOM2_CH1_SOMI.
 * To use register names with standard convension, please use GTM_ATOM2_CH1_SOMI.
 */
#define GTM_ATOM2_CH1_CTRL_SOMI        (GTM_ATOM2_CH1_SOMI)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM2_CH1_SOMC             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC *)0xF01E9084u)

/** Alias (User Manual Name) for GTM_ATOM2_CH1_SOMC.
 * To use register names with standard convension, please use GTM_ATOM2_CH1_SOMC.
 */
#define GTM_ATOM2_CH1_CTRL_SOMC        (GTM_ATOM2_CH1_SOMC)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM2_CH1_SOMP             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP *)0xF01E9084u)

/** Alias (User Manual Name) for GTM_ATOM2_CH1_SOMP.
 * To use register names with standard convension, please use GTM_ATOM2_CH1_SOMP.
 */
#define GTM_ATOM2_CH1_CTRL_SOMP        (GTM_ATOM2_CH1_SOMP)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM2_CH1_SOMS             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS *)0xF01E9084u)

/** Alias (User Manual Name) for GTM_ATOM2_CH1_SOMS.
 * To use register names with standard convension, please use GTM_ATOM2_CH1_SOMS.
 */
#define GTM_ATOM2_CH1_CTRL_SOMS        (GTM_ATOM2_CH1_SOMS)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM2_CH1_SOMB             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB *)0xF01E9084u)

/** Alias (User Manual Name) for GTM_ATOM2_CH1_SOMB.
 * To use register names with standard convension, please use GTM_ATOM2_CH1_SOMB.
 */
#define GTM_ATOM2_CH1_CTRL_SOMB        (GTM_ATOM2_CH1_SOMB)

/** \\brief  E9088, ATOM channel 0 CCU0 compare shadow register */
#define GTM_ATOM2_CH1_SR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0 *)0xF01E9088u)

/** \\brief  E908C, ATOM channel 0 CCU1 compare shadow register */
#define GTM_ATOM2_CH1_SR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1 *)0xF01E908Cu)

/** \\brief  E909C, ATOM channel 0 status register */
#define GTM_ATOM2_CH1_STAT             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT *)0xF01E909Cu)

/** \\brief  E9110, ATOM channel 0 CCU0 compare register */
#define GTM_ATOM2_CH2_CM0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0 *)0xF01E9110u)

/** \\brief  E9114, ATOM channel 0 CCU1 compare register */
#define GTM_ATOM2_CH2_CM1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1 *)0xF01E9114u)

/** \\brief  E9118, ATOM channel 0 CCU0 counter register */
#define GTM_ATOM2_CH2_CN0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0 *)0xF01E9118u)

/** \\brief  E9124, ATOM channel 0 interrupt enable register */
#define GTM_ATOM2_CH2_IRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN *)0xF01E9124u)

/** \\brief  E9128, ATOM channel 0 software interrupt generation */
#define GTM_ATOM2_CH2_IRQ_FORCINT      /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT *)0xF01E9128u)

/** \\brief  E912C, ATOM channel 0 interrupt mode configuration register */
#define GTM_ATOM2_CH2_IRQ_MODE         /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE *)0xF01E912Cu)

/** \\brief  E9120, ATOM channel 0 interrupt notification register */
#define GTM_ATOM2_CH2_IRQ_NOTIFY       /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY *)0xF01E9120u)

/** \\brief  E9100, ATOM channel 0 ARU read address register */
#define GTM_ATOM2_CH2_RDADDR           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR *)0xF01E9100u)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM2_CH2_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL *)0xF01E9104u)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM2_CH2_SOMI             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI *)0xF01E9104u)

/** Alias (User Manual Name) for GTM_ATOM2_CH2_SOMI.
 * To use register names with standard convension, please use GTM_ATOM2_CH2_SOMI.
 */
#define GTM_ATOM2_CH2_CTRL_SOMI        (GTM_ATOM2_CH2_SOMI)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM2_CH2_SOMC             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC *)0xF01E9104u)

/** Alias (User Manual Name) for GTM_ATOM2_CH2_SOMC.
 * To use register names with standard convension, please use GTM_ATOM2_CH2_SOMC.
 */
#define GTM_ATOM2_CH2_CTRL_SOMC        (GTM_ATOM2_CH2_SOMC)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM2_CH2_SOMP             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP *)0xF01E9104u)

/** Alias (User Manual Name) for GTM_ATOM2_CH2_SOMP.
 * To use register names with standard convension, please use GTM_ATOM2_CH2_SOMP.
 */
#define GTM_ATOM2_CH2_CTRL_SOMP        (GTM_ATOM2_CH2_SOMP)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM2_CH2_SOMS             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS *)0xF01E9104u)

/** Alias (User Manual Name) for GTM_ATOM2_CH2_SOMS.
 * To use register names with standard convension, please use GTM_ATOM2_CH2_SOMS.
 */
#define GTM_ATOM2_CH2_CTRL_SOMS        (GTM_ATOM2_CH2_SOMS)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM2_CH2_SOMB             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB *)0xF01E9104u)

/** Alias (User Manual Name) for GTM_ATOM2_CH2_SOMB.
 * To use register names with standard convension, please use GTM_ATOM2_CH2_SOMB.
 */
#define GTM_ATOM2_CH2_CTRL_SOMB        (GTM_ATOM2_CH2_SOMB)

/** \\brief  E9108, ATOM channel 0 CCU0 compare shadow register */
#define GTM_ATOM2_CH2_SR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0 *)0xF01E9108u)

/** \\brief  E910C, ATOM channel 0 CCU1 compare shadow register */
#define GTM_ATOM2_CH2_SR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1 *)0xF01E910Cu)

/** \\brief  E911C, ATOM channel 0 status register */
#define GTM_ATOM2_CH2_STAT             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT *)0xF01E911Cu)

