Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  E9190, ATOM channel 0 CCU0 compare register */
#define GTM_ATOM2_CH3_CM0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0 *)0xF01E9190u)

/** \\brief  E9194, ATOM channel 0 CCU1 compare register */
#define GTM_ATOM2_CH3_CM1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1 *)0xF01E9194u)

/** \\brief  E9198, ATOM channel 0 CCU0 counter register */
#define GTM_ATOM2_CH3_CN0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0 *)0xF01E9198u)

/** \\brief  E91A4, ATOM channel 0 interrupt enable register */
#define GTM_ATOM2_CH3_IRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN *)0xF01E91A4u)

/** \\brief  E91A8, ATOM channel 0 software interrupt generation */
#define GTM_ATOM2_CH3_IRQ_FORCINT      /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT *)0xF01E91A8u)

/** \\brief  E91AC, ATOM channel 0 interrupt mode configuration register */
#define GTM_ATOM2_CH3_IRQ_MODE         /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE *)0xF01E91ACu)

/** \\brief  E91A0, ATOM channel 0 interrupt notification register */
#define GTM_ATOM2_CH3_IRQ_NOTIFY       /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY *)0xF01E91A0u)

/** \\brief  E9180, ATOM channel 0 ARU read address register */
#define GTM_ATOM2_CH3_RDADDR           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR *)0xF01E9180u)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM2_CH3_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL *)0xF01E9184u)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM2_CH3_SOMI             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI *)0xF01E9184u)

/** Alias (User Manual Name) for GTM_ATOM2_CH3_SOMI.
 * To use register names with standard convension, please use GTM_ATOM2_CH3_SOMI.
 */
#define GTM_ATOM2_CH3_CTRL_SOMI        (GTM_ATOM2_CH3_SOMI)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM2_CH3_SOMC             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC *)0xF01E9184u)

/** Alias (User Manual Name) for GTM_ATOM2_CH3_SOMC.
 * To use register names with standard convension, please use GTM_ATOM2_CH3_SOMC.
 */
#define GTM_ATOM2_CH3_CTRL_SOMC        (GTM_ATOM2_CH3_SOMC)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM2_CH3_SOMP             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP *)0xF01E9184u)

/** Alias (User Manual Name) for GTM_ATOM2_CH3_SOMP.
 * To use register names with standard convension, please use GTM_ATOM2_CH3_SOMP.
 */
#define GTM_ATOM2_CH3_CTRL_SOMP        (GTM_ATOM2_CH3_SOMP)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM2_CH3_SOMS             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS *)0xF01E9184u)

/** Alias (User Manual Name) for GTM_ATOM2_CH3_SOMS.
 * To use register names with standard convension, please use GTM_ATOM2_CH3_SOMS.
 */
#define GTM_ATOM2_CH3_CTRL_SOMS        (GTM_ATOM2_CH3_SOMS)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM2_CH3_SOMB             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB *)0xF01E9184u)

/** Alias (User Manual Name) for GTM_ATOM2_CH3_SOMB.
 * To use register names with standard convension, please use GTM_ATOM2_CH3_SOMB.
 */
#define GTM_ATOM2_CH3_CTRL_SOMB        (GTM_ATOM2_CH3_SOMB)

/** \\brief  E9188, ATOM channel 0 CCU0 compare shadow register */
#define GTM_ATOM2_CH3_SR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0 *)0xF01E9188u)

/** \\brief  E918C, ATOM channel 0 CCU1 compare shadow register */
#define GTM_ATOM2_CH3_SR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1 *)0xF01E918Cu)

/** \\brief  E919C, ATOM channel 0 status register */
#define GTM_ATOM2_CH3_STAT             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT *)0xF01E919Cu)

/** \\brief  E9210, ATOM channel 0 CCU0 compare register */
#define GTM_ATOM2_CH4_CM0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0 *)0xF01E9210u)

/** \\brief  E9214, ATOM channel 0 CCU1 compare register */
#define GTM_ATOM2_CH4_CM1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1 *)0xF01E9214u)

/** \\brief  E9218, ATOM channel 0 CCU0 counter register */
#define GTM_ATOM2_CH4_CN0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0 *)0xF01E9218u)

/** \\brief  E9224, ATOM channel 0 interrupt enable register */
#define GTM_ATOM2_CH4_IRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN *)0xF01E9224u)

/** \\brief  E9228, ATOM channel 0 software interrupt generation */
#define GTM_ATOM2_CH4_IRQ_FORCINT      /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT *)0xF01E9228u)

/** \\brief  E922C, ATOM channel 0 interrupt mode configuration register */
#define GTM_ATOM2_CH4_IRQ_MODE         /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE *)0xF01E922Cu)

/** \\brief  E9220, ATOM channel 0 interrupt notification register */
#define GTM_ATOM2_CH4_IRQ_NOTIFY       /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY *)0xF01E9220u)

/** \\brief  E9200, ATOM channel 0 ARU read address register */
#define GTM_ATOM2_CH4_RDADDR           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR *)0xF01E9200u)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM2_CH4_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL *)0xF01E9204u)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM2_CH4_SOMI             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI *)0xF01E9204u)

/** Alias (User Manual Name) for GTM_ATOM2_CH4_SOMI.
 * To use register names with standard convension, please use GTM_ATOM2_CH4_SOMI.
 */
#define GTM_ATOM2_CH4_CTRL_SOMI        (GTM_ATOM2_CH4_SOMI)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM2_CH4_SOMC             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC *)0xF01E9204u)

/** Alias (User Manual Name) for GTM_ATOM2_CH4_SOMC.
 * To use register names with standard convension, please use GTM_ATOM2_CH4_SOMC.
 */
#define GTM_ATOM2_CH4_CTRL_SOMC        (GTM_ATOM2_CH4_SOMC)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM2_CH4_SOMP             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP *)0xF01E9204u)

/** Alias (User Manual Name) for GTM_ATOM2_CH4_SOMP.
 * To use register names with standard convension, please use GTM_ATOM2_CH4_SOMP.
 */
#define GTM_ATOM2_CH4_CTRL_SOMP        (GTM_ATOM2_CH4_SOMP)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM2_CH4_SOMS             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS *)0xF01E9204u)

