Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** Alias (User Manual Name) for GTM_ATOM2_CH4_SOMS.
 * To use register names with standard convension, please use GTM_ATOM2_CH4_SOMS.
 */
#define GTM_ATOM2_CH4_CTRL_SOMS        (GTM_ATOM2_CH4_SOMS)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM2_CH4_SOMB             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB *)0xF01E9204u)

/** Alias (User Manual Name) for GTM_ATOM2_CH4_SOMB.
 * To use register names with standard convension, please use GTM_ATOM2_CH4_SOMB.
 */
#define GTM_ATOM2_CH4_CTRL_SOMB        (GTM_ATOM2_CH4_SOMB)

/** \\brief  E9208, ATOM channel 0 CCU0 compare shadow register */
#define GTM_ATOM2_CH4_SR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0 *)0xF01E9208u)

/** \\brief  E920C, ATOM channel 0 CCU1 compare shadow register */
#define GTM_ATOM2_CH4_SR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1 *)0xF01E920Cu)

/** \\brief  E921C, ATOM channel 0 status register */
#define GTM_ATOM2_CH4_STAT             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT *)0xF01E921Cu)

/** \\brief  E9290, ATOM channel 0 CCU0 compare register */
#define GTM_ATOM2_CH5_CM0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0 *)0xF01E9290u)

/** \\brief  E9294, ATOM channel 0 CCU1 compare register */
#define GTM_ATOM2_CH5_CM1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1 *)0xF01E9294u)

/** \\brief  E9298, ATOM channel 0 CCU0 counter register */
#define GTM_ATOM2_CH5_CN0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0 *)0xF01E9298u)

/** \\brief  E92A4, ATOM channel 0 interrupt enable register */
#define GTM_ATOM2_CH5_IRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN *)0xF01E92A4u)

/** \\brief  E92A8, ATOM channel 0 software interrupt generation */
#define GTM_ATOM2_CH5_IRQ_FORCINT      /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT *)0xF01E92A8u)

/** \\brief  E92AC, ATOM channel 0 interrupt mode configuration register */
#define GTM_ATOM2_CH5_IRQ_MODE         /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE *)0xF01E92ACu)

/** \\brief  E92A0, ATOM channel 0 interrupt notification register */
#define GTM_ATOM2_CH5_IRQ_NOTIFY       /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY *)0xF01E92A0u)

/** \\brief  E9280, ATOM channel 0 ARU read address register */
#define GTM_ATOM2_CH5_RDADDR           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR *)0xF01E9280u)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM2_CH5_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL *)0xF01E9284u)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM2_CH5_SOMI             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI *)0xF01E9284u)

/** Alias (User Manual Name) for GTM_ATOM2_CH5_SOMI.
 * To use register names with standard convension, please use GTM_ATOM2_CH5_SOMI.
 */
#define GTM_ATOM2_CH5_CTRL_SOMI        (GTM_ATOM2_CH5_SOMI)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM2_CH5_SOMC             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC *)0xF01E9284u)

/** Alias (User Manual Name) for GTM_ATOM2_CH5_SOMC.
 * To use register names with standard convension, please use GTM_ATOM2_CH5_SOMC.
 */
#define GTM_ATOM2_CH5_CTRL_SOMC        (GTM_ATOM2_CH5_SOMC)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM2_CH5_SOMP             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP *)0xF01E9284u)

/** Alias (User Manual Name) for GTM_ATOM2_CH5_SOMP.
 * To use register names with standard convension, please use GTM_ATOM2_CH5_SOMP.
 */
#define GTM_ATOM2_CH5_CTRL_SOMP        (GTM_ATOM2_CH5_SOMP)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM2_CH5_SOMS             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS *)0xF01E9284u)

/** Alias (User Manual Name) for GTM_ATOM2_CH5_SOMS.
 * To use register names with standard convension, please use GTM_ATOM2_CH5_SOMS.
 */
#define GTM_ATOM2_CH5_CTRL_SOMS        (GTM_ATOM2_CH5_SOMS)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM2_CH5_SOMB             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB *)0xF01E9284u)

/** Alias (User Manual Name) for GTM_ATOM2_CH5_SOMB.
 * To use register names with standard convension, please use GTM_ATOM2_CH5_SOMB.
 */
#define GTM_ATOM2_CH5_CTRL_SOMB        (GTM_ATOM2_CH5_SOMB)

/** \\brief  E9288, ATOM channel 0 CCU0 compare shadow register */
#define GTM_ATOM2_CH5_SR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0 *)0xF01E9288u)

/** \\brief  E928C, ATOM channel 0 CCU1 compare shadow register */
#define GTM_ATOM2_CH5_SR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1 *)0xF01E928Cu)

/** \\brief  E929C, ATOM channel 0 status register */
#define GTM_ATOM2_CH5_STAT             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT *)0xF01E929Cu)

/** \\brief  E9310, ATOM channel 0 CCU0 compare register */
#define GTM_ATOM2_CH6_CM0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0 *)0xF01E9310u)

/** \\brief  E9314, ATOM channel 0 CCU1 compare register */
#define GTM_ATOM2_CH6_CM1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1 *)0xF01E9314u)

/** \\brief  E9318, ATOM channel 0 CCU0 counter register */
#define GTM_ATOM2_CH6_CN0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0 *)0xF01E9318u)

/** \\brief  E9324, ATOM channel 0 interrupt enable register */
#define GTM_ATOM2_CH6_IRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN *)0xF01E9324u)

/** \\brief  E9328, ATOM channel 0 software interrupt generation */
#define GTM_ATOM2_CH6_IRQ_FORCINT      /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT *)0xF01E9328u)

/** \\brief  E932C, ATOM channel 0 interrupt mode configuration register */
#define GTM_ATOM2_CH6_IRQ_MODE         /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE *)0xF01E932Cu)

