Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  E9320, ATOM channel 0 interrupt notification register */
#define GTM_ATOM2_CH6_IRQ_NOTIFY       /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY *)0xF01E9320u)

/** \\brief  E9300, ATOM channel 0 ARU read address register */
#define GTM_ATOM2_CH6_RDADDR           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR *)0xF01E9300u)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM2_CH6_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL *)0xF01E9304u)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM2_CH6_SOMI             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI *)0xF01E9304u)

/** Alias (User Manual Name) for GTM_ATOM2_CH6_SOMI.
 * To use register names with standard convension, please use GTM_ATOM2_CH6_SOMI.
 */
#define GTM_ATOM2_CH6_CTRL_SOMI        (GTM_ATOM2_CH6_SOMI)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM2_CH6_SOMC             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC *)0xF01E9304u)

/** Alias (User Manual Name) for GTM_ATOM2_CH6_SOMC.
 * To use register names with standard convension, please use GTM_ATOM2_CH6_SOMC.
 */
#define GTM_ATOM2_CH6_CTRL_SOMC        (GTM_ATOM2_CH6_SOMC)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM2_CH6_SOMP             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP *)0xF01E9304u)

/** Alias (User Manual Name) for GTM_ATOM2_CH6_SOMP.
 * To use register names with standard convension, please use GTM_ATOM2_CH6_SOMP.
 */
#define GTM_ATOM2_CH6_CTRL_SOMP        (GTM_ATOM2_CH6_SOMP)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM2_CH6_SOMS             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS *)0xF01E9304u)

/** Alias (User Manual Name) for GTM_ATOM2_CH6_SOMS.
 * To use register names with standard convension, please use GTM_ATOM2_CH6_SOMS.
 */
#define GTM_ATOM2_CH6_CTRL_SOMS        (GTM_ATOM2_CH6_SOMS)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM2_CH6_SOMB             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB *)0xF01E9304u)

/** Alias (User Manual Name) for GTM_ATOM2_CH6_SOMB.
 * To use register names with standard convension, please use GTM_ATOM2_CH6_SOMB.
 */
#define GTM_ATOM2_CH6_CTRL_SOMB        (GTM_ATOM2_CH6_SOMB)

/** \\brief  E9308, ATOM channel 0 CCU0 compare shadow register */
#define GTM_ATOM2_CH6_SR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0 *)0xF01E9308u)

/** \\brief  E930C, ATOM channel 0 CCU1 compare shadow register */
#define GTM_ATOM2_CH6_SR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1 *)0xF01E930Cu)

/** \\brief  E931C, ATOM channel 0 status register */
#define GTM_ATOM2_CH6_STAT             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT *)0xF01E931Cu)

/** \\brief  E9390, ATOM channel 0 CCU0 compare register */
#define GTM_ATOM2_CH7_CM0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0 *)0xF01E9390u)

/** \\brief  E9394, ATOM channel 0 CCU1 compare register */
#define GTM_ATOM2_CH7_CM1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1 *)0xF01E9394u)

/** \\brief  E9398, ATOM channel 0 CCU0 counter register */
#define GTM_ATOM2_CH7_CN0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0 *)0xF01E9398u)

/** \\brief  E93A4, ATOM channel 0 interrupt enable register */
#define GTM_ATOM2_CH7_IRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN *)0xF01E93A4u)

/** \\brief  E93A8, ATOM channel 0 software interrupt generation */
#define GTM_ATOM2_CH7_IRQ_FORCINT      /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT *)0xF01E93A8u)

/** \\brief  E93AC, ATOM channel 0 interrupt mode configuration register */
#define GTM_ATOM2_CH7_IRQ_MODE         /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE *)0xF01E93ACu)

/** \\brief  E93A0, ATOM channel 0 interrupt notification register */
#define GTM_ATOM2_CH7_IRQ_NOTIFY       /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY *)0xF01E93A0u)

/** \\brief  E9380, ATOM channel 0 ARU read address register */
#define GTM_ATOM2_CH7_RDADDR           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR *)0xF01E9380u)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM2_CH7_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL *)0xF01E9384u)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM2_CH7_SOMI             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI *)0xF01E9384u)

/** Alias (User Manual Name) for GTM_ATOM2_CH7_SOMI.
 * To use register names with standard convension, please use GTM_ATOM2_CH7_SOMI.
 */
#define GTM_ATOM2_CH7_CTRL_SOMI        (GTM_ATOM2_CH7_SOMI)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM2_CH7_SOMC             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC *)0xF01E9384u)

/** Alias (User Manual Name) for GTM_ATOM2_CH7_SOMC.
 * To use register names with standard convension, please use GTM_ATOM2_CH7_SOMC.
 */
#define GTM_ATOM2_CH7_CTRL_SOMC        (GTM_ATOM2_CH7_SOMC)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM2_CH7_SOMP             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP *)0xF01E9384u)

/** Alias (User Manual Name) for GTM_ATOM2_CH7_SOMP.
 * To use register names with standard convension, please use GTM_ATOM2_CH7_SOMP.
 */
#define GTM_ATOM2_CH7_CTRL_SOMP        (GTM_ATOM2_CH7_SOMP)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM2_CH7_SOMS             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS *)0xF01E9384u)

/** Alias (User Manual Name) for GTM_ATOM2_CH7_SOMS.
 * To use register names with standard convension, please use GTM_ATOM2_CH7_SOMS.
 */
#define GTM_ATOM2_CH7_CTRL_SOMS        (GTM_ATOM2_CH7_SOMS)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM2_CH7_SOMB             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB *)0xF01E9384u)

/** Alias (User Manual Name) for GTM_ATOM2_CH7_SOMB.
 * To use register names with standard convension, please use GTM_ATOM2_CH7_SOMB.
 */
#define GTM_ATOM2_CH7_CTRL_SOMB        (GTM_ATOM2_CH7_SOMB)

