Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  E9388, ATOM channel 0 CCU0 compare shadow register */
#define GTM_ATOM2_CH7_SR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0 *)0xF01E9388u)

/** \\brief  E938C, ATOM channel 0 CCU1 compare shadow register */
#define GTM_ATOM2_CH7_SR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1 *)0xF01E938Cu)

/** \\brief  E939C, ATOM channel 0 status register */
#define GTM_ATOM2_CH7_STAT             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT *)0xF01E939Cu)

/** \\brief  E984C, ATOM AGC action time base register */
#define GTM_ATOM3_AGC_ACT_TB           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_ACT_TB *)0xF01E984Cu)

/** \\brief  E9844, ATOM AGC enable/disable control register */
#define GTM_ATOM3_AGC_ENDIS_CTRL       /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_ENDIS_CTRL *)0xF01E9844u)

/** \\brief  E9848, ATOM AGC enable/disable status register */
#define GTM_ATOM3_AGC_ENDIS_STAT       /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_ENDIS_STAT *)0xF01E9848u)

/** \\brief  E9858, ATOM AGC force update control register */
#define GTM_ATOM3_AGC_FUPD_CTRL        /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_FUPD_CTRL *)0xF01E9858u)

/** \\brief  E9840, ATOM AGC global control register */
#define GTM_ATOM3_AGC_GLB_CTRL         /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_GLB_CTRL *)0xF01E9840u)

/** \\brief  E985C, ATOM AGC internal trigger control register */
#define GTM_ATOM3_AGC_INT_TRIG         /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_INT_TRIG *)0xF01E985Cu)

/** \\brief  E9850, ATOM AGC output enable control register */
#define GTM_ATOM3_AGC_OUTEN_CTRL       /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_OUTEN_CTRL *)0xF01E9850u)

/** \\brief  E9854, ATOM AGC output enable status register */
#define GTM_ATOM3_AGC_OUTEN_STAT       /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_OUTEN_STAT *)0xF01E9854u)

/** \\brief  E9810, ATOM channel 0 CCU0 compare register */
#define GTM_ATOM3_CH0_CM0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0 *)0xF01E9810u)

/** \\brief  E9814, ATOM channel 0 CCU1 compare register */
#define GTM_ATOM3_CH0_CM1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1 *)0xF01E9814u)

/** \\brief  E9818, ATOM channel 0 CCU0 counter register */
#define GTM_ATOM3_CH0_CN0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0 *)0xF01E9818u)

/** \\brief  E9824, ATOM channel 0 interrupt enable register */
#define GTM_ATOM3_CH0_IRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN *)0xF01E9824u)

/** \\brief  E9828, ATOM channel 0 software interrupt generation */
#define GTM_ATOM3_CH0_IRQ_FORCINT      /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT *)0xF01E9828u)

/** \\brief  E982C, ATOM channel 0 interrupt mode configuration register */
#define GTM_ATOM3_CH0_IRQ_MODE         /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE *)0xF01E982Cu)

/** \\brief  E9820, ATOM channel 0 interrupt notification register */
#define GTM_ATOM3_CH0_IRQ_NOTIFY       /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY *)0xF01E9820u)

/** \\brief  E9800, ATOM channel 0 ARU read address register */
#define GTM_ATOM3_CH0_RDADDR           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR *)0xF01E9800u)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM3_CH0_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL *)0xF01E9804u)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM3_CH0_SOMI             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI *)0xF01E9804u)

/** Alias (User Manual Name) for GTM_ATOM3_CH0_SOMI.
 * To use register names with standard convension, please use GTM_ATOM3_CH0_SOMI.
 */
#define GTM_ATOM3_CH0_CTRL_SOMI        (GTM_ATOM3_CH0_SOMI)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM3_CH0_SOMC             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC *)0xF01E9804u)

/** Alias (User Manual Name) for GTM_ATOM3_CH0_SOMC.
 * To use register names with standard convension, please use GTM_ATOM3_CH0_SOMC.
 */
#define GTM_ATOM3_CH0_CTRL_SOMC        (GTM_ATOM3_CH0_SOMC)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM3_CH0_SOMP             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP *)0xF01E9804u)

/** Alias (User Manual Name) for GTM_ATOM3_CH0_SOMP.
 * To use register names with standard convension, please use GTM_ATOM3_CH0_SOMP.
 */
#define GTM_ATOM3_CH0_CTRL_SOMP        (GTM_ATOM3_CH0_SOMP)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM3_CH0_SOMS             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS *)0xF01E9804u)

/** Alias (User Manual Name) for GTM_ATOM3_CH0_SOMS.
 * To use register names with standard convension, please use GTM_ATOM3_CH0_SOMS.
 */
#define GTM_ATOM3_CH0_CTRL_SOMS        (GTM_ATOM3_CH0_SOMS)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM3_CH0_SOMB             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB *)0xF01E9804u)

/** Alias (User Manual Name) for GTM_ATOM3_CH0_SOMB.
 * To use register names with standard convension, please use GTM_ATOM3_CH0_SOMB.
 */
#define GTM_ATOM3_CH0_CTRL_SOMB        (GTM_ATOM3_CH0_SOMB)

/** \\brief  E9808, ATOM channel 0 CCU0 compare shadow register */
#define GTM_ATOM3_CH0_SR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0 *)0xF01E9808u)

/** \\brief  E980C, ATOM channel 0 CCU1 compare shadow register */
#define GTM_ATOM3_CH0_SR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1 *)0xF01E980Cu)

/** \\brief  E981C, ATOM channel 0 status register */
#define GTM_ATOM3_CH0_STAT             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT *)0xF01E981Cu)

/** \\brief  E9890, ATOM channel 0 CCU0 compare register */
#define GTM_ATOM3_CH1_CM0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0 *)0xF01E9890u)

/** \\brief  E9894, ATOM channel 0 CCU1 compare register */
#define GTM_ATOM3_CH1_CM1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1 *)0xF01E9894u)

