Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  E9908, ATOM channel 0 CCU0 compare shadow register */
#define GTM_ATOM3_CH2_SR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0 *)0xF01E9908u)

/** \\brief  E990C, ATOM channel 0 CCU1 compare shadow register */
#define GTM_ATOM3_CH2_SR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1 *)0xF01E990Cu)

/** \\brief  E991C, ATOM channel 0 status register */
#define GTM_ATOM3_CH2_STAT             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT *)0xF01E991Cu)

/** \\brief  E9990, ATOM channel 0 CCU0 compare register */
#define GTM_ATOM3_CH3_CM0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0 *)0xF01E9990u)

/** \\brief  E9994, ATOM channel 0 CCU1 compare register */
#define GTM_ATOM3_CH3_CM1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1 *)0xF01E9994u)

/** \\brief  E9998, ATOM channel 0 CCU0 counter register */
#define GTM_ATOM3_CH3_CN0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0 *)0xF01E9998u)

/** \\brief  E99A4, ATOM channel 0 interrupt enable register */
#define GTM_ATOM3_CH3_IRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN *)0xF01E99A4u)

/** \\brief  E99A8, ATOM channel 0 software interrupt generation */
#define GTM_ATOM3_CH3_IRQ_FORCINT      /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT *)0xF01E99A8u)

/** \\brief  E99AC, ATOM channel 0 interrupt mode configuration register */
#define GTM_ATOM3_CH3_IRQ_MODE         /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE *)0xF01E99ACu)

/** \\brief  E99A0, ATOM channel 0 interrupt notification register */
#define GTM_ATOM3_CH3_IRQ_NOTIFY       /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY *)0xF01E99A0u)

/** \\brief  E9980, ATOM channel 0 ARU read address register */
#define GTM_ATOM3_CH3_RDADDR           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR *)0xF01E9980u)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM3_CH3_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL *)0xF01E9984u)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM3_CH3_SOMI             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI *)0xF01E9984u)

/** Alias (User Manual Name) for GTM_ATOM3_CH3_SOMI.
 * To use register names with standard convension, please use GTM_ATOM3_CH3_SOMI.
 */
#define GTM_ATOM3_CH3_CTRL_SOMI        (GTM_ATOM3_CH3_SOMI)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM3_CH3_SOMC             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC *)0xF01E9984u)

/** Alias (User Manual Name) for GTM_ATOM3_CH3_SOMC.
 * To use register names with standard convension, please use GTM_ATOM3_CH3_SOMC.
 */
#define GTM_ATOM3_CH3_CTRL_SOMC        (GTM_ATOM3_CH3_SOMC)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM3_CH3_SOMP             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP *)0xF01E9984u)

/** Alias (User Manual Name) for GTM_ATOM3_CH3_SOMP.
 * To use register names with standard convension, please use GTM_ATOM3_CH3_SOMP.
 */
#define GTM_ATOM3_CH3_CTRL_SOMP        (GTM_ATOM3_CH3_SOMP)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM3_CH3_SOMS             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS *)0xF01E9984u)

/** Alias (User Manual Name) for GTM_ATOM3_CH3_SOMS.
 * To use register names with standard convension, please use GTM_ATOM3_CH3_SOMS.
 */
#define GTM_ATOM3_CH3_CTRL_SOMS        (GTM_ATOM3_CH3_SOMS)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM3_CH3_SOMB             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB *)0xF01E9984u)

/** Alias (User Manual Name) for GTM_ATOM3_CH3_SOMB.
 * To use register names with standard convension, please use GTM_ATOM3_CH3_SOMB.
 */
#define GTM_ATOM3_CH3_CTRL_SOMB        (GTM_ATOM3_CH3_SOMB)

/** \\brief  E9988, ATOM channel 0 CCU0 compare shadow register */
#define GTM_ATOM3_CH3_SR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0 *)0xF01E9988u)

/** \\brief  E998C, ATOM channel 0 CCU1 compare shadow register */
#define GTM_ATOM3_CH3_SR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1 *)0xF01E998Cu)

/** \\brief  E999C, ATOM channel 0 status register */
#define GTM_ATOM3_CH3_STAT             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT *)0xF01E999Cu)

/** \\brief  E9A10, ATOM channel 0 CCU0 compare register */
#define GTM_ATOM3_CH4_CM0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0 *)0xF01E9A10u)

/** \\brief  E9A14, ATOM channel 0 CCU1 compare register */
#define GTM_ATOM3_CH4_CM1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1 *)0xF01E9A14u)

/** \\brief  E9A18, ATOM channel 0 CCU0 counter register */
#define GTM_ATOM3_CH4_CN0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0 *)0xF01E9A18u)

/** \\brief  E9A24, ATOM channel 0 interrupt enable register */
#define GTM_ATOM3_CH4_IRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN *)0xF01E9A24u)

/** \\brief  E9A28, ATOM channel 0 software interrupt generation */
#define GTM_ATOM3_CH4_IRQ_FORCINT      /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT *)0xF01E9A28u)

/** \\brief  E9A2C, ATOM channel 0 interrupt mode configuration register */
#define GTM_ATOM3_CH4_IRQ_MODE         /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE *)0xF01E9A2Cu)

/** \\brief  E9A20, ATOM channel 0 interrupt notification register */
#define GTM_ATOM3_CH4_IRQ_NOTIFY       /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY *)0xF01E9A20u)

/** \\brief  E9A00, ATOM channel 0 ARU read address register */
#define GTM_ATOM3_CH4_RDADDR           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR *)0xF01E9A00u)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM3_CH4_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL *)0xF01E9A04u)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM3_CH4_SOMI             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI *)0xF01E9A04u)

/** Alias (User Manual Name) for GTM_ATOM3_CH4_SOMI.
 * To use register names with standard convension, please use GTM_ATOM3_CH4_SOMI.
 */
#define GTM_ATOM3_CH4_CTRL_SOMI        (GTM_ATOM3_CH4_SOMI)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM3_CH4_SOMC             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC *)0xF01E9A04u)

/** Alias (User Manual Name) for GTM_ATOM3_CH4_SOMC.
 * To use register names with standard convension, please use GTM_ATOM3_CH4_SOMC.
 */
#define GTM_ATOM3_CH4_CTRL_SOMC        (GTM_ATOM3_CH4_SOMC)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM3_CH4_SOMP             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP *)0xF01E9A04u)

/** Alias (User Manual Name) for GTM_ATOM3_CH4_SOMP.
 * To use register names with standard convension, please use GTM_ATOM3_CH4_SOMP.
 */
#define GTM_ATOM3_CH4_CTRL_SOMP        (GTM_ATOM3_CH4_SOMP)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM3_CH4_SOMS             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS *)0xF01E9A04u)

