Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** Alias (User Manual Name) for GTM_ATOM3_CH4_SOMS.
 * To use register names with standard convension, please use GTM_ATOM3_CH4_SOMS.
 */
#define GTM_ATOM3_CH4_CTRL_SOMS        (GTM_ATOM3_CH4_SOMS)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM3_CH4_SOMB             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB *)0xF01E9A04u)

/** Alias (User Manual Name) for GTM_ATOM3_CH4_SOMB.
 * To use register names with standard convension, please use GTM_ATOM3_CH4_SOMB.
 */
#define GTM_ATOM3_CH4_CTRL_SOMB        (GTM_ATOM3_CH4_SOMB)

/** \\brief  E9A08, ATOM channel 0 CCU0 compare shadow register */
#define GTM_ATOM3_CH4_SR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0 *)0xF01E9A08u)

/** \\brief  E9A0C, ATOM channel 0 CCU1 compare shadow register */
#define GTM_ATOM3_CH4_SR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1 *)0xF01E9A0Cu)

/** \\brief  E9A1C, ATOM channel 0 status register */
#define GTM_ATOM3_CH4_STAT             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT *)0xF01E9A1Cu)

/** \\brief  E9A90, ATOM channel 0 CCU0 compare register */
#define GTM_ATOM3_CH5_CM0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0 *)0xF01E9A90u)

/** \\brief  E9A94, ATOM channel 0 CCU1 compare register */
#define GTM_ATOM3_CH5_CM1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1 *)0xF01E9A94u)

/** \\brief  E9A98, ATOM channel 0 CCU0 counter register */
#define GTM_ATOM3_CH5_CN0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0 *)0xF01E9A98u)

/** \\brief  E9AA4, ATOM channel 0 interrupt enable register */
#define GTM_ATOM3_CH5_IRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN *)0xF01E9AA4u)

/** \\brief  E9AA8, ATOM channel 0 software interrupt generation */
#define GTM_ATOM3_CH5_IRQ_FORCINT      /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT *)0xF01E9AA8u)

/** \\brief  E9AAC, ATOM channel 0 interrupt mode configuration register */
#define GTM_ATOM3_CH5_IRQ_MODE         /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE *)0xF01E9AACu)

/** \\brief  E9AA0, ATOM channel 0 interrupt notification register */
#define GTM_ATOM3_CH5_IRQ_NOTIFY       /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY *)0xF01E9AA0u)

/** \\brief  E9A80, ATOM channel 0 ARU read address register */
#define GTM_ATOM3_CH5_RDADDR           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR *)0xF01E9A80u)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM3_CH5_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL *)0xF01E9A84u)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM3_CH5_SOMI             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI *)0xF01E9A84u)

/** Alias (User Manual Name) for GTM_ATOM3_CH5_SOMI.
 * To use register names with standard convension, please use GTM_ATOM3_CH5_SOMI.
 */
#define GTM_ATOM3_CH5_CTRL_SOMI        (GTM_ATOM3_CH5_SOMI)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM3_CH5_SOMC             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC *)0xF01E9A84u)

/** Alias (User Manual Name) for GTM_ATOM3_CH5_SOMC.
 * To use register names with standard convension, please use GTM_ATOM3_CH5_SOMC.
 */
#define GTM_ATOM3_CH5_CTRL_SOMC        (GTM_ATOM3_CH5_SOMC)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM3_CH5_SOMP             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP *)0xF01E9A84u)

/** Alias (User Manual Name) for GTM_ATOM3_CH5_SOMP.
 * To use register names with standard convension, please use GTM_ATOM3_CH5_SOMP.
 */
#define GTM_ATOM3_CH5_CTRL_SOMP        (GTM_ATOM3_CH5_SOMP)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM3_CH5_SOMS             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS *)0xF01E9A84u)

/** Alias (User Manual Name) for GTM_ATOM3_CH5_SOMS.
 * To use register names with standard convension, please use GTM_ATOM3_CH5_SOMS.
 */
#define GTM_ATOM3_CH5_CTRL_SOMS        (GTM_ATOM3_CH5_SOMS)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM3_CH5_SOMB             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB *)0xF01E9A84u)

/** Alias (User Manual Name) for GTM_ATOM3_CH5_SOMB.
 * To use register names with standard convension, please use GTM_ATOM3_CH5_SOMB.
 */
#define GTM_ATOM3_CH5_CTRL_SOMB        (GTM_ATOM3_CH5_SOMB)

/** \\brief  E9A88, ATOM channel 0 CCU0 compare shadow register */
#define GTM_ATOM3_CH5_SR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0 *)0xF01E9A88u)

/** \\brief  E9A8C, ATOM channel 0 CCU1 compare shadow register */
#define GTM_ATOM3_CH5_SR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1 *)0xF01E9A8Cu)

/** \\brief  E9A9C, ATOM channel 0 status register */
#define GTM_ATOM3_CH5_STAT             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT *)0xF01E9A9Cu)

/** \\brief  E9B10, ATOM channel 0 CCU0 compare register */
#define GTM_ATOM3_CH6_CM0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0 *)0xF01E9B10u)

/** \\brief  E9B14, ATOM channel 0 CCU1 compare register */
#define GTM_ATOM3_CH6_CM1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1 *)0xF01E9B14u)

/** \\brief  E9B18, ATOM channel 0 CCU0 counter register */
#define GTM_ATOM3_CH6_CN0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0 *)0xF01E9B18u)

/** \\brief  E9B24, ATOM channel 0 interrupt enable register */
#define GTM_ATOM3_CH6_IRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN *)0xF01E9B24u)

/** \\brief  E9B28, ATOM channel 0 software interrupt generation */
#define GTM_ATOM3_CH6_IRQ_FORCINT      /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT *)0xF01E9B28u)

/** \\brief  E9B2C, ATOM channel 0 interrupt mode configuration register */
#define GTM_ATOM3_CH6_IRQ_MODE         /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE *)0xF01E9B2Cu)

/** \\brief  E9B20, ATOM channel 0 interrupt notification register */
#define GTM_ATOM3_CH6_IRQ_NOTIFY       /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY *)0xF01E9B20u)

/** \\brief  E9B00, ATOM channel 0 ARU read address register */
#define GTM_ATOM3_CH6_RDADDR           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR *)0xF01E9B00u)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM3_CH6_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL *)0xF01E9B04u)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM3_CH6_SOMI             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI *)0xF01E9B04u)

/** Alias (User Manual Name) for GTM_ATOM3_CH6_SOMI.
 * To use register names with standard convension, please use GTM_ATOM3_CH6_SOMI.
 */
#define GTM_ATOM3_CH6_CTRL_SOMI        (GTM_ATOM3_CH6_SOMI)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM3_CH6_SOMC             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC *)0xF01E9B04u)

