Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** Alias (User Manual Name) for GTM_ATOM3_CH6_SOMC.
 * To use register names with standard convension, please use GTM_ATOM3_CH6_SOMC.
 */
#define GTM_ATOM3_CH6_CTRL_SOMC        (GTM_ATOM3_CH6_SOMC)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM3_CH6_SOMP             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP *)0xF01E9B04u)

/** Alias (User Manual Name) for GTM_ATOM3_CH6_SOMP.
 * To use register names with standard convension, please use GTM_ATOM3_CH6_SOMP.
 */
#define GTM_ATOM3_CH6_CTRL_SOMP        (GTM_ATOM3_CH6_SOMP)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM3_CH6_SOMS             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS *)0xF01E9B04u)

/** Alias (User Manual Name) for GTM_ATOM3_CH6_SOMS.
 * To use register names with standard convension, please use GTM_ATOM3_CH6_SOMS.
 */
#define GTM_ATOM3_CH6_CTRL_SOMS        (GTM_ATOM3_CH6_SOMS)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM3_CH6_SOMB             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB *)0xF01E9B04u)

/** Alias (User Manual Name) for GTM_ATOM3_CH6_SOMB.
 * To use register names with standard convension, please use GTM_ATOM3_CH6_SOMB.
 */
#define GTM_ATOM3_CH6_CTRL_SOMB        (GTM_ATOM3_CH6_SOMB)

/** \\brief  E9B08, ATOM channel 0 CCU0 compare shadow register */
#define GTM_ATOM3_CH6_SR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0 *)0xF01E9B08u)

/** \\brief  E9B0C, ATOM channel 0 CCU1 compare shadow register */
#define GTM_ATOM3_CH6_SR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1 *)0xF01E9B0Cu)

/** \\brief  E9B1C, ATOM channel 0 status register */
#define GTM_ATOM3_CH6_STAT             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT *)0xF01E9B1Cu)

/** \\brief  E9B90, ATOM channel 0 CCU0 compare register */
#define GTM_ATOM3_CH7_CM0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0 *)0xF01E9B90u)

/** \\brief  E9B94, ATOM channel 0 CCU1 compare register */
#define GTM_ATOM3_CH7_CM1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1 *)0xF01E9B94u)

/** \\brief  E9B98, ATOM channel 0 CCU0 counter register */
#define GTM_ATOM3_CH7_CN0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0 *)0xF01E9B98u)

/** \\brief  E9BA4, ATOM channel 0 interrupt enable register */
#define GTM_ATOM3_CH7_IRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN *)0xF01E9BA4u)

/** \\brief  E9BA8, ATOM channel 0 software interrupt generation */
#define GTM_ATOM3_CH7_IRQ_FORCINT      /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT *)0xF01E9BA8u)

/** \\brief  E9BAC, ATOM channel 0 interrupt mode configuration register */
#define GTM_ATOM3_CH7_IRQ_MODE         /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE *)0xF01E9BACu)

/** \\brief  E9BA0, ATOM channel 0 interrupt notification register */
#define GTM_ATOM3_CH7_IRQ_NOTIFY       /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY *)0xF01E9BA0u)

/** \\brief  E9B80, ATOM channel 0 ARU read address register */
#define GTM_ATOM3_CH7_RDADDR           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR *)0xF01E9B80u)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM3_CH7_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL *)0xF01E9B84u)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM3_CH7_SOMI             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI *)0xF01E9B84u)

/** Alias (User Manual Name) for GTM_ATOM3_CH7_SOMI.
 * To use register names with standard convension, please use GTM_ATOM3_CH7_SOMI.
 */
#define GTM_ATOM3_CH7_CTRL_SOMI        (GTM_ATOM3_CH7_SOMI)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM3_CH7_SOMC             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC *)0xF01E9B84u)

/** Alias (User Manual Name) for GTM_ATOM3_CH7_SOMC.
 * To use register names with standard convension, please use GTM_ATOM3_CH7_SOMC.
 */
#define GTM_ATOM3_CH7_CTRL_SOMC        (GTM_ATOM3_CH7_SOMC)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM3_CH7_SOMP             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP *)0xF01E9B84u)

/** Alias (User Manual Name) for GTM_ATOM3_CH7_SOMP.
 * To use register names with standard convension, please use GTM_ATOM3_CH7_SOMP.
 */
#define GTM_ATOM3_CH7_CTRL_SOMP        (GTM_ATOM3_CH7_SOMP)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM3_CH7_SOMS             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS *)0xF01E9B84u)

/** Alias (User Manual Name) for GTM_ATOM3_CH7_SOMS.
 * To use register names with standard convension, please use GTM_ATOM3_CH7_SOMS.
 */
#define GTM_ATOM3_CH7_CTRL_SOMS        (GTM_ATOM3_CH7_SOMS)

/** \brief  D004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM3_CH7_SOMB             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB *)0xF01E9B84u)

/** Alias (User Manual Name) for GTM_ATOM3_CH7_SOMB.
 * To use register names with standard convension, please use GTM_ATOM3_CH7_SOMB.
 */
#define GTM_ATOM3_CH7_CTRL_SOMB        (GTM_ATOM3_CH7_SOMB)

/** \\brief  E9B88, ATOM channel 0 CCU0 compare shadow register */
#define GTM_ATOM3_CH7_SR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0 *)0xF01E9B88u)

/** \\brief  E9B8C, ATOM channel 0 CCU1 compare shadow register */
#define GTM_ATOM3_CH7_SR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1 *)0xF01E9B8Cu)

/** \\brief  E9B9C, ATOM channel 0 status register */
#define GTM_ATOM3_CH7_STAT             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT *)0xF01E9B9Cu)

/** \\brief  EA04C, ATOM AGC action time base register */
#define GTM_ATOM4_AGC_ACT_TB           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_ACT_TB *)0xF01EA04Cu)

/** \\brief  EA044, ATOM AGC enable/disable control register */
#define GTM_ATOM4_AGC_ENDIS_CTRL       /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_ENDIS_CTRL *)0xF01EA044u)

/** \\brief  EA048, ATOM AGC enable/disable status register */
#define GTM_ATOM4_AGC_ENDIS_STAT       /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_ENDIS_STAT *)0xF01EA048u)

/** \\brief  EA058, ATOM AGC force update control register */
#define GTM_ATOM4_AGC_FUPD_CTRL        /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_FUPD_CTRL *)0xF01EA058u)

/** \\brief  EA040, ATOM AGC global control register */
#define GTM_ATOM4_AGC_GLB_CTRL         /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_GLB_CTRL *)0xF01EA040u)

