Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  EA05C, ATOM AGC internal trigger control register */
#define GTM_ATOM4_AGC_INT_TRIG         /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_INT_TRIG *)0xF01EA05Cu)

/** \\brief  EA050, ATOM AGC output enable control register */
#define GTM_ATOM4_AGC_OUTEN_CTRL       /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_OUTEN_CTRL *)0xF01EA050u)

/** \\brief  EA054, ATOM AGC output enable status register */
#define GTM_ATOM4_AGC_OUTEN_STAT       /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_OUTEN_STAT *)0xF01EA054u)

/** \\brief  EA010, ATOM channel 0 CCU0 compare register */
#define GTM_ATOM4_CH0_CM0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0 *)0xF01EA010u)

/** \\brief  EA014, ATOM channel 0 CCU1 compare register */
#define GTM_ATOM4_CH0_CM1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1 *)0xF01EA014u)

/** \\brief  EA018, ATOM channel 0 CCU0 counter register */
#define GTM_ATOM4_CH0_CN0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0 *)0xF01EA018u)

/** \\brief  EA024, ATOM channel 0 interrupt enable register */
#define GTM_ATOM4_CH0_IRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN *)0xF01EA024u)

/** \\brief  EA028, ATOM channel 0 software interrupt generation */
#define GTM_ATOM4_CH0_IRQ_FORCINT      /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT *)0xF01EA028u)

/** \\brief  EA02C, ATOM channel 0 interrupt mode configuration register */
#define GTM_ATOM4_CH0_IRQ_MODE         /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE *)0xF01EA02Cu)

/** \\brief  EA020, ATOM channel 0 interrupt notification register */
#define GTM_ATOM4_CH0_IRQ_NOTIFY       /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY *)0xF01EA020u)

/** \\brief  EA000, ATOM channel 0 ARU read address register */
#define GTM_ATOM4_CH0_RDADDR           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR *)0xF01EA000u)

/** \brief  EA004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM4_CH0_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL *)0xF01EA004u)

/** \brief  EA004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM4_CH0_SOMI             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI *)0xF01EA004u)

/** Alias (User Manual Name) for GTM_ATOM4_CH0_SOMI.
 * To use register names with standard convension, please use GTM_ATOM4_CH0_SOMI.
 */
#define GTM_ATOM4_CH0_CTRL_SOMI        (GTM_ATOM4_CH0_SOMI)

/** \brief  EA004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM4_CH0_SOMC             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC *)0xF01EA004u)

/** Alias (User Manual Name) for GTM_ATOM4_CH0_SOMC.
 * To use register names with standard convension, please use GTM_ATOM4_CH0_SOMC.
 */
#define GTM_ATOM4_CH0_CTRL_SOMC        (GTM_ATOM4_CH0_SOMC)

/** \brief  EA004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM4_CH0_SOMP             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP *)0xF01EA004u)

/** Alias (User Manual Name) for GTM_ATOM4_CH0_SOMP.
 * To use register names with standard convension, please use GTM_ATOM4_CH0_SOMP.
 */
#define GTM_ATOM4_CH0_CTRL_SOMP        (GTM_ATOM4_CH0_SOMP)

/** \brief  EA004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM4_CH0_SOMS             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS *)0xF01EA004u)

/** Alias (User Manual Name) for GTM_ATOM4_CH0_SOMS.
 * To use register names with standard convension, please use GTM_ATOM4_CH0_SOMS.
 */
#define GTM_ATOM4_CH0_CTRL_SOMS        (GTM_ATOM4_CH0_SOMS)

/** \brief  EA004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM4_CH0_SOMB             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB *)0xF01EA004u)

/** Alias (User Manual Name) for GTM_ATOM4_CH0_SOMB.
 * To use register names with standard convension, please use GTM_ATOM4_CH0_SOMB.
 */
#define GTM_ATOM4_CH0_CTRL_SOMB        (GTM_ATOM4_CH0_SOMB)

/** \\brief  EA008, ATOM channel 0 CCU0 compare shadow register */
#define GTM_ATOM4_CH0_SR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0 *)0xF01EA008u)

/** \\brief  EA00C, ATOM channel 0 CCU1 compare shadow register */
#define GTM_ATOM4_CH0_SR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1 *)0xF01EA00Cu)

/** \\brief  EA01C, ATOM channel 0 status register */
#define GTM_ATOM4_CH0_STAT             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT *)0xF01EA01Cu)

/** \\brief  EA090, ATOM channel 0 CCU0 compare register */
#define GTM_ATOM4_CH1_CM0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0 *)0xF01EA090u)

/** \\brief  EA094, ATOM channel 0 CCU1 compare register */
#define GTM_ATOM4_CH1_CM1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1 *)0xF01EA094u)

/** \\brief  EA098, ATOM channel 0 CCU0 counter register */
#define GTM_ATOM4_CH1_CN0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0 *)0xF01EA098u)

/** \\brief  EA0A4, ATOM channel 0 interrupt enable register */
#define GTM_ATOM4_CH1_IRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN *)0xF01EA0A4u)

/** \\brief  EA0A8, ATOM channel 0 software interrupt generation */
#define GTM_ATOM4_CH1_IRQ_FORCINT      /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT *)0xF01EA0A8u)

/** \\brief  EA0AC, ATOM channel 0 interrupt mode configuration register */
#define GTM_ATOM4_CH1_IRQ_MODE         /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE *)0xF01EA0ACu)

/** \\brief  EA0A0, ATOM channel 0 interrupt notification register */
#define GTM_ATOM4_CH1_IRQ_NOTIFY       /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY *)0xF01EA0A0u)

/** \\brief  EA080, ATOM channel 0 ARU read address register */
#define GTM_ATOM4_CH1_RDADDR           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR *)0xF01EA080u)

/** \brief  EA084, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM4_CH1_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL *)0xF01EA084u)

