Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \brief  EA084, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM4_CH1_SOMI             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI *)0xF01EA084u)

/** Alias (User Manual Name) for GTM_ATOM4_CH1_SOMI.
 * To use register names with standard convension, please use GTM_ATOM4_CH1_SOMI.
 */
#define GTM_ATOM4_CH1_CTRL_SOMI        (GTM_ATOM4_CH1_SOMI)

/** \brief  EA084, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM4_CH1_SOMC             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC *)0xF01EA084u)

/** Alias (User Manual Name) for GTM_ATOM4_CH1_SOMC.
 * To use register names with standard convension, please use GTM_ATOM4_CH1_SOMC.
 */
#define GTM_ATOM4_CH1_CTRL_SOMC        (GTM_ATOM4_CH1_SOMC)

/** \brief  EA084, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM4_CH1_SOMP             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP *)0xF01EA084u)

/** Alias (User Manual Name) for GTM_ATOM4_CH1_SOMP.
 * To use register names with standard convension, please use GTM_ATOM4_CH1_SOMP.
 */
#define GTM_ATOM4_CH1_CTRL_SOMP        (GTM_ATOM4_CH1_SOMP)

/** \brief  EA084, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM4_CH1_SOMS             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS *)0xF01EA084u)

/** Alias (User Manual Name) for GTM_ATOM4_CH1_SOMS.
 * To use register names with standard convension, please use GTM_ATOM4_CH1_SOMS.
 */
#define GTM_ATOM4_CH1_CTRL_SOMS        (GTM_ATOM4_CH1_SOMS)

/** \brief  EA084, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM4_CH1_SOMB             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB *)0xF01EA084u)

/** Alias (User Manual Name) for GTM_ATOM4_CH1_SOMB.
 * To use register names with standard convension, please use GTM_ATOM4_CH1_SOMB.
 */
#define GTM_ATOM4_CH1_CTRL_SOMB        (GTM_ATOM4_CH1_SOMB)

/** \\brief  EA088, ATOM channel 0 CCU0 compare shadow register */
#define GTM_ATOM4_CH1_SR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0 *)0xF01EA088u)

/** \\brief  EA08C, ATOM channel 0 CCU1 compare shadow register */
#define GTM_ATOM4_CH1_SR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1 *)0xF01EA08Cu)

/** \\brief  EA09C, ATOM channel 0 status register */
#define GTM_ATOM4_CH1_STAT             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT *)0xF01EA09Cu)

/** \\brief  EA110, ATOM channel 0 CCU0 compare register */
#define GTM_ATOM4_CH2_CM0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0 *)0xF01EA110u)

/** \\brief  EA114, ATOM channel 0 CCU1 compare register */
#define GTM_ATOM4_CH2_CM1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1 *)0xF01EA114u)

/** \\brief  EA118, ATOM channel 0 CCU0 counter register */
#define GTM_ATOM4_CH2_CN0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0 *)0xF01EA118u)

/** \\brief  EA124, ATOM channel 0 interrupt enable register */
#define GTM_ATOM4_CH2_IRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN *)0xF01EA124u)

/** \\brief  EA128, ATOM channel 0 software interrupt generation */
#define GTM_ATOM4_CH2_IRQ_FORCINT      /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT *)0xF01EA128u)

/** \\brief  EA12C, ATOM channel 0 interrupt mode configuration register */
#define GTM_ATOM4_CH2_IRQ_MODE         /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE *)0xF01EA12Cu)

/** \\brief  EA120, ATOM channel 0 interrupt notification register */
#define GTM_ATOM4_CH2_IRQ_NOTIFY       /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY *)0xF01EA120u)

/** \\brief  EA100, ATOM channel 0 ARU read address register */
#define GTM_ATOM4_CH2_RDADDR           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR *)0xF01EA100u)

/** \brief  EA104, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM4_CH2_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL *)0xF01EA104u)

/** \brief  EA104, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM4_CH2_SOMI             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI *)0xF01EA104u)

/** Alias (User Manual Name) for GTM_ATOM4_CH2_SOMI.
 * To use register names with standard convension, please use GTM_ATOM4_CH2_SOMI.
 */
#define GTM_ATOM4_CH2_CTRL_SOMI        (GTM_ATOM4_CH2_SOMI)

/** \brief  EA104, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM4_CH2_SOMC             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC *)0xF01EA104u)

/** Alias (User Manual Name) for GTM_ATOM4_CH2_SOMC.
 * To use register names with standard convension, please use GTM_ATOM4_CH2_SOMC.
 */
#define GTM_ATOM4_CH2_CTRL_SOMC        (GTM_ATOM4_CH2_SOMC)

/** \brief  EA104, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM4_CH2_SOMP             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP *)0xF01EA104u)

/** Alias (User Manual Name) for GTM_ATOM4_CH2_SOMP.
 * To use register names with standard convension, please use GTM_ATOM4_CH2_SOMP.
 */
#define GTM_ATOM4_CH2_CTRL_SOMP        (GTM_ATOM4_CH2_SOMP)

/** \brief  EA104, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM4_CH2_SOMS             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS *)0xF01EA104u)

/** Alias (User Manual Name) for GTM_ATOM4_CH2_SOMS.
 * To use register names with standard convension, please use GTM_ATOM4_CH2_SOMS.
 */
#define GTM_ATOM4_CH2_CTRL_SOMS        (GTM_ATOM4_CH2_SOMS)

/** \brief  EA104, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM4_CH2_SOMB             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB *)0xF01EA104u)

/** Alias (User Manual Name) for GTM_ATOM4_CH2_SOMB.
 * To use register names with standard convension, please use GTM_ATOM4_CH2_SOMB.
 */
#define GTM_ATOM4_CH2_CTRL_SOMB        (GTM_ATOM4_CH2_SOMB)

/** \\brief  EA108, ATOM channel 0 CCU0 compare shadow register */
#define GTM_ATOM4_CH2_SR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0 *)0xF01EA108u)

/** \\brief  EA10C, ATOM channel 0 CCU1 compare shadow register */
#define GTM_ATOM4_CH2_SR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1 *)0xF01EA10Cu)

