Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  EA11C, ATOM channel 0 status register */
#define GTM_ATOM4_CH2_STAT             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT *)0xF01EA11Cu)

/** \\brief  EA190, ATOM channel 0 CCU0 compare register */
#define GTM_ATOM4_CH3_CM0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0 *)0xF01EA190u)

/** \\brief  EA194, ATOM channel 0 CCU1 compare register */
#define GTM_ATOM4_CH3_CM1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1 *)0xF01EA194u)

/** \\brief  EA198, ATOM channel 0 CCU0 counter register */
#define GTM_ATOM4_CH3_CN0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0 *)0xF01EA198u)

/** \\brief  EA1A4, ATOM channel 0 interrupt enable register */
#define GTM_ATOM4_CH3_IRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN *)0xF01EA1A4u)

/** \\brief  EA1A8, ATOM channel 0 software interrupt generation */
#define GTM_ATOM4_CH3_IRQ_FORCINT      /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT *)0xF01EA1A8u)

/** \\brief  EA1AC, ATOM channel 0 interrupt mode configuration register */
#define GTM_ATOM4_CH3_IRQ_MODE         /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE *)0xF01EA1ACu)

/** \\brief  EA1A0, ATOM channel 0 interrupt notification register */
#define GTM_ATOM4_CH3_IRQ_NOTIFY       /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY *)0xF01EA1A0u)

/** \\brief  EA180, ATOM channel 0 ARU read address register */
#define GTM_ATOM4_CH3_RDADDR           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR *)0xF01EA180u)

/** \brief  EA184, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM4_CH3_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL *)0xF01EA184u)

/** \brief  EA184, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM4_CH3_SOMI             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI *)0xF01EA184u)

/** Alias (User Manual Name) for GTM_ATOM4_CH3_SOMI.
 * To use register names with standard convension, please use GTM_ATOM4_CH3_SOMI.
 */
#define GTM_ATOM4_CH3_CTRL_SOMI        (GTM_ATOM4_CH3_SOMI)

/** \brief  EA184, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM4_CH3_SOMC             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC *)0xF01EA184u)

/** Alias (User Manual Name) for GTM_ATOM4_CH3_SOMC.
 * To use register names with standard convension, please use GTM_ATOM4_CH3_SOMC.
 */
#define GTM_ATOM4_CH3_CTRL_SOMC        (GTM_ATOM4_CH3_SOMC)

/** \brief  EA184, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM4_CH3_SOMP             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP *)0xF01EA184u)

/** Alias (User Manual Name) for GTM_ATOM4_CH3_SOMP.
 * To use register names with standard convension, please use GTM_ATOM4_CH3_SOMP.
 */
#define GTM_ATOM4_CH3_CTRL_SOMP        (GTM_ATOM4_CH3_SOMP)

/** \brief  EA184, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM4_CH3_SOMS             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS *)0xF01EA184u)

/** Alias (User Manual Name) for GTM_ATOM4_CH3_SOMS.
 * To use register names with standard convension, please use GTM_ATOM4_CH3_SOMS.
 */
#define GTM_ATOM4_CH3_CTRL_SOMS        (GTM_ATOM4_CH3_SOMS)

/** \brief  EA184, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM4_CH3_SOMB             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB *)0xF01EA184u)

/** Alias (User Manual Name) for GTM_ATOM4_CH3_SOMB.
 * To use register names with standard convension, please use GTM_ATOM4_CH3_SOMB.
 */
#define GTM_ATOM4_CH3_CTRL_SOMB        (GTM_ATOM4_CH3_SOMB)

/** \\brief  EA188, ATOM channel 0 CCU0 compare shadow register */
#define GTM_ATOM4_CH3_SR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0 *)0xF01EA188u)

/** \\brief  EA18C, ATOM channel 0 CCU1 compare shadow register */
#define GTM_ATOM4_CH3_SR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1 *)0xF01EA18Cu)

/** \\brief  EA19C, ATOM channel 0 status register */
#define GTM_ATOM4_CH3_STAT             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT *)0xF01EA19Cu)

/** \\brief  EA210, ATOM channel 0 CCU0 compare register */
#define GTM_ATOM4_CH4_CM0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0 *)0xF01EA210u)

/** \\brief  EA214, ATOM channel 0 CCU1 compare register */
#define GTM_ATOM4_CH4_CM1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1 *)0xF01EA214u)

/** \\brief  EA218, ATOM channel 0 CCU0 counter register */
#define GTM_ATOM4_CH4_CN0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0 *)0xF01EA218u)

/** \\brief  EA224, ATOM channel 0 interrupt enable register */
#define GTM_ATOM4_CH4_IRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN *)0xF01EA224u)

/** \\brief  EA228, ATOM channel 0 software interrupt generation */
#define GTM_ATOM4_CH4_IRQ_FORCINT      /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT *)0xF01EA228u)

/** \\brief  EA22C, ATOM channel 0 interrupt mode configuration register */
#define GTM_ATOM4_CH4_IRQ_MODE         /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE *)0xF01EA22Cu)

/** \\brief  EA220, ATOM channel 0 interrupt notification register */
#define GTM_ATOM4_CH4_IRQ_NOTIFY       /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY *)0xF01EA220u)

/** \\brief  EA200, ATOM channel 0 ARU read address register */
#define GTM_ATOM4_CH4_RDADDR           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR *)0xF01EA200u)

/** \brief  EA204, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM4_CH4_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL *)0xF01EA204u)

/** \brief  EA204, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM4_CH4_SOMI             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI *)0xF01EA204u)

/** Alias (User Manual Name) for GTM_ATOM4_CH4_SOMI.
 * To use register names with standard convension, please use GTM_ATOM4_CH4_SOMI.
 */
#define GTM_ATOM4_CH4_CTRL_SOMI        (GTM_ATOM4_CH4_SOMI)

/** \brief  EA204, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM4_CH4_SOMC             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC *)0xF01EA204u)

/** Alias (User Manual Name) for GTM_ATOM4_CH4_SOMC.
 * To use register names with standard convension, please use GTM_ATOM4_CH4_SOMC.
 */
#define GTM_ATOM4_CH4_CTRL_SOMC        (GTM_ATOM4_CH4_SOMC)

/** \brief  EA204, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM4_CH4_SOMP             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP *)0xF01EA204u)

