Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** Alias (User Manual Name) for GTM_ATOM4_CH4_SOMP.
 * To use register names with standard convension, please use GTM_ATOM4_CH4_SOMP.
 */
#define GTM_ATOM4_CH4_CTRL_SOMP        (GTM_ATOM4_CH4_SOMP)

/** \brief  EA204, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM4_CH4_SOMS             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS *)0xF01EA204u)

/** Alias (User Manual Name) for GTM_ATOM4_CH4_SOMS.
 * To use register names with standard convension, please use GTM_ATOM4_CH4_SOMS.
 */
#define GTM_ATOM4_CH4_CTRL_SOMS        (GTM_ATOM4_CH4_SOMS)

/** \brief  EA204, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM4_CH4_SOMB             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB *)0xF01EA204u)

/** Alias (User Manual Name) for GTM_ATOM4_CH4_SOMB.
 * To use register names with standard convension, please use GTM_ATOM4_CH4_SOMB.
 */
#define GTM_ATOM4_CH4_CTRL_SOMB        (GTM_ATOM4_CH4_SOMB)

/** \\brief  EA208, ATOM channel 0 CCU0 compare shadow register */
#define GTM_ATOM4_CH4_SR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0 *)0xF01EA208u)

/** \\brief  EA20C, ATOM channel 0 CCU1 compare shadow register */
#define GTM_ATOM4_CH4_SR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1 *)0xF01EA20Cu)

/** \\brief  EA21C, ATOM channel 0 status register */
#define GTM_ATOM4_CH4_STAT             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT *)0xF01EA21Cu)

/** \\brief  EA290, ATOM channel 0 CCU0 compare register */
#define GTM_ATOM4_CH5_CM0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0 *)0xF01EA290u)

/** \\brief  EA294, ATOM channel 0 CCU1 compare register */
#define GTM_ATOM4_CH5_CM1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1 *)0xF01EA294u)

/** \\brief  EA298, ATOM channel 0 CCU0 counter register */
#define GTM_ATOM4_CH5_CN0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0 *)0xF01EA298u)

/** \\brief  EA2A4, ATOM channel 0 interrupt enable register */
#define GTM_ATOM4_CH5_IRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN *)0xF01EA2A4u)

/** \\brief  EA2A8, ATOM channel 0 software interrupt generation */
#define GTM_ATOM4_CH5_IRQ_FORCINT      /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT *)0xF01EA2A8u)

/** \\brief  EA2AC, ATOM channel 0 interrupt mode configuration register */
#define GTM_ATOM4_CH5_IRQ_MODE         /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE *)0xF01EA2ACu)

/** \\brief  EA2A0, ATOM channel 0 interrupt notification register */
#define GTM_ATOM4_CH5_IRQ_NOTIFY       /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY *)0xF01EA2A0u)

/** \\brief  EA280, ATOM channel 0 ARU read address register */
#define GTM_ATOM4_CH5_RDADDR           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR *)0xF01EA280u)

/** \brief  EA284, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM4_CH5_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL *)0xF01EA284u)

/** \brief  EA284, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM4_CH5_SOMI             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI *)0xF01EA284u)

/** Alias (User Manual Name) for GTM_ATOM4_CH5_SOMI.
 * To use register names with standard convension, please use GTM_ATOM4_CH5_SOMI.
 */
#define GTM_ATOM4_CH5_CTRL_SOMI        (GTM_ATOM4_CH5_SOMI)

/** \brief  EA284, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM4_CH5_SOMC             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC *)0xF01EA284u)

/** Alias (User Manual Name) for GTM_ATOM4_CH5_SOMC.
 * To use register names with standard convension, please use GTM_ATOM4_CH5_SOMC.
 */
#define GTM_ATOM4_CH5_CTRL_SOMC        (GTM_ATOM4_CH5_SOMC)

/** \brief  EA284, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM4_CH5_SOMP             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP *)0xF01EA284u)

/** Alias (User Manual Name) for GTM_ATOM4_CH5_SOMP.
 * To use register names with standard convension, please use GTM_ATOM4_CH5_SOMP.
 */
#define GTM_ATOM4_CH5_CTRL_SOMP        (GTM_ATOM4_CH5_SOMP)

/** \brief  EA284, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM4_CH5_SOMS             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS *)0xF01EA284u)

/** Alias (User Manual Name) for GTM_ATOM4_CH5_SOMS.
 * To use register names with standard convension, please use GTM_ATOM4_CH5_SOMS.
 */
#define GTM_ATOM4_CH5_CTRL_SOMS        (GTM_ATOM4_CH5_SOMS)

/** \brief  EA284, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM4_CH5_SOMB             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB *)0xF01EA284u)

/** Alias (User Manual Name) for GTM_ATOM4_CH5_SOMB.
 * To use register names with standard convension, please use GTM_ATOM4_CH5_SOMB.
 */
#define GTM_ATOM4_CH5_CTRL_SOMB        (GTM_ATOM4_CH5_SOMB)

/** \\brief  EA288, ATOM channel 0 CCU0 compare shadow register */
#define GTM_ATOM4_CH5_SR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0 *)0xF01EA288u)

/** \\brief  EA28C, ATOM channel 0 CCU1 compare shadow register */
#define GTM_ATOM4_CH5_SR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1 *)0xF01EA28Cu)

/** \\brief  EA29C, ATOM channel 0 status register */
#define GTM_ATOM4_CH5_STAT             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT *)0xF01EA29Cu)

/** \\brief  EA310, ATOM channel 0 CCU0 compare register */
#define GTM_ATOM4_CH6_CM0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0 *)0xF01EA310u)

/** \\brief  EA314, ATOM channel 0 CCU1 compare register */
#define GTM_ATOM4_CH6_CM1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1 *)0xF01EA314u)

/** \\brief  EA318, ATOM channel 0 CCU0 counter register */
#define GTM_ATOM4_CH6_CN0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0 *)0xF01EA318u)

/** \\brief  EA324, ATOM channel 0 interrupt enable register */
#define GTM_ATOM4_CH6_IRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN *)0xF01EA324u)

/** \\brief  EA328, ATOM channel 0 software interrupt generation */
#define GTM_ATOM4_CH6_IRQ_FORCINT      /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT *)0xF01EA328u)

