Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  EA32C, ATOM channel 0 interrupt mode configuration register */
#define GTM_ATOM4_CH6_IRQ_MODE         /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE *)0xF01EA32Cu)

/** \\brief  EA320, ATOM channel 0 interrupt notification register */
#define GTM_ATOM4_CH6_IRQ_NOTIFY       /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY *)0xF01EA320u)

/** \\brief  EA300, ATOM channel 0 ARU read address register */
#define GTM_ATOM4_CH6_RDADDR           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR *)0xF01EA300u)

/** \brief  EA304, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM4_CH6_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL *)0xF01EA304u)

/** \brief  EA304, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM4_CH6_SOMI             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI *)0xF01EA304u)

/** Alias (User Manual Name) for GTM_ATOM4_CH6_SOMI.
 * To use register names with standard convension, please use GTM_ATOM4_CH6_SOMI.
 */
#define GTM_ATOM4_CH6_CTRL_SOMI        (GTM_ATOM4_CH6_SOMI)

/** \brief  EA304, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM4_CH6_SOMC             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC *)0xF01EA304u)

/** Alias (User Manual Name) for GTM_ATOM4_CH6_SOMC.
 * To use register names with standard convension, please use GTM_ATOM4_CH6_SOMC.
 */
#define GTM_ATOM4_CH6_CTRL_SOMC        (GTM_ATOM4_CH6_SOMC)

/** \brief  EA304, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM4_CH6_SOMP             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP *)0xF01EA304u)

/** Alias (User Manual Name) for GTM_ATOM4_CH6_SOMP.
 * To use register names with standard convension, please use GTM_ATOM4_CH6_SOMP.
 */
#define GTM_ATOM4_CH6_CTRL_SOMP        (GTM_ATOM4_CH6_SOMP)

/** \brief  EA304, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM4_CH6_SOMS             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS *)0xF01EA304u)

/** Alias (User Manual Name) for GTM_ATOM4_CH6_SOMS.
 * To use register names with standard convension, please use GTM_ATOM4_CH6_SOMS.
 */
#define GTM_ATOM4_CH6_CTRL_SOMS        (GTM_ATOM4_CH6_SOMS)

/** \brief  EA304, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM4_CH6_SOMB             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB *)0xF01EA304u)

/** Alias (User Manual Name) for GTM_ATOM4_CH6_SOMB.
 * To use register names with standard convension, please use GTM_ATOM4_CH6_SOMB.
 */
#define GTM_ATOM4_CH6_CTRL_SOMB        (GTM_ATOM4_CH6_SOMB)

/** \\brief  EA308, ATOM channel 0 CCU0 compare shadow register */
#define GTM_ATOM4_CH6_SR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0 *)0xF01EA308u)

/** \\brief  EA30C, ATOM channel 0 CCU1 compare shadow register */
#define GTM_ATOM4_CH6_SR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1 *)0xF01EA30Cu)

/** \\brief  EA31C, ATOM channel 0 status register */
#define GTM_ATOM4_CH6_STAT             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT *)0xF01EA31Cu)

/** \\brief  EA390, ATOM channel 0 CCU0 compare register */
#define GTM_ATOM4_CH7_CM0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0 *)0xF01EA390u)

/** \\brief  EA394, ATOM channel 0 CCU1 compare register */
#define GTM_ATOM4_CH7_CM1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1 *)0xF01EA394u)

/** \\brief  EA398, ATOM channel 0 CCU0 counter register */
#define GTM_ATOM4_CH7_CN0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0 *)0xF01EA398u)

/** \\brief  EA3A4, ATOM channel 0 interrupt enable register */
#define GTM_ATOM4_CH7_IRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN *)0xF01EA3A4u)

/** \\brief  EA3A8, ATOM channel 0 software interrupt generation */
#define GTM_ATOM4_CH7_IRQ_FORCINT      /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT *)0xF01EA3A8u)

/** \\brief  EA3AC, ATOM channel 0 interrupt mode configuration register */
#define GTM_ATOM4_CH7_IRQ_MODE         /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE *)0xF01EA3ACu)

/** \\brief  EA3A0, ATOM channel 0 interrupt notification register */
#define GTM_ATOM4_CH7_IRQ_NOTIFY       /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY *)0xF01EA3A0u)

/** \\brief  EA380, ATOM channel 0 ARU read address register */
#define GTM_ATOM4_CH7_RDADDR           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR *)0xF01EA380u)

/** \brief  EA384, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM4_CH7_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL *)0xF01EA384u)

/** \brief  EA384, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM4_CH7_SOMI             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI *)0xF01EA384u)

/** Alias (User Manual Name) for GTM_ATOM4_CH7_SOMI.
 * To use register names with standard convension, please use GTM_ATOM4_CH7_SOMI.
 */
#define GTM_ATOM4_CH7_CTRL_SOMI        (GTM_ATOM4_CH7_SOMI)

/** \brief  EA384, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM4_CH7_SOMC             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC *)0xF01EA384u)

/** Alias (User Manual Name) for GTM_ATOM4_CH7_SOMC.
 * To use register names with standard convension, please use GTM_ATOM4_CH7_SOMC.
 */
#define GTM_ATOM4_CH7_CTRL_SOMC        (GTM_ATOM4_CH7_SOMC)

/** \brief  EA384, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM4_CH7_SOMP             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP *)0xF01EA384u)

/** Alias (User Manual Name) for GTM_ATOM4_CH7_SOMP.
 * To use register names with standard convension, please use GTM_ATOM4_CH7_SOMP.
 */
#define GTM_ATOM4_CH7_CTRL_SOMP        (GTM_ATOM4_CH7_SOMP)

/** \brief  EA384, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM4_CH7_SOMS             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS *)0xF01EA384u)

/** Alias (User Manual Name) for GTM_ATOM4_CH7_SOMS.
 * To use register names with standard convension, please use GTM_ATOM4_CH7_SOMS.
 */
#define GTM_ATOM4_CH7_CTRL_SOMS        (GTM_ATOM4_CH7_SOMS)

/** \brief  EA384, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM4_CH7_SOMB             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB *)0xF01EA384u)

/** Alias (User Manual Name) for GTM_ATOM4_CH7_SOMB.
 * To use register names with standard convension, please use GTM_ATOM4_CH7_SOMB.
 */
#define GTM_ATOM4_CH7_CTRL_SOMB        (GTM_ATOM4_CH7_SOMB)

/** \\brief  EA388, ATOM channel 0 CCU0 compare shadow register */
#define GTM_ATOM4_CH7_SR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0 *)0xF01EA388u)

/** \\brief  EA38C, ATOM channel 0 CCU1 compare shadow register */
#define GTM_ATOM4_CH7_SR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1 *)0xF01EA38Cu)

/** \\brief  EA39C, ATOM channel 0 status register */
#define GTM_ATOM4_CH7_STAT             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT *)0xF01EA39Cu)

/** \\brief  EA84C, ATOM AGC action time base register */
#define GTM_ATOM5_AGC_ACT_TB           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_ACT_TB *)0xF01EA84Cu)

/** \\brief  EA844, ATOM AGC enable/disable control register */
#define GTM_ATOM5_AGC_ENDIS_CTRL       /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_ENDIS_CTRL *)0xF01EA844u)

/** \\brief  EA848, ATOM AGC enable/disable status register */
#define GTM_ATOM5_AGC_ENDIS_STAT       /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_ENDIS_STAT *)0xF01EA848u)

