Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  EA858, ATOM AGC force update control register */
#define GTM_ATOM5_AGC_FUPD_CTRL        /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_FUPD_CTRL *)0xF01EA858u)

/** \\brief  EA840, ATOM AGC global control register */
#define GTM_ATOM5_AGC_GLB_CTRL         /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_GLB_CTRL *)0xF01EA840u)

/** \\brief  EA85C, ATOM AGC internal trigger control register */
#define GTM_ATOM5_AGC_INT_TRIG         /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_INT_TRIG *)0xF01EA85Cu)

/** \\brief  EA850, ATOM AGC output enable control register */
#define GTM_ATOM5_AGC_OUTEN_CTRL       /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_OUTEN_CTRL *)0xF01EA850u)

/** \\brief  EA854, ATOM AGC output enable status register */
#define GTM_ATOM5_AGC_OUTEN_STAT       /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_OUTEN_STAT *)0xF01EA854u)

/** \\brief  EA810, ATOM channel 0 CCU0 compare register */
#define GTM_ATOM5_CH0_CM0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0 *)0xF01EA810u)

/** \\brief  EA814, ATOM channel 0 CCU1 compare register */
#define GTM_ATOM5_CH0_CM1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1 *)0xF01EA814u)

/** \\brief  EA818, ATOM channel 0 CCU0 counter register */
#define GTM_ATOM5_CH0_CN0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0 *)0xF01EA818u)

/** \\brief  EA824, ATOM channel 0 interrupt enable register */
#define GTM_ATOM5_CH0_IRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN *)0xF01EA824u)

/** \\brief  EA828, ATOM channel 0 software interrupt generation */
#define GTM_ATOM5_CH0_IRQ_FORCINT      /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT *)0xF01EA828u)

/** \\brief  EA82C, ATOM channel 0 interrupt mode configuration register */
#define GTM_ATOM5_CH0_IRQ_MODE         /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE *)0xF01EA82Cu)

/** \\brief  EA820, ATOM channel 0 interrupt notification register */
#define GTM_ATOM5_CH0_IRQ_NOTIFY       /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY *)0xF01EA820u)

/** \\brief  EA800, ATOM channel 0 ARU read address register */
#define GTM_ATOM5_CH0_RDADDR           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR *)0xF01EA800u)

/** \brief  EA804, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM5_CH0_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL *)0xF01EA804u)

/** \brief  EA804, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM5_CH0_SOMI             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI *)0xF01EA804u)

/** Alias (User Manual Name) for GTM_ATOM5_CH0_SOMI.
 * To use register names with standard convension, please use GTM_ATOM5_CH0_SOMI.
 */
#define GTM_ATOM5_CH0_CTRL_SOMI        (GTM_ATOM5_CH0_SOMI)

/** \brief  EA804, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM5_CH0_SOMC             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC *)0xF01EA804u)

/** Alias (User Manual Name) for GTM_ATOM5_CH0_SOMC.
 * To use register names with standard convension, please use GTM_ATOM5_CH0_SOMC.
 */
#define GTM_ATOM5_CH0_CTRL_SOMC        (GTM_ATOM5_CH0_SOMC)

/** \brief  EA804, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM5_CH0_SOMP             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP *)0xF01EA804u)

/** Alias (User Manual Name) for GTM_ATOM5_CH0_SOMP.
 * To use register names with standard convension, please use GTM_ATOM5_CH0_SOMP.
 */
#define GTM_ATOM5_CH0_CTRL_SOMP        (GTM_ATOM5_CH0_SOMP)

/** \brief  EA804, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM5_CH0_SOMS             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS *)0xF01EA804u)

/** Alias (User Manual Name) for GTM_ATOM5_CH0_SOMS.
 * To use register names with standard convension, please use GTM_ATOM5_CH0_SOMS.
 */
#define GTM_ATOM5_CH0_CTRL_SOMS        (GTM_ATOM5_CH0_SOMS)

/** \brief  EA804, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM5_CH0_SOMB             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB *)0xF01EA804u)

/** Alias (User Manual Name) for GTM_ATOM5_CH0_SOMB.
 * To use register names with standard convension, please use GTM_ATOM5_CH0_SOMB.
 */
#define GTM_ATOM5_CH0_CTRL_SOMB        (GTM_ATOM5_CH0_SOMB)

/** \\brief  EA808, ATOM channel 0 CCU0 compare shadow register */
#define GTM_ATOM5_CH0_SR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0 *)0xF01EA808u)

/** \\brief  EA80C, ATOM channel 0 CCU1 compare shadow register */
#define GTM_ATOM5_CH0_SR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1 *)0xF01EA80Cu)

/** \\brief  EA81C, ATOM channel 0 status register */
#define GTM_ATOM5_CH0_STAT             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT *)0xF01EA81Cu)

/** \\brief  EA890, ATOM channel 0 CCU0 compare register */
#define GTM_ATOM5_CH1_CM0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0 *)0xF01EA890u)

/** \\brief  EA894, ATOM channel 0 CCU1 compare register */
#define GTM_ATOM5_CH1_CM1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1 *)0xF01EA894u)

/** \\brief  EA898, ATOM channel 0 CCU0 counter register */
#define GTM_ATOM5_CH1_CN0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0 *)0xF01EA898u)

/** \\brief  EA8A4, ATOM channel 0 interrupt enable register */
#define GTM_ATOM5_CH1_IRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN *)0xF01EA8A4u)

/** \\brief  EA8A8, ATOM channel 0 software interrupt generation */
#define GTM_ATOM5_CH1_IRQ_FORCINT      /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT *)0xF01EA8A8u)

/** \\brief  EA8AC, ATOM channel 0 interrupt mode configuration register */
#define GTM_ATOM5_CH1_IRQ_MODE         /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE *)0xF01EA8ACu)

/** \\brief  EA8A0, ATOM channel 0 interrupt notification register */
#define GTM_ATOM5_CH1_IRQ_NOTIFY       /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY *)0xF01EA8A0u)

/** \\brief  EA880, ATOM channel 0 ARU read address register */
#define GTM_ATOM5_CH1_RDADDR           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR *)0xF01EA880u)

/** \brief  EA884, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM5_CH1_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL *)0xF01EA884u)

/** \brief  EA884, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM5_CH1_SOMI             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI *)0xF01EA884u)

/** Alias (User Manual Name) for GTM_ATOM5_CH1_SOMI.
 * To use register names with standard convension, please use GTM_ATOM5_CH1_SOMI.
 */
#define GTM_ATOM5_CH1_CTRL_SOMI        (GTM_ATOM5_CH1_SOMI)

/** \brief  EA884, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM5_CH1_SOMC             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC *)0xF01EA884u)

/** Alias (User Manual Name) for GTM_ATOM5_CH1_SOMC.
 * To use register names with standard convension, please use GTM_ATOM5_CH1_SOMC.
 */
#define GTM_ATOM5_CH1_CTRL_SOMC        (GTM_ATOM5_CH1_SOMC)

/** \brief  EA884, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM5_CH1_SOMP             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP *)0xF01EA884u)

/** Alias (User Manual Name) for GTM_ATOM5_CH1_SOMP.
 * To use register names with standard convension, please use GTM_ATOM5_CH1_SOMP.
 */
#define GTM_ATOM5_CH1_CTRL_SOMP        (GTM_ATOM5_CH1_SOMP)

/** \brief  EA884, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM5_CH1_SOMS             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS *)0xF01EA884u)

