Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** Alias (User Manual Name) for GTM_ATOM5_CH1_SOMS.
 * To use register names with standard convension, please use GTM_ATOM5_CH1_SOMS.
 */
#define GTM_ATOM5_CH1_CTRL_SOMS        (GTM_ATOM5_CH1_SOMS)

/** \brief  EA884, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM5_CH1_SOMB             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB *)0xF01EA884u)

/** Alias (User Manual Name) for GTM_ATOM5_CH1_SOMB.
 * To use register names with standard convension, please use GTM_ATOM5_CH1_SOMB.
 */
#define GTM_ATOM5_CH1_CTRL_SOMB        (GTM_ATOM5_CH1_SOMB)

/** \\brief  EA888, ATOM channel 0 CCU0 compare shadow register */
#define GTM_ATOM5_CH1_SR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0 *)0xF01EA888u)

/** \\brief  EA88C, ATOM channel 0 CCU1 compare shadow register */
#define GTM_ATOM5_CH1_SR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1 *)0xF01EA88Cu)

/** \\brief  EA89C, ATOM channel 0 status register */
#define GTM_ATOM5_CH1_STAT             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT *)0xF01EA89Cu)

/** \\brief  EA910, ATOM channel 0 CCU0 compare register */
#define GTM_ATOM5_CH2_CM0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0 *)0xF01EA910u)

/** \\brief  EA914, ATOM channel 0 CCU1 compare register */
#define GTM_ATOM5_CH2_CM1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1 *)0xF01EA914u)

/** \\brief  EA918, ATOM channel 0 CCU0 counter register */
#define GTM_ATOM5_CH2_CN0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0 *)0xF01EA918u)

/** \\brief  EA924, ATOM channel 0 interrupt enable register */
#define GTM_ATOM5_CH2_IRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN *)0xF01EA924u)

/** \\brief  EA928, ATOM channel 0 software interrupt generation */
#define GTM_ATOM5_CH2_IRQ_FORCINT      /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT *)0xF01EA928u)

/** \\brief  EA92C, ATOM channel 0 interrupt mode configuration register */
#define GTM_ATOM5_CH2_IRQ_MODE         /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE *)0xF01EA92Cu)

/** \\brief  EA920, ATOM channel 0 interrupt notification register */
#define GTM_ATOM5_CH2_IRQ_NOTIFY       /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY *)0xF01EA920u)

/** \\brief  EA900, ATOM channel 0 ARU read address register */
#define GTM_ATOM5_CH2_RDADDR           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR *)0xF01EA900u)

/** \brief  EA904, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM5_CH2_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL *)0xF01EA904u)

/** \brief  EA904, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM5_CH2_SOMI             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI *)0xF01EA904u)

/** Alias (User Manual Name) for GTM_ATOM5_CH2_SOMI.
 * To use register names with standard convension, please use GTM_ATOM5_CH2_SOMI.
 */
#define GTM_ATOM5_CH2_CTRL_SOMI        (GTM_ATOM5_CH2_SOMI)

/** \brief  EA904, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM5_CH2_SOMC             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC *)0xF01EA904u)

/** Alias (User Manual Name) for GTM_ATOM5_CH2_SOMC.
 * To use register names with standard convension, please use GTM_ATOM5_CH2_SOMC.
 */
#define GTM_ATOM5_CH2_CTRL_SOMC        (GTM_ATOM5_CH2_SOMC)

/** \brief  EA904, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM5_CH2_SOMP             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP *)0xF01EA904u)

/** Alias (User Manual Name) for GTM_ATOM5_CH2_SOMP.
 * To use register names with standard convension, please use GTM_ATOM5_CH2_SOMP.
 */
#define GTM_ATOM5_CH2_CTRL_SOMP        (GTM_ATOM5_CH2_SOMP)

/** \brief  EA904, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM5_CH2_SOMS             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS *)0xF01EA904u)

/** Alias (User Manual Name) for GTM_ATOM5_CH2_SOMS.
 * To use register names with standard convension, please use GTM_ATOM5_CH2_SOMS.
 */
#define GTM_ATOM5_CH2_CTRL_SOMS        (GTM_ATOM5_CH2_SOMS)

/** \brief  EA904, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM5_CH2_SOMB             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB *)0xF01EA904u)

/** Alias (User Manual Name) for GTM_ATOM5_CH2_SOMB.
 * To use register names with standard convension, please use GTM_ATOM5_CH2_SOMB.
 */
#define GTM_ATOM5_CH2_CTRL_SOMB        (GTM_ATOM5_CH2_SOMB)

/** \\brief  EA908, ATOM channel 0 CCU0 compare shadow register */
#define GTM_ATOM5_CH2_SR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0 *)0xF01EA908u)

/** \\brief  EA90C, ATOM channel 0 CCU1 compare shadow register */
#define GTM_ATOM5_CH2_SR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1 *)0xF01EA90Cu)

/** \\brief  EA91C, ATOM channel 0 status register */
#define GTM_ATOM5_CH2_STAT             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT *)0xF01EA91Cu)

/** \\brief  EA990, ATOM channel 0 CCU0 compare register */
#define GTM_ATOM5_CH3_CM0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0 *)0xF01EA990u)

/** \\brief  EA994, ATOM channel 0 CCU1 compare register */
#define GTM_ATOM5_CH3_CM1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1 *)0xF01EA994u)

/** \\brief  EA998, ATOM channel 0 CCU0 counter register */
#define GTM_ATOM5_CH3_CN0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0 *)0xF01EA998u)

/** \\brief  EA9A4, ATOM channel 0 interrupt enable register */
#define GTM_ATOM5_CH3_IRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN *)0xF01EA9A4u)

/** \\brief  EA9A8, ATOM channel 0 software interrupt generation */
#define GTM_ATOM5_CH3_IRQ_FORCINT      /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT *)0xF01EA9A8u)

/** \\brief  EA9AC, ATOM channel 0 interrupt mode configuration register */
#define GTM_ATOM5_CH3_IRQ_MODE         /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE *)0xF01EA9ACu)

