Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  EA9A0, ATOM channel 0 interrupt notification register */
#define GTM_ATOM5_CH3_IRQ_NOTIFY       /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY *)0xF01EA9A0u)

/** \\brief  EA980, ATOM channel 0 ARU read address register */
#define GTM_ATOM5_CH3_RDADDR           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR *)0xF01EA980u)

/** \brief  EA984, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM5_CH3_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL *)0xF01EA984u)

/** \brief  EA984, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM5_CH3_SOMI             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI *)0xF01EA984u)

/** Alias (User Manual Name) for GTM_ATOM5_CH3_SOMI.
 * To use register names with standard convension, please use GTM_ATOM5_CH3_SOMI.
 */
#define GTM_ATOM5_CH3_CTRL_SOMI        (GTM_ATOM5_CH3_SOMI)

/** \brief  EA984, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM5_CH3_SOMC             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC *)0xF01EA984u)

/** Alias (User Manual Name) for GTM_ATOM5_CH3_SOMC.
 * To use register names with standard convension, please use GTM_ATOM5_CH3_SOMC.
 */
#define GTM_ATOM5_CH3_CTRL_SOMC        (GTM_ATOM5_CH3_SOMC)

/** \brief  EA984, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM5_CH3_SOMP             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP *)0xF01EA984u)

/** Alias (User Manual Name) for GTM_ATOM5_CH3_SOMP.
 * To use register names with standard convension, please use GTM_ATOM5_CH3_SOMP.
 */
#define GTM_ATOM5_CH3_CTRL_SOMP        (GTM_ATOM5_CH3_SOMP)

/** \brief  EA984, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM5_CH3_SOMS             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS *)0xF01EA984u)

/** Alias (User Manual Name) for GTM_ATOM5_CH3_SOMS.
 * To use register names with standard convension, please use GTM_ATOM5_CH3_SOMS.
 */
#define GTM_ATOM5_CH3_CTRL_SOMS        (GTM_ATOM5_CH3_SOMS)

/** \brief  EA984, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM5_CH3_SOMB             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB *)0xF01EA984u)

/** Alias (User Manual Name) for GTM_ATOM5_CH3_SOMB.
 * To use register names with standard convension, please use GTM_ATOM5_CH3_SOMB.
 */
#define GTM_ATOM5_CH3_CTRL_SOMB        (GTM_ATOM5_CH3_SOMB)

/** \\brief  EA988, ATOM channel 0 CCU0 compare shadow register */
#define GTM_ATOM5_CH3_SR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0 *)0xF01EA988u)

/** \\brief  EA98C, ATOM channel 0 CCU1 compare shadow register */
#define GTM_ATOM5_CH3_SR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1 *)0xF01EA98Cu)

/** \\brief  EA99C, ATOM channel 0 status register */
#define GTM_ATOM5_CH3_STAT             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT *)0xF01EA99Cu)

/** \\brief  EAA10, ATOM channel 0 CCU0 compare register */
#define GTM_ATOM5_CH4_CM0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0 *)0xF01EAA10u)

/** \\brief  EAA14, ATOM channel 0 CCU1 compare register */
#define GTM_ATOM5_CH4_CM1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1 *)0xF01EAA14u)

/** \\brief  EAA18, ATOM channel 0 CCU0 counter register */
#define GTM_ATOM5_CH4_CN0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0 *)0xF01EAA18u)

/** \\brief  EAA24, ATOM channel 0 interrupt enable register */
#define GTM_ATOM5_CH4_IRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN *)0xF01EAA24u)

/** \\brief  EAA28, ATOM channel 0 software interrupt generation */
#define GTM_ATOM5_CH4_IRQ_FORCINT      /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT *)0xF01EAA28u)

/** \\brief  EAA2C, ATOM channel 0 interrupt mode configuration register */
#define GTM_ATOM5_CH4_IRQ_MODE         /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE *)0xF01EAA2Cu)

/** \\brief  EAA20, ATOM channel 0 interrupt notification register */
#define GTM_ATOM5_CH4_IRQ_NOTIFY       /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY *)0xF01EAA20u)

/** \\brief  EAA00, ATOM channel 0 ARU read address register */
#define GTM_ATOM5_CH4_RDADDR           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR *)0xF01EAA00u)

/** \brief  EAA04, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM5_CH4_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL *)0xF01EAA04u)

/** \brief  EAA04, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM5_CH4_SOMI             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI *)0xF01EAA04u)

/** Alias (User Manual Name) for GTM_ATOM5_CH4_SOMI.
 * To use register names with standard convension, please use GTM_ATOM5_CH4_SOMI.
 */
#define GTM_ATOM5_CH4_CTRL_SOMI        (GTM_ATOM5_CH4_SOMI)

/** \brief  EAA04, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM5_CH4_SOMC             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC *)0xF01EAA04u)

/** Alias (User Manual Name) for GTM_ATOM5_CH4_SOMC.
 * To use register names with standard convension, please use GTM_ATOM5_CH4_SOMC.
 */
#define GTM_ATOM5_CH4_CTRL_SOMC        (GTM_ATOM5_CH4_SOMC)

/** \brief  EAA04, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM5_CH4_SOMP             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP *)0xF01EAA04u)

/** Alias (User Manual Name) for GTM_ATOM5_CH4_SOMP.
 * To use register names with standard convension, please use GTM_ATOM5_CH4_SOMP.
 */
#define GTM_ATOM5_CH4_CTRL_SOMP        (GTM_ATOM5_CH4_SOMP)

/** \brief  EAA04, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM5_CH4_SOMS             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS *)0xF01EAA04u)

/** Alias (User Manual Name) for GTM_ATOM5_CH4_SOMS.
 * To use register names with standard convension, please use GTM_ATOM5_CH4_SOMS.
 */
#define GTM_ATOM5_CH4_CTRL_SOMS        (GTM_ATOM5_CH4_SOMS)

/** \brief  EAA04, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM5_CH4_SOMB             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB *)0xF01EAA04u)

/** Alias (User Manual Name) for GTM_ATOM5_CH4_SOMB.
 * To use register names with standard convension, please use GTM_ATOM5_CH4_SOMB.
 */
#define GTM_ATOM5_CH4_CTRL_SOMB        (GTM_ATOM5_CH4_SOMB)

/** \\brief  EAA08, ATOM channel 0 CCU0 compare shadow register */
#define GTM_ATOM5_CH4_SR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0 *)0xF01EAA08u)

/** \\brief  EAA0C, ATOM channel 0 CCU1 compare shadow register */
#define GTM_ATOM5_CH4_SR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1 *)0xF01EAA0Cu)

/** \\brief  EAA1C, ATOM channel 0 status register */
#define GTM_ATOM5_CH4_STAT             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT *)0xF01EAA1Cu)

/** \\brief  EAA90, ATOM channel 0 CCU0 compare register */
#define GTM_ATOM5_CH5_CM0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0 *)0xF01EAA90u)

/** \\brief  EAA94, ATOM channel 0 CCU1 compare register */
#define GTM_ATOM5_CH5_CM1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1 *)0xF01EAA94u)

