Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  EAA98, ATOM channel 0 CCU0 counter register */
#define GTM_ATOM5_CH5_CN0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0 *)0xF01EAA98u)

/** \\brief  EAAA4, ATOM channel 0 interrupt enable register */
#define GTM_ATOM5_CH5_IRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN *)0xF01EAAA4u)

/** \\brief  EAAA8, ATOM channel 0 software interrupt generation */
#define GTM_ATOM5_CH5_IRQ_FORCINT      /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT *)0xF01EAAA8u)

/** \\brief  EAAAC, ATOM channel 0 interrupt mode configuration register */
#define GTM_ATOM5_CH5_IRQ_MODE         /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE *)0xF01EAAACu)

/** \\brief  EAAA0, ATOM channel 0 interrupt notification register */
#define GTM_ATOM5_CH5_IRQ_NOTIFY       /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY *)0xF01EAAA0u)

/** \\brief  EAA80, ATOM channel 0 ARU read address register */
#define GTM_ATOM5_CH5_RDADDR           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR *)0xF01EAA80u)

/** \brief  EAA84, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM5_CH5_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL *)0xF01EAA84u)

/** \brief  EAA84, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM5_CH5_SOMI             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI *)0xF01EAA84u)

/** Alias (User Manual Name) for GTM_ATOM5_CH5_SOMI.
 * To use register names with standard convension, please use GTM_ATOM5_CH5_SOMI.
 */
#define GTM_ATOM5_CH5_CTRL_SOMI        (GTM_ATOM5_CH5_SOMI)

/** \brief  EAA84, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM5_CH5_SOMC             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC *)0xF01EAA84u)

/** Alias (User Manual Name) for GTM_ATOM5_CH5_SOMC.
 * To use register names with standard convension, please use GTM_ATOM5_CH5_SOMC.
 */
#define GTM_ATOM5_CH5_CTRL_SOMC        (GTM_ATOM5_CH5_SOMC)

/** \brief  EAA84, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM5_CH5_SOMP             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP *)0xF01EAA84u)

/** Alias (User Manual Name) for GTM_ATOM5_CH5_SOMP.
 * To use register names with standard convension, please use GTM_ATOM5_CH5_SOMP.
 */
#define GTM_ATOM5_CH5_CTRL_SOMP        (GTM_ATOM5_CH5_SOMP)

/** \brief  EAA84, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM5_CH5_SOMS             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS *)0xF01EAA84u)

/** Alias (User Manual Name) for GTM_ATOM5_CH5_SOMS.
 * To use register names with standard convension, please use GTM_ATOM5_CH5_SOMS.
 */
#define GTM_ATOM5_CH5_CTRL_SOMS        (GTM_ATOM5_CH5_SOMS)

/** \brief  EAA84, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM5_CH5_SOMB             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB *)0xF01EAA84u)

/** Alias (User Manual Name) for GTM_ATOM5_CH5_SOMB.
 * To use register names with standard convension, please use GTM_ATOM5_CH5_SOMB.
 */
#define GTM_ATOM5_CH5_CTRL_SOMB        (GTM_ATOM5_CH5_SOMB)

/** \\brief  EAA88, ATOM channel 0 CCU0 compare shadow register */
#define GTM_ATOM5_CH5_SR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0 *)0xF01EAA88u)

/** \\brief  EAA8C, ATOM channel 0 CCU1 compare shadow register */
#define GTM_ATOM5_CH5_SR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1 *)0xF01EAA8Cu)

/** \\brief  EAA9C, ATOM channel 0 status register */
#define GTM_ATOM5_CH5_STAT             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT *)0xF01EAA9Cu)

/** \\brief  EAB10, ATOM channel 0 CCU0 compare register */
#define GTM_ATOM5_CH6_CM0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0 *)0xF01EAB10u)

/** \\brief  EAB14, ATOM channel 0 CCU1 compare register */
#define GTM_ATOM5_CH6_CM1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1 *)0xF01EAB14u)

/** \\brief  EAB18, ATOM channel 0 CCU0 counter register */
#define GTM_ATOM5_CH6_CN0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0 *)0xF01EAB18u)

/** \\brief  EAB24, ATOM channel 0 interrupt enable register */
#define GTM_ATOM5_CH6_IRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN *)0xF01EAB24u)

/** \\brief  EAB28, ATOM channel 0 software interrupt generation */
#define GTM_ATOM5_CH6_IRQ_FORCINT      /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT *)0xF01EAB28u)

/** \\brief  EAB2C, ATOM channel 0 interrupt mode configuration register */
#define GTM_ATOM5_CH6_IRQ_MODE         /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE *)0xF01EAB2Cu)

/** \\brief  EAB20, ATOM channel 0 interrupt notification register */
#define GTM_ATOM5_CH6_IRQ_NOTIFY       /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY *)0xF01EAB20u)

/** \\brief  EAB00, ATOM channel 0 ARU read address register */
#define GTM_ATOM5_CH6_RDADDR           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR *)0xF01EAB00u)

/** \brief  EAB04, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM5_CH6_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL *)0xF01EAB04u)

/** \brief  EAB04, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM5_CH6_SOMI             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI *)0xF01EAB04u)

/** Alias (User Manual Name) for GTM_ATOM5_CH6_SOMI.
 * To use register names with standard convension, please use GTM_ATOM5_CH6_SOMI.
 */
#define GTM_ATOM5_CH6_CTRL_SOMI        (GTM_ATOM5_CH6_SOMI)

/** \brief  EAB04, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM5_CH6_SOMC             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC *)0xF01EAB04u)

/** Alias (User Manual Name) for GTM_ATOM5_CH6_SOMC.
 * To use register names with standard convension, please use GTM_ATOM5_CH6_SOMC.
 */
#define GTM_ATOM5_CH6_CTRL_SOMC        (GTM_ATOM5_CH6_SOMC)

/** \brief  EAB04, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM5_CH6_SOMP             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP *)0xF01EAB04u)

/** Alias (User Manual Name) for GTM_ATOM5_CH6_SOMP.
 * To use register names with standard convension, please use GTM_ATOM5_CH6_SOMP.
 */
#define GTM_ATOM5_CH6_CTRL_SOMP        (GTM_ATOM5_CH6_SOMP)

/** \brief  EAB04, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM5_CH6_SOMS             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS *)0xF01EAB04u)

/** Alias (User Manual Name) for GTM_ATOM5_CH6_SOMS.
 * To use register names with standard convension, please use GTM_ATOM5_CH6_SOMS.
 */
#define GTM_ATOM5_CH6_CTRL_SOMS        (GTM_ATOM5_CH6_SOMS)

/** \brief  EAB04, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM5_CH6_SOMB             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB *)0xF01EAB04u)

/** Alias (User Manual Name) for GTM_ATOM5_CH6_SOMB.
 * To use register names with standard convension, please use GTM_ATOM5_CH6_SOMB.
 */
#define GTM_ATOM5_CH6_CTRL_SOMB        (GTM_ATOM5_CH6_SOMB)

/** \\brief  EAB08, ATOM channel 0 CCU0 compare shadow register */
#define GTM_ATOM5_CH6_SR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0 *)0xF01EAB08u)

/** \\brief  EAB0C, ATOM channel 0 CCU1 compare shadow register */
#define GTM_ATOM5_CH6_SR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1 *)0xF01EAB0Cu)

/** \\brief  EAB1C, ATOM channel 0 status register */
#define GTM_ATOM5_CH6_STAT             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT *)0xF01EAB1Cu)

/** \\brief  EAB90, ATOM channel 0 CCU0 compare register */
#define GTM_ATOM5_CH7_CM0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0 *)0xF01EAB90u)

