Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  EAB94, ATOM channel 0 CCU1 compare register */
#define GTM_ATOM5_CH7_CM1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1 *)0xF01EAB94u)

/** \\brief  EAB98, ATOM channel 0 CCU0 counter register */
#define GTM_ATOM5_CH7_CN0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0 *)0xF01EAB98u)

/** \\brief  EABA4, ATOM channel 0 interrupt enable register */
#define GTM_ATOM5_CH7_IRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN *)0xF01EABA4u)

/** \\brief  EABA8, ATOM channel 0 software interrupt generation */
#define GTM_ATOM5_CH7_IRQ_FORCINT      /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT *)0xF01EABA8u)

/** \\brief  EABAC, ATOM channel 0 interrupt mode configuration register */
#define GTM_ATOM5_CH7_IRQ_MODE         /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE *)0xF01EABACu)

/** \\brief  EABA0, ATOM channel 0 interrupt notification register */
#define GTM_ATOM5_CH7_IRQ_NOTIFY       /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY *)0xF01EABA0u)

/** \\brief  EAB80, ATOM channel 0 ARU read address register */
#define GTM_ATOM5_CH7_RDADDR           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR *)0xF01EAB80u)

/** \brief  EAB84, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM5_CH7_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL *)0xF01EAB84u)

/** \brief  EAB84, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM5_CH7_SOMI             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI *)0xF01EAB84u)

/** Alias (User Manual Name) for GTM_ATOM5_CH7_SOMI.
 * To use register names with standard convension, please use GTM_ATOM5_CH7_SOMI.
 */
#define GTM_ATOM5_CH7_CTRL_SOMI        (GTM_ATOM5_CH7_SOMI)

/** \brief  EAB84, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM5_CH7_SOMC             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC *)0xF01EAB84u)

/** Alias (User Manual Name) for GTM_ATOM5_CH7_SOMC.
 * To use register names with standard convension, please use GTM_ATOM5_CH7_SOMC.
 */
#define GTM_ATOM5_CH7_CTRL_SOMC        (GTM_ATOM5_CH7_SOMC)

/** \brief  EAB84, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM5_CH7_SOMP             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP *)0xF01EAB84u)

/** Alias (User Manual Name) for GTM_ATOM5_CH7_SOMP.
 * To use register names with standard convension, please use GTM_ATOM5_CH7_SOMP.
 */
#define GTM_ATOM5_CH7_CTRL_SOMP        (GTM_ATOM5_CH7_SOMP)

/** \brief  EAB84, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM5_CH7_SOMS             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS *)0xF01EAB84u)

/** Alias (User Manual Name) for GTM_ATOM5_CH7_SOMS.
 * To use register names with standard convension, please use GTM_ATOM5_CH7_SOMS.
 */
#define GTM_ATOM5_CH7_CTRL_SOMS        (GTM_ATOM5_CH7_SOMS)

/** \brief  EAB84, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM5_CH7_SOMB             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB *)0xF01EAB84u)

/** Alias (User Manual Name) for GTM_ATOM5_CH7_SOMB.
 * To use register names with standard convension, please use GTM_ATOM5_CH7_SOMB.
 */
#define GTM_ATOM5_CH7_CTRL_SOMB        (GTM_ATOM5_CH7_SOMB)

/** \\brief  EAB88, ATOM channel 0 CCU0 compare shadow register */
#define GTM_ATOM5_CH7_SR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0 *)0xF01EAB88u)

/** \\brief  EAB8C, ATOM channel 0 CCU1 compare shadow register */
#define GTM_ATOM5_CH7_SR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1 *)0xF01EAB8Cu)

/** \\brief  EAB9C, ATOM channel 0 status register */
#define GTM_ATOM5_CH7_STAT             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT *)0xF01EAB9Cu)

/** \\brief  EB04C, ATOM AGC action time base register */
#define GTM_ATOM6_AGC_ACT_TB           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_ACT_TB *)0xF01EB04Cu)

/** \\brief  EB044, ATOM AGC enable/disable control register */
#define GTM_ATOM6_AGC_ENDIS_CTRL       /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_ENDIS_CTRL *)0xF01EB044u)

/** \\brief  EB048, ATOM AGC enable/disable status register */
#define GTM_ATOM6_AGC_ENDIS_STAT       /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_ENDIS_STAT *)0xF01EB048u)

/** \\brief  EB058, ATOM AGC force update control register */
#define GTM_ATOM6_AGC_FUPD_CTRL        /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_FUPD_CTRL *)0xF01EB058u)

/** \\brief  EB040, ATOM AGC global control register */
#define GTM_ATOM6_AGC_GLB_CTRL         /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_GLB_CTRL *)0xF01EB040u)

/** \\brief  EB05C, ATOM AGC internal trigger control register */
#define GTM_ATOM6_AGC_INT_TRIG         /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_INT_TRIG *)0xF01EB05Cu)

/** \\brief  EB050, ATOM AGC output enable control register */
#define GTM_ATOM6_AGC_OUTEN_CTRL       /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_OUTEN_CTRL *)0xF01EB050u)

/** \\brief  EB054, ATOM AGC output enable status register */
#define GTM_ATOM6_AGC_OUTEN_STAT       /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_OUTEN_STAT *)0xF01EB054u)

/** \\brief  EB010, ATOM channel 0 CCU0 compare register */
#define GTM_ATOM6_CH0_CM0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0 *)0xF01EB010u)

/** \\brief  EB014, ATOM channel 0 CCU1 compare register */
#define GTM_ATOM6_CH0_CM1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1 *)0xF01EB014u)

/** \\brief  EB018, ATOM channel 0 CCU0 counter register */
#define GTM_ATOM6_CH0_CN0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0 *)0xF01EB018u)

/** \\brief  EB024, ATOM channel 0 interrupt enable register */
#define GTM_ATOM6_CH0_IRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN *)0xF01EB024u)

/** \\brief  EB028, ATOM channel 0 software interrupt generation */
#define GTM_ATOM6_CH0_IRQ_FORCINT      /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT *)0xF01EB028u)

/** \\brief  EB02C, ATOM channel 0 interrupt mode configuration register */
#define GTM_ATOM6_CH0_IRQ_MODE         /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE *)0xF01EB02Cu)

/** \\brief  EB020, ATOM channel 0 interrupt notification register */
#define GTM_ATOM6_CH0_IRQ_NOTIFY       /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY *)0xF01EB020u)

/** \\brief  EB000, ATOM channel 0 ARU read address register */
#define GTM_ATOM6_CH0_RDADDR           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR *)0xF01EB000u)

/** \brief  EB004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM6_CH0_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL *)0xF01EB004u)

/** \brief  EB004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM6_CH0_SOMI             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI *)0xF01EB004u)

/** Alias (User Manual Name) for GTM_ATOM6_CH0_SOMI.
 * To use register names with standard convension, please use GTM_ATOM6_CH0_SOMI.
 */
#define GTM_ATOM6_CH0_CTRL_SOMI        (GTM_ATOM6_CH0_SOMI)

/** \brief  EB004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM6_CH0_SOMC             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC *)0xF01EB004u)

