Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** Alias (User Manual Name) for GTM_ATOM6_CH0_SOMC.
 * To use register names with standard convension, please use GTM_ATOM6_CH0_SOMC.
 */
#define GTM_ATOM6_CH0_CTRL_SOMC        (GTM_ATOM6_CH0_SOMC)

/** \brief  EB004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM6_CH0_SOMP             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP *)0xF01EB004u)

/** Alias (User Manual Name) for GTM_ATOM6_CH0_SOMP.
 * To use register names with standard convension, please use GTM_ATOM6_CH0_SOMP.
 */
#define GTM_ATOM6_CH0_CTRL_SOMP        (GTM_ATOM6_CH0_SOMP)

/** \brief  EB004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM6_CH0_SOMS             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS *)0xF01EB004u)

/** Alias (User Manual Name) for GTM_ATOM6_CH0_SOMS.
 * To use register names with standard convension, please use GTM_ATOM6_CH0_SOMS.
 */
#define GTM_ATOM6_CH0_CTRL_SOMS        (GTM_ATOM6_CH0_SOMS)

/** \brief  EB004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM6_CH0_SOMB             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB *)0xF01EB004u)

/** Alias (User Manual Name) for GTM_ATOM6_CH0_SOMB.
 * To use register names with standard convension, please use GTM_ATOM6_CH0_SOMB.
 */
#define GTM_ATOM6_CH0_CTRL_SOMB        (GTM_ATOM6_CH0_SOMB)

/** \\brief  EB008, ATOM channel 0 CCU0 compare shadow register */
#define GTM_ATOM6_CH0_SR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0 *)0xF01EB008u)

/** \\brief  EB00C, ATOM channel 0 CCU1 compare shadow register */
#define GTM_ATOM6_CH0_SR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1 *)0xF01EB00Cu)

/** \\brief  EB01C, ATOM channel 0 status register */
#define GTM_ATOM6_CH0_STAT             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT *)0xF01EB01Cu)

/** \\brief  EB090, ATOM channel 0 CCU0 compare register */
#define GTM_ATOM6_CH1_CM0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0 *)0xF01EB090u)

/** \\brief  EB094, ATOM channel 0 CCU1 compare register */
#define GTM_ATOM6_CH1_CM1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1 *)0xF01EB094u)

/** \\brief  EB098, ATOM channel 0 CCU0 counter register */
#define GTM_ATOM6_CH1_CN0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0 *)0xF01EB098u)

/** \\brief  EB0A4, ATOM channel 0 interrupt enable register */
#define GTM_ATOM6_CH1_IRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN *)0xF01EB0A4u)

/** \\brief  EB0A8, ATOM channel 0 software interrupt generation */
#define GTM_ATOM6_CH1_IRQ_FORCINT      /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT *)0xF01EB0A8u)

/** \\brief  EB0AC, ATOM channel 0 interrupt mode configuration register */
#define GTM_ATOM6_CH1_IRQ_MODE         /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE *)0xF01EB0ACu)

/** \\brief  EB0A0, ATOM channel 0 interrupt notification register */
#define GTM_ATOM6_CH1_IRQ_NOTIFY       /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY *)0xF01EB0A0u)

/** \\brief  EB080, ATOM channel 0 ARU read address register */
#define GTM_ATOM6_CH1_RDADDR           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR *)0xF01EB080u)

/** \brief  EB084, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM6_CH1_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL *)0xF01EB084u)

/** \brief  EB084, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM6_CH1_SOMI             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI *)0xF01EB084u)

/** Alias (User Manual Name) for GTM_ATOM6_CH1_SOMI.
 * To use register names with standard convension, please use GTM_ATOM6_CH1_SOMI.
 */
#define GTM_ATOM6_CH1_CTRL_SOMI        (GTM_ATOM6_CH1_SOMI)

/** \brief  EB084, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM6_CH1_SOMC             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC *)0xF01EB084u)

/** Alias (User Manual Name) for GTM_ATOM6_CH1_SOMC.
 * To use register names with standard convension, please use GTM_ATOM6_CH1_SOMC.
 */
#define GTM_ATOM6_CH1_CTRL_SOMC        (GTM_ATOM6_CH1_SOMC)

/** \brief  EB084, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM6_CH1_SOMP             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP *)0xF01EB084u)

/** Alias (User Manual Name) for GTM_ATOM6_CH1_SOMP.
 * To use register names with standard convension, please use GTM_ATOM6_CH1_SOMP.
 */
#define GTM_ATOM6_CH1_CTRL_SOMP        (GTM_ATOM6_CH1_SOMP)

/** \brief  EB084, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM6_CH1_SOMS             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS *)0xF01EB084u)

/** Alias (User Manual Name) for GTM_ATOM6_CH1_SOMS.
 * To use register names with standard convension, please use GTM_ATOM6_CH1_SOMS.
 */
#define GTM_ATOM6_CH1_CTRL_SOMS        (GTM_ATOM6_CH1_SOMS)

/** \brief  EB084, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM6_CH1_SOMB             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB *)0xF01EB084u)

/** Alias (User Manual Name) for GTM_ATOM6_CH1_SOMB.
 * To use register names with standard convension, please use GTM_ATOM6_CH1_SOMB.
 */
#define GTM_ATOM6_CH1_CTRL_SOMB        (GTM_ATOM6_CH1_SOMB)

/** \\brief  EB088, ATOM channel 0 CCU0 compare shadow register */
#define GTM_ATOM6_CH1_SR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0 *)0xF01EB088u)

/** \\brief  EB08C, ATOM channel 0 CCU1 compare shadow register */
#define GTM_ATOM6_CH1_SR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1 *)0xF01EB08Cu)

/** \\brief  EB09C, ATOM channel 0 status register */
#define GTM_ATOM6_CH1_STAT             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT *)0xF01EB09Cu)

/** \\brief  EB110, ATOM channel 0 CCU0 compare register */
#define GTM_ATOM6_CH2_CM0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0 *)0xF01EB110u)

/** \\brief  EB114, ATOM channel 0 CCU1 compare register */
#define GTM_ATOM6_CH2_CM1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1 *)0xF01EB114u)

