Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  EB118, ATOM channel 0 CCU0 counter register */
#define GTM_ATOM6_CH2_CN0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0 *)0xF01EB118u)

/** \\brief  EB124, ATOM channel 0 interrupt enable register */
#define GTM_ATOM6_CH2_IRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN *)0xF01EB124u)

/** \\brief  EB128, ATOM channel 0 software interrupt generation */
#define GTM_ATOM6_CH2_IRQ_FORCINT      /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT *)0xF01EB128u)

/** \\brief  EB12C, ATOM channel 0 interrupt mode configuration register */
#define GTM_ATOM6_CH2_IRQ_MODE         /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE *)0xF01EB12Cu)

/** \\brief  EB120, ATOM channel 0 interrupt notification register */
#define GTM_ATOM6_CH2_IRQ_NOTIFY       /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY *)0xF01EB120u)

/** \\brief  EB100, ATOM channel 0 ARU read address register */
#define GTM_ATOM6_CH2_RDADDR           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR *)0xF01EB100u)

/** \brief  EB104, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM6_CH2_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL *)0xF01EB104u)

/** \brief  EB104, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM6_CH2_SOMI             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI *)0xF01EB104u)

/** Alias (User Manual Name) for GTM_ATOM6_CH2_SOMI.
 * To use register names with standard convension, please use GTM_ATOM6_CH2_SOMI.
 */
#define GTM_ATOM6_CH2_CTRL_SOMI        (GTM_ATOM6_CH2_SOMI)

/** \brief  EB104, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM6_CH2_SOMC             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC *)0xF01EB104u)

/** Alias (User Manual Name) for GTM_ATOM6_CH2_SOMC.
 * To use register names with standard convension, please use GTM_ATOM6_CH2_SOMC.
 */
#define GTM_ATOM6_CH2_CTRL_SOMC        (GTM_ATOM6_CH2_SOMC)

/** \brief  EB104, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM6_CH2_SOMP             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP *)0xF01EB104u)

/** Alias (User Manual Name) for GTM_ATOM6_CH2_SOMP.
 * To use register names with standard convension, please use GTM_ATOM6_CH2_SOMP.
 */
#define GTM_ATOM6_CH2_CTRL_SOMP        (GTM_ATOM6_CH2_SOMP)

/** \brief  EB104, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM6_CH2_SOMS             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS *)0xF01EB104u)

/** Alias (User Manual Name) for GTM_ATOM6_CH2_SOMS.
 * To use register names with standard convension, please use GTM_ATOM6_CH2_SOMS.
 */
#define GTM_ATOM6_CH2_CTRL_SOMS        (GTM_ATOM6_CH2_SOMS)

/** \brief  EB104, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM6_CH2_SOMB             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB *)0xF01EB104u)

/** Alias (User Manual Name) for GTM_ATOM6_CH2_SOMB.
 * To use register names with standard convension, please use GTM_ATOM6_CH2_SOMB.
 */
#define GTM_ATOM6_CH2_CTRL_SOMB        (GTM_ATOM6_CH2_SOMB)

/** \\brief  EB108, ATOM channel 0 CCU0 compare shadow register */
#define GTM_ATOM6_CH2_SR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0 *)0xF01EB108u)

/** \\brief  EB10C, ATOM channel 0 CCU1 compare shadow register */
#define GTM_ATOM6_CH2_SR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1 *)0xF01EB10Cu)

/** \\brief  EB11C, ATOM channel 0 status register */
#define GTM_ATOM6_CH2_STAT             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT *)0xF01EB11Cu)

/** \\brief  EB190, ATOM channel 0 CCU0 compare register */
#define GTM_ATOM6_CH3_CM0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0 *)0xF01EB190u)

/** \\brief  EB194, ATOM channel 0 CCU1 compare register */
#define GTM_ATOM6_CH3_CM1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1 *)0xF01EB194u)

/** \\brief  EB198, ATOM channel 0 CCU0 counter register */
#define GTM_ATOM6_CH3_CN0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0 *)0xF01EB198u)

/** \\brief  EB1A4, ATOM channel 0 interrupt enable register */
#define GTM_ATOM6_CH3_IRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN *)0xF01EB1A4u)

/** \\brief  EB1A8, ATOM channel 0 software interrupt generation */
#define GTM_ATOM6_CH3_IRQ_FORCINT      /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT *)0xF01EB1A8u)

/** \\brief  EB1AC, ATOM channel 0 interrupt mode configuration register */
#define GTM_ATOM6_CH3_IRQ_MODE         /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE *)0xF01EB1ACu)

/** \\brief  EB1A0, ATOM channel 0 interrupt notification register */
#define GTM_ATOM6_CH3_IRQ_NOTIFY       /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY *)0xF01EB1A0u)

/** \\brief  EB180, ATOM channel 0 ARU read address register */
#define GTM_ATOM6_CH3_RDADDR           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR *)0xF01EB180u)

/** \brief  EB184, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM6_CH3_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL *)0xF01EB184u)

/** \brief  EB184, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM6_CH3_SOMI             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI *)0xF01EB184u)

/** Alias (User Manual Name) for GTM_ATOM6_CH3_SOMI.
 * To use register names with standard convension, please use GTM_ATOM6_CH3_SOMI.
 */
#define GTM_ATOM6_CH3_CTRL_SOMI        (GTM_ATOM6_CH3_SOMI)

/** \brief  EB184, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM6_CH3_SOMC             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC *)0xF01EB184u)

/** Alias (User Manual Name) for GTM_ATOM6_CH3_SOMC.
 * To use register names with standard convension, please use GTM_ATOM6_CH3_SOMC.
 */
#define GTM_ATOM6_CH3_CTRL_SOMC        (GTM_ATOM6_CH3_SOMC)

/** \brief  EB184, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM6_CH3_SOMP             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP *)0xF01EB184u)

/** Alias (User Manual Name) for GTM_ATOM6_CH3_SOMP.
 * To use register names with standard convension, please use GTM_ATOM6_CH3_SOMP.
 */
#define GTM_ATOM6_CH3_CTRL_SOMP        (GTM_ATOM6_CH3_SOMP)

/** \brief  EB184, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM6_CH3_SOMS             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS *)0xF01EB184u)

