Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** Alias (User Manual Name) for GTM_ATOM6_CH3_SOMS.
 * To use register names with standard convension, please use GTM_ATOM6_CH3_SOMS.
 */
#define GTM_ATOM6_CH3_CTRL_SOMS        (GTM_ATOM6_CH3_SOMS)

/** \brief  EB184, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM6_CH3_SOMB             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB *)0xF01EB184u)

/** Alias (User Manual Name) for GTM_ATOM6_CH3_SOMB.
 * To use register names with standard convension, please use GTM_ATOM6_CH3_SOMB.
 */
#define GTM_ATOM6_CH3_CTRL_SOMB        (GTM_ATOM6_CH3_SOMB)

/** \\brief  EB188, ATOM channel 0 CCU0 compare shadow register */
#define GTM_ATOM6_CH3_SR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0 *)0xF01EB188u)

/** \\brief  EB18C, ATOM channel 0 CCU1 compare shadow register */
#define GTM_ATOM6_CH3_SR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1 *)0xF01EB18Cu)

/** \\brief  EB19C, ATOM channel 0 status register */
#define GTM_ATOM6_CH3_STAT             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT *)0xF01EB19Cu)

/** \\brief  EB210, ATOM channel 0 CCU0 compare register */
#define GTM_ATOM6_CH4_CM0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0 *)0xF01EB210u)

/** \\brief  EB214, ATOM channel 0 CCU1 compare register */
#define GTM_ATOM6_CH4_CM1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1 *)0xF01EB214u)

/** \\brief  EB218, ATOM channel 0 CCU0 counter register */
#define GTM_ATOM6_CH4_CN0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0 *)0xF01EB218u)

/** \\brief  EB224, ATOM channel 0 interrupt enable register */
#define GTM_ATOM6_CH4_IRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN *)0xF01EB224u)

/** \\brief  EB228, ATOM channel 0 software interrupt generation */
#define GTM_ATOM6_CH4_IRQ_FORCINT      /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT *)0xF01EB228u)

/** \\brief  EB22C, ATOM channel 0 interrupt mode configuration register */
#define GTM_ATOM6_CH4_IRQ_MODE         /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE *)0xF01EB22Cu)

/** \\brief  EB220, ATOM channel 0 interrupt notification register */
#define GTM_ATOM6_CH4_IRQ_NOTIFY       /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY *)0xF01EB220u)

/** \\brief  EB200, ATOM channel 0 ARU read address register */
#define GTM_ATOM6_CH4_RDADDR           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR *)0xF01EB200u)

/** \brief  EB204, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM6_CH4_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL *)0xF01EB204u)

/** \brief  EB204, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM6_CH4_SOMI             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI *)0xF01EB204u)

/** Alias (User Manual Name) for GTM_ATOM6_CH4_SOMI.
 * To use register names with standard convension, please use GTM_ATOM6_CH4_SOMI.
 */
#define GTM_ATOM6_CH4_CTRL_SOMI        (GTM_ATOM6_CH4_SOMI)

/** \brief  EB204, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM6_CH4_SOMC             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC *)0xF01EB204u)

/** Alias (User Manual Name) for GTM_ATOM6_CH4_SOMC.
 * To use register names with standard convension, please use GTM_ATOM6_CH4_SOMC.
 */
#define GTM_ATOM6_CH4_CTRL_SOMC        (GTM_ATOM6_CH4_SOMC)

/** \brief  EB204, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM6_CH4_SOMP             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP *)0xF01EB204u)

/** Alias (User Manual Name) for GTM_ATOM6_CH4_SOMP.
 * To use register names with standard convension, please use GTM_ATOM6_CH4_SOMP.
 */
#define GTM_ATOM6_CH4_CTRL_SOMP        (GTM_ATOM6_CH4_SOMP)

/** \brief  EB204, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM6_CH4_SOMS             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS *)0xF01EB204u)

/** Alias (User Manual Name) for GTM_ATOM6_CH4_SOMS.
 * To use register names with standard convension, please use GTM_ATOM6_CH4_SOMS.
 */
#define GTM_ATOM6_CH4_CTRL_SOMS        (GTM_ATOM6_CH4_SOMS)

/** \brief  EB204, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM6_CH4_SOMB             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB *)0xF01EB204u)

/** Alias (User Manual Name) for GTM_ATOM6_CH4_SOMB.
 * To use register names with standard convension, please use GTM_ATOM6_CH4_SOMB.
 */
#define GTM_ATOM6_CH4_CTRL_SOMB        (GTM_ATOM6_CH4_SOMB)

/** \\brief  EB208, ATOM channel 0 CCU0 compare shadow register */
#define GTM_ATOM6_CH4_SR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0 *)0xF01EB208u)

/** \\brief  EB20C, ATOM channel 0 CCU1 compare shadow register */
#define GTM_ATOM6_CH4_SR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1 *)0xF01EB20Cu)

/** \\brief  EB21C, ATOM channel 0 status register */
#define GTM_ATOM6_CH4_STAT             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT *)0xF01EB21Cu)

/** \\brief  EB290, ATOM channel 0 CCU0 compare register */
#define GTM_ATOM6_CH5_CM0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0 *)0xF01EB290u)

/** \\brief  EB294, ATOM channel 0 CCU1 compare register */
#define GTM_ATOM6_CH5_CM1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1 *)0xF01EB294u)

/** \\brief  EB298, ATOM channel 0 CCU0 counter register */
#define GTM_ATOM6_CH5_CN0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0 *)0xF01EB298u)

/** \\brief  EB2A4, ATOM channel 0 interrupt enable register */
#define GTM_ATOM6_CH5_IRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN *)0xF01EB2A4u)

/** \\brief  EB2A8, ATOM channel 0 software interrupt generation */
#define GTM_ATOM6_CH5_IRQ_FORCINT      /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT *)0xF01EB2A8u)

/** \\brief  EB2AC, ATOM channel 0 interrupt mode configuration register */
#define GTM_ATOM6_CH5_IRQ_MODE         /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE *)0xF01EB2ACu)

/** \\brief  EB2A0, ATOM channel 0 interrupt notification register */
#define GTM_ATOM6_CH5_IRQ_NOTIFY       /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY *)0xF01EB2A0u)

