Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  EB280, ATOM channel 0 ARU read address register */
#define GTM_ATOM6_CH5_RDADDR           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR *)0xF01EB280u)

/** \brief  EB284, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM6_CH5_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL *)0xF01EB284u)

/** \brief  EB284, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM6_CH5_SOMI             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI *)0xF01EB284u)

/** Alias (User Manual Name) for GTM_ATOM6_CH5_SOMI.
 * To use register names with standard convension, please use GTM_ATOM6_CH5_SOMI.
 */
#define GTM_ATOM6_CH5_CTRL_SOMI        (GTM_ATOM6_CH5_SOMI)

/** \brief  EB284, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM6_CH5_SOMC             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC *)0xF01EB284u)

/** Alias (User Manual Name) for GTM_ATOM6_CH5_SOMC.
 * To use register names with standard convension, please use GTM_ATOM6_CH5_SOMC.
 */
#define GTM_ATOM6_CH5_CTRL_SOMC        (GTM_ATOM6_CH5_SOMC)

/** \brief  EB284, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM6_CH5_SOMP             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP *)0xF01EB284u)

/** Alias (User Manual Name) for GTM_ATOM6_CH5_SOMP.
 * To use register names with standard convension, please use GTM_ATOM6_CH5_SOMP.
 */
#define GTM_ATOM6_CH5_CTRL_SOMP        (GTM_ATOM6_CH5_SOMP)

/** \brief  EB284, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM6_CH5_SOMS             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS *)0xF01EB284u)

/** Alias (User Manual Name) for GTM_ATOM6_CH5_SOMS.
 * To use register names with standard convension, please use GTM_ATOM6_CH5_SOMS.
 */
#define GTM_ATOM6_CH5_CTRL_SOMS        (GTM_ATOM6_CH5_SOMS)

/** \brief  EB284, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM6_CH5_SOMB             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB *)0xF01EB284u)

/** Alias (User Manual Name) for GTM_ATOM6_CH5_SOMB.
 * To use register names with standard convension, please use GTM_ATOM6_CH5_SOMB.
 */
#define GTM_ATOM6_CH5_CTRL_SOMB        (GTM_ATOM6_CH5_SOMB)

/** \\brief  EB288, ATOM channel 0 CCU0 compare shadow register */
#define GTM_ATOM6_CH5_SR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0 *)0xF01EB288u)

/** \\brief  EB28C, ATOM channel 0 CCU1 compare shadow register */
#define GTM_ATOM6_CH5_SR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1 *)0xF01EB28Cu)

/** \\brief  EB29C, ATOM channel 0 status register */
#define GTM_ATOM6_CH5_STAT             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT *)0xF01EB29Cu)

/** \\brief  EB310, ATOM channel 0 CCU0 compare register */
#define GTM_ATOM6_CH6_CM0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0 *)0xF01EB310u)

/** \\brief  EB314, ATOM channel 0 CCU1 compare register */
#define GTM_ATOM6_CH6_CM1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1 *)0xF01EB314u)

/** \\brief  EB318, ATOM channel 0 CCU0 counter register */
#define GTM_ATOM6_CH6_CN0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0 *)0xF01EB318u)

/** \\brief  EB324, ATOM channel 0 interrupt enable register */
#define GTM_ATOM6_CH6_IRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN *)0xF01EB324u)

/** \\brief  EB328, ATOM channel 0 software interrupt generation */
#define GTM_ATOM6_CH6_IRQ_FORCINT      /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT *)0xF01EB328u)

/** \\brief  EB32C, ATOM channel 0 interrupt mode configuration register */
#define GTM_ATOM6_CH6_IRQ_MODE         /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE *)0xF01EB32Cu)

/** \\brief  EB320, ATOM channel 0 interrupt notification register */
#define GTM_ATOM6_CH6_IRQ_NOTIFY       /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY *)0xF01EB320u)

/** \\brief  EB300, ATOM channel 0 ARU read address register */
#define GTM_ATOM6_CH6_RDADDR           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR *)0xF01EB300u)

/** \brief  EB304, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM6_CH6_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL *)0xF01EB304u)

/** \brief  EB304, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM6_CH6_SOMI             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI *)0xF01EB304u)

/** Alias (User Manual Name) for GTM_ATOM6_CH6_SOMI.
 * To use register names with standard convension, please use GTM_ATOM6_CH6_SOMI.
 */
#define GTM_ATOM6_CH6_CTRL_SOMI        (GTM_ATOM6_CH6_SOMI)

/** \brief  EB304, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM6_CH6_SOMC             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC *)0xF01EB304u)

/** Alias (User Manual Name) for GTM_ATOM6_CH6_SOMC.
 * To use register names with standard convension, please use GTM_ATOM6_CH6_SOMC.
 */
#define GTM_ATOM6_CH6_CTRL_SOMC        (GTM_ATOM6_CH6_SOMC)

/** \brief  EB304, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM6_CH6_SOMP             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP *)0xF01EB304u)

/** Alias (User Manual Name) for GTM_ATOM6_CH6_SOMP.
 * To use register names with standard convension, please use GTM_ATOM6_CH6_SOMP.
 */
#define GTM_ATOM6_CH6_CTRL_SOMP        (GTM_ATOM6_CH6_SOMP)

/** \brief  EB304, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM6_CH6_SOMS             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS *)0xF01EB304u)

/** Alias (User Manual Name) for GTM_ATOM6_CH6_SOMS.
 * To use register names with standard convension, please use GTM_ATOM6_CH6_SOMS.
 */
#define GTM_ATOM6_CH6_CTRL_SOMS        (GTM_ATOM6_CH6_SOMS)

/** \brief  EB304, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM6_CH6_SOMB             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB *)0xF01EB304u)

/** Alias (User Manual Name) for GTM_ATOM6_CH6_SOMB.
 * To use register names with standard convension, please use GTM_ATOM6_CH6_SOMB.
 */
#define GTM_ATOM6_CH6_CTRL_SOMB        (GTM_ATOM6_CH6_SOMB)

