Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  EB308, ATOM channel 0 CCU0 compare shadow register */
#define GTM_ATOM6_CH6_SR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0 *)0xF01EB308u)

/** \\brief  EB30C, ATOM channel 0 CCU1 compare shadow register */
#define GTM_ATOM6_CH6_SR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1 *)0xF01EB30Cu)

/** \\brief  EB31C, ATOM channel 0 status register */
#define GTM_ATOM6_CH6_STAT             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT *)0xF01EB31Cu)

/** \\brief  EB390, ATOM channel 0 CCU0 compare register */
#define GTM_ATOM6_CH7_CM0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0 *)0xF01EB390u)

/** \\brief  EB394, ATOM channel 0 CCU1 compare register */
#define GTM_ATOM6_CH7_CM1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1 *)0xF01EB394u)

/** \\brief  EB398, ATOM channel 0 CCU0 counter register */
#define GTM_ATOM6_CH7_CN0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0 *)0xF01EB398u)

/** \\brief  EB3A4, ATOM channel 0 interrupt enable register */
#define GTM_ATOM6_CH7_IRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN *)0xF01EB3A4u)

/** \\brief  EB3A8, ATOM channel 0 software interrupt generation */
#define GTM_ATOM6_CH7_IRQ_FORCINT      /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT *)0xF01EB3A8u)

/** \\brief  EB3AC, ATOM channel 0 interrupt mode configuration register */
#define GTM_ATOM6_CH7_IRQ_MODE         /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE *)0xF01EB3ACu)

/** \\brief  EB3A0, ATOM channel 0 interrupt notification register */
#define GTM_ATOM6_CH7_IRQ_NOTIFY       /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY *)0xF01EB3A0u)

/** \\brief  EB380, ATOM channel 0 ARU read address register */
#define GTM_ATOM6_CH7_RDADDR           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR *)0xF01EB380u)

/** \brief  EB384, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM6_CH7_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL *)0xF01EB384u)

/** \brief  EB384, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM6_CH7_SOMI             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI *)0xF01EB384u)

/** Alias (User Manual Name) for GTM_ATOM6_CH7_SOMI.
 * To use register names with standard convension, please use GTM_ATOM6_CH7_SOMI.
 */
#define GTM_ATOM6_CH7_CTRL_SOMI        (GTM_ATOM6_CH7_SOMI)

/** \brief  EB384, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM6_CH7_SOMC             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC *)0xF01EB384u)

/** Alias (User Manual Name) for GTM_ATOM6_CH7_SOMC.
 * To use register names with standard convension, please use GTM_ATOM6_CH7_SOMC.
 */
#define GTM_ATOM6_CH7_CTRL_SOMC        (GTM_ATOM6_CH7_SOMC)

/** \brief  EB384, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM6_CH7_SOMP             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP *)0xF01EB384u)

/** Alias (User Manual Name) for GTM_ATOM6_CH7_SOMP.
 * To use register names with standard convension, please use GTM_ATOM6_CH7_SOMP.
 */
#define GTM_ATOM6_CH7_CTRL_SOMP        (GTM_ATOM6_CH7_SOMP)

/** \brief  EB384, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM6_CH7_SOMS             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS *)0xF01EB384u)

/** Alias (User Manual Name) for GTM_ATOM6_CH7_SOMS.
 * To use register names with standard convension, please use GTM_ATOM6_CH7_SOMS.
 */
#define GTM_ATOM6_CH7_CTRL_SOMS        (GTM_ATOM6_CH7_SOMS)

/** \brief  EB384, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM6_CH7_SOMB             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB *)0xF01EB384u)

/** Alias (User Manual Name) for GTM_ATOM6_CH7_SOMB.
 * To use register names with standard convension, please use GTM_ATOM6_CH7_SOMB.
 */
#define GTM_ATOM6_CH7_CTRL_SOMB        (GTM_ATOM6_CH7_SOMB)

/** \\brief  EB388, ATOM channel 0 CCU0 compare shadow register */
#define GTM_ATOM6_CH7_SR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0 *)0xF01EB388u)

/** \\brief  EB38C, ATOM channel 0 CCU1 compare shadow register */
#define GTM_ATOM6_CH7_SR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1 *)0xF01EB38Cu)

/** \\brief  EB39C, ATOM channel 0 status register */
#define GTM_ATOM6_CH7_STAT             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT *)0xF01EB39Cu)

/** \\brief  EB84C, ATOM AGC action time base register */
#define GTM_ATOM7_AGC_ACT_TB           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_ACT_TB *)0xF01EB84Cu)

/** \\brief  EB844, ATOM AGC enable/disable control register */
#define GTM_ATOM7_AGC_ENDIS_CTRL       /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_ENDIS_CTRL *)0xF01EB844u)

/** \\brief  EB848, ATOM AGC enable/disable status register */
#define GTM_ATOM7_AGC_ENDIS_STAT       /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_ENDIS_STAT *)0xF01EB848u)

/** \\brief  EB858, ATOM AGC force update control register */
#define GTM_ATOM7_AGC_FUPD_CTRL        /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_FUPD_CTRL *)0xF01EB858u)

/** \\brief  EB840, ATOM AGC global control register */
#define GTM_ATOM7_AGC_GLB_CTRL         /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_GLB_CTRL *)0xF01EB840u)

/** \\brief  EB85C, ATOM AGC internal trigger control register */
#define GTM_ATOM7_AGC_INT_TRIG         /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_INT_TRIG *)0xF01EB85Cu)

/** \\brief  EB850, ATOM AGC output enable control register */
#define GTM_ATOM7_AGC_OUTEN_CTRL       /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_OUTEN_CTRL *)0xF01EB850u)

/** \\brief  EB854, ATOM AGC output enable status register */
#define GTM_ATOM7_AGC_OUTEN_STAT       /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_OUTEN_STAT *)0xF01EB854u)

/** \\brief  EB810, ATOM channel 0 CCU0 compare register */
#define GTM_ATOM7_CH0_CM0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0 *)0xF01EB810u)

/** \\brief  EB814, ATOM channel 0 CCU1 compare register */
#define GTM_ATOM7_CH0_CM1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1 *)0xF01EB814u)

/** \\brief  EB818, ATOM channel 0 CCU0 counter register */
#define GTM_ATOM7_CH0_CN0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0 *)0xF01EB818u)

/** \\brief  EB824, ATOM channel 0 interrupt enable register */
#define GTM_ATOM7_CH0_IRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN *)0xF01EB824u)

/** \\brief  EB828, ATOM channel 0 software interrupt generation */
#define GTM_ATOM7_CH0_IRQ_FORCINT      /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT *)0xF01EB828u)

