Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  EB82C, ATOM channel 0 interrupt mode configuration register */
#define GTM_ATOM7_CH0_IRQ_MODE         /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE *)0xF01EB82Cu)

/** \\brief  EB820, ATOM channel 0 interrupt notification register */
#define GTM_ATOM7_CH0_IRQ_NOTIFY       /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY *)0xF01EB820u)

/** \\brief  EB800, ATOM channel 0 ARU read address register */
#define GTM_ATOM7_CH0_RDADDR           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR *)0xF01EB800u)

/** \brief  EB804, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM7_CH0_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL *)0xF01EB804u)

/** \brief  EB804, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM7_CH0_SOMI             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI *)0xF01EB804u)

/** Alias (User Manual Name) for GTM_ATOM7_CH0_SOMI.
 * To use register names with standard convension, please use GTM_ATOM7_CH0_SOMI.
 */
#define GTM_ATOM7_CH0_CTRL_SOMI        (GTM_ATOM7_CH0_SOMI)

/** \brief  EB804, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM7_CH0_SOMC             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC *)0xF01EB804u)

/** Alias (User Manual Name) for GTM_ATOM7_CH0_SOMC.
 * To use register names with standard convension, please use GTM_ATOM7_CH0_SOMC.
 */
#define GTM_ATOM7_CH0_CTRL_SOMC        (GTM_ATOM7_CH0_SOMC)

/** \brief  EB804, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM7_CH0_SOMP             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP *)0xF01EB804u)

/** Alias (User Manual Name) for GTM_ATOM7_CH0_SOMP.
 * To use register names with standard convension, please use GTM_ATOM7_CH0_SOMP.
 */
#define GTM_ATOM7_CH0_CTRL_SOMP        (GTM_ATOM7_CH0_SOMP)

/** \brief  EB804, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM7_CH0_SOMS             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS *)0xF01EB804u)

/** Alias (User Manual Name) for GTM_ATOM7_CH0_SOMS.
 * To use register names with standard convension, please use GTM_ATOM7_CH0_SOMS.
 */
#define GTM_ATOM7_CH0_CTRL_SOMS        (GTM_ATOM7_CH0_SOMS)

/** \brief  EB804, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM7_CH0_SOMB             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB *)0xF01EB804u)

/** Alias (User Manual Name) for GTM_ATOM7_CH0_SOMB.
 * To use register names with standard convension, please use GTM_ATOM7_CH0_SOMB.
 */
#define GTM_ATOM7_CH0_CTRL_SOMB        (GTM_ATOM7_CH0_SOMB)

/** \\brief  EB808, ATOM channel 0 CCU0 compare shadow register */
#define GTM_ATOM7_CH0_SR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0 *)0xF01EB808u)

/** \\brief  EB80C, ATOM channel 0 CCU1 compare shadow register */
#define GTM_ATOM7_CH0_SR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1 *)0xF01EB80Cu)

/** \\brief  EB81C, ATOM channel 0 status register */
#define GTM_ATOM7_CH0_STAT             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT *)0xF01EB81Cu)

/** \\brief  EB890, ATOM channel 0 CCU0 compare register */
#define GTM_ATOM7_CH1_CM0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0 *)0xF01EB890u)

/** \\brief  EB894, ATOM channel 0 CCU1 compare register */
#define GTM_ATOM7_CH1_CM1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1 *)0xF01EB894u)

/** \\brief  EB898, ATOM channel 0 CCU0 counter register */
#define GTM_ATOM7_CH1_CN0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0 *)0xF01EB898u)

/** \\brief  EB8A4, ATOM channel 0 interrupt enable register */
#define GTM_ATOM7_CH1_IRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN *)0xF01EB8A4u)

/** \\brief  EB8A8, ATOM channel 0 software interrupt generation */
#define GTM_ATOM7_CH1_IRQ_FORCINT      /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT *)0xF01EB8A8u)

/** \\brief  EB8AC, ATOM channel 0 interrupt mode configuration register */
#define GTM_ATOM7_CH1_IRQ_MODE         /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE *)0xF01EB8ACu)

/** \\brief  EB8A0, ATOM channel 0 interrupt notification register */
#define GTM_ATOM7_CH1_IRQ_NOTIFY       /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY *)0xF01EB8A0u)

/** \\brief  EB880, ATOM channel 0 ARU read address register */
#define GTM_ATOM7_CH1_RDADDR           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR *)0xF01EB880u)

/** \brief  EB884, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM7_CH1_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL *)0xF01EB884u)

/** \brief  EB884, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM7_CH1_SOMI             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI *)0xF01EB884u)

/** Alias (User Manual Name) for GTM_ATOM7_CH1_SOMI.
 * To use register names with standard convension, please use GTM_ATOM7_CH1_SOMI.
 */
#define GTM_ATOM7_CH1_CTRL_SOMI        (GTM_ATOM7_CH1_SOMI)

/** \brief  EB884, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM7_CH1_SOMC             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC *)0xF01EB884u)

/** Alias (User Manual Name) for GTM_ATOM7_CH1_SOMC.
 * To use register names with standard convension, please use GTM_ATOM7_CH1_SOMC.
 */
#define GTM_ATOM7_CH1_CTRL_SOMC        (GTM_ATOM7_CH1_SOMC)

/** \brief  EB884, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM7_CH1_SOMP             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP *)0xF01EB884u)

/** Alias (User Manual Name) for GTM_ATOM7_CH1_SOMP.
 * To use register names with standard convension, please use GTM_ATOM7_CH1_SOMP.
 */
#define GTM_ATOM7_CH1_CTRL_SOMP        (GTM_ATOM7_CH1_SOMP)

/** \brief  EB884, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM7_CH1_SOMS             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS *)0xF01EB884u)

/** Alias (User Manual Name) for GTM_ATOM7_CH1_SOMS.
 * To use register names with standard convension, please use GTM_ATOM7_CH1_SOMS.
 */
#define GTM_ATOM7_CH1_CTRL_SOMS        (GTM_ATOM7_CH1_SOMS)

/** \brief  EB884, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM7_CH1_SOMB             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB *)0xF01EB884u)

/** Alias (User Manual Name) for GTM_ATOM7_CH1_SOMB.
 * To use register names with standard convension, please use GTM_ATOM7_CH1_SOMB.
 */
#define GTM_ATOM7_CH1_CTRL_SOMB        (GTM_ATOM7_CH1_SOMB)

/** \\brief  EB888, ATOM channel 0 CCU0 compare shadow register */
#define GTM_ATOM7_CH1_SR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0 *)0xF01EB888u)

/** \\brief  EB88C, ATOM channel 0 CCU1 compare shadow register */
#define GTM_ATOM7_CH1_SR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1 *)0xF01EB88Cu)

/** \\brief  EB89C, ATOM channel 0 status register */
#define GTM_ATOM7_CH1_STAT             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT *)0xF01EB89Cu)

/** \\brief  EB910, ATOM channel 0 CCU0 compare register */
#define GTM_ATOM7_CH2_CM0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0 *)0xF01EB910u)

/** \\brief  EB914, ATOM channel 0 CCU1 compare register */
#define GTM_ATOM7_CH2_CM1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1 *)0xF01EB914u)

/** \\brief  EB918, ATOM channel 0 CCU0 counter register */
#define GTM_ATOM7_CH2_CN0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0 *)0xF01EB918u)

/** \\brief  EB924, ATOM channel 0 interrupt enable register */
#define GTM_ATOM7_CH2_IRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN *)0xF01EB924u)

/** \\brief  EB928, ATOM channel 0 software interrupt generation */
#define GTM_ATOM7_CH2_IRQ_FORCINT      /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT *)0xF01EB928u)

/** \\brief  EB92C, ATOM channel 0 interrupt mode configuration register */
#define GTM_ATOM7_CH2_IRQ_MODE         /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE *)0xF01EB92Cu)

/** \\brief  EB920, ATOM channel 0 interrupt notification register */
#define GTM_ATOM7_CH2_IRQ_NOTIFY       /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY *)0xF01EB920u)

/** \\brief  EB900, ATOM channel 0 ARU read address register */
#define GTM_ATOM7_CH2_RDADDR           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR *)0xF01EB900u)

/** \brief  EB904, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM7_CH2_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL *)0xF01EB904u)

/** \brief  EB904, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM7_CH2_SOMI             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI *)0xF01EB904u)

/** Alias (User Manual Name) for GTM_ATOM7_CH2_SOMI.
 * To use register names with standard convension, please use GTM_ATOM7_CH2_SOMI.
 */
#define GTM_ATOM7_CH2_CTRL_SOMI        (GTM_ATOM7_CH2_SOMI)

/** \brief  EB904, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM7_CH2_SOMC             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC *)0xF01EB904u)

/** Alias (User Manual Name) for GTM_ATOM7_CH2_SOMC.
 * To use register names with standard convension, please use GTM_ATOM7_CH2_SOMC.
 */
#define GTM_ATOM7_CH2_CTRL_SOMC        (GTM_ATOM7_CH2_SOMC)

/** \brief  EB904, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM7_CH2_SOMP             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP *)0xF01EB904u)

/** Alias (User Manual Name) for GTM_ATOM7_CH2_SOMP.
 * To use register names with standard convension, please use GTM_ATOM7_CH2_SOMP.
 */
#define GTM_ATOM7_CH2_CTRL_SOMP        (GTM_ATOM7_CH2_SOMP)

/** \brief  EB904, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM7_CH2_SOMS             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS *)0xF01EB904u)

