Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** Alias (User Manual Name) for GTM_ATOM7_CH2_SOMS.
 * To use register names with standard convension, please use GTM_ATOM7_CH2_SOMS.
 */
#define GTM_ATOM7_CH2_CTRL_SOMS        (GTM_ATOM7_CH2_SOMS)

/** \brief  EB904, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM7_CH2_SOMB             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB *)0xF01EB904u)

/** Alias (User Manual Name) for GTM_ATOM7_CH2_SOMB.
 * To use register names with standard convension, please use GTM_ATOM7_CH2_SOMB.
 */
#define GTM_ATOM7_CH2_CTRL_SOMB        (GTM_ATOM7_CH2_SOMB)

/** \\brief  EB908, ATOM channel 0 CCU0 compare shadow register */
#define GTM_ATOM7_CH2_SR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0 *)0xF01EB908u)

/** \\brief  EB90C, ATOM channel 0 CCU1 compare shadow register */
#define GTM_ATOM7_CH2_SR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1 *)0xF01EB90Cu)

/** \\brief  EB91C, ATOM channel 0 status register */
#define GTM_ATOM7_CH2_STAT             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT *)0xF01EB91Cu)

/** \\brief  EB990, ATOM channel 0 CCU0 compare register */
#define GTM_ATOM7_CH3_CM0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0 *)0xF01EB990u)

/** \\brief  EB994, ATOM channel 0 CCU1 compare register */
#define GTM_ATOM7_CH3_CM1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1 *)0xF01EB994u)

/** \\brief  EB998, ATOM channel 0 CCU0 counter register */
#define GTM_ATOM7_CH3_CN0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0 *)0xF01EB998u)

/** \\brief  EB9A4, ATOM channel 0 interrupt enable register */
#define GTM_ATOM7_CH3_IRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN *)0xF01EB9A4u)

/** \\brief  EB9A8, ATOM channel 0 software interrupt generation */
#define GTM_ATOM7_CH3_IRQ_FORCINT      /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT *)0xF01EB9A8u)

/** \\brief  EB9AC, ATOM channel 0 interrupt mode configuration register */
#define GTM_ATOM7_CH3_IRQ_MODE         /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE *)0xF01EB9ACu)

/** \\brief  EB9A0, ATOM channel 0 interrupt notification register */
#define GTM_ATOM7_CH3_IRQ_NOTIFY       /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY *)0xF01EB9A0u)

/** \\brief  EB980, ATOM channel 0 ARU read address register */
#define GTM_ATOM7_CH3_RDADDR           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR *)0xF01EB980u)

/** \brief  EB984, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM7_CH3_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL *)0xF01EB984u)

/** \brief  EB984, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM7_CH3_SOMI             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI *)0xF01EB984u)

/** Alias (User Manual Name) for GTM_ATOM7_CH3_SOMI.
 * To use register names with standard convension, please use GTM_ATOM7_CH3_SOMI.
 */
#define GTM_ATOM7_CH3_CTRL_SOMI        (GTM_ATOM7_CH3_SOMI)

/** \brief  EB984, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM7_CH3_SOMC             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC *)0xF01EB984u)

/** Alias (User Manual Name) for GTM_ATOM7_CH3_SOMC.
 * To use register names with standard convension, please use GTM_ATOM7_CH3_SOMC.
 */
#define GTM_ATOM7_CH3_CTRL_SOMC        (GTM_ATOM7_CH3_SOMC)

/** \brief  EB984, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM7_CH3_SOMP             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP *)0xF01EB984u)

/** Alias (User Manual Name) for GTM_ATOM7_CH3_SOMP.
 * To use register names with standard convension, please use GTM_ATOM7_CH3_SOMP.
 */
#define GTM_ATOM7_CH3_CTRL_SOMP        (GTM_ATOM7_CH3_SOMP)

/** \brief  EB984, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM7_CH3_SOMS             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS *)0xF01EB984u)

/** Alias (User Manual Name) for GTM_ATOM7_CH3_SOMS.
 * To use register names with standard convension, please use GTM_ATOM7_CH3_SOMS.
 */
#define GTM_ATOM7_CH3_CTRL_SOMS        (GTM_ATOM7_CH3_SOMS)

/** \brief  EB984, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM7_CH3_SOMB             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB *)0xF01EB984u)

/** Alias (User Manual Name) for GTM_ATOM7_CH3_SOMB.
 * To use register names with standard convension, please use GTM_ATOM7_CH3_SOMB.
 */
#define GTM_ATOM7_CH3_CTRL_SOMB        (GTM_ATOM7_CH3_SOMB)

/** \\brief  EB988, ATOM channel 0 CCU0 compare shadow register */
#define GTM_ATOM7_CH3_SR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0 *)0xF01EB988u)

/** \\brief  EB98C, ATOM channel 0 CCU1 compare shadow register */
#define GTM_ATOM7_CH3_SR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1 *)0xF01EB98Cu)

/** \\brief  EB99C, ATOM channel 0 status register */
#define GTM_ATOM7_CH3_STAT             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT *)0xF01EB99Cu)

/** \\brief  EBA10, ATOM channel 0 CCU0 compare register */
#define GTM_ATOM7_CH4_CM0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0 *)0xF01EBA10u)

/** \\brief  EBA14, ATOM channel 0 CCU1 compare register */
#define GTM_ATOM7_CH4_CM1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1 *)0xF01EBA14u)

/** \\brief  EBA18, ATOM channel 0 CCU0 counter register */
#define GTM_ATOM7_CH4_CN0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0 *)0xF01EBA18u)

/** \\brief  EBA24, ATOM channel 0 interrupt enable register */
#define GTM_ATOM7_CH4_IRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN *)0xF01EBA24u)

/** \\brief  EBA28, ATOM channel 0 software interrupt generation */
#define GTM_ATOM7_CH4_IRQ_FORCINT      /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT *)0xF01EBA28u)

/** \\brief  EBA2C, ATOM channel 0 interrupt mode configuration register */
#define GTM_ATOM7_CH4_IRQ_MODE         /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE *)0xF01EBA2Cu)

/** \\brief  EBA20, ATOM channel 0 interrupt notification register */
#define GTM_ATOM7_CH4_IRQ_NOTIFY       /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY *)0xF01EBA20u)

/** \\brief  EBA00, ATOM channel 0 ARU read address register */
#define GTM_ATOM7_CH4_RDADDR           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR *)0xF01EBA00u)

