Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \brief  EBA04, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM7_CH4_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL *)0xF01EBA04u)

/** \brief  EBA04, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM7_CH4_SOMI             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI *)0xF01EBA04u)

/** Alias (User Manual Name) for GTM_ATOM7_CH4_SOMI.
 * To use register names with standard convension, please use GTM_ATOM7_CH4_SOMI.
 */
#define GTM_ATOM7_CH4_CTRL_SOMI        (GTM_ATOM7_CH4_SOMI)

/** \brief  EBA04, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM7_CH4_SOMC             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC *)0xF01EBA04u)

/** Alias (User Manual Name) for GTM_ATOM7_CH4_SOMC.
 * To use register names with standard convension, please use GTM_ATOM7_CH4_SOMC.
 */
#define GTM_ATOM7_CH4_CTRL_SOMC        (GTM_ATOM7_CH4_SOMC)

/** \brief  EBA04, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM7_CH4_SOMP             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP *)0xF01EBA04u)

/** Alias (User Manual Name) for GTM_ATOM7_CH4_SOMP.
 * To use register names with standard convension, please use GTM_ATOM7_CH4_SOMP.
 */
#define GTM_ATOM7_CH4_CTRL_SOMP        (GTM_ATOM7_CH4_SOMP)

/** \brief  EBA04, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM7_CH4_SOMS             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS *)0xF01EBA04u)

/** Alias (User Manual Name) for GTM_ATOM7_CH4_SOMS.
 * To use register names with standard convension, please use GTM_ATOM7_CH4_SOMS.
 */
#define GTM_ATOM7_CH4_CTRL_SOMS        (GTM_ATOM7_CH4_SOMS)

/** \brief  EBA04, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM7_CH4_SOMB             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB *)0xF01EBA04u)

/** Alias (User Manual Name) for GTM_ATOM7_CH4_SOMB.
 * To use register names with standard convension, please use GTM_ATOM7_CH4_SOMB.
 */
#define GTM_ATOM7_CH4_CTRL_SOMB        (GTM_ATOM7_CH4_SOMB)

/** \\brief  EBA08, ATOM channel 0 CCU0 compare shadow register */
#define GTM_ATOM7_CH4_SR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0 *)0xF01EBA08u)

/** \\brief  EBA0C, ATOM channel 0 CCU1 compare shadow register */
#define GTM_ATOM7_CH4_SR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1 *)0xF01EBA0Cu)

/** \\brief  EBA1C, ATOM channel 0 status register */
#define GTM_ATOM7_CH4_STAT             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT *)0xF01EBA1Cu)

/** \\brief  EBA90, ATOM channel 0 CCU0 compare register */
#define GTM_ATOM7_CH5_CM0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0 *)0xF01EBA90u)

/** \\brief  EBA94, ATOM channel 0 CCU1 compare register */
#define GTM_ATOM7_CH5_CM1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1 *)0xF01EBA94u)

/** \\brief  EBA98, ATOM channel 0 CCU0 counter register */
#define GTM_ATOM7_CH5_CN0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0 *)0xF01EBA98u)

/** \\brief  EBAA4, ATOM channel 0 interrupt enable register */
#define GTM_ATOM7_CH5_IRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN *)0xF01EBAA4u)

/** \\brief  EBAA8, ATOM channel 0 software interrupt generation */
#define GTM_ATOM7_CH5_IRQ_FORCINT      /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT *)0xF01EBAA8u)

/** \\brief  EBAAC, ATOM channel 0 interrupt mode configuration register */
#define GTM_ATOM7_CH5_IRQ_MODE         /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE *)0xF01EBAACu)

/** \\brief  EBAA0, ATOM channel 0 interrupt notification register */
#define GTM_ATOM7_CH5_IRQ_NOTIFY       /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY *)0xF01EBAA0u)

/** \\brief  EBA80, ATOM channel 0 ARU read address register */
#define GTM_ATOM7_CH5_RDADDR           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR *)0xF01EBA80u)

/** \brief  EBA84, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM7_CH5_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL *)0xF01EBA84u)

/** \brief  EBA84, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM7_CH5_SOMI             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI *)0xF01EBA84u)

/** Alias (User Manual Name) for GTM_ATOM7_CH5_SOMI.
 * To use register names with standard convension, please use GTM_ATOM7_CH5_SOMI.
 */
#define GTM_ATOM7_CH5_CTRL_SOMI        (GTM_ATOM7_CH5_SOMI)

/** \brief  EBA84, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM7_CH5_SOMC             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC *)0xF01EBA84u)

/** Alias (User Manual Name) for GTM_ATOM7_CH5_SOMC.
 * To use register names with standard convension, please use GTM_ATOM7_CH5_SOMC.
 */
#define GTM_ATOM7_CH5_CTRL_SOMC        (GTM_ATOM7_CH5_SOMC)

/** \brief  EBA84, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM7_CH5_SOMP             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP *)0xF01EBA84u)

/** Alias (User Manual Name) for GTM_ATOM7_CH5_SOMP.
 * To use register names with standard convension, please use GTM_ATOM7_CH5_SOMP.
 */
#define GTM_ATOM7_CH5_CTRL_SOMP        (GTM_ATOM7_CH5_SOMP)

/** \brief  EBA84, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM7_CH5_SOMS             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS *)0xF01EBA84u)

/** Alias (User Manual Name) for GTM_ATOM7_CH5_SOMS.
 * To use register names with standard convension, please use GTM_ATOM7_CH5_SOMS.
 */
#define GTM_ATOM7_CH5_CTRL_SOMS        (GTM_ATOM7_CH5_SOMS)

/** \brief  EBA84, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM7_CH5_SOMB             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB *)0xF01EBA84u)

/** Alias (User Manual Name) for GTM_ATOM7_CH5_SOMB.
 * To use register names with standard convension, please use GTM_ATOM7_CH5_SOMB.
 */
#define GTM_ATOM7_CH5_CTRL_SOMB        (GTM_ATOM7_CH5_SOMB)

/** \\brief  EBA88, ATOM channel 0 CCU0 compare shadow register */
#define GTM_ATOM7_CH5_SR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0 *)0xF01EBA88u)

/** \\brief  EBA8C, ATOM channel 0 CCU1 compare shadow register */
#define GTM_ATOM7_CH5_SR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1 *)0xF01EBA8Cu)

