Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  EBA9C, ATOM channel 0 status register */
#define GTM_ATOM7_CH5_STAT             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT *)0xF01EBA9Cu)

/** \\brief  EBB10, ATOM channel 0 CCU0 compare register */
#define GTM_ATOM7_CH6_CM0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0 *)0xF01EBB10u)

/** \\brief  EBB14, ATOM channel 0 CCU1 compare register */
#define GTM_ATOM7_CH6_CM1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1 *)0xF01EBB14u)

/** \\brief  EBB18, ATOM channel 0 CCU0 counter register */
#define GTM_ATOM7_CH6_CN0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0 *)0xF01EBB18u)

/** \\brief  EBB24, ATOM channel 0 interrupt enable register */
#define GTM_ATOM7_CH6_IRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN *)0xF01EBB24u)

/** \\brief  EBB28, ATOM channel 0 software interrupt generation */
#define GTM_ATOM7_CH6_IRQ_FORCINT      /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT *)0xF01EBB28u)

/** \\brief  EBB2C, ATOM channel 0 interrupt mode configuration register */
#define GTM_ATOM7_CH6_IRQ_MODE         /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE *)0xF01EBB2Cu)

/** \\brief  EBB20, ATOM channel 0 interrupt notification register */
#define GTM_ATOM7_CH6_IRQ_NOTIFY       /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY *)0xF01EBB20u)

/** \\brief  EBB00, ATOM channel 0 ARU read address register */
#define GTM_ATOM7_CH6_RDADDR           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR *)0xF01EBB00u)

/** \brief  EBB04, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM7_CH6_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL *)0xF01EBB04u)

/** \brief  EBB04, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM7_CH6_SOMI             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI *)0xF01EBB04u)

/** Alias (User Manual Name) for GTM_ATOM7_CH6_SOMI.
 * To use register names with standard convension, please use GTM_ATOM7_CH6_SOMI.
 */
#define GTM_ATOM7_CH6_CTRL_SOMI        (GTM_ATOM7_CH6_SOMI)

/** \brief  EBB04, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM7_CH6_SOMC             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC *)0xF01EBB04u)

/** Alias (User Manual Name) for GTM_ATOM7_CH6_SOMC.
 * To use register names with standard convension, please use GTM_ATOM7_CH6_SOMC.
 */
#define GTM_ATOM7_CH6_CTRL_SOMC        (GTM_ATOM7_CH6_SOMC)

/** \brief  EBB04, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM7_CH6_SOMP             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP *)0xF01EBB04u)

/** Alias (User Manual Name) for GTM_ATOM7_CH6_SOMP.
 * To use register names with standard convension, please use GTM_ATOM7_CH6_SOMP.
 */
#define GTM_ATOM7_CH6_CTRL_SOMP        (GTM_ATOM7_CH6_SOMP)

/** \brief  EBB04, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM7_CH6_SOMS             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS *)0xF01EBB04u)

/** Alias (User Manual Name) for GTM_ATOM7_CH6_SOMS.
 * To use register names with standard convension, please use GTM_ATOM7_CH6_SOMS.
 */
#define GTM_ATOM7_CH6_CTRL_SOMS        (GTM_ATOM7_CH6_SOMS)

/** \brief  EBB04, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM7_CH6_SOMB             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB *)0xF01EBB04u)

/** Alias (User Manual Name) for GTM_ATOM7_CH6_SOMB.
 * To use register names with standard convension, please use GTM_ATOM7_CH6_SOMB.
 */
#define GTM_ATOM7_CH6_CTRL_SOMB        (GTM_ATOM7_CH6_SOMB)

/** \\brief  EBB08, ATOM channel 0 CCU0 compare shadow register */
#define GTM_ATOM7_CH6_SR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0 *)0xF01EBB08u)

/** \\brief  EBB0C, ATOM channel 0 CCU1 compare shadow register */
#define GTM_ATOM7_CH6_SR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1 *)0xF01EBB0Cu)

/** \\brief  EBB1C, ATOM channel 0 status register */
#define GTM_ATOM7_CH6_STAT             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT *)0xF01EBB1Cu)

/** \\brief  EBB90, ATOM channel 0 CCU0 compare register */
#define GTM_ATOM7_CH7_CM0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0 *)0xF01EBB90u)

/** \\brief  EBB94, ATOM channel 0 CCU1 compare register */
#define GTM_ATOM7_CH7_CM1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1 *)0xF01EBB94u)

/** \\brief  EBB98, ATOM channel 0 CCU0 counter register */
#define GTM_ATOM7_CH7_CN0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0 *)0xF01EBB98u)

/** \\brief  EBBA4, ATOM channel 0 interrupt enable register */
#define GTM_ATOM7_CH7_IRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN *)0xF01EBBA4u)

/** \\brief  EBBA8, ATOM channel 0 software interrupt generation */
#define GTM_ATOM7_CH7_IRQ_FORCINT      /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT *)0xF01EBBA8u)

/** \\brief  EBBAC, ATOM channel 0 interrupt mode configuration register */
#define GTM_ATOM7_CH7_IRQ_MODE         /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE *)0xF01EBBACu)

/** \\brief  EBBA0, ATOM channel 0 interrupt notification register */
#define GTM_ATOM7_CH7_IRQ_NOTIFY       /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY *)0xF01EBBA0u)

/** \\brief  EBB80, ATOM channel 0 ARU read address register */
#define GTM_ATOM7_CH7_RDADDR           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR *)0xF01EBB80u)

/** \brief  EBB84, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM7_CH7_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL *)0xF01EBB84u)

/** \brief  EBB84, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM7_CH7_SOMI             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI *)0xF01EBB84u)

/** Alias (User Manual Name) for GTM_ATOM7_CH7_SOMI.
 * To use register names with standard convension, please use GTM_ATOM7_CH7_SOMI.
 */
#define GTM_ATOM7_CH7_CTRL_SOMI        (GTM_ATOM7_CH7_SOMI)

