Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \brief  EBB84, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM7_CH7_SOMC             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC *)0xF01EBB84u)

/** Alias (User Manual Name) for GTM_ATOM7_CH7_SOMC.
 * To use register names with standard convension, please use GTM_ATOM7_CH7_SOMC.
 */
#define GTM_ATOM7_CH7_CTRL_SOMC        (GTM_ATOM7_CH7_SOMC)

/** \brief  EBB84, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM7_CH7_SOMP             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP *)0xF01EBB84u)

/** Alias (User Manual Name) for GTM_ATOM7_CH7_SOMP.
 * To use register names with standard convension, please use GTM_ATOM7_CH7_SOMP.
 */
#define GTM_ATOM7_CH7_CTRL_SOMP        (GTM_ATOM7_CH7_SOMP)

/** \brief  EBB84, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM7_CH7_SOMS             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS *)0xF01EBB84u)

/** Alias (User Manual Name) for GTM_ATOM7_CH7_SOMS.
 * To use register names with standard convension, please use GTM_ATOM7_CH7_SOMS.
 */
#define GTM_ATOM7_CH7_CTRL_SOMS        (GTM_ATOM7_CH7_SOMS)

/** \brief  EBB84, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM7_CH7_SOMB             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB *)0xF01EBB84u)

/** Alias (User Manual Name) for GTM_ATOM7_CH7_SOMB.
 * To use register names with standard convension, please use GTM_ATOM7_CH7_SOMB.
 */
#define GTM_ATOM7_CH7_CTRL_SOMB        (GTM_ATOM7_CH7_SOMB)

/** \\brief  EBB88, ATOM channel 0 CCU0 compare shadow register */
#define GTM_ATOM7_CH7_SR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0 *)0xF01EBB88u)

/** \\brief  EBB8C, ATOM channel 0 CCU1 compare shadow register */
#define GTM_ATOM7_CH7_SR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1 *)0xF01EBB8Cu)

/** \\brief  EBB9C, ATOM channel 0 status register */
#define GTM_ATOM7_CH7_STAT             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT *)0xF01EBB9Cu)

/** \\brief  EC04C, ATOM AGC action time base register */
#define GTM_ATOM8_AGC_ACT_TB           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_ACT_TB *)0xF01EC04Cu)

/** \\brief  EC044, ATOM AGC enable/disable control register */
#define GTM_ATOM8_AGC_ENDIS_CTRL       /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_ENDIS_CTRL *)0xF01EC044u)

/** \\brief  EC048, ATOM AGC enable/disable status register */
#define GTM_ATOM8_AGC_ENDIS_STAT       /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_ENDIS_STAT *)0xF01EC048u)

/** \\brief  EC058, ATOM AGC force update control register */
#define GTM_ATOM8_AGC_FUPD_CTRL        /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_FUPD_CTRL *)0xF01EC058u)

/** \\brief  EC040, ATOM AGC global control register */
#define GTM_ATOM8_AGC_GLB_CTRL         /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_GLB_CTRL *)0xF01EC040u)

/** \\brief  EC05C, ATOM AGC internal trigger control register */
#define GTM_ATOM8_AGC_INT_TRIG         /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_INT_TRIG *)0xF01EC05Cu)

/** \\brief  EC050, ATOM AGC output enable control register */
#define GTM_ATOM8_AGC_OUTEN_CTRL       /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_OUTEN_CTRL *)0xF01EC050u)

/** \\brief  EC054, ATOM AGC output enable status register */
#define GTM_ATOM8_AGC_OUTEN_STAT       /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_OUTEN_STAT *)0xF01EC054u)

/** \\brief  EC010, ATOM channel 0 CCU0 compare register */
#define GTM_ATOM8_CH0_CM0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0 *)0xF01EC010u)

/** \\brief  EC014, ATOM channel 0 CCU1 compare register */
#define GTM_ATOM8_CH0_CM1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1 *)0xF01EC014u)

/** \\brief  EC018, ATOM channel 0 CCU0 counter register */
#define GTM_ATOM8_CH0_CN0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0 *)0xF01EC018u)

/** \\brief  EC024, ATOM channel 0 interrupt enable register */
#define GTM_ATOM8_CH0_IRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN *)0xF01EC024u)

/** \\brief  EC028, ATOM channel 0 software interrupt generation */
#define GTM_ATOM8_CH0_IRQ_FORCINT      /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT *)0xF01EC028u)

/** \\brief  EC02C, ATOM channel 0 interrupt mode configuration register */
#define GTM_ATOM8_CH0_IRQ_MODE         /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE *)0xF01EC02Cu)

/** \\brief  EC020, ATOM channel 0 interrupt notification register */
#define GTM_ATOM8_CH0_IRQ_NOTIFY       /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY *)0xF01EC020u)

/** \\brief  EC000, ATOM channel 0 ARU read address register */
#define GTM_ATOM8_CH0_RDADDR           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR *)0xF01EC000u)

/** \brief  EC004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM8_CH0_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL *)0xF01EC004u)

/** \brief  EC004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM8_CH0_SOMI             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI *)0xF01EC004u)

/** Alias (User Manual Name) for GTM_ATOM8_CH0_SOMI.
 * To use register names with standard convension, please use GTM_ATOM8_CH0_SOMI.
 */
#define GTM_ATOM8_CH0_CTRL_SOMI        (GTM_ATOM8_CH0_SOMI)

/** \brief  EC004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM8_CH0_SOMC             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC *)0xF01EC004u)

/** Alias (User Manual Name) for GTM_ATOM8_CH0_SOMC.
 * To use register names with standard convension, please use GTM_ATOM8_CH0_SOMC.
 */
#define GTM_ATOM8_CH0_CTRL_SOMC        (GTM_ATOM8_CH0_SOMC)

/** \brief  EC004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM8_CH0_SOMP             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP *)0xF01EC004u)

/** Alias (User Manual Name) for GTM_ATOM8_CH0_SOMP.
 * To use register names with standard convension, please use GTM_ATOM8_CH0_SOMP.
 */
#define GTM_ATOM8_CH0_CTRL_SOMP        (GTM_ATOM8_CH0_SOMP)

/** \brief  EC004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM8_CH0_SOMS             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS *)0xF01EC004u)

/** Alias (User Manual Name) for GTM_ATOM8_CH0_SOMS.
 * To use register names with standard convension, please use GTM_ATOM8_CH0_SOMS.
 */
#define GTM_ATOM8_CH0_CTRL_SOMS        (GTM_ATOM8_CH0_SOMS)

/** \brief  EC004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM8_CH0_SOMB             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB *)0xF01EC004u)

/** Alias (User Manual Name) for GTM_ATOM8_CH0_SOMB.
 * To use register names with standard convension, please use GTM_ATOM8_CH0_SOMB.
 */
#define GTM_ATOM8_CH0_CTRL_SOMB        (GTM_ATOM8_CH0_SOMB)

/** \\brief  EC008, ATOM channel 0 CCU0 compare shadow register */
#define GTM_ATOM8_CH0_SR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0 *)0xF01EC008u)

/** \\brief  EC00C, ATOM channel 0 CCU1 compare shadow register */
#define GTM_ATOM8_CH0_SR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1 *)0xF01EC00Cu)

