Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  EC01C, ATOM channel 0 status register */
#define GTM_ATOM8_CH0_STAT             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT *)0xF01EC01Cu)

/** \\brief  EC090, ATOM channel 0 CCU0 compare register */
#define GTM_ATOM8_CH1_CM0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0 *)0xF01EC090u)

/** \\brief  EC094, ATOM channel 0 CCU1 compare register */
#define GTM_ATOM8_CH1_CM1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1 *)0xF01EC094u)

/** \\brief  EC098, ATOM channel 0 CCU0 counter register */
#define GTM_ATOM8_CH1_CN0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0 *)0xF01EC098u)

/** \\brief  EC0A4, ATOM channel 0 interrupt enable register */
#define GTM_ATOM8_CH1_IRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN *)0xF01EC0A4u)

/** \\brief  EC0A8, ATOM channel 0 software interrupt generation */
#define GTM_ATOM8_CH1_IRQ_FORCINT      /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT *)0xF01EC0A8u)

/** \\brief  EC0AC, ATOM channel 0 interrupt mode configuration register */
#define GTM_ATOM8_CH1_IRQ_MODE         /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE *)0xF01EC0ACu)

/** \\brief  EC0A0, ATOM channel 0 interrupt notification register */
#define GTM_ATOM8_CH1_IRQ_NOTIFY       /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY *)0xF01EC0A0u)

/** \\brief  EC080, ATOM channel 0 ARU read address register */
#define GTM_ATOM8_CH1_RDADDR           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR *)0xF01EC080u)

/** \brief  EC084, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM8_CH1_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL *)0xF01EC084u)

/** \brief  EC084, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM8_CH1_SOMI             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI *)0xF01EC084u)

/** Alias (User Manual Name) for GTM_ATOM8_CH1_SOMI.
 * To use register names with standard convension, please use GTM_ATOM8_CH1_SOMI.
 */
#define GTM_ATOM8_CH1_CTRL_SOMI        (GTM_ATOM8_CH1_SOMI)

/** \brief  EC084, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM8_CH1_SOMC             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC *)0xF01EC084u)

/** Alias (User Manual Name) for GTM_ATOM8_CH1_SOMC.
 * To use register names with standard convension, please use GTM_ATOM8_CH1_SOMC.
 */
#define GTM_ATOM8_CH1_CTRL_SOMC        (GTM_ATOM8_CH1_SOMC)

/** \brief  EC084, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM8_CH1_SOMP             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP *)0xF01EC084u)

/** Alias (User Manual Name) for GTM_ATOM8_CH1_SOMP.
 * To use register names with standard convension, please use GTM_ATOM8_CH1_SOMP.
 */
#define GTM_ATOM8_CH1_CTRL_SOMP        (GTM_ATOM8_CH1_SOMP)

/** \brief  EC084, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM8_CH1_SOMS             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS *)0xF01EC084u)

/** Alias (User Manual Name) for GTM_ATOM8_CH1_SOMS.
 * To use register names with standard convension, please use GTM_ATOM8_CH1_SOMS.
 */
#define GTM_ATOM8_CH1_CTRL_SOMS        (GTM_ATOM8_CH1_SOMS)

/** \brief  EC084, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM8_CH1_SOMB             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB *)0xF01EC084u)

/** Alias (User Manual Name) for GTM_ATOM8_CH1_SOMB.
 * To use register names with standard convension, please use GTM_ATOM8_CH1_SOMB.
 */
#define GTM_ATOM8_CH1_CTRL_SOMB        (GTM_ATOM8_CH1_SOMB)

/** \\brief  EC088, ATOM channel 0 CCU0 compare shadow register */
#define GTM_ATOM8_CH1_SR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0 *)0xF01EC088u)

/** \\brief  EC08C, ATOM channel 0 CCU1 compare shadow register */
#define GTM_ATOM8_CH1_SR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1 *)0xF01EC08Cu)

/** \\brief  EC09C, ATOM channel 0 status register */
#define GTM_ATOM8_CH1_STAT             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT *)0xF01EC09Cu)

/** \\brief  EC110, ATOM channel 0 CCU0 compare register */
#define GTM_ATOM8_CH2_CM0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0 *)0xF01EC110u)

/** \\brief  EC114, ATOM channel 0 CCU1 compare register */
#define GTM_ATOM8_CH2_CM1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1 *)0xF01EC114u)

/** \\brief  EC118, ATOM channel 0 CCU0 counter register */
#define GTM_ATOM8_CH2_CN0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0 *)0xF01EC118u)

/** \\brief  EC124, ATOM channel 0 interrupt enable register */
#define GTM_ATOM8_CH2_IRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN *)0xF01EC124u)

/** \\brief  EC128, ATOM channel 0 software interrupt generation */
#define GTM_ATOM8_CH2_IRQ_FORCINT      /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT *)0xF01EC128u)

/** \\brief  EC12C, ATOM channel 0 interrupt mode configuration register */
#define GTM_ATOM8_CH2_IRQ_MODE         /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE *)0xF01EC12Cu)

/** \\brief  EC120, ATOM channel 0 interrupt notification register */
#define GTM_ATOM8_CH2_IRQ_NOTIFY       /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY *)0xF01EC120u)

/** \\brief  EC100, ATOM channel 0 ARU read address register */
#define GTM_ATOM8_CH2_RDADDR           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR *)0xF01EC100u)

/** \brief  EC104, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM8_CH2_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL *)0xF01EC104u)

/** \brief  EC104, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM8_CH2_SOMI             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI *)0xF01EC104u)

/** Alias (User Manual Name) for GTM_ATOM8_CH2_SOMI.
 * To use register names with standard convension, please use GTM_ATOM8_CH2_SOMI.
 */
#define GTM_ATOM8_CH2_CTRL_SOMI        (GTM_ATOM8_CH2_SOMI)

