Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \brief  EC104, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM8_CH2_SOMC             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC *)0xF01EC104u)

/** Alias (User Manual Name) for GTM_ATOM8_CH2_SOMC.
 * To use register names with standard convension, please use GTM_ATOM8_CH2_SOMC.
 */
#define GTM_ATOM8_CH2_CTRL_SOMC        (GTM_ATOM8_CH2_SOMC)

/** \brief  EC104, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM8_CH2_SOMP             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP *)0xF01EC104u)

/** Alias (User Manual Name) for GTM_ATOM8_CH2_SOMP.
 * To use register names with standard convension, please use GTM_ATOM8_CH2_SOMP.
 */
#define GTM_ATOM8_CH2_CTRL_SOMP        (GTM_ATOM8_CH2_SOMP)

/** \brief  EC104, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM8_CH2_SOMS             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS *)0xF01EC104u)

/** Alias (User Manual Name) for GTM_ATOM8_CH2_SOMS.
 * To use register names with standard convension, please use GTM_ATOM8_CH2_SOMS.
 */
#define GTM_ATOM8_CH2_CTRL_SOMS        (GTM_ATOM8_CH2_SOMS)

/** \brief  EC104, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM8_CH2_SOMB             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB *)0xF01EC104u)

/** Alias (User Manual Name) for GTM_ATOM8_CH2_SOMB.
 * To use register names with standard convension, please use GTM_ATOM8_CH2_SOMB.
 */
#define GTM_ATOM8_CH2_CTRL_SOMB        (GTM_ATOM8_CH2_SOMB)

/** \\brief  EC108, ATOM channel 0 CCU0 compare shadow register */
#define GTM_ATOM8_CH2_SR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0 *)0xF01EC108u)

/** \\brief  EC10C, ATOM channel 0 CCU1 compare shadow register */
#define GTM_ATOM8_CH2_SR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1 *)0xF01EC10Cu)

/** \\brief  EC11C, ATOM channel 0 status register */
#define GTM_ATOM8_CH2_STAT             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT *)0xF01EC11Cu)

/** \\brief  EC190, ATOM channel 0 CCU0 compare register */
#define GTM_ATOM8_CH3_CM0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0 *)0xF01EC190u)

/** \\brief  EC194, ATOM channel 0 CCU1 compare register */
#define GTM_ATOM8_CH3_CM1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1 *)0xF01EC194u)

/** \\brief  EC198, ATOM channel 0 CCU0 counter register */
#define GTM_ATOM8_CH3_CN0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0 *)0xF01EC198u)

/** \\brief  EC1A4, ATOM channel 0 interrupt enable register */
#define GTM_ATOM8_CH3_IRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN *)0xF01EC1A4u)

/** \\brief  EC1A8, ATOM channel 0 software interrupt generation */
#define GTM_ATOM8_CH3_IRQ_FORCINT      /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT *)0xF01EC1A8u)

/** \\brief  EC1AC, ATOM channel 0 interrupt mode configuration register */
#define GTM_ATOM8_CH3_IRQ_MODE         /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE *)0xF01EC1ACu)

/** \\brief  EC1A0, ATOM channel 0 interrupt notification register */
#define GTM_ATOM8_CH3_IRQ_NOTIFY       /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY *)0xF01EC1A0u)

/** \\brief  EC180, ATOM channel 0 ARU read address register */
#define GTM_ATOM8_CH3_RDADDR           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR *)0xF01EC180u)

/** \brief  EC184, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM8_CH3_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL *)0xF01EC184u)

/** \brief  EC184, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM8_CH3_SOMI             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI *)0xF01EC184u)

/** Alias (User Manual Name) for GTM_ATOM8_CH3_SOMI.
 * To use register names with standard convension, please use GTM_ATOM8_CH3_SOMI.
 */
#define GTM_ATOM8_CH3_CTRL_SOMI        (GTM_ATOM8_CH3_SOMI)

/** \brief  EC184, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM8_CH3_SOMC             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC *)0xF01EC184u)

/** Alias (User Manual Name) for GTM_ATOM8_CH3_SOMC.
 * To use register names with standard convension, please use GTM_ATOM8_CH3_SOMC.
 */
#define GTM_ATOM8_CH3_CTRL_SOMC        (GTM_ATOM8_CH3_SOMC)

/** \brief  EC184, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM8_CH3_SOMP             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP *)0xF01EC184u)

/** Alias (User Manual Name) for GTM_ATOM8_CH3_SOMP.
 * To use register names with standard convension, please use GTM_ATOM8_CH3_SOMP.
 */
#define GTM_ATOM8_CH3_CTRL_SOMP        (GTM_ATOM8_CH3_SOMP)

/** \brief  EC184, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM8_CH3_SOMS             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS *)0xF01EC184u)

/** Alias (User Manual Name) for GTM_ATOM8_CH3_SOMS.
 * To use register names with standard convension, please use GTM_ATOM8_CH3_SOMS.
 */
#define GTM_ATOM8_CH3_CTRL_SOMS        (GTM_ATOM8_CH3_SOMS)

/** \brief  EC184, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM8_CH3_SOMB             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB *)0xF01EC184u)

/** Alias (User Manual Name) for GTM_ATOM8_CH3_SOMB.
 * To use register names with standard convension, please use GTM_ATOM8_CH3_SOMB.
 */
#define GTM_ATOM8_CH3_CTRL_SOMB        (GTM_ATOM8_CH3_SOMB)

/** \\brief  EC188, ATOM channel 0 CCU0 compare shadow register */
#define GTM_ATOM8_CH3_SR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0 *)0xF01EC188u)

/** \\brief  EC18C, ATOM channel 0 CCU1 compare shadow register */
#define GTM_ATOM8_CH3_SR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1 *)0xF01EC18Cu)

/** \\brief  EC19C, ATOM channel 0 status register */
#define GTM_ATOM8_CH3_STAT             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT *)0xF01EC19Cu)

/** \\brief  EC210, ATOM channel 0 CCU0 compare register */
#define GTM_ATOM8_CH4_CM0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0 *)0xF01EC210u)

