Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  EC214, ATOM channel 0 CCU1 compare register */
#define GTM_ATOM8_CH4_CM1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1 *)0xF01EC214u)

/** \\brief  EC218, ATOM channel 0 CCU0 counter register */
#define GTM_ATOM8_CH4_CN0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0 *)0xF01EC218u)

/** \\brief  EC224, ATOM channel 0 interrupt enable register */
#define GTM_ATOM8_CH4_IRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN *)0xF01EC224u)

/** \\brief  EC228, ATOM channel 0 software interrupt generation */
#define GTM_ATOM8_CH4_IRQ_FORCINT      /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT *)0xF01EC228u)

/** \\brief  EC22C, ATOM channel 0 interrupt mode configuration register */
#define GTM_ATOM8_CH4_IRQ_MODE         /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE *)0xF01EC22Cu)

/** \\brief  EC220, ATOM channel 0 interrupt notification register */
#define GTM_ATOM8_CH4_IRQ_NOTIFY       /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY *)0xF01EC220u)

/** \\brief  EC200, ATOM channel 0 ARU read address register */
#define GTM_ATOM8_CH4_RDADDR           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR *)0xF01EC200u)

/** \brief  EC204, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM8_CH4_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL *)0xF01EC204u)

/** \brief  EC204, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM8_CH4_SOMI             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI *)0xF01EC204u)

/** Alias (User Manual Name) for GTM_ATOM8_CH4_SOMI.
 * To use register names with standard convension, please use GTM_ATOM8_CH4_SOMI.
 */
#define GTM_ATOM8_CH4_CTRL_SOMI        (GTM_ATOM8_CH4_SOMI)

/** \brief  EC204, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM8_CH4_SOMC             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC *)0xF01EC204u)

/** Alias (User Manual Name) for GTM_ATOM8_CH4_SOMC.
 * To use register names with standard convension, please use GTM_ATOM8_CH4_SOMC.
 */
#define GTM_ATOM8_CH4_CTRL_SOMC        (GTM_ATOM8_CH4_SOMC)

/** \brief  EC204, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM8_CH4_SOMP             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP *)0xF01EC204u)

/** Alias (User Manual Name) for GTM_ATOM8_CH4_SOMP.
 * To use register names with standard convension, please use GTM_ATOM8_CH4_SOMP.
 */
#define GTM_ATOM8_CH4_CTRL_SOMP        (GTM_ATOM8_CH4_SOMP)

/** \brief  EC204, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM8_CH4_SOMS             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS *)0xF01EC204u)

/** Alias (User Manual Name) for GTM_ATOM8_CH4_SOMS.
 * To use register names with standard convension, please use GTM_ATOM8_CH4_SOMS.
 */
#define GTM_ATOM8_CH4_CTRL_SOMS        (GTM_ATOM8_CH4_SOMS)

/** \brief  EC204, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM8_CH4_SOMB             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB *)0xF01EC204u)

/** Alias (User Manual Name) for GTM_ATOM8_CH4_SOMB.
 * To use register names with standard convension, please use GTM_ATOM8_CH4_SOMB.
 */
#define GTM_ATOM8_CH4_CTRL_SOMB        (GTM_ATOM8_CH4_SOMB)

/** \\brief  EC208, ATOM channel 0 CCU0 compare shadow register */
#define GTM_ATOM8_CH4_SR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0 *)0xF01EC208u)

/** \\brief  EC20C, ATOM channel 0 CCU1 compare shadow register */
#define GTM_ATOM8_CH4_SR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1 *)0xF01EC20Cu)

/** \\brief  EC21C, ATOM channel 0 status register */
#define GTM_ATOM8_CH4_STAT             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT *)0xF01EC21Cu)

/** \\brief  EC290, ATOM channel 0 CCU0 compare register */
#define GTM_ATOM8_CH5_CM0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0 *)0xF01EC290u)

/** \\brief  EC294, ATOM channel 0 CCU1 compare register */
#define GTM_ATOM8_CH5_CM1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1 *)0xF01EC294u)

/** \\brief  EC298, ATOM channel 0 CCU0 counter register */
#define GTM_ATOM8_CH5_CN0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0 *)0xF01EC298u)

/** \\brief  EC2A4, ATOM channel 0 interrupt enable register */
#define GTM_ATOM8_CH5_IRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN *)0xF01EC2A4u)

/** \\brief  EC2A8, ATOM channel 0 software interrupt generation */
#define GTM_ATOM8_CH5_IRQ_FORCINT      /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT *)0xF01EC2A8u)

/** \\brief  EC2AC, ATOM channel 0 interrupt mode configuration register */
#define GTM_ATOM8_CH5_IRQ_MODE         /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE *)0xF01EC2ACu)

/** \\brief  EC2A0, ATOM channel 0 interrupt notification register */
#define GTM_ATOM8_CH5_IRQ_NOTIFY       /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY *)0xF01EC2A0u)

/** \\brief  EC280, ATOM channel 0 ARU read address register */
#define GTM_ATOM8_CH5_RDADDR           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR *)0xF01EC280u)

/** \brief  EC214, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM8_CH5_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL *)0xF01EC284u)

/** \brief  EC214, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM8_CH5_SOMI             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI *)0xF01EC284u)

/** Alias (User Manual Name) for GTM_ATOM8_CH5_SOMI.
 * To use register names with standard convension, please use GTM_ATOM8_CH5_SOMI.
 */
#define GTM_ATOM8_CH5_CTRL_SOMI        (GTM_ATOM8_CH5_SOMI)

/** \brief  EC214, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM8_CH5_SOMC             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC *)0xF01EC284u)

/** Alias (User Manual Name) for GTM_ATOM8_CH5_SOMC.
 * To use register names with standard convension, please use GTM_ATOM8_CH5_SOMC.
 */
#define GTM_ATOM8_CH5_CTRL_SOMC        (GTM_ATOM8_CH5_SOMC)

/** \brief  EC214, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM8_CH5_SOMP             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP *)0xF01EC284u)

/** Alias (User Manual Name) for GTM_ATOM8_CH5_SOMP.
 * To use register names with standard convension, please use GTM_ATOM8_CH5_SOMP.
 */
#define GTM_ATOM8_CH5_CTRL_SOMP        (GTM_ATOM8_CH5_SOMP)

/** \brief  EC214, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM8_CH5_SOMS             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS *)0xF01EC284u)

