Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** Alias (User Manual Name) for GTM_ATOM8_CH5_SOMS.
 * To use register names with standard convension, please use GTM_ATOM8_CH5_SOMS.
 */
#define GTM_ATOM8_CH5_CTRL_SOMS        (GTM_ATOM8_CH5_SOMS)

/** \brief  EC214, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM8_CH5_SOMB             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB *)0xF01EC284u)

/** Alias (User Manual Name) for GTM_ATOM8_CH5_SOMB.
 * To use register names with standard convension, please use GTM_ATOM8_CH5_SOMB.
 */
#define GTM_ATOM8_CH5_CTRL_SOMB        (GTM_ATOM8_CH5_SOMB)

/** \\brief  EC288, ATOM channel 0 CCU0 compare shadow register */
#define GTM_ATOM8_CH5_SR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0 *)0xF01EC288u)

/** \\brief  EC28C, ATOM channel 0 CCU1 compare shadow register */
#define GTM_ATOM8_CH5_SR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1 *)0xF01EC28Cu)

/** \\brief  EC29C, ATOM channel 0 status register */
#define GTM_ATOM8_CH5_STAT             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT *)0xF01EC29Cu)

/** \\brief  EC310, ATOM channel 0 CCU0 compare register */
#define GTM_ATOM8_CH6_CM0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0 *)0xF01EC310u)

/** \\brief  EC314, ATOM channel 0 CCU1 compare register */
#define GTM_ATOM8_CH6_CM1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1 *)0xF01EC314u)

/** \\brief  EC318, ATOM channel 0 CCU0 counter register */
#define GTM_ATOM8_CH6_CN0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0 *)0xF01EC318u)

/** \\brief  EC324, ATOM channel 0 interrupt enable register */
#define GTM_ATOM8_CH6_IRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN *)0xF01EC324u)

/** \\brief  EC328, ATOM channel 0 software interrupt generation */
#define GTM_ATOM8_CH6_IRQ_FORCINT      /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT *)0xF01EC328u)

/** \\brief  EC32C, ATOM channel 0 interrupt mode configuration register */
#define GTM_ATOM8_CH6_IRQ_MODE         /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE *)0xF01EC32Cu)

/** \\brief  EC320, ATOM channel 0 interrupt notification register */
#define GTM_ATOM8_CH6_IRQ_NOTIFY       /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY *)0xF01EC320u)

/** \\brief  EC300, ATOM channel 0 ARU read address register */
#define GTM_ATOM8_CH6_RDADDR           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR *)0xF01EC300u)

/** \brief  EC304, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM8_CH6_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL *)0xF01EC304u)

/** \brief  EC304, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM8_CH6_SOMI             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI *)0xF01EC304u)

/** Alias (User Manual Name) for GTM_ATOM8_CH6_SOMI.
 * To use register names with standard convension, please use GTM_ATOM8_CH6_SOMI.
 */
#define GTM_ATOM8_CH6_CTRL_SOMI        (GTM_ATOM8_CH6_SOMI)

/** \brief  EC304, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM8_CH6_SOMC             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC *)0xF01EC304u)

/** Alias (User Manual Name) for GTM_ATOM8_CH6_SOMC.
 * To use register names with standard convension, please use GTM_ATOM8_CH6_SOMC.
 */
#define GTM_ATOM8_CH6_CTRL_SOMC        (GTM_ATOM8_CH6_SOMC)

/** \brief  EC304, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM8_CH6_SOMP             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP *)0xF01EC304u)

/** Alias (User Manual Name) for GTM_ATOM8_CH6_SOMP.
 * To use register names with standard convension, please use GTM_ATOM8_CH6_SOMP.
 */
#define GTM_ATOM8_CH6_CTRL_SOMP        (GTM_ATOM8_CH6_SOMP)

/** \brief  EC304, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM8_CH6_SOMS             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS *)0xF01EC304u)

/** Alias (User Manual Name) for GTM_ATOM8_CH6_SOMS.
 * To use register names with standard convension, please use GTM_ATOM8_CH6_SOMS.
 */
#define GTM_ATOM8_CH6_CTRL_SOMS        (GTM_ATOM8_CH6_SOMS)

/** \brief  EC304, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM8_CH6_SOMB             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB *)0xF01EC304u)

/** Alias (User Manual Name) for GTM_ATOM8_CH6_SOMB.
 * To use register names with standard convension, please use GTM_ATOM8_CH6_SOMB.
 */
#define GTM_ATOM8_CH6_CTRL_SOMB        (GTM_ATOM8_CH6_SOMB)

/** \\brief  EC308, ATOM channel 0 CCU0 compare shadow register */
#define GTM_ATOM8_CH6_SR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0 *)0xF01EC308u)

/** \\brief  EC30C, ATOM channel 0 CCU1 compare shadow register */
#define GTM_ATOM8_CH6_SR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1 *)0xF01EC30Cu)

/** \\brief  EC31C, ATOM channel 0 status register */
#define GTM_ATOM8_CH6_STAT             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT *)0xF01EC31Cu)

/** \\brief  EC390, ATOM channel 0 CCU0 compare register */
#define GTM_ATOM8_CH7_CM0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0 *)0xF01EC390u)

/** \\brief  EC394, ATOM channel 0 CCU1 compare register */
#define GTM_ATOM8_CH7_CM1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1 *)0xF01EC394u)

/** \\brief  EC398, ATOM channel 0 CCU0 counter register */
#define GTM_ATOM8_CH7_CN0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0 *)0xF01EC398u)

/** \\brief  EC3A4, ATOM channel 0 interrupt enable register */
#define GTM_ATOM8_CH7_IRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN *)0xF01EC3A4u)

/** \\brief  EC3A8, ATOM channel 0 software interrupt generation */
#define GTM_ATOM8_CH7_IRQ_FORCINT      /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT *)0xF01EC3A8u)

/** \\brief  EC3AC, ATOM channel 0 interrupt mode configuration register */
#define GTM_ATOM8_CH7_IRQ_MODE         /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE *)0xF01EC3ACu)

