Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  EC3A0, ATOM channel 0 interrupt notification register */
#define GTM_ATOM8_CH7_IRQ_NOTIFY       /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY *)0xF01EC3A0u)

/** \\brief  EC380, ATOM channel 0 ARU read address register */
#define GTM_ATOM8_CH7_RDADDR           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR *)0xF01EC380u)

/** \brief  EC384, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM8_CH7_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL *)0xF01EC384u)

/** \brief  EC384, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM8_CH7_SOMI             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI *)0xF01EC384u)

/** Alias (User Manual Name) for GTM_ATOM8_CH7_SOMI.
 * To use register names with standard convension, please use GTM_ATOM8_CH7_SOMI.
 */
#define GTM_ATOM8_CH7_CTRL_SOMI        (GTM_ATOM8_CH7_SOMI)

/** \brief  EC384, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM8_CH7_SOMC             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC *)0xF01EC384u)

/** Alias (User Manual Name) for GTM_ATOM8_CH7_SOMC.
 * To use register names with standard convension, please use GTM_ATOM8_CH7_SOMC.
 */
#define GTM_ATOM8_CH7_CTRL_SOMC        (GTM_ATOM8_CH7_SOMC)

/** \brief  EC384, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM8_CH7_SOMP             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP *)0xF01EC384u)

/** Alias (User Manual Name) for GTM_ATOM8_CH7_SOMP.
 * To use register names with standard convension, please use GTM_ATOM8_CH7_SOMP.
 */
#define GTM_ATOM8_CH7_CTRL_SOMP        (GTM_ATOM8_CH7_SOMP)

/** \brief  EC384, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM8_CH7_SOMS             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS *)0xF01EC384u)

/** Alias (User Manual Name) for GTM_ATOM8_CH7_SOMS.
 * To use register names with standard convension, please use GTM_ATOM8_CH7_SOMS.
 */
#define GTM_ATOM8_CH7_CTRL_SOMS        (GTM_ATOM8_CH7_SOMS)

/** \brief  EC384, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM8_CH7_SOMB             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB *)0xF01EC384u)

/** Alias (User Manual Name) for GTM_ATOM8_CH7_SOMB.
 * To use register names with standard convension, please use GTM_ATOM8_CH7_SOMB.
 */
#define GTM_ATOM8_CH7_CTRL_SOMB        (GTM_ATOM8_CH7_SOMB)

/** \\brief  EC388, ATOM channel 0 CCU0 compare shadow register */
#define GTM_ATOM8_CH7_SR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0 *)0xF01EC388u)

/** \\brief  EC38C, ATOM channel 0 CCU1 compare shadow register */
#define GTM_ATOM8_CH7_SR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1 *)0xF01EC38Cu)

/** \\brief  EC39C, ATOM channel 0 status register */
#define GTM_ATOM8_CH7_STAT             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT *)0xF01EC39Cu)

/** \\brief  EC84C, ATOM AGC action time base register */
#define GTM_ATOM9_AGC_ACT_TB           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_ACT_TB *)0xF01EC84Cu)

/** \\brief  EC844, ATOM AGC enable/disable control register */
#define GTM_ATOM9_AGC_ENDIS_CTRL       /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_ENDIS_CTRL *)0xF01EC844u)

/** \\brief  EC848, ATOM AGC enable/disable status register */
#define GTM_ATOM9_AGC_ENDIS_STAT       /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_ENDIS_STAT *)0xF01EC848u)

/** \\brief  EC858, ATOM AGC force update control register */
#define GTM_ATOM9_AGC_FUPD_CTRL        /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_FUPD_CTRL *)0xF01EC858u)

/** \\brief  EC840, ATOM AGC global control register */
#define GTM_ATOM9_AGC_GLB_CTRL         /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_GLB_CTRL *)0xF01EC840u)

/** \\brief  EC85C, ATOM AGC internal trigger control register */
#define GTM_ATOM9_AGC_INT_TRIG         /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_INT_TRIG *)0xF01EC85Cu)

/** \\brief  EC850, ATOM AGC output enable control register */
#define GTM_ATOM9_AGC_OUTEN_CTRL       /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_OUTEN_CTRL *)0xF01EC850u)

/** \\brief  EC854, ATOM AGC output enable status register */
#define GTM_ATOM9_AGC_OUTEN_STAT       /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_OUTEN_STAT *)0xF01EC854u)

/** \\brief  EC810, ATOM channel 0 CCU0 compare register */
#define GTM_ATOM9_CH0_CM0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0 *)0xF01EC810u)

/** \\brief  EC814, ATOM channel 0 CCU1 compare register */
#define GTM_ATOM9_CH0_CM1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1 *)0xF01EC814u)

/** \\brief  EC818, ATOM channel 0 CCU0 counter register */
#define GTM_ATOM9_CH0_CN0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0 *)0xF01EC818u)

/** \\brief  EC824, ATOM channel 0 interrupt enable register */
#define GTM_ATOM9_CH0_IRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN *)0xF01EC824u)

/** \\brief  EC828, ATOM channel 0 software interrupt generation */
#define GTM_ATOM9_CH0_IRQ_FORCINT      /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT *)0xF01EC828u)

/** \\brief  EC82C, ATOM channel 0 interrupt mode configuration register */
#define GTM_ATOM9_CH0_IRQ_MODE         /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE *)0xF01EC82Cu)

/** \\brief  EC820, ATOM channel 0 interrupt notification register */
#define GTM_ATOM9_CH0_IRQ_NOTIFY       /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY *)0xF01EC820u)

/** \\brief  EC800, ATOM channel 0 ARU read address register */
#define GTM_ATOM9_CH0_RDADDR           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR *)0xF01EC800u)

/** \brief  EC804, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM9_CH0_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL *)0xF01EC804u)

/** \brief  EC804, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM9_CH0_SOMI             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI *)0xF01EC804u)

