Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** Alias (User Manual Name) for GTM_ATOM9_CH0_SOMI.
 * To use register names with standard convension, please use GTM_ATOM9_CH0_SOMI.
 */
#define GTM_ATOM9_CH0_CTRL_SOMI        (GTM_ATOM9_CH0_SOMI)

/** \brief  EC804, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM9_CH0_SOMC             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC *)0xF01EC804u)

/** Alias (User Manual Name) for GTM_ATOM9_CH0_SOMC.
 * To use register names with standard convension, please use GTM_ATOM9_CH0_SOMC.
 */
#define GTM_ATOM9_CH0_CTRL_SOMC        (GTM_ATOM9_CH0_SOMC)

/** \brief  EC804, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM9_CH0_SOMP             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP *)0xF01EC804u)

/** Alias (User Manual Name) for GTM_ATOM9_CH0_SOMP.
 * To use register names with standard convension, please use GTM_ATOM9_CH0_SOMP.
 */
#define GTM_ATOM9_CH0_CTRL_SOMP        (GTM_ATOM9_CH0_SOMP)

/** \brief  EC804, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM9_CH0_SOMS             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS *)0xF01EC804u)

/** Alias (User Manual Name) for GTM_ATOM9_CH0_SOMS.
 * To use register names with standard convension, please use GTM_ATOM9_CH0_SOMS.
 */
#define GTM_ATOM9_CH0_CTRL_SOMS        (GTM_ATOM9_CH0_SOMS)

/** \brief  EC804, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM9_CH0_SOMB             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB *)0xF01EC804u)

/** Alias (User Manual Name) for GTM_ATOM9_CH0_SOMB.
 * To use register names with standard convension, please use GTM_ATOM9_CH0_SOMB.
 */
#define GTM_ATOM9_CH0_CTRL_SOMB        (GTM_ATOM9_CH0_SOMB)

/** \\brief  EC808, ATOM channel 0 CCU0 compare shadow register */
#define GTM_ATOM9_CH0_SR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0 *)0xF01EC808u)

/** \\brief  EC80C, ATOM channel 0 CCU1 compare shadow register */
#define GTM_ATOM9_CH0_SR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1 *)0xF01EC80Cu)

/** \\brief  EC81C, ATOM channel 0 status register */
#define GTM_ATOM9_CH0_STAT             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT *)0xF01EC81Cu)

/** \\brief  EC890, ATOM channel 0 CCU0 compare register */
#define GTM_ATOM9_CH1_CM0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0 *)0xF01EC890u)

/** \\brief  EC894, ATOM channel 0 CCU1 compare register */
#define GTM_ATOM9_CH1_CM1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1 *)0xF01EC894u)

/** \\brief  EC898, ATOM channel 0 CCU0 counter register */
#define GTM_ATOM9_CH1_CN0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0 *)0xF01EC898u)

/** \\brief  EC8A4, ATOM channel 0 interrupt enable register */
#define GTM_ATOM9_CH1_IRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN *)0xF01EC8A4u)

/** \\brief  EC8A8, ATOM channel 0 software interrupt generation */
#define GTM_ATOM9_CH1_IRQ_FORCINT      /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT *)0xF01EC8A8u)

/** \\brief  EC8AC, ATOM channel 0 interrupt mode configuration register */
#define GTM_ATOM9_CH1_IRQ_MODE         /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE *)0xF01EC8ACu)

/** \\brief  EC8A0, ATOM channel 0 interrupt notification register */
#define GTM_ATOM9_CH1_IRQ_NOTIFY       /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY *)0xF01EC8A0u)

/** \\brief  EC880, ATOM channel 0 ARU read address register */
#define GTM_ATOM9_CH1_RDADDR           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR *)0xF01EC880u)

/** \brief  EC884, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM9_CH1_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL *)0xF01EC884u)

/** \brief  EC884, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM9_CH1_SOMI             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI *)0xF01EC884u)

/** Alias (User Manual Name) for GTM_ATOM9_CH1_SOMI.
 * To use register names with standard convension, please use GTM_ATOM9_CH1_SOMI.
 */
#define GTM_ATOM9_CH1_CTRL_SOMI        (GTM_ATOM9_CH1_SOMI)

/** \brief  EC884, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM9_CH1_SOMC             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC *)0xF01EC884u)

/** Alias (User Manual Name) for GTM_ATOM9_CH1_SOMC.
 * To use register names with standard convension, please use GTM_ATOM9_CH1_SOMC.
 */
#define GTM_ATOM9_CH1_CTRL_SOMC        (GTM_ATOM9_CH1_SOMC)

/** \brief  EC884, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM9_CH1_SOMP             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP *)0xF01EC884u)

/** Alias (User Manual Name) for GTM_ATOM9_CH1_SOMP.
 * To use register names with standard convension, please use GTM_ATOM9_CH1_SOMP.
 */
#define GTM_ATOM9_CH1_CTRL_SOMP        (GTM_ATOM9_CH1_SOMP)

/** \brief  EC884, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM9_CH1_SOMS             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS *)0xF01EC884u)

/** Alias (User Manual Name) for GTM_ATOM9_CH1_SOMS.
 * To use register names with standard convension, please use GTM_ATOM9_CH1_SOMS.
 */
#define GTM_ATOM9_CH1_CTRL_SOMS        (GTM_ATOM9_CH1_SOMS)

/** \brief  EC884, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM9_CH1_SOMB             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB *)0xF01EC884u)

/** Alias (User Manual Name) for GTM_ATOM9_CH1_SOMB.
 * To use register names with standard convension, please use GTM_ATOM9_CH1_SOMB.
 */
#define GTM_ATOM9_CH1_CTRL_SOMB        (GTM_ATOM9_CH1_SOMB)

/** \\brief  EC888, ATOM channel 0 CCU0 compare shadow register */
#define GTM_ATOM9_CH1_SR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0 *)0xF01EC888u)

/** \\brief  EC88C, ATOM channel 0 CCU1 compare shadow register */
#define GTM_ATOM9_CH1_SR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1 *)0xF01EC88Cu)

/** \\brief  EC89C, ATOM channel 0 status register */
#define GTM_ATOM9_CH1_STAT             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT *)0xF01EC89Cu)

/** \\brief  EC910, ATOM channel 0 CCU0 compare register */
#define GTM_ATOM9_CH2_CM0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0 *)0xF01EC910u)

/** \\brief  EC914, ATOM channel 0 CCU1 compare register */
#define GTM_ATOM9_CH2_CM1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1 *)0xF01EC914u)

/** \\brief  EC918, ATOM channel 0 CCU0 counter register */
#define GTM_ATOM9_CH2_CN0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0 *)0xF01EC918u)

