Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  EC924, ATOM channel 0 interrupt enable register */
#define GTM_ATOM9_CH2_IRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN *)0xF01EC924u)

/** \\brief  EC928, ATOM channel 0 software interrupt generation */
#define GTM_ATOM9_CH2_IRQ_FORCINT      /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT *)0xF01EC928u)

/** \\brief  EC92C, ATOM channel 0 interrupt mode configuration register */
#define GTM_ATOM9_CH2_IRQ_MODE         /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE *)0xF01EC92Cu)

/** \\brief  EC920, ATOM channel 0 interrupt notification register */
#define GTM_ATOM9_CH2_IRQ_NOTIFY       /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY *)0xF01EC920u)

/** \\brief  EC900, ATOM channel 0 ARU read address register */
#define GTM_ATOM9_CH2_RDADDR           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR *)0xF01EC900u)

/** \brief  EC904, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM9_CH2_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL *)0xF01EC904u)

/** \brief  EC904, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM9_CH2_SOMI             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI *)0xF01EC904u)

/** Alias (User Manual Name) for GTM_ATOM9_CH2_SOMI.
 * To use register names with standard convension, please use GTM_ATOM9_CH2_SOMI.
 */
#define GTM_ATOM9_CH2_CTRL_SOMI        (GTM_ATOM9_CH2_SOMI)

/** \brief  EC904, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM9_CH2_SOMC             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC *)0xF01EC904u)

/** Alias (User Manual Name) for GTM_ATOM9_CH2_SOMC.
 * To use register names with standard convension, please use GTM_ATOM9_CH2_SOMC.
 */
#define GTM_ATOM9_CH2_CTRL_SOMC        (GTM_ATOM9_CH2_SOMC)

/** \brief  EC904, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM9_CH2_SOMP             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP *)0xF01EC904u)

/** Alias (User Manual Name) for GTM_ATOM9_CH2_SOMP.
 * To use register names with standard convension, please use GTM_ATOM9_CH2_SOMP.
 */
#define GTM_ATOM9_CH2_CTRL_SOMP        (GTM_ATOM9_CH2_SOMP)

/** \brief  EC904, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM9_CH2_SOMS             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS *)0xF01EC904u)

/** Alias (User Manual Name) for GTM_ATOM9_CH2_SOMS.
 * To use register names with standard convension, please use GTM_ATOM9_CH2_SOMS.
 */
#define GTM_ATOM9_CH2_CTRL_SOMS        (GTM_ATOM9_CH2_SOMS)

/** \brief  EC904, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM9_CH2_SOMB             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB *)0xF01EC904u)

/** Alias (User Manual Name) for GTM_ATOM9_CH2_SOMB.
 * To use register names with standard convension, please use GTM_ATOM9_CH2_SOMB.
 */
#define GTM_ATOM9_CH2_CTRL_SOMB        (GTM_ATOM9_CH2_SOMB)

/** \\brief  EC908, ATOM channel 0 CCU0 compare shadow register */
#define GTM_ATOM9_CH2_SR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0 *)0xF01EC908u)

/** \\brief  EC90C, ATOM channel 0 CCU1 compare shadow register */
#define GTM_ATOM9_CH2_SR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1 *)0xF01EC90Cu)

/** \\brief  EC91C, ATOM channel 0 status register */
#define GTM_ATOM9_CH2_STAT             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT *)0xF01EC91Cu)

/** \\brief  EC990, ATOM channel 0 CCU0 compare register */
#define GTM_ATOM9_CH3_CM0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0 *)0xF01EC990u)

/** \\brief  EC994, ATOM channel 0 CCU1 compare register */
#define GTM_ATOM9_CH3_CM1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1 *)0xF01EC994u)

/** \\brief  EC998, ATOM channel 0 CCU0 counter register */
#define GTM_ATOM9_CH3_CN0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0 *)0xF01EC998u)

/** \\brief  EC9A4, ATOM channel 0 interrupt enable register */
#define GTM_ATOM9_CH3_IRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN *)0xF01EC9A4u)

/** \\brief  EC9A8, ATOM channel 0 software interrupt generation */
#define GTM_ATOM9_CH3_IRQ_FORCINT      /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT *)0xF01EC9A8u)

/** \\brief  EC9AC, ATOM channel 0 interrupt mode configuration register */
#define GTM_ATOM9_CH3_IRQ_MODE         /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE *)0xF01EC9ACu)

/** \\brief  EC9A0, ATOM channel 0 interrupt notification register */
#define GTM_ATOM9_CH3_IRQ_NOTIFY       /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY *)0xF01EC9A0u)

/** \\brief  EC980, ATOM channel 0 ARU read address register */
#define GTM_ATOM9_CH3_RDADDR           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR *)0xF01EC980u)

/** \brief  EC984, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM9_CH3_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL *)0xF01EC984u)

/** \brief  EC984, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM9_CH3_SOMI             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI *)0xF01EC984u)

/** Alias (User Manual Name) for GTM_ATOM9_CH3_SOMI.
 * To use register names with standard convension, please use GTM_ATOM9_CH3_SOMI.
 */
#define GTM_ATOM9_CH3_CTRL_SOMI        (GTM_ATOM9_CH3_SOMI)

/** \brief  EC984, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM9_CH3_SOMC             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC *)0xF01EC984u)

/** Alias (User Manual Name) for GTM_ATOM9_CH3_SOMC.
 * To use register names with standard convension, please use GTM_ATOM9_CH3_SOMC.
 */
#define GTM_ATOM9_CH3_CTRL_SOMC        (GTM_ATOM9_CH3_SOMC)

/** \brief  EC984, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM9_CH3_SOMP             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP *)0xF01EC984u)

/** Alias (User Manual Name) for GTM_ATOM9_CH3_SOMP.
 * To use register names with standard convension, please use GTM_ATOM9_CH3_SOMP.
 */
#define GTM_ATOM9_CH3_CTRL_SOMP        (GTM_ATOM9_CH3_SOMP)

