Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \brief  EC984, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM9_CH3_SOMS             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS *)0xF01EC984u)

/** Alias (User Manual Name) for GTM_ATOM9_CH3_SOMS.
 * To use register names with standard convension, please use GTM_ATOM9_CH3_SOMS.
 */
#define GTM_ATOM9_CH3_CTRL_SOMS        (GTM_ATOM9_CH3_SOMS)

/** \brief  EC984, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM9_CH3_SOMB             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB *)0xF01EC984u)

/** Alias (User Manual Name) for GTM_ATOM9_CH3_SOMB.
 * To use register names with standard convension, please use GTM_ATOM9_CH3_SOMB.
 */
#define GTM_ATOM9_CH3_CTRL_SOMB        (GTM_ATOM9_CH3_SOMB)

/** \\brief  EC988, ATOM channel 0 CCU0 compare shadow register */
#define GTM_ATOM9_CH3_SR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0 *)0xF01EC988u)

/** \\brief  EC98C, ATOM channel 0 CCU1 compare shadow register */
#define GTM_ATOM9_CH3_SR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1 *)0xF01EC98Cu)

/** \\brief  EC99C, ATOM channel 0 status register */
#define GTM_ATOM9_CH3_STAT             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT *)0xF01EC99Cu)

/** \\brief  ECA10, ATOM channel 0 CCU0 compare register */
#define GTM_ATOM9_CH4_CM0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0 *)0xF01ECA10u)

/** \\brief  ECA14, ATOM channel 0 CCU1 compare register */
#define GTM_ATOM9_CH4_CM1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1 *)0xF01ECA14u)

/** \\brief  ECA18, ATOM channel 0 CCU0 counter register */
#define GTM_ATOM9_CH4_CN0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0 *)0xF01ECA18u)

/** \\brief  ECA24, ATOM channel 0 interrupt enable register */
#define GTM_ATOM9_CH4_IRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN *)0xF01ECA24u)

/** \\brief  ECA28, ATOM channel 0 software interrupt generation */
#define GTM_ATOM9_CH4_IRQ_FORCINT      /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT *)0xF01ECA28u)

/** \\brief  ECA2C, ATOM channel 0 interrupt mode configuration register */
#define GTM_ATOM9_CH4_IRQ_MODE         /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE *)0xF01ECA2Cu)

/** \\brief  ECA20, ATOM channel 0 interrupt notification register */
#define GTM_ATOM9_CH4_IRQ_NOTIFY       /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY *)0xF01ECA20u)

/** \\brief  ECA00, ATOM channel 0 ARU read address register */
#define GTM_ATOM9_CH4_RDADDR           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR *)0xF01ECA00u)

/** \brief  ECA04, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM9_CH4_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL *)0xF01ECA04u)

/** \brief  ECA04, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM9_CH4_SOMI             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI *)0xF01ECA04u)

/** Alias (User Manual Name) for GTM_ATOM9_CH4_SOMI.
 * To use register names with standard convension, please use GTM_ATOM9_CH4_SOMI.
 */
#define GTM_ATOM9_CH4_CTRL_SOMI        (GTM_ATOM9_CH4_SOMI)

/** \brief  ECA04, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM9_CH4_SOMC             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC *)0xF01ECA04u)

/** Alias (User Manual Name) for GTM_ATOM9_CH4_SOMC.
 * To use register names with standard convension, please use GTM_ATOM9_CH4_SOMC.
 */
#define GTM_ATOM9_CH4_CTRL_SOMC        (GTM_ATOM9_CH4_SOMC)

/** \brief  ECA04, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM9_CH4_SOMP             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP *)0xF01ECA04u)

/** Alias (User Manual Name) for GTM_ATOM9_CH4_SOMP.
 * To use register names with standard convension, please use GTM_ATOM9_CH4_SOMP.
 */
#define GTM_ATOM9_CH4_CTRL_SOMP        (GTM_ATOM9_CH4_SOMP)

/** \brief  ECA04, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM9_CH4_SOMS             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS *)0xF01ECA04u)

/** Alias (User Manual Name) for GTM_ATOM9_CH4_SOMS.
 * To use register names with standard convension, please use GTM_ATOM9_CH4_SOMS.
 */
#define GTM_ATOM9_CH4_CTRL_SOMS        (GTM_ATOM9_CH4_SOMS)

/** \brief  ECA04, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM9_CH4_SOMB             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB *)0xF01ECA04u)

/** Alias (User Manual Name) for GTM_ATOM9_CH4_SOMB.
 * To use register names with standard convension, please use GTM_ATOM9_CH4_SOMB.
 */
#define GTM_ATOM9_CH4_CTRL_SOMB        (GTM_ATOM9_CH4_SOMB)

/** \\brief  ECA08, ATOM channel 0 CCU0 compare shadow register */
#define GTM_ATOM9_CH4_SR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0 *)0xF01ECA08u)

/** \\brief  ECA0C, ATOM channel 0 CCU1 compare shadow register */
#define GTM_ATOM9_CH4_SR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1 *)0xF01ECA0Cu)

/** \\brief  ECA1C, ATOM channel 0 status register */
#define GTM_ATOM9_CH4_STAT             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT *)0xF01ECA1Cu)

/** \\brief  ECA90, ATOM channel 0 CCU0 compare register */
#define GTM_ATOM9_CH5_CM0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0 *)0xF01ECA90u)

/** \\brief  ECA94, ATOM channel 0 CCU1 compare register */
#define GTM_ATOM9_CH5_CM1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1 *)0xF01ECA94u)

/** \\brief  ECA98, ATOM channel 0 CCU0 counter register */
#define GTM_ATOM9_CH5_CN0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0 *)0xF01ECA98u)

/** \\brief  ECAA4, ATOM channel 0 interrupt enable register */
#define GTM_ATOM9_CH5_IRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN *)0xF01ECAA4u)

/** \\brief  ECAA8, ATOM channel 0 software interrupt generation */
#define GTM_ATOM9_CH5_IRQ_FORCINT      /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT *)0xF01ECAA8u)

