Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  ECAAC, ATOM channel 0 interrupt mode configuration register */
#define GTM_ATOM9_CH5_IRQ_MODE         /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE *)0xF01ECAACu)

/** \\brief  ECAA0, ATOM channel 0 interrupt notification register */
#define GTM_ATOM9_CH5_IRQ_NOTIFY       /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY *)0xF01ECAA0u)

/** \\brief  ECA80, ATOM channel 0 ARU read address register */
#define GTM_ATOM9_CH5_RDADDR           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR *)0xF01ECA80u)

/** \brief  ECA84, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM9_CH5_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL *)0xF01ECA84u)

/** \brief  ECA84, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM9_CH5_SOMI             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI *)0xF01ECA84u)

/** Alias (User Manual Name) for GTM_ATOM9_CH5_SOMI.
 * To use register names with standard convension, please use GTM_ATOM9_CH5_SOMI.
 */
#define GTM_ATOM9_CH5_CTRL_SOMI        (GTM_ATOM9_CH5_SOMI)

/** \brief  ECA84, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM9_CH5_SOMC             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC *)0xF01ECA84u)

/** Alias (User Manual Name) for GTM_ATOM9_CH5_SOMC.
 * To use register names with standard convension, please use GTM_ATOM9_CH5_SOMC.
 */
#define GTM_ATOM9_CH5_CTRL_SOMC        (GTM_ATOM9_CH5_SOMC)

/** \brief  ECA84, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM9_CH5_SOMP             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP *)0xF01ECA84u)

/** Alias (User Manual Name) for GTM_ATOM9_CH5_SOMP.
 * To use register names with standard convension, please use GTM_ATOM9_CH5_SOMP.
 */
#define GTM_ATOM9_CH5_CTRL_SOMP        (GTM_ATOM9_CH5_SOMP)

/** \brief  ECA84, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM9_CH5_SOMS             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS *)0xF01ECA84u)

/** Alias (User Manual Name) for GTM_ATOM9_CH5_SOMS.
 * To use register names with standard convension, please use GTM_ATOM9_CH5_SOMS.
 */
#define GTM_ATOM9_CH5_CTRL_SOMS        (GTM_ATOM9_CH5_SOMS)

/** \brief  ECA84, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM9_CH5_SOMB             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB *)0xF01ECA84u)

/** Alias (User Manual Name) for GTM_ATOM9_CH5_SOMB.
 * To use register names with standard convension, please use GTM_ATOM9_CH5_SOMB.
 */
#define GTM_ATOM9_CH5_CTRL_SOMB        (GTM_ATOM9_CH5_SOMB)

/** \\brief  ECA88, ATOM channel 0 CCU0 compare shadow register */
#define GTM_ATOM9_CH5_SR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0 *)0xF01ECA88u)

/** \\brief  ECA8C, ATOM channel 0 CCU1 compare shadow register */
#define GTM_ATOM9_CH5_SR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1 *)0xF01ECA8Cu)

/** \\brief  ECA9C, ATOM channel 0 status register */
#define GTM_ATOM9_CH5_STAT             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT *)0xF01ECA9Cu)

/** \\brief  ECB10, ATOM channel 0 CCU0 compare register */
#define GTM_ATOM9_CH6_CM0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0 *)0xF01ECB10u)

/** \\brief  ECB14, ATOM channel 0 CCU1 compare register */
#define GTM_ATOM9_CH6_CM1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1 *)0xF01ECB14u)

/** \\brief  ECB18, ATOM channel 0 CCU0 counter register */
#define GTM_ATOM9_CH6_CN0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0 *)0xF01ECB18u)

/** \\brief  ECB24, ATOM channel 0 interrupt enable register */
#define GTM_ATOM9_CH6_IRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN *)0xF01ECB24u)

/** \\brief  ECB28, ATOM channel 0 software interrupt generation */
#define GTM_ATOM9_CH6_IRQ_FORCINT      /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT *)0xF01ECB28u)

/** \\brief  ECB2C, ATOM channel 0 interrupt mode configuration register */
#define GTM_ATOM9_CH6_IRQ_MODE         /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE *)0xF01ECB2Cu)

/** \\brief  ECB20, ATOM channel 0 interrupt notification register */
#define GTM_ATOM9_CH6_IRQ_NOTIFY       /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY *)0xF01ECB20u)

/** \\brief  ECB00, ATOM channel 0 ARU read address register */
#define GTM_ATOM9_CH6_RDADDR           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR *)0xF01ECB00u)

/** \brief  ECB04, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM9_CH6_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL *)0xF01ECB04u)

/** \brief  ECB04, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM9_CH6_SOMI             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI *)0xF01ECB04u)

/** Alias (User Manual Name) for GTM_ATOM9_CH6_SOMI.
 * To use register names with standard convension, please use GTM_ATOM9_CH6_SOMI.
 */
#define GTM_ATOM9_CH6_CTRL_SOMI        (GTM_ATOM9_CH6_SOMI)

/** \brief  ECB04, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM9_CH6_SOMC             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC *)0xF01ECB04u)

/** Alias (User Manual Name) for GTM_ATOM9_CH6_SOMC.
 * To use register names with standard convension, please use GTM_ATOM9_CH6_SOMC.
 */
#define GTM_ATOM9_CH6_CTRL_SOMC        (GTM_ATOM9_CH6_SOMC)

/** \brief  ECB04, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM9_CH6_SOMP             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP *)0xF01ECB04u)

/** Alias (User Manual Name) for GTM_ATOM9_CH6_SOMP.
 * To use register names with standard convension, please use GTM_ATOM9_CH6_SOMP.
 */
#define GTM_ATOM9_CH6_CTRL_SOMP        (GTM_ATOM9_CH6_SOMP)

/** \brief  ECB04, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM9_CH6_SOMS             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS *)0xF01ECB04u)

/** Alias (User Manual Name) for GTM_ATOM9_CH6_SOMS.
 * To use register names with standard convension, please use GTM_ATOM9_CH6_SOMS.
 */
#define GTM_ATOM9_CH6_CTRL_SOMS        (GTM_ATOM9_CH6_SOMS)

/** \brief  ECB04, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM9_CH6_SOMB             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB *)0xF01ECB04u)

/** Alias (User Manual Name) for GTM_ATOM9_CH6_SOMB.
 * To use register names with standard convension, please use GTM_ATOM9_CH6_SOMB.
 */
#define GTM_ATOM9_CH6_CTRL_SOMB        (GTM_ATOM9_CH6_SOMB)

/** \\brief  ECB08, ATOM channel 0 CCU0 compare shadow register */
#define GTM_ATOM9_CH6_SR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0 *)0xF01ECB08u)

/** \\brief  ECB0C, ATOM channel 0 CCU1 compare shadow register */
#define GTM_ATOM9_CH6_SR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1 *)0xF01ECB0Cu)

