Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  ECB1C, ATOM channel 0 status register */
#define GTM_ATOM9_CH6_STAT             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT *)0xF01ECB1Cu)

/** \\brief  ECB90, ATOM channel 0 CCU0 compare register */
#define GTM_ATOM9_CH7_CM0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0 *)0xF01ECB90u)

/** \\brief  ECB94, ATOM channel 0 CCU1 compare register */
#define GTM_ATOM9_CH7_CM1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1 *)0xF01ECB94u)

/** \\brief  ECB98, ATOM channel 0 CCU0 counter register */
#define GTM_ATOM9_CH7_CN0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0 *)0xF01ECB98u)

/** \\brief  ECBA4, ATOM channel 0 interrupt enable register */
#define GTM_ATOM9_CH7_IRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN *)0xF01ECBA4u)

/** \\brief  ECBA8, ATOM channel 0 software interrupt generation */
#define GTM_ATOM9_CH7_IRQ_FORCINT      /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT *)0xF01ECBA8u)

/** \\brief  ECBAC, ATOM channel 0 interrupt mode configuration register */
#define GTM_ATOM9_CH7_IRQ_MODE         /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE *)0xF01ECBACu)

/** \\brief  ECBA0, ATOM channel 0 interrupt notification register */
#define GTM_ATOM9_CH7_IRQ_NOTIFY       /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY *)0xF01ECBA0u)

/** \\brief  ECB80, ATOM channel 0 ARU read address register */
#define GTM_ATOM9_CH7_RDADDR           /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR *)0xF01ECB80u)

/** \brief  ECB84, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM9_CH7_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL *)0xF01ECB84u)

/** \brief  ECB84, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM9_CH7_SOMI             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI *)0xF01ECB84u)

/** Alias (User Manual Name) for GTM_ATOM9_CH7_SOMI.
 * To use register names with standard convension, please use GTM_ATOM9_CH7_SOMI.
 */
#define GTM_ATOM9_CH7_CTRL_SOMI        (GTM_ATOM9_CH7_SOMI)

/** \brief  ECB84, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM9_CH7_SOMC             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC *)0xF01ECB84u)

/** Alias (User Manual Name) for GTM_ATOM9_CH7_SOMC.
 * To use register names with standard convension, please use GTM_ATOM9_CH7_SOMC.
 */
#define GTM_ATOM9_CH7_CTRL_SOMC        (GTM_ATOM9_CH7_SOMC)

/** \brief  ECB84, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM9_CH7_SOMP             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP *)0xF01ECB84u)

/** Alias (User Manual Name) for GTM_ATOM9_CH7_SOMP.
 * To use register names with standard convension, please use GTM_ATOM9_CH7_SOMP.
 */
#define GTM_ATOM9_CH7_CTRL_SOMP        (GTM_ATOM9_CH7_SOMP)

/** \brief  ECB84, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM9_CH7_SOMS             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS *)0xF01ECB84u)

/** Alias (User Manual Name) for GTM_ATOM9_CH7_SOMS.
 * To use register names with standard convension, please use GTM_ATOM9_CH7_SOMS.
 */
#define GTM_ATOM9_CH7_CTRL_SOMS        (GTM_ATOM9_CH7_SOMS)

/** \brief  ECB84, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM9_CH7_SOMB             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB *)0xF01ECB84u)

/** Alias (User Manual Name) for GTM_ATOM9_CH7_SOMB.
 * To use register names with standard convension, please use GTM_ATOM9_CH7_SOMB.
 */
#define GTM_ATOM9_CH7_CTRL_SOMB        (GTM_ATOM9_CH7_SOMB)

/** \\brief  ECB88, ATOM channel 0 CCU0 compare shadow register */
#define GTM_ATOM9_CH7_SR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0 *)0xF01ECB88u)

/** \\brief  ECB8C, ATOM channel 0 CCU1 compare shadow register */
#define GTM_ATOM9_CH7_SR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1 *)0xF01ECB8Cu)

/** \\brief  ECB9C, ATOM channel 0 status register */
#define GTM_ATOM9_CH7_STAT             /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT *)0xF01ECB9Cu)

/** \\brief  98, GTM ATOM   Output Level */
#define GTM_ATOM_OUT0                  /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_OUT *)0xF0100098u)

/** Alias (User Manual Name) for GTM_ATOM_OUT0.
 * To use register names with standard convension, please use GTM_ATOM_OUT0.
 */
#define GTM_ATOM0_OUT                  (GTM_ATOM_OUT0)

/** Alias (User Manual Name) for GTM_ATOM_OUT0.
 * To use register names with standard convension, please use GTM_ATOM_OUT0.
 */
#define GTM_ATOM0_OUT                  (GTM_ATOM_OUT0)

/** \\brief  9C, GTM ATOM   Output Level */
#define GTM_ATOM_OUT1                  /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_OUT *)0xF010009Cu)

/** Alias (User Manual Name) for GTM_ATOM_OUT1.
 * To use register names with standard convension, please use GTM_ATOM_OUT1.
 */
#define GTM_ATOM2_OUT                  (GTM_ATOM_OUT1)

/** Alias (User Manual Name) for GTM_ATOM_OUT1.
 * To use register names with standard convension, please use GTM_ATOM_OUT1.
 */
#define GTM_ATOM2_OUT                  (GTM_ATOM_OUT1)

/** \\brief  A0, GTM ATOM   Output Level */
#define GTM_ATOM_OUT2                  /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_OUT *)0xF01000A0u)

/** Alias (User Manual Name) for GTM_ATOM_OUT2.
 * To use register names with standard convension, please use GTM_ATOM_OUT2.
 */
#define GTM_ATOM4_OUT                  (GTM_ATOM_OUT2)

/** Alias (User Manual Name) for GTM_ATOM_OUT2.
 * To use register names with standard convension, please use GTM_ATOM_OUT2.
 */
#define GTM_ATOM4_OUT                  (GTM_ATOM_OUT2)

/** \\brief  A4, GTM ATOM   Output Level */
#define GTM_ATOM_OUT3                  /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_OUT *)0xF01000A4u)

/** Alias (User Manual Name) for GTM_ATOM_OUT3.
 * To use register names with standard convension, please use GTM_ATOM_OUT3.
 */
#define GTM_ATOM6_OUT                  (GTM_ATOM_OUT3)

/** Alias (User Manual Name) for GTM_ATOM_OUT3.
 * To use register names with standard convension, please use GTM_ATOM_OUT3.
 */
#define GTM_ATOM6_OUT                  (GTM_ATOM_OUT3)

/** \\brief  A8, GTM ATOM   Output Level */
#define GTM_ATOM_OUT4                  /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_OUT *)0xF01000A8u)

/** Alias (User Manual Name) for GTM_ATOM_OUT4.
 * To use register names with standard convension, please use GTM_ATOM_OUT4.
 */
#define GTM_ATOM8_OUT                  (GTM_ATOM_OUT4)

/** Alias (User Manual Name) for GTM_ATOM_OUT4.
 * To use register names with standard convension, please use GTM_ATOM_OUT4.
 */
#define GTM_ATOM8_OUT                  (GTM_ATOM_OUT4)

/** \\brief  474, BRC error interrupt enable register */
#define GTM_BRC_EIRQ_EN                /*lint --e(923)*/ (*(volatile Ifx_GTM_BRC_EIRQ_EN *)0xF0100474u)

/** \\brief  464, BRC interrupt enable register */
#define GTM_BRC_IRQ_EN                 /*lint --e(923)*/ (*(volatile Ifx_GTM_BRC_IRQ_EN *)0xF0100464u)

/** \\brief  468, BRC force interrupt register */
#define GTM_BRC_IRQ_FORCINT            /*lint --e(923)*/ (*(volatile Ifx_GTM_BRC_IRQ_FORCINT *)0xF0100468u)

/** \\brief  46C, BRC interrupt mode configuration register */
#define GTM_BRC_IRQ_MODE               /*lint --e(923)*/ (*(volatile Ifx_GTM_BRC_IRQ_MODE *)0xF010046Cu)

/** \\brief  460, BRC interrupt notification register */
#define GTM_BRC_IRQ_NOTIFY             /*lint --e(923)*/ (*(volatile Ifx_GTM_BRC_IRQ_NOTIFY *)0xF0100460u)

/** \\brief  470, BRC software reset register */
#define GTM_BRC_RST                    /*lint --e(923)*/ (*(volatile Ifx_GTM_BRC_RST *)0xF0100470u)

