Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  400, BRC read address for input channel 0 */
#define GTM_BRC_SRC0_ADDR              /*lint --e(923)*/ (*(volatile Ifx_GTM_BRC_SRC_ADDR *)0xF0100400u)

/** Alias (User Manual Name) for GTM_BRC_SRC0_ADDR.
 * To use register names with standard convension, please use GTM_BRC_SRC0_ADDR.
 */
#define GTM_BRC_SRC_0_ADDR             (GTM_BRC_SRC0_ADDR)

/** Alias (User Manual Name) for GTM_BRC_SRC0_ADDR.
 * To use register names with standard convension, please use GTM_BRC_SRC0_ADDR.
 */
#define GTM_BRC_SRC_0_ADDR             (GTM_BRC_SRC0_ADDR)

/** \\brief  404, BRC destination channels for input channel 0 */
#define GTM_BRC_SRC0_DEST              /*lint --e(923)*/ (*(volatile Ifx_GTM_BRC_SRC_DEST *)0xF0100404u)

/** Alias (User Manual Name) for GTM_BRC_SRC0_DEST.
 * To use register names with standard convension, please use GTM_BRC_SRC0_DEST.
 */
#define GTM_BRC_SRC_0_DEST             (GTM_BRC_SRC0_DEST)

/** Alias (User Manual Name) for GTM_BRC_SRC0_DEST.
 * To use register names with standard convension, please use GTM_BRC_SRC0_DEST.
 */
#define GTM_BRC_SRC_0_DEST             (GTM_BRC_SRC0_DEST)

/** \\brief  450, BRC read address for input channel 0 */
#define GTM_BRC_SRC10_ADDR             /*lint --e(923)*/ (*(volatile Ifx_GTM_BRC_SRC_ADDR *)0xF0100450u)

/** Alias (User Manual Name) for GTM_BRC_SRC10_ADDR.
 * To use register names with standard convension, please use GTM_BRC_SRC10_ADDR.
 */
#define GTM_BRC_SRC_10_ADDR            (GTM_BRC_SRC10_ADDR)

/** Alias (User Manual Name) for GTM_BRC_SRC10_ADDR.
 * To use register names with standard convension, please use GTM_BRC_SRC10_ADDR.
 */
#define GTM_BRC_SRC_10_ADDR            (GTM_BRC_SRC10_ADDR)

/** \\brief  454, BRC destination channels for input channel 0 */
#define GTM_BRC_SRC10_DEST             /*lint --e(923)*/ (*(volatile Ifx_GTM_BRC_SRC_DEST *)0xF0100454u)

/** Alias (User Manual Name) for GTM_BRC_SRC10_DEST.
 * To use register names with standard convension, please use GTM_BRC_SRC10_DEST.
 */
#define GTM_BRC_SRC_10_DEST            (GTM_BRC_SRC10_DEST)

/** Alias (User Manual Name) for GTM_BRC_SRC10_DEST.
 * To use register names with standard convension, please use GTM_BRC_SRC10_DEST.
 */
#define GTM_BRC_SRC_10_DEST            (GTM_BRC_SRC10_DEST)

/** \\brief  458, BRC read address for input channel 0 */
#define GTM_BRC_SRC11_ADDR             /*lint --e(923)*/ (*(volatile Ifx_GTM_BRC_SRC_ADDR *)0xF0100458u)

/** Alias (User Manual Name) for GTM_BRC_SRC11_ADDR.
 * To use register names with standard convension, please use GTM_BRC_SRC11_ADDR.
 */
#define GTM_BRC_SRC_11_ADDR            (GTM_BRC_SRC11_ADDR)

/** Alias (User Manual Name) for GTM_BRC_SRC11_ADDR.
 * To use register names with standard convension, please use GTM_BRC_SRC11_ADDR.
 */
#define GTM_BRC_SRC_11_ADDR            (GTM_BRC_SRC11_ADDR)

/** \\brief  45C, BRC destination channels for input channel 0 */
#define GTM_BRC_SRC11_DEST             /*lint --e(923)*/ (*(volatile Ifx_GTM_BRC_SRC_DEST *)0xF010045Cu)

/** Alias (User Manual Name) for GTM_BRC_SRC11_DEST.
 * To use register names with standard convension, please use GTM_BRC_SRC11_DEST.
 */
#define GTM_BRC_SRC_11_DEST            (GTM_BRC_SRC11_DEST)

/** Alias (User Manual Name) for GTM_BRC_SRC11_DEST.
 * To use register names with standard convension, please use GTM_BRC_SRC11_DEST.
 */
#define GTM_BRC_SRC_11_DEST            (GTM_BRC_SRC11_DEST)

/** \\brief  408, BRC read address for input channel 0 */
#define GTM_BRC_SRC1_ADDR              /*lint --e(923)*/ (*(volatile Ifx_GTM_BRC_SRC_ADDR *)0xF0100408u)

/** Alias (User Manual Name) for GTM_BRC_SRC1_ADDR.
 * To use register names with standard convension, please use GTM_BRC_SRC1_ADDR.
 */
#define GTM_BRC_SRC_1_ADDR             (GTM_BRC_SRC1_ADDR)

/** Alias (User Manual Name) for GTM_BRC_SRC1_ADDR.
 * To use register names with standard convension, please use GTM_BRC_SRC1_ADDR.
 */
#define GTM_BRC_SRC_1_ADDR             (GTM_BRC_SRC1_ADDR)

/** \\brief  40C, BRC destination channels for input channel 0 */
#define GTM_BRC_SRC1_DEST              /*lint --e(923)*/ (*(volatile Ifx_GTM_BRC_SRC_DEST *)0xF010040Cu)

/** Alias (User Manual Name) for GTM_BRC_SRC1_DEST.
 * To use register names with standard convension, please use GTM_BRC_SRC1_DEST.
 */
#define GTM_BRC_SRC_1_DEST             (GTM_BRC_SRC1_DEST)

/** Alias (User Manual Name) for GTM_BRC_SRC1_DEST.
 * To use register names with standard convension, please use GTM_BRC_SRC1_DEST.
 */
#define GTM_BRC_SRC_1_DEST             (GTM_BRC_SRC1_DEST)

/** \\brief  410, BRC read address for input channel 0 */
#define GTM_BRC_SRC2_ADDR              /*lint --e(923)*/ (*(volatile Ifx_GTM_BRC_SRC_ADDR *)0xF0100410u)

/** Alias (User Manual Name) for GTM_BRC_SRC2_ADDR.
 * To use register names with standard convension, please use GTM_BRC_SRC2_ADDR.
 */
#define GTM_BRC_SRC_2_ADDR             (GTM_BRC_SRC2_ADDR)

/** Alias (User Manual Name) for GTM_BRC_SRC2_ADDR.
 * To use register names with standard convension, please use GTM_BRC_SRC2_ADDR.
 */
#define GTM_BRC_SRC_2_ADDR             (GTM_BRC_SRC2_ADDR)

/** \\brief  414, BRC destination channels for input channel 0 */
#define GTM_BRC_SRC2_DEST              /*lint --e(923)*/ (*(volatile Ifx_GTM_BRC_SRC_DEST *)0xF0100414u)

/** Alias (User Manual Name) for GTM_BRC_SRC2_DEST.
 * To use register names with standard convension, please use GTM_BRC_SRC2_DEST.
 */
#define GTM_BRC_SRC_2_DEST             (GTM_BRC_SRC2_DEST)

/** Alias (User Manual Name) for GTM_BRC_SRC2_DEST.
 * To use register names with standard convension, please use GTM_BRC_SRC2_DEST.
 */
#define GTM_BRC_SRC_2_DEST             (GTM_BRC_SRC2_DEST)

/** \\brief  418, BRC read address for input channel 0 */
#define GTM_BRC_SRC3_ADDR              /*lint --e(923)*/ (*(volatile Ifx_GTM_BRC_SRC_ADDR *)0xF0100418u)

/** Alias (User Manual Name) for GTM_BRC_SRC3_ADDR.
 * To use register names with standard convension, please use GTM_BRC_SRC3_ADDR.
 */
#define GTM_BRC_SRC_3_ADDR             (GTM_BRC_SRC3_ADDR)

