Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** Alias (User Manual Name) for GTM_BRC_SRC3_ADDR.
 * To use register names with standard convension, please use GTM_BRC_SRC3_ADDR.
 */
#define GTM_BRC_SRC_3_ADDR             (GTM_BRC_SRC3_ADDR)

/** \\brief  41C, BRC destination channels for input channel 0 */
#define GTM_BRC_SRC3_DEST              /*lint --e(923)*/ (*(volatile Ifx_GTM_BRC_SRC_DEST *)0xF010041Cu)

/** Alias (User Manual Name) for GTM_BRC_SRC3_DEST.
 * To use register names with standard convension, please use GTM_BRC_SRC3_DEST.
 */
#define GTM_BRC_SRC_3_DEST             (GTM_BRC_SRC3_DEST)

/** Alias (User Manual Name) for GTM_BRC_SRC3_DEST.
 * To use register names with standard convension, please use GTM_BRC_SRC3_DEST.
 */
#define GTM_BRC_SRC_3_DEST             (GTM_BRC_SRC3_DEST)

/** \\brief  420, BRC read address for input channel 0 */
#define GTM_BRC_SRC4_ADDR              /*lint --e(923)*/ (*(volatile Ifx_GTM_BRC_SRC_ADDR *)0xF0100420u)

/** Alias (User Manual Name) for GTM_BRC_SRC4_ADDR.
 * To use register names with standard convension, please use GTM_BRC_SRC4_ADDR.
 */
#define GTM_BRC_SRC_4_ADDR             (GTM_BRC_SRC4_ADDR)

/** Alias (User Manual Name) for GTM_BRC_SRC4_ADDR.
 * To use register names with standard convension, please use GTM_BRC_SRC4_ADDR.
 */
#define GTM_BRC_SRC_4_ADDR             (GTM_BRC_SRC4_ADDR)

/** \\brief  424, BRC destination channels for input channel 0 */
#define GTM_BRC_SRC4_DEST              /*lint --e(923)*/ (*(volatile Ifx_GTM_BRC_SRC_DEST *)0xF0100424u)

/** Alias (User Manual Name) for GTM_BRC_SRC4_DEST.
 * To use register names with standard convension, please use GTM_BRC_SRC4_DEST.
 */
#define GTM_BRC_SRC_4_DEST             (GTM_BRC_SRC4_DEST)

/** Alias (User Manual Name) for GTM_BRC_SRC4_DEST.
 * To use register names with standard convension, please use GTM_BRC_SRC4_DEST.
 */
#define GTM_BRC_SRC_4_DEST             (GTM_BRC_SRC4_DEST)

/** \\brief  428, BRC read address for input channel 0 */
#define GTM_BRC_SRC5_ADDR              /*lint --e(923)*/ (*(volatile Ifx_GTM_BRC_SRC_ADDR *)0xF0100428u)

/** Alias (User Manual Name) for GTM_BRC_SRC5_ADDR.
 * To use register names with standard convension, please use GTM_BRC_SRC5_ADDR.
 */
#define GTM_BRC_SRC_5_ADDR             (GTM_BRC_SRC5_ADDR)

/** Alias (User Manual Name) for GTM_BRC_SRC5_ADDR.
 * To use register names with standard convension, please use GTM_BRC_SRC5_ADDR.
 */
#define GTM_BRC_SRC_5_ADDR             (GTM_BRC_SRC5_ADDR)

/** \\brief  42C, BRC destination channels for input channel 0 */
#define GTM_BRC_SRC5_DEST              /*lint --e(923)*/ (*(volatile Ifx_GTM_BRC_SRC_DEST *)0xF010042Cu)

/** Alias (User Manual Name) for GTM_BRC_SRC5_DEST.
 * To use register names with standard convension, please use GTM_BRC_SRC5_DEST.
 */
#define GTM_BRC_SRC_5_DEST             (GTM_BRC_SRC5_DEST)

/** Alias (User Manual Name) for GTM_BRC_SRC5_DEST.
 * To use register names with standard convension, please use GTM_BRC_SRC5_DEST.
 */
#define GTM_BRC_SRC_5_DEST             (GTM_BRC_SRC5_DEST)

/** \\brief  430, BRC read address for input channel 0 */
#define GTM_BRC_SRC6_ADDR              /*lint --e(923)*/ (*(volatile Ifx_GTM_BRC_SRC_ADDR *)0xF0100430u)

/** Alias (User Manual Name) for GTM_BRC_SRC6_ADDR.
 * To use register names with standard convension, please use GTM_BRC_SRC6_ADDR.
 */
#define GTM_BRC_SRC_6_ADDR             (GTM_BRC_SRC6_ADDR)

/** Alias (User Manual Name) for GTM_BRC_SRC6_ADDR.
 * To use register names with standard convension, please use GTM_BRC_SRC6_ADDR.
 */
#define GTM_BRC_SRC_6_ADDR             (GTM_BRC_SRC6_ADDR)

/** \\brief  434, BRC destination channels for input channel 0 */
#define GTM_BRC_SRC6_DEST              /*lint --e(923)*/ (*(volatile Ifx_GTM_BRC_SRC_DEST *)0xF0100434u)

/** Alias (User Manual Name) for GTM_BRC_SRC6_DEST.
 * To use register names with standard convension, please use GTM_BRC_SRC6_DEST.
 */
#define GTM_BRC_SRC_6_DEST             (GTM_BRC_SRC6_DEST)

/** Alias (User Manual Name) for GTM_BRC_SRC6_DEST.
 * To use register names with standard convension, please use GTM_BRC_SRC6_DEST.
 */
#define GTM_BRC_SRC_6_DEST             (GTM_BRC_SRC6_DEST)

/** \\brief  438, BRC read address for input channel 0 */
#define GTM_BRC_SRC7_ADDR              /*lint --e(923)*/ (*(volatile Ifx_GTM_BRC_SRC_ADDR *)0xF0100438u)

/** Alias (User Manual Name) for GTM_BRC_SRC7_ADDR.
 * To use register names with standard convension, please use GTM_BRC_SRC7_ADDR.
 */
#define GTM_BRC_SRC_7_ADDR             (GTM_BRC_SRC7_ADDR)

/** Alias (User Manual Name) for GTM_BRC_SRC7_ADDR.
 * To use register names with standard convension, please use GTM_BRC_SRC7_ADDR.
 */
#define GTM_BRC_SRC_7_ADDR             (GTM_BRC_SRC7_ADDR)

/** \\brief  43C, BRC destination channels for input channel 0 */
#define GTM_BRC_SRC7_DEST              /*lint --e(923)*/ (*(volatile Ifx_GTM_BRC_SRC_DEST *)0xF010043Cu)

/** Alias (User Manual Name) for GTM_BRC_SRC7_DEST.
 * To use register names with standard convension, please use GTM_BRC_SRC7_DEST.
 */
#define GTM_BRC_SRC_7_DEST             (GTM_BRC_SRC7_DEST)

/** Alias (User Manual Name) for GTM_BRC_SRC7_DEST.
 * To use register names with standard convension, please use GTM_BRC_SRC7_DEST.
 */
#define GTM_BRC_SRC_7_DEST             (GTM_BRC_SRC7_DEST)

/** \\brief  440, BRC read address for input channel 0 */
#define GTM_BRC_SRC8_ADDR              /*lint --e(923)*/ (*(volatile Ifx_GTM_BRC_SRC_ADDR *)0xF0100440u)

/** Alias (User Manual Name) for GTM_BRC_SRC8_ADDR.
 * To use register names with standard convension, please use GTM_BRC_SRC8_ADDR.
 */
#define GTM_BRC_SRC_8_ADDR             (GTM_BRC_SRC8_ADDR)

/** Alias (User Manual Name) for GTM_BRC_SRC8_ADDR.
 * To use register names with standard convension, please use GTM_BRC_SRC8_ADDR.
 */
#define GTM_BRC_SRC_8_ADDR             (GTM_BRC_SRC8_ADDR)

/** \\brief  444, BRC destination channels for input channel 0 */
#define GTM_BRC_SRC8_DEST              /*lint --e(923)*/ (*(volatile Ifx_GTM_BRC_SRC_DEST *)0xF0100444u)

/** Alias (User Manual Name) for GTM_BRC_SRC8_DEST.
 * To use register names with standard convension, please use GTM_BRC_SRC8_DEST.
 */
#define GTM_BRC_SRC_8_DEST             (GTM_BRC_SRC8_DEST)

