Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** Alias (User Manual Name) for GTM_BRC_SRC8_DEST.
 * To use register names with standard convension, please use GTM_BRC_SRC8_DEST.
 */
#define GTM_BRC_SRC_8_DEST             (GTM_BRC_SRC8_DEST)

/** \\brief  448, BRC read address for input channel 0 */
#define GTM_BRC_SRC9_ADDR              /*lint --e(923)*/ (*(volatile Ifx_GTM_BRC_SRC_ADDR *)0xF0100448u)

/** Alias (User Manual Name) for GTM_BRC_SRC9_ADDR.
 * To use register names with standard convension, please use GTM_BRC_SRC9_ADDR.
 */
#define GTM_BRC_SRC_9_ADDR             (GTM_BRC_SRC9_ADDR)

/** Alias (User Manual Name) for GTM_BRC_SRC9_ADDR.
 * To use register names with standard convension, please use GTM_BRC_SRC9_ADDR.
 */
#define GTM_BRC_SRC_9_ADDR             (GTM_BRC_SRC9_ADDR)

/** \\brief  44C, BRC destination channels for input channel 0 */
#define GTM_BRC_SRC9_DEST              /*lint --e(923)*/ (*(volatile Ifx_GTM_BRC_SRC_DEST *)0xF010044Cu)

/** Alias (User Manual Name) for GTM_BRC_SRC9_DEST.
 * To use register names with standard convension, please use GTM_BRC_SRC9_DEST.
 */
#define GTM_BRC_SRC_9_DEST             (GTM_BRC_SRC9_DEST)

/** Alias (User Manual Name) for GTM_BRC_SRC9_DEST.
 * To use register names with standard convension, please use GTM_BRC_SRC9_DEST.
 */
#define GTM_BRC_SRC_9_DEST             (GTM_BRC_SRC9_DEST)

/** \\brief  30, GTM AEI bridge mode register */
#define GTM_BRIDGE_MODE                /*lint --e(923)*/ (*(volatile Ifx_GTM_BRIDGE_MODE *)0xF0100030u)

/** \\brief  34, GTM AEI bridge pointer 1 register */
#define GTM_BRIDGE_PTR1                /*lint --e(923)*/ (*(volatile Ifx_GTM_BRIDGE_PTR1 *)0xF0100034u)

/** \\brief  38, GTM AEI bridge pointer 2 register */
#define GTM_BRIDGE_PTR2                /*lint --e(923)*/ (*(volatile Ifx_GTM_BRIDGE_PTR2 *)0xF0100038u)

/** \\brief  E21D8, CCM MCS Bus Master Status Register */
#define GTM_CCM0_AEIM_STA              /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_AEIM_STA *)0xF01E21D8u)

/** \\brief  E2000, CCM Address Range Protector 0 Control Register */
#define GTM_CCM0_ARP0_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP0_CTRL *)0xF01E2000u)

/** \\brief  E2004, CCM Address Range Protector 0 Protection Register */
#define GTM_CCM0_ARP0_PROT             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP0_PROT *)0xF01E2004u)

/** \\brief  E2008, CCM Address Range Protector 1 Control Register */
#define GTM_CCM0_ARP1_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP1_CTRL *)0xF01E2008u)

/** \\brief  E200C, CCM Address Range Protector 1 Protection Register */
#define GTM_CCM0_ARP1_PROT             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP1_PROT *)0xF01E200Cu)

/** \\brief  E2010, CCM Address Range Protector 2 Control Register */
#define GTM_CCM0_ARP2_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP2_CTRL *)0xF01E2010u)

/** \\brief  E2014, CCM Address Range Protector 2 Protection Register */
#define GTM_CCM0_ARP2_PROT             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP2_PROT *)0xF01E2014u)

/** \\brief  E2018, CCM Address Range Protector 3 Control Register */
#define GTM_CCM0_ARP3_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP3_CTRL *)0xF01E2018u)

/** \\brief  E201C, CCM Address Range Protector 3 Protection Register */
#define GTM_CCM0_ARP3_PROT             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP3_PROT *)0xF01E201Cu)

/** \\brief  E2020, CCM Address Range Protector 4 Control Register */
#define GTM_CCM0_ARP4_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP4_CTRL *)0xF01E2020u)

/** \\brief  E2024, CCM Address Range Protector 4 Protection Register */
#define GTM_CCM0_ARP4_PROT             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP4_PROT *)0xF01E2024u)

/** \\brief  E2028, CCM Address Range Protector 5 Control Register */
#define GTM_CCM0_ARP5_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP5_CTRL *)0xF01E2028u)

/** \\brief  E202C, CCM Address Range Protector 5 Protection Register */
#define GTM_CCM0_ARP5_PROT             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP5_PROT *)0xF01E202Cu)

/** \\brief  E2030, CCM Address Range Protector 6 Control Register */
#define GTM_CCM0_ARP6_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP6_CTRL *)0xF01E2030u)

/** \\brief  E2034, CCM Address Range Protector 6 Protection Register */
#define GTM_CCM0_ARP6_PROT             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP6_PROT *)0xF01E2034u)

/** \\brief  E2038, CCM Address Range Protector 7 Control Register */
#define GTM_CCM0_ARP7_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP7_CTRL *)0xF01E2038u)

/** \\brief  E203C, CCM Address Range Protector 7 Protection Register */
#define GTM_CCM0_ARP7_PROT             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP7_PROT *)0xF01E203Cu)

/** \\brief  E2040, CCM Address Range Protector 8 Control Register */
#define GTM_CCM0_ARP8_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP8_CTRL *)0xF01E2040u)

/** \\brief  E2044, CCM Address Range Protector 8 Protection Register */
#define GTM_CCM0_ARP8_PROT             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP8_PROT *)0xF01E2044u)

/** \\brief  E2048, CCM Address Range Protector 9 Control Register */
#define GTM_CCM0_ARP9_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP9_CTRL *)0xF01E2048u)

/** \\brief  E204C, CCM Address Range Protector 9 Protection Register */
#define GTM_CCM0_ARP9_PROT             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP9_PROT *)0xF01E204Cu)

/** \\brief  E21EC, GTM CCM ATOM Output Level */
#define GTM_CCM0_ATOM_OUT              /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ATOM_OUT *)0xF01E21ECu)

/** \\brief  E21F8, CCM Configuration Register */
#define GTM_CCM0_CFG                   /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_CFG *)0xF01E21F8u)

/** \\brief  E21F0, CCM CMU Clock Configuration Register */
#define GTM_CCM0_CMU_CLK_CFG           /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_CMU_CLK_CFG *)0xF01E21F0u)

