Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  E21F4, CCM CMU Fixed Clock Configuration Register */
#define GTM_CCM0_CMU_FXCLK_CFG         /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_CMU_FXCLK_CFG *)0xF01E21F4u)

/** \\brief  E21E4, CCM external capture trigger enable */
#define GTM_CCM0_EXT_CAP_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_EXT_CAP_EN *)0xF01E21E4u)

/** \\brief  E21DC, CCM Hardware Configuration */
#define GTM_CCM0_HW_CONF               /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_HW_CONF *)0xF01E21DCu)

/** \\brief  E21FC, CCM Protection Register */
#define GTM_CCM0_PROT                  /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_PROT *)0xF01E21FCu)

/** \\brief  E21E0, CCM TIM module AUX_IN source selection register */
#define GTM_CCM0_TIM_AUX_IN_SRC        /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_TIM_AUX_IN_SRC *)0xF01E21E0u)

/** \\brief  E21E8, GTM CCM TOM output level */
#define GTM_CCM0_TOM_OUT               /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_TOM_OUT *)0xF01E21E8u)

/** \\brief  E35F8, CCM10 Configuration Register */
#define GTM_CCM10_CFG                  /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM10_CFG *)0xF01E35F8u)

/** \\brief  E35F0, CCM10 CMU Clock Configuration Register */
#define GTM_CCM10_CMU_CLK_CFG          /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM10_CMU_CLK_CFG *)0xF01E35F0u)

/** \\brief  E35F4, CCM10 CMU Fixed Clock Configuration Register */
#define GTM_CCM10_CMU_FXCLK_CFG        /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM10_CMU_FXCLK_CFG *)0xF01E35F4u)

/** \\brief  E35DC, CCM10 Hardware Configuration */
#define GTM_CCM10_HW_CONF              /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM10_HW_CONF *)0xF01E35DCu)

/** \\brief  E35FC, CCM10 Protection Register */
#define GTM_CCM10_PROT                 /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM10_PROT *)0xF01E35FCu)

/** \\brief  E37F8, CCM11 Configuration Register */
#define GTM_CCM11_CFG                  /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM11_CFG *)0xF01E37F8u)

/** \\brief  E37F0, CCM11 CMU Clock Configuration Register */
#define GTM_CCM11_CMU_CLK_CFG          /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM11_CMU_CLK_CFG *)0xF01E37F0u)

/** \\brief  E37F4, CCM11 CMU Fixed Clock Configuration Register */
#define GTM_CCM11_CMU_FXCLK_CFG        /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM11_CMU_FXCLK_CFG *)0xF01E37F4u)

/** \\brief  E37DC, CCM11 Hardware Configuration */
#define GTM_CCM11_HW_CONF              /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM11_HW_CONF *)0xF01E37DCu)

/** \\brief  E37FC, CCM11 Protection Register */
#define GTM_CCM11_PROT                 /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM11_PROT *)0xF01E37FCu)

/** \\brief  E23D8, CCM MCS Bus Master Status Register */
#define GTM_CCM1_AEIM_STA              /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_AEIM_STA *)0xF01E23D8u)

/** \\brief  E2200, CCM Address Range Protector 0 Control Register */
#define GTM_CCM1_ARP0_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP0_CTRL *)0xF01E2200u)

/** \\brief  E2204, CCM Address Range Protector 0 Protection Register */
#define GTM_CCM1_ARP0_PROT             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP0_PROT *)0xF01E2204u)

/** \\brief  E2208, CCM Address Range Protector 1 Control Register */
#define GTM_CCM1_ARP1_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP1_CTRL *)0xF01E2208u)

/** \\brief  E220C, CCM Address Range Protector 1 Protection Register */
#define GTM_CCM1_ARP1_PROT             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP1_PROT *)0xF01E220Cu)

/** \\brief  E2210, CCM Address Range Protector 2 Control Register */
#define GTM_CCM1_ARP2_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP2_CTRL *)0xF01E2210u)

/** \\brief  E2214, CCM Address Range Protector 2 Protection Register */
#define GTM_CCM1_ARP2_PROT             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP2_PROT *)0xF01E2214u)

/** \\brief  E2218, CCM Address Range Protector 3 Control Register */
#define GTM_CCM1_ARP3_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP3_CTRL *)0xF01E2218u)

/** \\brief  E221C, CCM Address Range Protector 3 Protection Register */
#define GTM_CCM1_ARP3_PROT             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP3_PROT *)0xF01E221Cu)

/** \\brief  E2220, CCM Address Range Protector 4 Control Register */
#define GTM_CCM1_ARP4_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP4_CTRL *)0xF01E2220u)

/** \\brief  E2224, CCM Address Range Protector 4 Protection Register */
#define GTM_CCM1_ARP4_PROT             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP4_PROT *)0xF01E2224u)

/** \\brief  E2228, CCM Address Range Protector 5 Control Register */
#define GTM_CCM1_ARP5_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP5_CTRL *)0xF01E2228u)

/** \\brief  E222C, CCM Address Range Protector 5 Protection Register */
#define GTM_CCM1_ARP5_PROT             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP5_PROT *)0xF01E222Cu)

/** \\brief  E2230, CCM Address Range Protector 6 Control Register */
#define GTM_CCM1_ARP6_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP6_CTRL *)0xF01E2230u)

/** \\brief  E2234, CCM Address Range Protector 6 Protection Register */
#define GTM_CCM1_ARP6_PROT             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP6_PROT *)0xF01E2234u)

/** \\brief  E2238, CCM Address Range Protector 7 Control Register */
#define GTM_CCM1_ARP7_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP7_CTRL *)0xF01E2238u)

/** \\brief  E223C, CCM Address Range Protector 7 Protection Register */
#define GTM_CCM1_ARP7_PROT             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP7_PROT *)0xF01E223Cu)

/** \\brief  E2240, CCM Address Range Protector 8 Control Register */
#define GTM_CCM1_ARP8_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP8_CTRL *)0xF01E2240u)

/** \\brief  E2244, CCM Address Range Protector 8 Protection Register */
#define GTM_CCM1_ARP8_PROT             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP8_PROT *)0xF01E2244u)

/** \\brief  E2248, CCM Address Range Protector 9 Control Register */
#define GTM_CCM1_ARP9_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP9_CTRL *)0xF01E2248u)

