Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  E224C, CCM Address Range Protector 9 Protection Register */
#define GTM_CCM1_ARP9_PROT             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP9_PROT *)0xF01E224Cu)

/** \\brief  E23EC, GTM CCM ATOM Output Level */
#define GTM_CCM1_ATOM_OUT              /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ATOM_OUT *)0xF01E23ECu)

/** \\brief  E23F8, CCM Configuration Register */
#define GTM_CCM1_CFG                   /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_CFG *)0xF01E23F8u)

/** \\brief  E23F0, CCM CMU Clock Configuration Register */
#define GTM_CCM1_CMU_CLK_CFG           /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_CMU_CLK_CFG *)0xF01E23F0u)

/** \\brief  E23F4, CCM CMU Fixed Clock Configuration Register */
#define GTM_CCM1_CMU_FXCLK_CFG         /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_CMU_FXCLK_CFG *)0xF01E23F4u)

/** \\brief  E23E4, CCM external capture trigger enable */
#define GTM_CCM1_EXT_CAP_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_EXT_CAP_EN *)0xF01E23E4u)

/** \\brief  E23DC, CCM Hardware Configuration */
#define GTM_CCM1_HW_CONF               /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_HW_CONF *)0xF01E23DCu)

/** \\brief  E23FC, CCM Protection Register */
#define GTM_CCM1_PROT                  /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_PROT *)0xF01E23FCu)

/** \\brief  E23E0, CCM TIM module AUX_IN source selection register */
#define GTM_CCM1_TIM_AUX_IN_SRC        /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_TIM_AUX_IN_SRC *)0xF01E23E0u)

/** \\brief  E23E8, GTM CCM TOM output level */
#define GTM_CCM1_TOM_OUT               /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_TOM_OUT *)0xF01E23E8u)

/** \\brief  E25D8, CCM MCS Bus Master Status Register */
#define GTM_CCM2_AEIM_STA              /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_AEIM_STA *)0xF01E25D8u)

/** \\brief  E2400, CCM Address Range Protector 0 Control Register */
#define GTM_CCM2_ARP0_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP0_CTRL *)0xF01E2400u)

/** \\brief  E2404, CCM Address Range Protector 0 Protection Register */
#define GTM_CCM2_ARP0_PROT             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP0_PROT *)0xF01E2404u)

/** \\brief  E2408, CCM Address Range Protector 1 Control Register */
#define GTM_CCM2_ARP1_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP1_CTRL *)0xF01E2408u)

/** \\brief  E240C, CCM Address Range Protector 1 Protection Register */
#define GTM_CCM2_ARP1_PROT             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP1_PROT *)0xF01E240Cu)

/** \\brief  E2410, CCM Address Range Protector 2 Control Register */
#define GTM_CCM2_ARP2_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP2_CTRL *)0xF01E2410u)

/** \\brief  E2414, CCM Address Range Protector 2 Protection Register */
#define GTM_CCM2_ARP2_PROT             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP2_PROT *)0xF01E2414u)

/** \\brief  E2418, CCM Address Range Protector 3 Control Register */
#define GTM_CCM2_ARP3_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP3_CTRL *)0xF01E2418u)

/** \\brief  E241C, CCM Address Range Protector 3 Protection Register */
#define GTM_CCM2_ARP3_PROT             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP3_PROT *)0xF01E241Cu)

/** \\brief  E2420, CCM Address Range Protector 4 Control Register */
#define GTM_CCM2_ARP4_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP4_CTRL *)0xF01E2420u)

/** \\brief  E2424, CCM Address Range Protector 4 Protection Register */
#define GTM_CCM2_ARP4_PROT             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP4_PROT *)0xF01E2424u)

/** \\brief  E2428, CCM Address Range Protector 5 Control Register */
#define GTM_CCM2_ARP5_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP5_CTRL *)0xF01E2428u)

/** \\brief  E242C, CCM Address Range Protector 5 Protection Register */
#define GTM_CCM2_ARP5_PROT             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP5_PROT *)0xF01E242Cu)

/** \\brief  E2430, CCM Address Range Protector 6 Control Register */
#define GTM_CCM2_ARP6_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP6_CTRL *)0xF01E2430u)

/** \\brief  E2434, CCM Address Range Protector 6 Protection Register */
#define GTM_CCM2_ARP6_PROT             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP6_PROT *)0xF01E2434u)

/** \\brief  E2438, CCM Address Range Protector 7 Control Register */
#define GTM_CCM2_ARP7_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP7_CTRL *)0xF01E2438u)

/** \\brief  E243C, CCM Address Range Protector 7 Protection Register */
#define GTM_CCM2_ARP7_PROT             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP7_PROT *)0xF01E243Cu)

/** \\brief  E2440, CCM Address Range Protector 8 Control Register */
#define GTM_CCM2_ARP8_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP8_CTRL *)0xF01E2440u)

/** \\brief  E2444, CCM Address Range Protector 8 Protection Register */
#define GTM_CCM2_ARP8_PROT             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP8_PROT *)0xF01E2444u)

/** \\brief  E2448, CCM Address Range Protector 9 Control Register */
#define GTM_CCM2_ARP9_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP9_CTRL *)0xF01E2448u)

/** \\brief  E244C, CCM Address Range Protector 9 Protection Register */
#define GTM_CCM2_ARP9_PROT             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP9_PROT *)0xF01E244Cu)

/** \\brief  E25EC, GTM CCM ATOM Output Level */
#define GTM_CCM2_ATOM_OUT              /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ATOM_OUT *)0xF01E25ECu)

/** \\brief  E25F8, CCM Configuration Register */
#define GTM_CCM2_CFG                   /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_CFG *)0xF01E25F8u)

/** \\brief  E25F0, CCM CMU Clock Configuration Register */
#define GTM_CCM2_CMU_CLK_CFG           /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_CMU_CLK_CFG *)0xF01E25F0u)

/** \\brief  E25F4, CCM CMU Fixed Clock Configuration Register */
#define GTM_CCM2_CMU_FXCLK_CFG         /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_CMU_FXCLK_CFG *)0xF01E25F4u)

