Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  E25E4, CCM external capture trigger enable */
#define GTM_CCM2_EXT_CAP_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_EXT_CAP_EN *)0xF01E25E4u)

/** \\brief  E25DC, CCM Hardware Configuration */
#define GTM_CCM2_HW_CONF               /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_HW_CONF *)0xF01E25DCu)

/** \\brief  E25FC, CCM Protection Register */
#define GTM_CCM2_PROT                  /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_PROT *)0xF01E25FCu)

/** \\brief  E25E0, CCM TIM module AUX_IN source selection register */
#define GTM_CCM2_TIM_AUX_IN_SRC        /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_TIM_AUX_IN_SRC *)0xF01E25E0u)

/** \\brief  E25E8, GTM CCM TOM output level */
#define GTM_CCM2_TOM_OUT               /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_TOM_OUT *)0xF01E25E8u)

/** \\brief  E27D8, CCM MCS Bus Master Status Register */
#define GTM_CCM3_AEIM_STA              /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_AEIM_STA *)0xF01E27D8u)

/** \\brief  E2600, CCM Address Range Protector 0 Control Register */
#define GTM_CCM3_ARP0_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP0_CTRL *)0xF01E2600u)

/** \\brief  E2604, CCM Address Range Protector 0 Protection Register */
#define GTM_CCM3_ARP0_PROT             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP0_PROT *)0xF01E2604u)

/** \\brief  E2608, CCM Address Range Protector 1 Control Register */
#define GTM_CCM3_ARP1_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP1_CTRL *)0xF01E2608u)

/** \\brief  E260C, CCM Address Range Protector 1 Protection Register */
#define GTM_CCM3_ARP1_PROT             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP1_PROT *)0xF01E260Cu)

/** \\brief  E2610, CCM Address Range Protector 2 Control Register */
#define GTM_CCM3_ARP2_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP2_CTRL *)0xF01E2610u)

/** \\brief  E2614, CCM Address Range Protector 2 Protection Register */
#define GTM_CCM3_ARP2_PROT             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP2_PROT *)0xF01E2614u)

/** \\brief  E2618, CCM Address Range Protector 3 Control Register */
#define GTM_CCM3_ARP3_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP3_CTRL *)0xF01E2618u)

/** \\brief  E261C, CCM Address Range Protector 3 Protection Register */
#define GTM_CCM3_ARP3_PROT             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP3_PROT *)0xF01E261Cu)

/** \\brief  E2620, CCM Address Range Protector 4 Control Register */
#define GTM_CCM3_ARP4_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP4_CTRL *)0xF01E2620u)

/** \\brief  E2624, CCM Address Range Protector 4 Protection Register */
#define GTM_CCM3_ARP4_PROT             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP4_PROT *)0xF01E2624u)

/** \\brief  E2628, CCM Address Range Protector 5 Control Register */
#define GTM_CCM3_ARP5_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP5_CTRL *)0xF01E2628u)

/** \\brief  E262C, CCM Address Range Protector 5 Protection Register */
#define GTM_CCM3_ARP5_PROT             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP5_PROT *)0xF01E262Cu)

/** \\brief  E2630, CCM Address Range Protector 6 Control Register */
#define GTM_CCM3_ARP6_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP6_CTRL *)0xF01E2630u)

/** \\brief  E2634, CCM Address Range Protector 6 Protection Register */
#define GTM_CCM3_ARP6_PROT             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP6_PROT *)0xF01E2634u)

/** \\brief  E2638, CCM Address Range Protector 7 Control Register */
#define GTM_CCM3_ARP7_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP7_CTRL *)0xF01E2638u)

/** \\brief  E263C, CCM Address Range Protector 7 Protection Register */
#define GTM_CCM3_ARP7_PROT             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP7_PROT *)0xF01E263Cu)

/** \\brief  E2640, CCM Address Range Protector 8 Control Register */
#define GTM_CCM3_ARP8_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP8_CTRL *)0xF01E2640u)

/** \\brief  E2644, CCM Address Range Protector 8 Protection Register */
#define GTM_CCM3_ARP8_PROT             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP8_PROT *)0xF01E2644u)

/** \\brief  E2648, CCM Address Range Protector 9 Control Register */
#define GTM_CCM3_ARP9_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP9_CTRL *)0xF01E2648u)

/** \\brief  E264C, CCM Address Range Protector 9 Protection Register */
#define GTM_CCM3_ARP9_PROT             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP9_PROT *)0xF01E264Cu)

/** \\brief  E27EC, GTM CCM ATOM Output Level */
#define GTM_CCM3_ATOM_OUT              /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ATOM_OUT *)0xF01E27ECu)

/** \\brief  E27F8, CCM Configuration Register */
#define GTM_CCM3_CFG                   /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_CFG *)0xF01E27F8u)

/** \\brief  E27F0, CCM CMU Clock Configuration Register */
#define GTM_CCM3_CMU_CLK_CFG           /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_CMU_CLK_CFG *)0xF01E27F0u)

/** \\brief  E27F4, CCM CMU Fixed Clock Configuration Register */
#define GTM_CCM3_CMU_FXCLK_CFG         /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_CMU_FXCLK_CFG *)0xF01E27F4u)

/** \\brief  E27E4, CCM external capture trigger enable */
#define GTM_CCM3_EXT_CAP_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_EXT_CAP_EN *)0xF01E27E4u)

/** \\brief  E27DC, CCM Hardware Configuration */
#define GTM_CCM3_HW_CONF               /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_HW_CONF *)0xF01E27DCu)

/** \\brief  E27FC, CCM Protection Register */
#define GTM_CCM3_PROT                  /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_PROT *)0xF01E27FCu)

/** \\brief  E27E0, CCM TIM module AUX_IN source selection register */
#define GTM_CCM3_TIM_AUX_IN_SRC        /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_TIM_AUX_IN_SRC *)0xF01E27E0u)

/** \\brief  E27E8, GTM CCM TOM output level */
#define GTM_CCM3_TOM_OUT               /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_TOM_OUT *)0xF01E27E8u)

/** \\brief  E29D8, CCM MCS Bus Master Status Register */
#define GTM_CCM4_AEIM_STA              /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_AEIM_STA *)0xF01E29D8u)

/** \\brief  E2800, CCM Address Range Protector 0 Control Register */
#define GTM_CCM4_ARP0_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP0_CTRL *)0xF01E2800u)

/** \\brief  E2804, CCM Address Range Protector 0 Protection Register */
#define GTM_CCM4_ARP0_PROT             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP0_PROT *)0xF01E2804u)

/** \\brief  E2808, CCM Address Range Protector 1 Control Register */
#define GTM_CCM4_ARP1_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP1_CTRL *)0xF01E2808u)

/** \\brief  E280C, CCM Address Range Protector 1 Protection Register */
#define GTM_CCM4_ARP1_PROT             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP1_PROT *)0xF01E280Cu)

/** \\brief  E2810, CCM Address Range Protector 2 Control Register */
#define GTM_CCM4_ARP2_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP2_CTRL *)0xF01E2810u)

/** \\brief  E2814, CCM Address Range Protector 2 Protection Register */
#define GTM_CCM4_ARP2_PROT             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP2_PROT *)0xF01E2814u)

/** \\brief  E2818, CCM Address Range Protector 3 Control Register */
#define GTM_CCM4_ARP3_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP3_CTRL *)0xF01E2818u)

/** \\brief  E281C, CCM Address Range Protector 3 Protection Register */
#define GTM_CCM4_ARP3_PROT             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP3_PROT *)0xF01E281Cu)

/** \\brief  E2820, CCM Address Range Protector 4 Control Register */
#define GTM_CCM4_ARP4_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP4_CTRL *)0xF01E2820u)

