Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  E2824, CCM Address Range Protector 4 Protection Register */
#define GTM_CCM4_ARP4_PROT             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP4_PROT *)0xF01E2824u)

/** \\brief  E2828, CCM Address Range Protector 5 Control Register */
#define GTM_CCM4_ARP5_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP5_CTRL *)0xF01E2828u)

/** \\brief  E282C, CCM Address Range Protector 5 Protection Register */
#define GTM_CCM4_ARP5_PROT             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP5_PROT *)0xF01E282Cu)

/** \\brief  E2830, CCM Address Range Protector 6 Control Register */
#define GTM_CCM4_ARP6_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP6_CTRL *)0xF01E2830u)

/** \\brief  E2834, CCM Address Range Protector 6 Protection Register */
#define GTM_CCM4_ARP6_PROT             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP6_PROT *)0xF01E2834u)

/** \\brief  E2838, CCM Address Range Protector 7 Control Register */
#define GTM_CCM4_ARP7_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP7_CTRL *)0xF01E2838u)

/** \\brief  E283C, CCM Address Range Protector 7 Protection Register */
#define GTM_CCM4_ARP7_PROT             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP7_PROT *)0xF01E283Cu)

/** \\brief  E2840, CCM Address Range Protector 8 Control Register */
#define GTM_CCM4_ARP8_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP8_CTRL *)0xF01E2840u)

/** \\brief  E2844, CCM Address Range Protector 8 Protection Register */
#define GTM_CCM4_ARP8_PROT             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP8_PROT *)0xF01E2844u)

/** \\brief  E2848, CCM Address Range Protector 9 Control Register */
#define GTM_CCM4_ARP9_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP9_CTRL *)0xF01E2848u)

/** \\brief  E284C, CCM Address Range Protector 9 Protection Register */
#define GTM_CCM4_ARP9_PROT             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP9_PROT *)0xF01E284Cu)

/** \\brief  E29EC, GTM CCM ATOM Output Level */
#define GTM_CCM4_ATOM_OUT              /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ATOM_OUT *)0xF01E29ECu)

/** \\brief  E29F8, CCM Configuration Register */
#define GTM_CCM4_CFG                   /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_CFG *)0xF01E29F8u)

/** \\brief  E29F0, CCM CMU Clock Configuration Register */
#define GTM_CCM4_CMU_CLK_CFG           /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_CMU_CLK_CFG *)0xF01E29F0u)

/** \\brief  E29F4, CCM CMU Fixed Clock Configuration Register */
#define GTM_CCM4_CMU_FXCLK_CFG         /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_CMU_FXCLK_CFG *)0xF01E29F4u)

/** \\brief  E29E4, CCM external capture trigger enable */
#define GTM_CCM4_EXT_CAP_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_EXT_CAP_EN *)0xF01E29E4u)

/** \\brief  E29DC, CCM Hardware Configuration */
#define GTM_CCM4_HW_CONF               /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_HW_CONF *)0xF01E29DCu)

/** \\brief  E29FC, CCM Protection Register */
#define GTM_CCM4_PROT                  /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_PROT *)0xF01E29FCu)

/** \\brief  E29E0, CCM TIM module AUX_IN source selection register */
#define GTM_CCM4_TIM_AUX_IN_SRC        /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_TIM_AUX_IN_SRC *)0xF01E29E0u)

/** \\brief  E29E8, GTM CCM TOM output level */
#define GTM_CCM4_TOM_OUT               /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_TOM_OUT *)0xF01E29E8u)

/** \\brief  E2BD8, CCM MCS Bus Master Status Register */
#define GTM_CCM5_AEIM_STA              /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_AEIM_STA *)0xF01E2BD8u)

/** \\brief  E2A00, CCM Address Range Protector 0 Control Register */
#define GTM_CCM5_ARP0_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP0_CTRL *)0xF01E2A00u)

/** \\brief  E2A04, CCM Address Range Protector 0 Protection Register */
#define GTM_CCM5_ARP0_PROT             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP0_PROT *)0xF01E2A04u)

/** \\brief  E2A08, CCM Address Range Protector 1 Control Register */
#define GTM_CCM5_ARP1_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP1_CTRL *)0xF01E2A08u)

/** \\brief  E2A0C, CCM Address Range Protector 1 Protection Register */
#define GTM_CCM5_ARP1_PROT             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP1_PROT *)0xF01E2A0Cu)

/** \\brief  E2A10, CCM Address Range Protector 2 Control Register */
#define GTM_CCM5_ARP2_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP2_CTRL *)0xF01E2A10u)

/** \\brief  E2A14, CCM Address Range Protector 2 Protection Register */
#define GTM_CCM5_ARP2_PROT             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP2_PROT *)0xF01E2A14u)

/** \\brief  E2A18, CCM Address Range Protector 3 Control Register */
#define GTM_CCM5_ARP3_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP3_CTRL *)0xF01E2A18u)

/** \\brief  E2A1C, CCM Address Range Protector 3 Protection Register */
#define GTM_CCM5_ARP3_PROT             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP3_PROT *)0xF01E2A1Cu)

/** \\brief  E2A20, CCM Address Range Protector 4 Control Register */
#define GTM_CCM5_ARP4_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP4_CTRL *)0xF01E2A20u)

/** \\brief  E2A24, CCM Address Range Protector 4 Protection Register */
#define GTM_CCM5_ARP4_PROT             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP4_PROT *)0xF01E2A24u)

/** \\brief  E2A28, CCM Address Range Protector 5 Control Register */
#define GTM_CCM5_ARP5_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP5_CTRL *)0xF01E2A28u)

/** \\brief  E2A2C, CCM Address Range Protector 5 Protection Register */
#define GTM_CCM5_ARP5_PROT             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP5_PROT *)0xF01E2A2Cu)

/** \\brief  E2A30, CCM Address Range Protector 6 Control Register */
#define GTM_CCM5_ARP6_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP6_CTRL *)0xF01E2A30u)

/** \\brief  E2A34, CCM Address Range Protector 6 Protection Register */
#define GTM_CCM5_ARP6_PROT             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP6_PROT *)0xF01E2A34u)

/** \\brief  E2A38, CCM Address Range Protector 7 Control Register */
#define GTM_CCM5_ARP7_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP7_CTRL *)0xF01E2A38u)

/** \\brief  E2A3C, CCM Address Range Protector 7 Protection Register */
#define GTM_CCM5_ARP7_PROT             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP7_PROT *)0xF01E2A3Cu)

/** \\brief  E2A40, CCM Address Range Protector 8 Control Register */
#define GTM_CCM5_ARP8_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP8_CTRL *)0xF01E2A40u)

/** \\brief  E2A44, CCM Address Range Protector 8 Protection Register */
#define GTM_CCM5_ARP8_PROT             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP8_PROT *)0xF01E2A44u)

/** \\brief  E2A48, CCM Address Range Protector 9 Control Register */
#define GTM_CCM5_ARP9_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP9_CTRL *)0xF01E2A48u)

/** \\brief  E2A4C, CCM Address Range Protector 9 Protection Register */
#define GTM_CCM5_ARP9_PROT             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP9_PROT *)0xF01E2A4Cu)

/** \\brief  E2BEC, GTM CCM ATOM Output Level */
#define GTM_CCM5_ATOM_OUT              /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ATOM_OUT *)0xF01E2BECu)

/** \\brief  E2BF8, CCM Configuration Register */
#define GTM_CCM5_CFG                   /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_CFG *)0xF01E2BF8u)

/** \\brief  E2BF0, CCM CMU Clock Configuration Register */
#define GTM_CCM5_CMU_CLK_CFG           /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_CMU_CLK_CFG *)0xF01E2BF0u)

/** \\brief  E2BF4, CCM CMU Fixed Clock Configuration Register */
#define GTM_CCM5_CMU_FXCLK_CFG         /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_CMU_FXCLK_CFG *)0xF01E2BF4u)

