Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  E2BE4, CCM external capture trigger enable */
#define GTM_CCM5_EXT_CAP_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_EXT_CAP_EN *)0xF01E2BE4u)

/** \\brief  E2BDC, CCM Hardware Configuration */
#define GTM_CCM5_HW_CONF               /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_HW_CONF *)0xF01E2BDCu)

/** \\brief  E2BFC, CCM Protection Register */
#define GTM_CCM5_PROT                  /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_PROT *)0xF01E2BFCu)

/** \\brief  E2BE0, CCM TIM module AUX_IN source selection register */
#define GTM_CCM5_TIM_AUX_IN_SRC        /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_TIM_AUX_IN_SRC *)0xF01E2BE0u)

/** \\brief  E2BE8, GTM CCM TOM output level */
#define GTM_CCM5_TOM_OUT               /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_TOM_OUT *)0xF01E2BE8u)

/** \\brief  E2DD8, CCM MCS Bus Master Status Register */
#define GTM_CCM6_AEIM_STA              /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_AEIM_STA *)0xF01E2DD8u)

/** \\brief  E2C00, CCM Address Range Protector 0 Control Register */
#define GTM_CCM6_ARP0_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP0_CTRL *)0xF01E2C00u)

/** \\brief  E2C04, CCM Address Range Protector 0 Protection Register */
#define GTM_CCM6_ARP0_PROT             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP0_PROT *)0xF01E2C04u)

/** \\brief  E2C08, CCM Address Range Protector 1 Control Register */
#define GTM_CCM6_ARP1_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP1_CTRL *)0xF01E2C08u)

/** \\brief  E2C0C, CCM Address Range Protector 1 Protection Register */
#define GTM_CCM6_ARP1_PROT             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP1_PROT *)0xF01E2C0Cu)

/** \\brief  E2C10, CCM Address Range Protector 2 Control Register */
#define GTM_CCM6_ARP2_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP2_CTRL *)0xF01E2C10u)

/** \\brief  E2C14, CCM Address Range Protector 2 Protection Register */
#define GTM_CCM6_ARP2_PROT             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP2_PROT *)0xF01E2C14u)

/** \\brief  E2C18, CCM Address Range Protector 3 Control Register */
#define GTM_CCM6_ARP3_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP3_CTRL *)0xF01E2C18u)

/** \\brief  E2C1C, CCM Address Range Protector 3 Protection Register */
#define GTM_CCM6_ARP3_PROT             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP3_PROT *)0xF01E2C1Cu)

/** \\brief  E2C20, CCM Address Range Protector 4 Control Register */
#define GTM_CCM6_ARP4_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP4_CTRL *)0xF01E2C20u)

/** \\brief  E2C24, CCM Address Range Protector 4 Protection Register */
#define GTM_CCM6_ARP4_PROT             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP4_PROT *)0xF01E2C24u)

/** \\brief  E2C28, CCM Address Range Protector 5 Control Register */
#define GTM_CCM6_ARP5_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP5_CTRL *)0xF01E2C28u)

/** \\brief  E2C2C, CCM Address Range Protector 5 Protection Register */
#define GTM_CCM6_ARP5_PROT             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP5_PROT *)0xF01E2C2Cu)

/** \\brief  E2C30, CCM Address Range Protector 6 Control Register */
#define GTM_CCM6_ARP6_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP6_CTRL *)0xF01E2C30u)

/** \\brief  E2C34, CCM Address Range Protector 6 Protection Register */
#define GTM_CCM6_ARP6_PROT             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP6_PROT *)0xF01E2C34u)

/** \\brief  E2C38, CCM Address Range Protector 7 Control Register */
#define GTM_CCM6_ARP7_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP7_CTRL *)0xF01E2C38u)

/** \\brief  E2C3C, CCM Address Range Protector 7 Protection Register */
#define GTM_CCM6_ARP7_PROT             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP7_PROT *)0xF01E2C3Cu)

/** \\brief  E2C40, CCM Address Range Protector 8 Control Register */
#define GTM_CCM6_ARP8_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP8_CTRL *)0xF01E2C40u)

/** \\brief  E2C44, CCM Address Range Protector 8 Protection Register */
#define GTM_CCM6_ARP8_PROT             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP8_PROT *)0xF01E2C44u)

/** \\brief  E2C48, CCM Address Range Protector 9 Control Register */
#define GTM_CCM6_ARP9_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP9_CTRL *)0xF01E2C48u)

/** \\brief  E2C4C, CCM Address Range Protector 9 Protection Register */
#define GTM_CCM6_ARP9_PROT             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP9_PROT *)0xF01E2C4Cu)

/** \\brief  E2DEC, GTM CCM ATOM Output Level */
#define GTM_CCM6_ATOM_OUT              /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ATOM_OUT *)0xF01E2DECu)

/** \\brief  E2DF8, CCM Configuration Register */
#define GTM_CCM6_CFG                   /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_CFG *)0xF01E2DF8u)

/** \\brief  E2DF0, CCM CMU Clock Configuration Register */
#define GTM_CCM6_CMU_CLK_CFG           /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_CMU_CLK_CFG *)0xF01E2DF0u)

/** \\brief  E2DF4, CCM CMU Fixed Clock Configuration Register */
#define GTM_CCM6_CMU_FXCLK_CFG         /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_CMU_FXCLK_CFG *)0xF01E2DF4u)

/** \\brief  E2DE4, CCM external capture trigger enable */
#define GTM_CCM6_EXT_CAP_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_EXT_CAP_EN *)0xF01E2DE4u)

/** \\brief  E2DDC, CCM Hardware Configuration */
#define GTM_CCM6_HW_CONF               /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_HW_CONF *)0xF01E2DDCu)

/** \\brief  E2DFC, CCM Protection Register */
#define GTM_CCM6_PROT                  /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_PROT *)0xF01E2DFCu)

/** \\brief  E2DE0, CCM TIM module AUX_IN source selection register */
#define GTM_CCM6_TIM_AUX_IN_SRC        /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_TIM_AUX_IN_SRC *)0xF01E2DE0u)

/** \\brief  E2FD8, CCM MCS Bus Master Status Register */
#define GTM_CCM7_AEIM_STA              /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_AEIM_STA *)0xF01E2FD8u)

