Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  E2E00, CCM Address Range Protector 0 Control Register */
#define GTM_CCM7_ARP0_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP0_CTRL *)0xF01E2E00u)

/** \\brief  E2E04, CCM Address Range Protector 0 Protection Register */
#define GTM_CCM7_ARP0_PROT             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP0_PROT *)0xF01E2E04u)

/** \\brief  E2E08, CCM Address Range Protector 1 Control Register */
#define GTM_CCM7_ARP1_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP1_CTRL *)0xF01E2E08u)

/** \\brief  E2E0C, CCM Address Range Protector 1 Protection Register */
#define GTM_CCM7_ARP1_PROT             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP1_PROT *)0xF01E2E0Cu)

/** \\brief  E2E10, CCM Address Range Protector 2 Control Register */
#define GTM_CCM7_ARP2_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP2_CTRL *)0xF01E2E10u)

/** \\brief  E2E14, CCM Address Range Protector 2 Protection Register */
#define GTM_CCM7_ARP2_PROT             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP2_PROT *)0xF01E2E14u)

/** \\brief  E2E18, CCM Address Range Protector 3 Control Register */
#define GTM_CCM7_ARP3_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP3_CTRL *)0xF01E2E18u)

/** \\brief  E2E1C, CCM Address Range Protector 3 Protection Register */
#define GTM_CCM7_ARP3_PROT             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP3_PROT *)0xF01E2E1Cu)

/** \\brief  E2E20, CCM Address Range Protector 4 Control Register */
#define GTM_CCM7_ARP4_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP4_CTRL *)0xF01E2E20u)

/** \\brief  E2E24, CCM Address Range Protector 4 Protection Register */
#define GTM_CCM7_ARP4_PROT             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP4_PROT *)0xF01E2E24u)

/** \\brief  E2E28, CCM Address Range Protector 5 Control Register */
#define GTM_CCM7_ARP5_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP5_CTRL *)0xF01E2E28u)

/** \\brief  E2E2C, CCM Address Range Protector 5 Protection Register */
#define GTM_CCM7_ARP5_PROT             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP5_PROT *)0xF01E2E2Cu)

/** \\brief  E2E30, CCM Address Range Protector 6 Control Register */
#define GTM_CCM7_ARP6_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP6_CTRL *)0xF01E2E30u)

/** \\brief  E2E34, CCM Address Range Protector 6 Protection Register */
#define GTM_CCM7_ARP6_PROT             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP6_PROT *)0xF01E2E34u)

/** \\brief  E2E38, CCM Address Range Protector 7 Control Register */
#define GTM_CCM7_ARP7_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP7_CTRL *)0xF01E2E38u)

/** \\brief  E2E3C, CCM Address Range Protector 7 Protection Register */
#define GTM_CCM7_ARP7_PROT             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP7_PROT *)0xF01E2E3Cu)

/** \\brief  E2E40, CCM Address Range Protector 8 Control Register */
#define GTM_CCM7_ARP8_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP8_CTRL *)0xF01E2E40u)

/** \\brief  E2E44, CCM Address Range Protector 8 Protection Register */
#define GTM_CCM7_ARP8_PROT             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP8_PROT *)0xF01E2E44u)

/** \\brief  E2E48, CCM Address Range Protector 9 Control Register */
#define GTM_CCM7_ARP9_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP9_CTRL *)0xF01E2E48u)

/** \\brief  E2E4C, CCM Address Range Protector 9 Protection Register */
#define GTM_CCM7_ARP9_PROT             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP9_PROT *)0xF01E2E4Cu)

/** \\brief  E2FEC, GTM CCM ATOM Output Level */
#define GTM_CCM7_ATOM_OUT              /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ATOM_OUT *)0xF01E2FECu)

/** \\brief  E2FF8, CCM Configuration Register */
#define GTM_CCM7_CFG                   /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_CFG *)0xF01E2FF8u)

/** \\brief  E2FF0, CCM CMU Clock Configuration Register */
#define GTM_CCM7_CMU_CLK_CFG           /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_CMU_CLK_CFG *)0xF01E2FF0u)

/** \\brief  E2FF4, CCM CMU Fixed Clock Configuration Register */
#define GTM_CCM7_CMU_FXCLK_CFG         /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_CMU_FXCLK_CFG *)0xF01E2FF4u)

/** \\brief  E2FE4, CCM external capture trigger enable */
#define GTM_CCM7_EXT_CAP_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_EXT_CAP_EN *)0xF01E2FE4u)

/** \\brief  E2FDC, CCM Hardware Configuration */
#define GTM_CCM7_HW_CONF               /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_HW_CONF *)0xF01E2FDCu)

/** \\brief  E2FFC, CCM Protection Register */
#define GTM_CCM7_PROT                  /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_PROT *)0xF01E2FFCu)

/** \\brief  E2FE0, CCM TIM module AUX_IN source selection register */
#define GTM_CCM7_TIM_AUX_IN_SRC        /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_TIM_AUX_IN_SRC *)0xF01E2FE0u)

/** \\brief  E31D8, CCM MCS Bus Master Status Register */
#define GTM_CCM8_AEIM_STA              /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_AEIM_STA *)0xF01E31D8u)

/** \\brief  E3000, CCM Address Range Protector 0 Control Register */
#define GTM_CCM8_ARP0_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP0_CTRL *)0xF01E3000u)

/** \\brief  E3004, CCM Address Range Protector 0 Protection Register */
#define GTM_CCM8_ARP0_PROT             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP0_PROT *)0xF01E3004u)

/** \\brief  E3008, CCM Address Range Protector 1 Control Register */
#define GTM_CCM8_ARP1_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP1_CTRL *)0xF01E3008u)

/** \\brief  E300C, CCM Address Range Protector 1 Protection Register */
#define GTM_CCM8_ARP1_PROT             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP1_PROT *)0xF01E300Cu)

/** \\brief  E3010, CCM Address Range Protector 2 Control Register */
#define GTM_CCM8_ARP2_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP2_CTRL *)0xF01E3010u)

/** \\brief  E3014, CCM Address Range Protector 2 Protection Register */
#define GTM_CCM8_ARP2_PROT             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP2_PROT *)0xF01E3014u)

/** \\brief  E3018, CCM Address Range Protector 3 Control Register */
#define GTM_CCM8_ARP3_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP3_CTRL *)0xF01E3018u)

/** \\brief  E301C, CCM Address Range Protector 3 Protection Register */
#define GTM_CCM8_ARP3_PROT             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP3_PROT *)0xF01E301Cu)

/** \\brief  E3020, CCM Address Range Protector 4 Control Register */
#define GTM_CCM8_ARP4_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP4_CTRL *)0xF01E3020u)

/** \\brief  E3024, CCM Address Range Protector 4 Protection Register */
#define GTM_CCM8_ARP4_PROT             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP4_PROT *)0xF01E3024u)

/** \\brief  E3028, CCM Address Range Protector 5 Control Register */
#define GTM_CCM8_ARP5_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP5_CTRL *)0xF01E3028u)

