Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  E302C, CCM Address Range Protector 5 Protection Register */
#define GTM_CCM8_ARP5_PROT             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP5_PROT *)0xF01E302Cu)

/** \\brief  E3030, CCM Address Range Protector 6 Control Register */
#define GTM_CCM8_ARP6_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP6_CTRL *)0xF01E3030u)

/** \\brief  E3034, CCM Address Range Protector 6 Protection Register */
#define GTM_CCM8_ARP6_PROT             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP6_PROT *)0xF01E3034u)

/** \\brief  E3038, CCM Address Range Protector 7 Control Register */
#define GTM_CCM8_ARP7_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP7_CTRL *)0xF01E3038u)

/** \\brief  E303C, CCM Address Range Protector 7 Protection Register */
#define GTM_CCM8_ARP7_PROT             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP7_PROT *)0xF01E303Cu)

/** \\brief  E3040, CCM Address Range Protector 8 Control Register */
#define GTM_CCM8_ARP8_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP8_CTRL *)0xF01E3040u)

/** \\brief  E3044, CCM Address Range Protector 8 Protection Register */
#define GTM_CCM8_ARP8_PROT             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP8_PROT *)0xF01E3044u)

/** \\brief  E3048, CCM Address Range Protector 9 Control Register */
#define GTM_CCM8_ARP9_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP9_CTRL *)0xF01E3048u)

/** \\brief  E304C, CCM Address Range Protector 9 Protection Register */
#define GTM_CCM8_ARP9_PROT             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP9_PROT *)0xF01E304Cu)

/** \\brief  E31F8, CCM Configuration Register */
#define GTM_CCM8_CFG                   /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_CFG *)0xF01E31F8u)

/** \\brief  E31F0, CCM CMU Clock Configuration Register */
#define GTM_CCM8_CMU_CLK_CFG           /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_CMU_CLK_CFG *)0xF01E31F0u)

/** \\brief  E31F4, CCM CMU Fixed Clock Configuration Register */
#define GTM_CCM8_CMU_FXCLK_CFG         /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_CMU_FXCLK_CFG *)0xF01E31F4u)

/** \\brief  E31DC, CCM Hardware Configuration */
#define GTM_CCM8_HW_CONF               /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_HW_CONF *)0xF01E31DCu)

/** \\brief  E31FC, CCM Protection Register */
#define GTM_CCM8_PROT                  /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_PROT *)0xF01E31FCu)

/** \\brief  E33D8, CCM MCS Bus Master Status Register */
#define GTM_CCM9_AEIM_STA              /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_AEIM_STA *)0xF01E33D8u)

/** \\brief  E3200, CCM Address Range Protector 0 Control Register */
#define GTM_CCM9_ARP0_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP0_CTRL *)0xF01E3200u)

/** \\brief  E3204, CCM Address Range Protector 0 Protection Register */
#define GTM_CCM9_ARP0_PROT             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP0_PROT *)0xF01E3204u)

/** \\brief  E3208, CCM Address Range Protector 1 Control Register */
#define GTM_CCM9_ARP1_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP1_CTRL *)0xF01E3208u)

/** \\brief  E320C, CCM Address Range Protector 1 Protection Register */
#define GTM_CCM9_ARP1_PROT             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP1_PROT *)0xF01E320Cu)

/** \\brief  E3210, CCM Address Range Protector 2 Control Register */
#define GTM_CCM9_ARP2_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP2_CTRL *)0xF01E3210u)

/** \\brief  E3214, CCM Address Range Protector 2 Protection Register */
#define GTM_CCM9_ARP2_PROT             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP2_PROT *)0xF01E3214u)

/** \\brief  E3218, CCM Address Range Protector 3 Control Register */
#define GTM_CCM9_ARP3_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP3_CTRL *)0xF01E3218u)

/** \\brief  E321C, CCM Address Range Protector 3 Protection Register */
#define GTM_CCM9_ARP3_PROT             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP3_PROT *)0xF01E321Cu)

/** \\brief  E3220, CCM Address Range Protector 4 Control Register */
#define GTM_CCM9_ARP4_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP4_CTRL *)0xF01E3220u)

/** \\brief  E3224, CCM Address Range Protector 4 Protection Register */
#define GTM_CCM9_ARP4_PROT             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP4_PROT *)0xF01E3224u)

/** \\brief  E3228, CCM Address Range Protector 5 Control Register */
#define GTM_CCM9_ARP5_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP5_CTRL *)0xF01E3228u)

/** \\brief  E322C, CCM Address Range Protector 5 Protection Register */
#define GTM_CCM9_ARP5_PROT             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP5_PROT *)0xF01E322Cu)

/** \\brief  E3230, CCM Address Range Protector 6 Control Register */
#define GTM_CCM9_ARP6_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP6_CTRL *)0xF01E3230u)

/** \\brief  E3234, CCM Address Range Protector 6 Protection Register */
#define GTM_CCM9_ARP6_PROT             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP6_PROT *)0xF01E3234u)

/** \\brief  E3238, CCM Address Range Protector 7 Control Register */
#define GTM_CCM9_ARP7_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP7_CTRL *)0xF01E3238u)

/** \\brief  E323C, CCM Address Range Protector 7 Protection Register */
#define GTM_CCM9_ARP7_PROT             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP7_PROT *)0xF01E323Cu)

/** \\brief  E3240, CCM Address Range Protector 8 Control Register */
#define GTM_CCM9_ARP8_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP8_CTRL *)0xF01E3240u)

/** \\brief  E3244, CCM Address Range Protector 8 Protection Register */
#define GTM_CCM9_ARP8_PROT             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP8_PROT *)0xF01E3244u)

/** \\brief  E3248, CCM Address Range Protector 9 Control Register */
#define GTM_CCM9_ARP9_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP9_CTRL *)0xF01E3248u)

/** \\brief  E324C, CCM Address Range Protector 9 Protection Register */
#define GTM_CCM9_ARP9_PROT             /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_ARP9_PROT *)0xF01E324Cu)

/** \\brief  E33F8, CCM Configuration Register */
#define GTM_CCM9_CFG                   /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_CFG *)0xF01E33F8u)

/** \\brief  E33F0, CCM CMU Clock Configuration Register */
#define GTM_CCM9_CMU_CLK_CFG           /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_CMU_CLK_CFG *)0xF01E33F0u)

