Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  E33F4, CCM CMU Fixed Clock Configuration Register */
#define GTM_CCM9_CMU_FXCLK_CFG         /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_CMU_FXCLK_CFG *)0xF01E33F4u)

/** \\brief  E33DC, CCM Hardware Configuration */
#define GTM_CCM9_HW_CONF               /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_HW_CONF *)0xF01E33DCu)

/** \\brief  E33FC, CCM Protection Register */
#define GTM_CCM9_PROT                  /*lint --e(923)*/ (*(volatile Ifx_GTM_CCM_PROT *)0xF01E33FCu)

/** \\brief  E4004, CDTM0 DTM0 channel control register 1 */
#define GTM_CDTM0_DTM0_CH_CTRL1        /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_CTRL1 *)0xF01E4004u)

/** \\brief  E4008, CDTM0 DTM0 channel control register 2 */
#define GTM_CDTM0_DTM0_CH_CTRL2        /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_CTRL2 *)0xF01E4008u)

/** \\brief  E400C, CDTM0 DTM0 channel control register 2 shadow */
#define GTM_CDTM0_DTM0_CH_CTRL2_SR     /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_CTRL2_SR *)0xF01E400Cu)

/** \\brief  E4028, CDTM0 DTM0 channel control register 3 */
#define GTM_CDTM0_DTM0_CH_CTRL3        /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_CTRL3 *)0xF01E4028u)

/** \\brief  E4014, CDTM0 DTM0 channel 0 dead time reload values */
#define GTM_CDTM0_DTM0_CH_DTV0         /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_DTV *)0xF01E4014u)

/** Alias (User Manual Name) for GTM_CDTM0_DTM0_CH_DTV0.
 * To use register names with standard convension, please use GTM_CDTM0_DTM0_CH_DTV0.
 */
#define GTM_CDTM0_DTM0_CH0_DTV         (GTM_CDTM0_DTM0_CH_DTV0)

/** Alias (User Manual Name) for GTM_CDTM0_DTM0_CH_DTV0.
 * To use register names with standard convension, please use GTM_CDTM0_DTM0_CH_DTV0.
 */
#define GTM_CDTM0_DTM0_CH0_DTV         (GTM_CDTM0_DTM0_CH_DTV0)

/** \\brief  E4018, CDTM0 DTM0 channel 0 dead time reload values */
#define GTM_CDTM0_DTM0_CH_DTV1         /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_DTV *)0xF01E4018u)

/** Alias (User Manual Name) for GTM_CDTM0_DTM0_CH_DTV1.
 * To use register names with standard convension, please use GTM_CDTM0_DTM0_CH_DTV1.
 */
#define GTM_CDTM0_DTM0_CH1_DTV         (GTM_CDTM0_DTM0_CH_DTV1)

/** Alias (User Manual Name) for GTM_CDTM0_DTM0_CH_DTV1.
 * To use register names with standard convension, please use GTM_CDTM0_DTM0_CH_DTV1.
 */
#define GTM_CDTM0_DTM0_CH1_DTV         (GTM_CDTM0_DTM0_CH_DTV1)

/** \\brief  E401C, CDTM0 DTM0 channel 0 dead time reload values */
#define GTM_CDTM0_DTM0_CH_DTV2         /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_DTV *)0xF01E401Cu)

/** Alias (User Manual Name) for GTM_CDTM0_DTM0_CH_DTV2.
 * To use register names with standard convension, please use GTM_CDTM0_DTM0_CH_DTV2.
 */
#define GTM_CDTM0_DTM0_CH2_DTV         (GTM_CDTM0_DTM0_CH_DTV2)

/** Alias (User Manual Name) for GTM_CDTM0_DTM0_CH_DTV2.
 * To use register names with standard convension, please use GTM_CDTM0_DTM0_CH_DTV2.
 */
#define GTM_CDTM0_DTM0_CH2_DTV         (GTM_CDTM0_DTM0_CH_DTV2)

/** \\brief  E4020, CDTM0 DTM0 channel 0 dead time reload values */
#define GTM_CDTM0_DTM0_CH_DTV3         /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_DTV *)0xF01E4020u)

/** Alias (User Manual Name) for GTM_CDTM0_DTM0_CH_DTV3.
 * To use register names with standard convension, please use GTM_CDTM0_DTM0_CH_DTV3.
 */
#define GTM_CDTM0_DTM0_CH3_DTV         (GTM_CDTM0_DTM0_CH_DTV3)

/** Alias (User Manual Name) for GTM_CDTM0_DTM0_CH_DTV3.
 * To use register names with standard convension, please use GTM_CDTM0_DTM0_CH_DTV3.
 */
#define GTM_CDTM0_DTM0_CH3_DTV         (GTM_CDTM0_DTM0_CH_DTV3)

/** \\brief  E4024, CDTM DTM0 channel shadow reg0ster */
#define GTM_CDTM0_DTM0_CH_SR           /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_SR *)0xF01E4024u)

/** \\brief  E4000, CDTM0 DTM0 global configuration and control register */
#define GTM_CDTM0_DTM0_CTRL            /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CTRL *)0xF01E4000u)

/** \\brief  E4010, CDTM0 DTM0 phase shift unit configuration and control
 * register */
#define GTM_CDTM0_DTM0_PS_CTRL         /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_PS_CTRL *)0xF01E4010u)

/** \\brief  E4044, CDTM0 DTM0 channel control register 1 */
#define GTM_CDTM0_DTM1_CH_CTRL1        /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_CTRL1 *)0xF01E4044u)

/** \\brief  E4048, CDTM0 DTM0 channel control register 2 */
#define GTM_CDTM0_DTM1_CH_CTRL2        /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_CTRL2 *)0xF01E4048u)

/** \\brief  E404C, CDTM0 DTM0 channel control register 2 shadow */
#define GTM_CDTM0_DTM1_CH_CTRL2_SR     /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_CTRL2_SR *)0xF01E404Cu)

/** \\brief  E4068, CDTM0 DTM0 channel control register 3 */
#define GTM_CDTM0_DTM1_CH_CTRL3        /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_CTRL3 *)0xF01E4068u)

/** \\brief  E4054, CDTM0 DTM0 channel 0 dead time reload values */
#define GTM_CDTM0_DTM1_CH_DTV0         /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_DTV *)0xF01E4054u)

/** Alias (User Manual Name) for GTM_CDTM0_DTM1_CH_DTV0.
 * To use register names with standard convension, please use GTM_CDTM0_DTM1_CH_DTV0.
 */
#define GTM_CDTM0_DTM1_CH0_DTV         (GTM_CDTM0_DTM1_CH_DTV0)

/** Alias (User Manual Name) for GTM_CDTM0_DTM1_CH_DTV0.
 * To use register names with standard convension, please use GTM_CDTM0_DTM1_CH_DTV0.
 */
#define GTM_CDTM0_DTM1_CH0_DTV         (GTM_CDTM0_DTM1_CH_DTV0)

/** \\brief  E4058, CDTM0 DTM0 channel 0 dead time reload values */
#define GTM_CDTM0_DTM1_CH_DTV1         /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_DTV *)0xF01E4058u)

/** Alias (User Manual Name) for GTM_CDTM0_DTM1_CH_DTV1.
 * To use register names with standard convension, please use GTM_CDTM0_DTM1_CH_DTV1.
 */
#define GTM_CDTM0_DTM1_CH1_DTV         (GTM_CDTM0_DTM1_CH_DTV1)

/** Alias (User Manual Name) for GTM_CDTM0_DTM1_CH_DTV1.
 * To use register names with standard convension, please use GTM_CDTM0_DTM1_CH_DTV1.
 */
#define GTM_CDTM0_DTM1_CH1_DTV         (GTM_CDTM0_DTM1_CH_DTV1)

/** \\brief  E405C, CDTM0 DTM0 channel 0 dead time reload values */
#define GTM_CDTM0_DTM1_CH_DTV2         /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_DTV *)0xF01E405Cu)

/** Alias (User Manual Name) for GTM_CDTM0_DTM1_CH_DTV2.
 * To use register names with standard convension, please use GTM_CDTM0_DTM1_CH_DTV2.
 */
#define GTM_CDTM0_DTM1_CH2_DTV         (GTM_CDTM0_DTM1_CH_DTV2)

/** Alias (User Manual Name) for GTM_CDTM0_DTM1_CH_DTV2.
 * To use register names with standard convension, please use GTM_CDTM0_DTM1_CH_DTV2.
 */
#define GTM_CDTM0_DTM1_CH2_DTV         (GTM_CDTM0_DTM1_CH_DTV2)

