Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  E4060, CDTM0 DTM0 channel 0 dead time reload values */
#define GTM_CDTM0_DTM1_CH_DTV3         /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_DTV *)0xF01E4060u)

/** Alias (User Manual Name) for GTM_CDTM0_DTM1_CH_DTV3.
 * To use register names with standard convension, please use GTM_CDTM0_DTM1_CH_DTV3.
 */
#define GTM_CDTM0_DTM1_CH3_DTV         (GTM_CDTM0_DTM1_CH_DTV3)

/** Alias (User Manual Name) for GTM_CDTM0_DTM1_CH_DTV3.
 * To use register names with standard convension, please use GTM_CDTM0_DTM1_CH_DTV3.
 */
#define GTM_CDTM0_DTM1_CH3_DTV         (GTM_CDTM0_DTM1_CH_DTV3)

/** \\brief  E4064, CDTM DTM0 channel shadow reg0ster */
#define GTM_CDTM0_DTM1_CH_SR           /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_SR *)0xF01E4064u)

/** \\brief  E4040, CDTM0 DTM0 global configuration and control register */
#define GTM_CDTM0_DTM1_CTRL            /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CTRL *)0xF01E4040u)

/** \\brief  E4050, CDTM0 DTM0 phase shift unit configuration and control
 * register */
#define GTM_CDTM0_DTM1_PS_CTRL         /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_PS_CTRL *)0xF01E4050u)

/** \\brief  E4080, CDTM0 DTM2 global configuration and control register */
#define GTM_CDTM0_DTM2_CTRL            /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM2_CTRL *)0xF01E4080u)

/** \\brief  E40C0, CDTM0 DTM3 global configuration and control register */
#define GTM_CDTM0_DTM3_CTRL            /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM3_CTRL *)0xF01E40C0u)

/** \\brief  E4104, CDTM0 DTM0 channel control register 1 */
#define GTM_CDTM0_DTM4_CH_CTRL1        /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_CTRL1 *)0xF01E4104u)

/** \\brief  E4108, CDTM0 DTM0 channel control register 2 */
#define GTM_CDTM0_DTM4_CH_CTRL2        /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_CTRL2 *)0xF01E4108u)

/** \\brief  E410C, CDTM0 DTM0 channel control register 2 shadow */
#define GTM_CDTM0_DTM4_CH_CTRL2_SR     /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_CTRL2_SR *)0xF01E410Cu)

/** \\brief  E4128, CDTM0 DTM0 channel control register 3 */
#define GTM_CDTM0_DTM4_CH_CTRL3        /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_CTRL3 *)0xF01E4128u)

/** \\brief  E4114, CDTM0 DTM0 channel 0 dead time reload values */
#define GTM_CDTM0_DTM4_CH_DTV0         /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_DTV *)0xF01E4114u)

/** Alias (User Manual Name) for GTM_CDTM0_DTM4_CH_DTV0.
 * To use register names with standard convension, please use GTM_CDTM0_DTM4_CH_DTV0.
 */
#define GTM_CDTM0_DTM4_CH0_DTV         (GTM_CDTM0_DTM4_CH_DTV0)

/** Alias (User Manual Name) for GTM_CDTM0_DTM4_CH_DTV0.
 * To use register names with standard convension, please use GTM_CDTM0_DTM4_CH_DTV0.
 */
#define GTM_CDTM0_DTM4_CH0_DTV         (GTM_CDTM0_DTM4_CH_DTV0)

/** \\brief  E4118, CDTM0 DTM0 channel 0 dead time reload values */
#define GTM_CDTM0_DTM4_CH_DTV1         /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_DTV *)0xF01E4118u)

/** Alias (User Manual Name) for GTM_CDTM0_DTM4_CH_DTV1.
 * To use register names with standard convension, please use GTM_CDTM0_DTM4_CH_DTV1.
 */
#define GTM_CDTM0_DTM4_CH1_DTV         (GTM_CDTM0_DTM4_CH_DTV1)

/** Alias (User Manual Name) for GTM_CDTM0_DTM4_CH_DTV1.
 * To use register names with standard convension, please use GTM_CDTM0_DTM4_CH_DTV1.
 */
#define GTM_CDTM0_DTM4_CH1_DTV         (GTM_CDTM0_DTM4_CH_DTV1)

/** \\brief  E411C, CDTM0 DTM0 channel 0 dead time reload values */
#define GTM_CDTM0_DTM4_CH_DTV2         /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_DTV *)0xF01E411Cu)

/** Alias (User Manual Name) for GTM_CDTM0_DTM4_CH_DTV2.
 * To use register names with standard convension, please use GTM_CDTM0_DTM4_CH_DTV2.
 */
#define GTM_CDTM0_DTM4_CH2_DTV         (GTM_CDTM0_DTM4_CH_DTV2)

/** Alias (User Manual Name) for GTM_CDTM0_DTM4_CH_DTV2.
 * To use register names with standard convension, please use GTM_CDTM0_DTM4_CH_DTV2.
 */
#define GTM_CDTM0_DTM4_CH2_DTV         (GTM_CDTM0_DTM4_CH_DTV2)

/** \\brief  E4120, CDTM0 DTM0 channel 0 dead time reload values */
#define GTM_CDTM0_DTM4_CH_DTV3         /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_DTV *)0xF01E4120u)

/** Alias (User Manual Name) for GTM_CDTM0_DTM4_CH_DTV3.
 * To use register names with standard convension, please use GTM_CDTM0_DTM4_CH_DTV3.
 */
#define GTM_CDTM0_DTM4_CH3_DTV         (GTM_CDTM0_DTM4_CH_DTV3)

/** Alias (User Manual Name) for GTM_CDTM0_DTM4_CH_DTV3.
 * To use register names with standard convension, please use GTM_CDTM0_DTM4_CH_DTV3.
 */
#define GTM_CDTM0_DTM4_CH3_DTV         (GTM_CDTM0_DTM4_CH_DTV3)

/** \\brief  E4124, CDTM DTM0 channel shadow reg0ster */
#define GTM_CDTM0_DTM4_CH_SR           /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_SR *)0xF01E4124u)

/** \\brief  E4100, CDTM0 DTM0 global configuration and control register */
#define GTM_CDTM0_DTM4_CTRL            /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CTRL *)0xF01E4100u)

/** \\brief  E4110, CDTM0 DTM0 phase shift unit configuration and control
 * register */
#define GTM_CDTM0_DTM4_PS_CTRL         /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_PS_CTRL *)0xF01E4110u)

/** \\brief  E4144, CDTM0 DTM0 channel control register 1 */
#define GTM_CDTM0_DTM5_CH_CTRL1        /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_CTRL1 *)0xF01E4144u)

/** \\brief  E4148, CDTM0 DTM0 channel control register 2 */
#define GTM_CDTM0_DTM5_CH_CTRL2        /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_CTRL2 *)0xF01E4148u)

/** \\brief  E414C, CDTM0 DTM0 channel control register 2 shadow */
#define GTM_CDTM0_DTM5_CH_CTRL2_SR     /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_CTRL2_SR *)0xF01E414Cu)

/** \\brief  E4168, CDTM0 DTM0 channel control register 3 */
#define GTM_CDTM0_DTM5_CH_CTRL3        /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_CTRL3 *)0xF01E4168u)

/** \\brief  E4154, CDTM0 DTM0 channel 0 dead time reload values */
#define GTM_CDTM0_DTM5_CH_DTV0         /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_DTV *)0xF01E4154u)

/** Alias (User Manual Name) for GTM_CDTM0_DTM5_CH_DTV0.
 * To use register names with standard convension, please use GTM_CDTM0_DTM5_CH_DTV0.
 */
#define GTM_CDTM0_DTM5_CH0_DTV         (GTM_CDTM0_DTM5_CH_DTV0)

/** Alias (User Manual Name) for GTM_CDTM0_DTM5_CH_DTV0.
 * To use register names with standard convension, please use GTM_CDTM0_DTM5_CH_DTV0.
 */
#define GTM_CDTM0_DTM5_CH0_DTV         (GTM_CDTM0_DTM5_CH_DTV0)

/** \\brief  E4158, CDTM0 DTM0 channel 0 dead time reload values */
#define GTM_CDTM0_DTM5_CH_DTV1         /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_DTV *)0xF01E4158u)

/** Alias (User Manual Name) for GTM_CDTM0_DTM5_CH_DTV1.
 * To use register names with standard convension, please use GTM_CDTM0_DTM5_CH_DTV1.
 */
#define GTM_CDTM0_DTM5_CH1_DTV         (GTM_CDTM0_DTM5_CH_DTV1)

/** Alias (User Manual Name) for GTM_CDTM0_DTM5_CH_DTV1.
 * To use register names with standard convension, please use GTM_CDTM0_DTM5_CH_DTV1.
 */
#define GTM_CDTM0_DTM5_CH1_DTV         (GTM_CDTM0_DTM5_CH_DTV1)

