Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  E415C, CDTM0 DTM0 channel 0 dead time reload values */
#define GTM_CDTM0_DTM5_CH_DTV2         /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_DTV *)0xF01E415Cu)

/** Alias (User Manual Name) for GTM_CDTM0_DTM5_CH_DTV2.
 * To use register names with standard convension, please use GTM_CDTM0_DTM5_CH_DTV2.
 */
#define GTM_CDTM0_DTM5_CH2_DTV         (GTM_CDTM0_DTM5_CH_DTV2)

/** Alias (User Manual Name) for GTM_CDTM0_DTM5_CH_DTV2.
 * To use register names with standard convension, please use GTM_CDTM0_DTM5_CH_DTV2.
 */
#define GTM_CDTM0_DTM5_CH2_DTV         (GTM_CDTM0_DTM5_CH_DTV2)

/** \\brief  E4160, CDTM0 DTM0 channel 0 dead time reload values */
#define GTM_CDTM0_DTM5_CH_DTV3         /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_DTV *)0xF01E4160u)

/** Alias (User Manual Name) for GTM_CDTM0_DTM5_CH_DTV3.
 * To use register names with standard convension, please use GTM_CDTM0_DTM5_CH_DTV3.
 */
#define GTM_CDTM0_DTM5_CH3_DTV         (GTM_CDTM0_DTM5_CH_DTV3)

/** Alias (User Manual Name) for GTM_CDTM0_DTM5_CH_DTV3.
 * To use register names with standard convension, please use GTM_CDTM0_DTM5_CH_DTV3.
 */
#define GTM_CDTM0_DTM5_CH3_DTV         (GTM_CDTM0_DTM5_CH_DTV3)

/** \\brief  E4164, CDTM DTM0 channel shadow reg0ster */
#define GTM_CDTM0_DTM5_CH_SR           /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_SR *)0xF01E4164u)

/** \\brief  E4140, CDTM0 DTM0 global configuration and control register */
#define GTM_CDTM0_DTM5_CTRL            /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CTRL *)0xF01E4140u)

/** \\brief  E4150, CDTM0 DTM0 phase shift unit configuration and control
 * register */
#define GTM_CDTM0_DTM5_PS_CTRL         /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_PS_CTRL *)0xF01E4150u)

/** \\brief  E4404, CDTM0 DTM0 channel control register 1 */
#define GTM_CDTM1_DTM0_CH_CTRL1        /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_CTRL1 *)0xF01E4404u)

/** \\brief  E4408, CDTM0 DTM0 channel control register 2 */
#define GTM_CDTM1_DTM0_CH_CTRL2        /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_CTRL2 *)0xF01E4408u)

/** \\brief  E440C, CDTM0 DTM0 channel control register 2 shadow */
#define GTM_CDTM1_DTM0_CH_CTRL2_SR     /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_CTRL2_SR *)0xF01E440Cu)

/** \\brief  E4428, CDTM0 DTM0 channel control register 3 */
#define GTM_CDTM1_DTM0_CH_CTRL3        /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_CTRL3 *)0xF01E4428u)

/** \\brief  E4414, CDTM0 DTM0 channel 0 dead time reload values */
#define GTM_CDTM1_DTM0_CH_DTV0         /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_DTV *)0xF01E4414u)

/** Alias (User Manual Name) for GTM_CDTM1_DTM0_CH_DTV0.
 * To use register names with standard convension, please use GTM_CDTM1_DTM0_CH_DTV0.
 */
#define GTM_CDTM1_DTM0_CH0_DTV         (GTM_CDTM1_DTM0_CH_DTV0)

/** Alias (User Manual Name) for GTM_CDTM1_DTM0_CH_DTV0.
 * To use register names with standard convension, please use GTM_CDTM1_DTM0_CH_DTV0.
 */
#define GTM_CDTM1_DTM0_CH0_DTV         (GTM_CDTM1_DTM0_CH_DTV0)

/** \\brief  E4418, CDTM0 DTM0 channel 0 dead time reload values */
#define GTM_CDTM1_DTM0_CH_DTV1         /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_DTV *)0xF01E4418u)

/** Alias (User Manual Name) for GTM_CDTM1_DTM0_CH_DTV1.
 * To use register names with standard convension, please use GTM_CDTM1_DTM0_CH_DTV1.
 */
#define GTM_CDTM1_DTM0_CH1_DTV         (GTM_CDTM1_DTM0_CH_DTV1)

/** Alias (User Manual Name) for GTM_CDTM1_DTM0_CH_DTV1.
 * To use register names with standard convension, please use GTM_CDTM1_DTM0_CH_DTV1.
 */
#define GTM_CDTM1_DTM0_CH1_DTV         (GTM_CDTM1_DTM0_CH_DTV1)

/** \\brief  E441C, CDTM0 DTM0 channel 0 dead time reload values */
#define GTM_CDTM1_DTM0_CH_DTV2         /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_DTV *)0xF01E441Cu)

/** Alias (User Manual Name) for GTM_CDTM1_DTM0_CH_DTV2.
 * To use register names with standard convension, please use GTM_CDTM1_DTM0_CH_DTV2.
 */
#define GTM_CDTM1_DTM0_CH2_DTV         (GTM_CDTM1_DTM0_CH_DTV2)

/** Alias (User Manual Name) for GTM_CDTM1_DTM0_CH_DTV2.
 * To use register names with standard convension, please use GTM_CDTM1_DTM0_CH_DTV2.
 */
#define GTM_CDTM1_DTM0_CH2_DTV         (GTM_CDTM1_DTM0_CH_DTV2)

/** \\brief  E4420, CDTM0 DTM0 channel 0 dead time reload values */
#define GTM_CDTM1_DTM0_CH_DTV3         /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_DTV *)0xF01E4420u)

/** Alias (User Manual Name) for GTM_CDTM1_DTM0_CH_DTV3.
 * To use register names with standard convension, please use GTM_CDTM1_DTM0_CH_DTV3.
 */
#define GTM_CDTM1_DTM0_CH3_DTV         (GTM_CDTM1_DTM0_CH_DTV3)

/** Alias (User Manual Name) for GTM_CDTM1_DTM0_CH_DTV3.
 * To use register names with standard convension, please use GTM_CDTM1_DTM0_CH_DTV3.
 */
#define GTM_CDTM1_DTM0_CH3_DTV         (GTM_CDTM1_DTM0_CH_DTV3)

/** \\brief  E4424, CDTM DTM0 channel shadow reg0ster */
#define GTM_CDTM1_DTM0_CH_SR           /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_SR *)0xF01E4424u)

/** \\brief  E4400, CDTM0 DTM0 global configuration and control register */
#define GTM_CDTM1_DTM0_CTRL            /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CTRL *)0xF01E4400u)

/** \\brief  E4410, CDTM0 DTM0 phase shift unit configuration and control
 * register */
#define GTM_CDTM1_DTM0_PS_CTRL         /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_PS_CTRL *)0xF01E4410u)

/** \\brief  E4444, CDTM0 DTM0 channel control register 1 */
#define GTM_CDTM1_DTM1_CH_CTRL1        /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_CTRL1 *)0xF01E4444u)

/** \\brief  E4448, CDTM0 DTM0 channel control register 2 */
#define GTM_CDTM1_DTM1_CH_CTRL2        /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_CTRL2 *)0xF01E4448u)

/** \\brief  E444C, CDTM0 DTM0 channel control register 2 shadow */
#define GTM_CDTM1_DTM1_CH_CTRL2_SR     /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_CTRL2_SR *)0xF01E444Cu)

/** \\brief  E4468, CDTM0 DTM0 channel control register 3 */
#define GTM_CDTM1_DTM1_CH_CTRL3        /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_CTRL3 *)0xF01E4468u)

/** \\brief  E4454, CDTM0 DTM0 channel 0 dead time reload values */
#define GTM_CDTM1_DTM1_CH_DTV0         /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_DTV *)0xF01E4454u)

