Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** Alias (User Manual Name) for GTM_CDTM1_DTM1_CH_DTV0.
 * To use register names with standard convension, please use GTM_CDTM1_DTM1_CH_DTV0.
 */
#define GTM_CDTM1_DTM1_CH0_DTV         (GTM_CDTM1_DTM1_CH_DTV0)

/** Alias (User Manual Name) for GTM_CDTM1_DTM1_CH_DTV0.
 * To use register names with standard convension, please use GTM_CDTM1_DTM1_CH_DTV0.
 */
#define GTM_CDTM1_DTM1_CH0_DTV         (GTM_CDTM1_DTM1_CH_DTV0)

/** \\brief  E4458, CDTM0 DTM0 channel 0 dead time reload values */
#define GTM_CDTM1_DTM1_CH_DTV1         /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_DTV *)0xF01E4458u)

/** Alias (User Manual Name) for GTM_CDTM1_DTM1_CH_DTV1.
 * To use register names with standard convension, please use GTM_CDTM1_DTM1_CH_DTV1.
 */
#define GTM_CDTM1_DTM1_CH1_DTV         (GTM_CDTM1_DTM1_CH_DTV1)

/** Alias (User Manual Name) for GTM_CDTM1_DTM1_CH_DTV1.
 * To use register names with standard convension, please use GTM_CDTM1_DTM1_CH_DTV1.
 */
#define GTM_CDTM1_DTM1_CH1_DTV         (GTM_CDTM1_DTM1_CH_DTV1)

/** \\brief  E445C, CDTM0 DTM0 channel 0 dead time reload values */
#define GTM_CDTM1_DTM1_CH_DTV2         /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_DTV *)0xF01E445Cu)

/** Alias (User Manual Name) for GTM_CDTM1_DTM1_CH_DTV2.
 * To use register names with standard convension, please use GTM_CDTM1_DTM1_CH_DTV2.
 */
#define GTM_CDTM1_DTM1_CH2_DTV         (GTM_CDTM1_DTM1_CH_DTV2)

/** Alias (User Manual Name) for GTM_CDTM1_DTM1_CH_DTV2.
 * To use register names with standard convension, please use GTM_CDTM1_DTM1_CH_DTV2.
 */
#define GTM_CDTM1_DTM1_CH2_DTV         (GTM_CDTM1_DTM1_CH_DTV2)

/** \\brief  E4460, CDTM0 DTM0 channel 0 dead time reload values */
#define GTM_CDTM1_DTM1_CH_DTV3         /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_DTV *)0xF01E4460u)

/** Alias (User Manual Name) for GTM_CDTM1_DTM1_CH_DTV3.
 * To use register names with standard convension, please use GTM_CDTM1_DTM1_CH_DTV3.
 */
#define GTM_CDTM1_DTM1_CH3_DTV         (GTM_CDTM1_DTM1_CH_DTV3)

/** Alias (User Manual Name) for GTM_CDTM1_DTM1_CH_DTV3.
 * To use register names with standard convension, please use GTM_CDTM1_DTM1_CH_DTV3.
 */
#define GTM_CDTM1_DTM1_CH3_DTV         (GTM_CDTM1_DTM1_CH_DTV3)

/** \\brief  E4464, CDTM DTM0 channel shadow reg0ster */
#define GTM_CDTM1_DTM1_CH_SR           /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_SR *)0xF01E4464u)

/** \\brief  E4440, CDTM0 DTM0 global configuration and control register */
#define GTM_CDTM1_DTM1_CTRL            /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CTRL *)0xF01E4440u)

/** \\brief  E4450, CDTM0 DTM0 phase shift unit configuration and control
 * register */
#define GTM_CDTM1_DTM1_PS_CTRL         /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_PS_CTRL *)0xF01E4450u)

/** \\brief  E4480, CDTM0 DTM2 global configuration and control register */
#define GTM_CDTM1_DTM2_CTRL            /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM2_CTRL *)0xF01E4480u)

/** \\brief  E44C0, CDTM0 DTM3 global configuration and control register */
#define GTM_CDTM1_DTM3_CTRL            /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM3_CTRL *)0xF01E44C0u)

/** \\brief  E4504, CDTM0 DTM0 channel control register 1 */
#define GTM_CDTM1_DTM4_CH_CTRL1        /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_CTRL1 *)0xF01E4504u)

/** \\brief  E4508, CDTM0 DTM0 channel control register 2 */
#define GTM_CDTM1_DTM4_CH_CTRL2        /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_CTRL2 *)0xF01E4508u)

/** \\brief  E450C, CDTM0 DTM0 channel control register 2 shadow */
#define GTM_CDTM1_DTM4_CH_CTRL2_SR     /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_CTRL2_SR *)0xF01E450Cu)

/** \\brief  E4528, CDTM0 DTM0 channel control register 3 */
#define GTM_CDTM1_DTM4_CH_CTRL3        /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_CTRL3 *)0xF01E4528u)

/** \\brief  E4514, CDTM0 DTM0 channel 0 dead time reload values */
#define GTM_CDTM1_DTM4_CH_DTV0         /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_DTV *)0xF01E4514u)

/** Alias (User Manual Name) for GTM_CDTM1_DTM4_CH_DTV0.
 * To use register names with standard convension, please use GTM_CDTM1_DTM4_CH_DTV0.
 */
#define GTM_CDTM1_DTM4_CH0_DTV         (GTM_CDTM1_DTM4_CH_DTV0)

/** Alias (User Manual Name) for GTM_CDTM1_DTM4_CH_DTV0.
 * To use register names with standard convension, please use GTM_CDTM1_DTM4_CH_DTV0.
 */
#define GTM_CDTM1_DTM4_CH0_DTV         (GTM_CDTM1_DTM4_CH_DTV0)

/** \\brief  E4518, CDTM0 DTM0 channel 0 dead time reload values */
#define GTM_CDTM1_DTM4_CH_DTV1         /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_DTV *)0xF01E4518u)

/** Alias (User Manual Name) for GTM_CDTM1_DTM4_CH_DTV1.
 * To use register names with standard convension, please use GTM_CDTM1_DTM4_CH_DTV1.
 */
#define GTM_CDTM1_DTM4_CH1_DTV         (GTM_CDTM1_DTM4_CH_DTV1)

/** Alias (User Manual Name) for GTM_CDTM1_DTM4_CH_DTV1.
 * To use register names with standard convension, please use GTM_CDTM1_DTM4_CH_DTV1.
 */
#define GTM_CDTM1_DTM4_CH1_DTV         (GTM_CDTM1_DTM4_CH_DTV1)

/** \\brief  E451C, CDTM0 DTM0 channel 0 dead time reload values */
#define GTM_CDTM1_DTM4_CH_DTV2         /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_DTV *)0xF01E451Cu)

/** Alias (User Manual Name) for GTM_CDTM1_DTM4_CH_DTV2.
 * To use register names with standard convension, please use GTM_CDTM1_DTM4_CH_DTV2.
 */
#define GTM_CDTM1_DTM4_CH2_DTV         (GTM_CDTM1_DTM4_CH_DTV2)

/** Alias (User Manual Name) for GTM_CDTM1_DTM4_CH_DTV2.
 * To use register names with standard convension, please use GTM_CDTM1_DTM4_CH_DTV2.
 */
#define GTM_CDTM1_DTM4_CH2_DTV         (GTM_CDTM1_DTM4_CH_DTV2)

/** \\brief  E4520, CDTM0 DTM0 channel 0 dead time reload values */
#define GTM_CDTM1_DTM4_CH_DTV3         /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_DTV *)0xF01E4520u)

/** Alias (User Manual Name) for GTM_CDTM1_DTM4_CH_DTV3.
 * To use register names with standard convension, please use GTM_CDTM1_DTM4_CH_DTV3.
 */
#define GTM_CDTM1_DTM4_CH3_DTV         (GTM_CDTM1_DTM4_CH_DTV3)

/** Alias (User Manual Name) for GTM_CDTM1_DTM4_CH_DTV3.
 * To use register names with standard convension, please use GTM_CDTM1_DTM4_CH_DTV3.
 */
#define GTM_CDTM1_DTM4_CH3_DTV         (GTM_CDTM1_DTM4_CH_DTV3)

/** \\brief  E4524, CDTM DTM0 channel shadow reg0ster */
#define GTM_CDTM1_DTM4_CH_SR           /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_SR *)0xF01E4524u)

/** \\brief  E4500, CDTM0 DTM0 global configuration and control register */
#define GTM_CDTM1_DTM4_CTRL            /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CTRL *)0xF01E4500u)

/** \\brief  E4510, CDTM0 DTM0 phase shift unit configuration and control
 * register */
#define GTM_CDTM1_DTM4_PS_CTRL         /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_PS_CTRL *)0xF01E4510u)

