Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  E4544, CDTM0 DTM0 channel control register 1 */
#define GTM_CDTM1_DTM5_CH_CTRL1        /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_CTRL1 *)0xF01E4544u)

/** \\brief  E4548, CDTM0 DTM0 channel control register 2 */
#define GTM_CDTM1_DTM5_CH_CTRL2        /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_CTRL2 *)0xF01E4548u)

/** \\brief  E454C, CDTM0 DTM0 channel control register 2 shadow */
#define GTM_CDTM1_DTM5_CH_CTRL2_SR     /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_CTRL2_SR *)0xF01E454Cu)

/** \\brief  E4568, CDTM0 DTM0 channel control register 3 */
#define GTM_CDTM1_DTM5_CH_CTRL3        /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_CTRL3 *)0xF01E4568u)

/** \\brief  E4554, CDTM0 DTM0 channel 0 dead time reload values */
#define GTM_CDTM1_DTM5_CH_DTV0         /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_DTV *)0xF01E4554u)

/** Alias (User Manual Name) for GTM_CDTM1_DTM5_CH_DTV0.
 * To use register names with standard convension, please use GTM_CDTM1_DTM5_CH_DTV0.
 */
#define GTM_CDTM1_DTM5_CH0_DTV         (GTM_CDTM1_DTM5_CH_DTV0)

/** Alias (User Manual Name) for GTM_CDTM1_DTM5_CH_DTV0.
 * To use register names with standard convension, please use GTM_CDTM1_DTM5_CH_DTV0.
 */
#define GTM_CDTM1_DTM5_CH0_DTV         (GTM_CDTM1_DTM5_CH_DTV0)

/** \\brief  E4558, CDTM0 DTM0 channel 0 dead time reload values */
#define GTM_CDTM1_DTM5_CH_DTV1         /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_DTV *)0xF01E4558u)

/** Alias (User Manual Name) for GTM_CDTM1_DTM5_CH_DTV1.
 * To use register names with standard convension, please use GTM_CDTM1_DTM5_CH_DTV1.
 */
#define GTM_CDTM1_DTM5_CH1_DTV         (GTM_CDTM1_DTM5_CH_DTV1)

/** Alias (User Manual Name) for GTM_CDTM1_DTM5_CH_DTV1.
 * To use register names with standard convension, please use GTM_CDTM1_DTM5_CH_DTV1.
 */
#define GTM_CDTM1_DTM5_CH1_DTV         (GTM_CDTM1_DTM5_CH_DTV1)

/** \\brief  E455C, CDTM0 DTM0 channel 0 dead time reload values */
#define GTM_CDTM1_DTM5_CH_DTV2         /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_DTV *)0xF01E455Cu)

/** Alias (User Manual Name) for GTM_CDTM1_DTM5_CH_DTV2.
 * To use register names with standard convension, please use GTM_CDTM1_DTM5_CH_DTV2.
 */
#define GTM_CDTM1_DTM5_CH2_DTV         (GTM_CDTM1_DTM5_CH_DTV2)

/** Alias (User Manual Name) for GTM_CDTM1_DTM5_CH_DTV2.
 * To use register names with standard convension, please use GTM_CDTM1_DTM5_CH_DTV2.
 */
#define GTM_CDTM1_DTM5_CH2_DTV         (GTM_CDTM1_DTM5_CH_DTV2)

/** \\brief  E4560, CDTM0 DTM0 channel 0 dead time reload values */
#define GTM_CDTM1_DTM5_CH_DTV3         /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_DTV *)0xF01E4560u)

/** Alias (User Manual Name) for GTM_CDTM1_DTM5_CH_DTV3.
 * To use register names with standard convension, please use GTM_CDTM1_DTM5_CH_DTV3.
 */
#define GTM_CDTM1_DTM5_CH3_DTV         (GTM_CDTM1_DTM5_CH_DTV3)

/** Alias (User Manual Name) for GTM_CDTM1_DTM5_CH_DTV3.
 * To use register names with standard convension, please use GTM_CDTM1_DTM5_CH_DTV3.
 */
#define GTM_CDTM1_DTM5_CH3_DTV         (GTM_CDTM1_DTM5_CH_DTV3)

/** \\brief  E4564, CDTM DTM0 channel shadow reg0ster */
#define GTM_CDTM1_DTM5_CH_SR           /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_SR *)0xF01E4564u)

/** \\brief  E4540, CDTM0 DTM0 global configuration and control register */
#define GTM_CDTM1_DTM5_CTRL            /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CTRL *)0xF01E4540u)

/** \\brief  E4550, CDTM0 DTM0 phase shift unit configuration and control
 * register */
#define GTM_CDTM1_DTM5_PS_CTRL         /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_PS_CTRL *)0xF01E4550u)

/** \\brief  E4804, CDTM0 DTM0 channel control register 1 */
#define GTM_CDTM2_DTM0_CH_CTRL1        /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_CTRL1 *)0xF01E4804u)

/** \\brief  E4808, CDTM0 DTM0 channel control register 2 */
#define GTM_CDTM2_DTM0_CH_CTRL2        /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_CTRL2 *)0xF01E4808u)

/** \\brief  E480C, CDTM0 DTM0 channel control register 2 shadow */
#define GTM_CDTM2_DTM0_CH_CTRL2_SR     /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_CTRL2_SR *)0xF01E480Cu)

/** \\brief  E4828, CDTM0 DTM0 channel control register 3 */
#define GTM_CDTM2_DTM0_CH_CTRL3        /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_CTRL3 *)0xF01E4828u)

/** \\brief  E4814, CDTM0 DTM0 channel 0 dead time reload values */
#define GTM_CDTM2_DTM0_CH_DTV0         /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_DTV *)0xF01E4814u)

/** Alias (User Manual Name) for GTM_CDTM2_DTM0_CH_DTV0.
 * To use register names with standard convension, please use GTM_CDTM2_DTM0_CH_DTV0.
 */
#define GTM_CDTM2_DTM0_CH0_DTV         (GTM_CDTM2_DTM0_CH_DTV0)

/** Alias (User Manual Name) for GTM_CDTM2_DTM0_CH_DTV0.
 * To use register names with standard convension, please use GTM_CDTM2_DTM0_CH_DTV0.
 */
#define GTM_CDTM2_DTM0_CH0_DTV         (GTM_CDTM2_DTM0_CH_DTV0)

/** \\brief  E4818, CDTM0 DTM0 channel 0 dead time reload values */
#define GTM_CDTM2_DTM0_CH_DTV1         /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_DTV *)0xF01E4818u)

/** Alias (User Manual Name) for GTM_CDTM2_DTM0_CH_DTV1.
 * To use register names with standard convension, please use GTM_CDTM2_DTM0_CH_DTV1.
 */
#define GTM_CDTM2_DTM0_CH1_DTV         (GTM_CDTM2_DTM0_CH_DTV1)

/** Alias (User Manual Name) for GTM_CDTM2_DTM0_CH_DTV1.
 * To use register names with standard convension, please use GTM_CDTM2_DTM0_CH_DTV1.
 */
#define GTM_CDTM2_DTM0_CH1_DTV         (GTM_CDTM2_DTM0_CH_DTV1)

/** \\brief  E481C, CDTM0 DTM0 channel 0 dead time reload values */
#define GTM_CDTM2_DTM0_CH_DTV2         /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_DTV *)0xF01E481Cu)

/** Alias (User Manual Name) for GTM_CDTM2_DTM0_CH_DTV2.
 * To use register names with standard convension, please use GTM_CDTM2_DTM0_CH_DTV2.
 */
#define GTM_CDTM2_DTM0_CH2_DTV         (GTM_CDTM2_DTM0_CH_DTV2)

/** Alias (User Manual Name) for GTM_CDTM2_DTM0_CH_DTV2.
 * To use register names with standard convension, please use GTM_CDTM2_DTM0_CH_DTV2.
 */
#define GTM_CDTM2_DTM0_CH2_DTV         (GTM_CDTM2_DTM0_CH_DTV2)

