Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  E4820, CDTM0 DTM0 channel 0 dead time reload values */
#define GTM_CDTM2_DTM0_CH_DTV3         /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_DTV *)0xF01E4820u)

/** Alias (User Manual Name) for GTM_CDTM2_DTM0_CH_DTV3.
 * To use register names with standard convension, please use GTM_CDTM2_DTM0_CH_DTV3.
 */
#define GTM_CDTM2_DTM0_CH3_DTV         (GTM_CDTM2_DTM0_CH_DTV3)

/** Alias (User Manual Name) for GTM_CDTM2_DTM0_CH_DTV3.
 * To use register names with standard convension, please use GTM_CDTM2_DTM0_CH_DTV3.
 */
#define GTM_CDTM2_DTM0_CH3_DTV         (GTM_CDTM2_DTM0_CH_DTV3)

/** \\brief  E4824, CDTM DTM0 channel shadow reg0ster */
#define GTM_CDTM2_DTM0_CH_SR           /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_SR *)0xF01E4824u)

/** \\brief  E4800, CDTM0 DTM0 global configuration and control register */
#define GTM_CDTM2_DTM0_CTRL            /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CTRL *)0xF01E4800u)

/** \\brief  E4810, CDTM0 DTM0 phase shift unit configuration and control
 * register */
#define GTM_CDTM2_DTM0_PS_CTRL         /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_PS_CTRL *)0xF01E4810u)

/** \\brief  E4844, CDTM0 DTM0 channel control register 1 */
#define GTM_CDTM2_DTM1_CH_CTRL1        /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_CTRL1 *)0xF01E4844u)

/** \\brief  E4848, CDTM0 DTM0 channel control register 2 */
#define GTM_CDTM2_DTM1_CH_CTRL2        /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_CTRL2 *)0xF01E4848u)

/** \\brief  E484C, CDTM0 DTM0 channel control register 2 shadow */
#define GTM_CDTM2_DTM1_CH_CTRL2_SR     /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_CTRL2_SR *)0xF01E484Cu)

/** \\brief  E4868, CDTM0 DTM0 channel control register 3 */
#define GTM_CDTM2_DTM1_CH_CTRL3        /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_CTRL3 *)0xF01E4868u)

/** \\brief  E4854, CDTM0 DTM0 channel 0 dead time reload values */
#define GTM_CDTM2_DTM1_CH_DTV0         /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_DTV *)0xF01E4854u)

/** Alias (User Manual Name) for GTM_CDTM2_DTM1_CH_DTV0.
 * To use register names with standard convension, please use GTM_CDTM2_DTM1_CH_DTV0.
 */
#define GTM_CDTM2_DTM1_CH0_DTV         (GTM_CDTM2_DTM1_CH_DTV0)

/** Alias (User Manual Name) for GTM_CDTM2_DTM1_CH_DTV0.
 * To use register names with standard convension, please use GTM_CDTM2_DTM1_CH_DTV0.
 */
#define GTM_CDTM2_DTM1_CH0_DTV         (GTM_CDTM2_DTM1_CH_DTV0)

/** \\brief  E4858, CDTM0 DTM0 channel 0 dead time reload values */
#define GTM_CDTM2_DTM1_CH_DTV1         /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_DTV *)0xF01E4858u)

/** Alias (User Manual Name) for GTM_CDTM2_DTM1_CH_DTV1.
 * To use register names with standard convension, please use GTM_CDTM2_DTM1_CH_DTV1.
 */
#define GTM_CDTM2_DTM1_CH1_DTV         (GTM_CDTM2_DTM1_CH_DTV1)

/** Alias (User Manual Name) for GTM_CDTM2_DTM1_CH_DTV1.
 * To use register names with standard convension, please use GTM_CDTM2_DTM1_CH_DTV1.
 */
#define GTM_CDTM2_DTM1_CH1_DTV         (GTM_CDTM2_DTM1_CH_DTV1)

/** \\brief  E485C, CDTM0 DTM0 channel 0 dead time reload values */
#define GTM_CDTM2_DTM1_CH_DTV2         /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_DTV *)0xF01E485Cu)

/** Alias (User Manual Name) for GTM_CDTM2_DTM1_CH_DTV2.
 * To use register names with standard convension, please use GTM_CDTM2_DTM1_CH_DTV2.
 */
#define GTM_CDTM2_DTM1_CH2_DTV         (GTM_CDTM2_DTM1_CH_DTV2)

/** Alias (User Manual Name) for GTM_CDTM2_DTM1_CH_DTV2.
 * To use register names with standard convension, please use GTM_CDTM2_DTM1_CH_DTV2.
 */
#define GTM_CDTM2_DTM1_CH2_DTV         (GTM_CDTM2_DTM1_CH_DTV2)

/** \\brief  E4860, CDTM0 DTM0 channel 0 dead time reload values */
#define GTM_CDTM2_DTM1_CH_DTV3         /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_DTV *)0xF01E4860u)

/** Alias (User Manual Name) for GTM_CDTM2_DTM1_CH_DTV3.
 * To use register names with standard convension, please use GTM_CDTM2_DTM1_CH_DTV3.
 */
#define GTM_CDTM2_DTM1_CH3_DTV         (GTM_CDTM2_DTM1_CH_DTV3)

/** Alias (User Manual Name) for GTM_CDTM2_DTM1_CH_DTV3.
 * To use register names with standard convension, please use GTM_CDTM2_DTM1_CH_DTV3.
 */
#define GTM_CDTM2_DTM1_CH3_DTV         (GTM_CDTM2_DTM1_CH_DTV3)

/** \\brief  E4864, CDTM DTM0 channel shadow reg0ster */
#define GTM_CDTM2_DTM1_CH_SR           /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_SR *)0xF01E4864u)

/** \\brief  E4840, CDTM0 DTM0 global configuration and control register */
#define GTM_CDTM2_DTM1_CTRL            /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CTRL *)0xF01E4840u)

/** \\brief  E4850, CDTM0 DTM0 phase shift unit configuration and control
 * register */
#define GTM_CDTM2_DTM1_PS_CTRL         /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_PS_CTRL *)0xF01E4850u)

/** \\brief  E4880, CDTM0 DTM2 global configuration and control register */
#define GTM_CDTM2_DTM2_CTRL            /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM2_CTRL *)0xF01E4880u)

/** \\brief  E48C0, CDTM0 DTM3 global configuration and control register */
#define GTM_CDTM2_DTM3_CTRL            /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM3_CTRL *)0xF01E48C0u)

/** \\brief  E4904, CDTM0 DTM0 channel control register 1 */
#define GTM_CDTM2_DTM4_CH_CTRL1        /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_CTRL1 *)0xF01E4904u)

/** \\brief  E4908, CDTM0 DTM0 channel control register 2 */
#define GTM_CDTM2_DTM4_CH_CTRL2        /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_CTRL2 *)0xF01E4908u)

/** \\brief  E490C, CDTM0 DTM0 channel control register 2 shadow */
#define GTM_CDTM2_DTM4_CH_CTRL2_SR     /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_CTRL2_SR *)0xF01E490Cu)

/** \\brief  E4928, CDTM0 DTM0 channel control register 3 */
#define GTM_CDTM2_DTM4_CH_CTRL3        /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_CTRL3 *)0xF01E4928u)

/** \\brief  E4914, CDTM0 DTM0 channel 0 dead time reload values */
#define GTM_CDTM2_DTM4_CH_DTV0         /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_DTV *)0xF01E4914u)

/** Alias (User Manual Name) for GTM_CDTM2_DTM4_CH_DTV0.
 * To use register names with standard convension, please use GTM_CDTM2_DTM4_CH_DTV0.
 */
#define GTM_CDTM2_DTM4_CH0_DTV         (GTM_CDTM2_DTM4_CH_DTV0)

/** Alias (User Manual Name) for GTM_CDTM2_DTM4_CH_DTV0.
 * To use register names with standard convension, please use GTM_CDTM2_DTM4_CH_DTV0.
 */
#define GTM_CDTM2_DTM4_CH0_DTV         (GTM_CDTM2_DTM4_CH_DTV0)

/** \\brief  E4918, CDTM0 DTM0 channel 0 dead time reload values */
#define GTM_CDTM2_DTM4_CH_DTV1         /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_DTV *)0xF01E4918u)

