Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** Alias (User Manual Name) for GTM_CDTM2_DTM4_CH_DTV1.
 * To use register names with standard convension, please use GTM_CDTM2_DTM4_CH_DTV1.
 */
#define GTM_CDTM2_DTM4_CH1_DTV         (GTM_CDTM2_DTM4_CH_DTV1)

/** Alias (User Manual Name) for GTM_CDTM2_DTM4_CH_DTV1.
 * To use register names with standard convension, please use GTM_CDTM2_DTM4_CH_DTV1.
 */
#define GTM_CDTM2_DTM4_CH1_DTV         (GTM_CDTM2_DTM4_CH_DTV1)

/** \\brief  E491C, CDTM0 DTM0 channel 0 dead time reload values */
#define GTM_CDTM2_DTM4_CH_DTV2         /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_DTV *)0xF01E491Cu)

/** Alias (User Manual Name) for GTM_CDTM2_DTM4_CH_DTV2.
 * To use register names with standard convension, please use GTM_CDTM2_DTM4_CH_DTV2.
 */
#define GTM_CDTM2_DTM4_CH2_DTV         (GTM_CDTM2_DTM4_CH_DTV2)

/** Alias (User Manual Name) for GTM_CDTM2_DTM4_CH_DTV2.
 * To use register names with standard convension, please use GTM_CDTM2_DTM4_CH_DTV2.
 */
#define GTM_CDTM2_DTM4_CH2_DTV         (GTM_CDTM2_DTM4_CH_DTV2)

/** \\brief  E4920, CDTM0 DTM0 channel 0 dead time reload values */
#define GTM_CDTM2_DTM4_CH_DTV3         /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_DTV *)0xF01E4920u)

/** Alias (User Manual Name) for GTM_CDTM2_DTM4_CH_DTV3.
 * To use register names with standard convension, please use GTM_CDTM2_DTM4_CH_DTV3.
 */
#define GTM_CDTM2_DTM4_CH3_DTV         (GTM_CDTM2_DTM4_CH_DTV3)

/** Alias (User Manual Name) for GTM_CDTM2_DTM4_CH_DTV3.
 * To use register names with standard convension, please use GTM_CDTM2_DTM4_CH_DTV3.
 */
#define GTM_CDTM2_DTM4_CH3_DTV         (GTM_CDTM2_DTM4_CH_DTV3)

/** \\brief  E4924, CDTM DTM0 channel shadow reg0ster */
#define GTM_CDTM2_DTM4_CH_SR           /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_SR *)0xF01E4924u)

/** \\brief  E4900, CDTM0 DTM0 global configuration and control register */
#define GTM_CDTM2_DTM4_CTRL            /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CTRL *)0xF01E4900u)

/** \\brief  E4910, CDTM0 DTM0 phase shift unit configuration and control
 * register */
#define GTM_CDTM2_DTM4_PS_CTRL         /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_PS_CTRL *)0xF01E4910u)

/** \\brief  E4944, CDTM0 DTM0 channel control register 1 */
#define GTM_CDTM2_DTM5_CH_CTRL1        /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_CTRL1 *)0xF01E4944u)

/** \\brief  E4948, CDTM0 DTM0 channel control register 2 */
#define GTM_CDTM2_DTM5_CH_CTRL2        /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_CTRL2 *)0xF01E4948u)

/** \\brief  E494C, CDTM0 DTM0 channel control register 2 shadow */
#define GTM_CDTM2_DTM5_CH_CTRL2_SR     /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_CTRL2_SR *)0xF01E494Cu)

/** \\brief  E4968, CDTM0 DTM0 channel control register 3 */
#define GTM_CDTM2_DTM5_CH_CTRL3        /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_CTRL3 *)0xF01E4968u)

/** \\brief  E4954, CDTM0 DTM0 channel 0 dead time reload values */
#define GTM_CDTM2_DTM5_CH_DTV0         /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_DTV *)0xF01E4954u)

/** Alias (User Manual Name) for GTM_CDTM2_DTM5_CH_DTV0.
 * To use register names with standard convension, please use GTM_CDTM2_DTM5_CH_DTV0.
 */
#define GTM_CDTM2_DTM5_CH0_DTV         (GTM_CDTM2_DTM5_CH_DTV0)

/** Alias (User Manual Name) for GTM_CDTM2_DTM5_CH_DTV0.
 * To use register names with standard convension, please use GTM_CDTM2_DTM5_CH_DTV0.
 */
#define GTM_CDTM2_DTM5_CH0_DTV         (GTM_CDTM2_DTM5_CH_DTV0)

/** \\brief  E4958, CDTM0 DTM0 channel 0 dead time reload values */
#define GTM_CDTM2_DTM5_CH_DTV1         /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_DTV *)0xF01E4958u)

/** Alias (User Manual Name) for GTM_CDTM2_DTM5_CH_DTV1.
 * To use register names with standard convension, please use GTM_CDTM2_DTM5_CH_DTV1.
 */
#define GTM_CDTM2_DTM5_CH1_DTV         (GTM_CDTM2_DTM5_CH_DTV1)

/** Alias (User Manual Name) for GTM_CDTM2_DTM5_CH_DTV1.
 * To use register names with standard convension, please use GTM_CDTM2_DTM5_CH_DTV1.
 */
#define GTM_CDTM2_DTM5_CH1_DTV         (GTM_CDTM2_DTM5_CH_DTV1)

/** \\brief  E495C, CDTM0 DTM0 channel 0 dead time reload values */
#define GTM_CDTM2_DTM5_CH_DTV2         /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_DTV *)0xF01E495Cu)

/** Alias (User Manual Name) for GTM_CDTM2_DTM5_CH_DTV2.
 * To use register names with standard convension, please use GTM_CDTM2_DTM5_CH_DTV2.
 */
#define GTM_CDTM2_DTM5_CH2_DTV         (GTM_CDTM2_DTM5_CH_DTV2)

/** Alias (User Manual Name) for GTM_CDTM2_DTM5_CH_DTV2.
 * To use register names with standard convension, please use GTM_CDTM2_DTM5_CH_DTV2.
 */
#define GTM_CDTM2_DTM5_CH2_DTV         (GTM_CDTM2_DTM5_CH_DTV2)

/** \\brief  E4960, CDTM0 DTM0 channel 0 dead time reload values */
#define GTM_CDTM2_DTM5_CH_DTV3         /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_DTV *)0xF01E4960u)

/** Alias (User Manual Name) for GTM_CDTM2_DTM5_CH_DTV3.
 * To use register names with standard convension, please use GTM_CDTM2_DTM5_CH_DTV3.
 */
#define GTM_CDTM2_DTM5_CH3_DTV         (GTM_CDTM2_DTM5_CH_DTV3)

/** Alias (User Manual Name) for GTM_CDTM2_DTM5_CH_DTV3.
 * To use register names with standard convension, please use GTM_CDTM2_DTM5_CH_DTV3.
 */
#define GTM_CDTM2_DTM5_CH3_DTV         (GTM_CDTM2_DTM5_CH_DTV3)

/** \\brief  E4964, CDTM DTM0 channel shadow reg0ster */
#define GTM_CDTM2_DTM5_CH_SR           /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_SR *)0xF01E4964u)

/** \\brief  E4940, CDTM0 DTM0 global configuration and control register */
#define GTM_CDTM2_DTM5_CTRL            /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CTRL *)0xF01E4940u)

/** \\brief  E4950, CDTM0 DTM0 phase shift unit configuration and control
 * register */
#define GTM_CDTM2_DTM5_PS_CTRL         /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_PS_CTRL *)0xF01E4950u)

/** \\brief  E4C04, CDTM0 DTM0 channel control register 1 */
#define GTM_CDTM3_DTM0_CH_CTRL1        /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_CTRL1 *)0xF01E4C04u)

/** \\brief  E4C08, CDTM0 DTM0 channel control register 2 */
#define GTM_CDTM3_DTM0_CH_CTRL2        /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_CTRL2 *)0xF01E4C08u)

/** \\brief  E4C0C, CDTM0 DTM0 channel control register 2 shadow */
#define GTM_CDTM3_DTM0_CH_CTRL2_SR     /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_CTRL2_SR *)0xF01E4C0Cu)

/** \\brief  E4C28, CDTM0 DTM0 channel control register 3 */
#define GTM_CDTM3_DTM0_CH_CTRL3        /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_CTRL3 *)0xF01E4C28u)

/** \\brief  E4C14, CDTM0 DTM0 channel 0 dead time reload values */
#define GTM_CDTM3_DTM0_CH_DTV0         /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_DTV *)0xF01E4C14u)

/** Alias (User Manual Name) for GTM_CDTM3_DTM0_CH_DTV0.
 * To use register names with standard convension, please use GTM_CDTM3_DTM0_CH_DTV0.
 */
#define GTM_CDTM3_DTM0_CH0_DTV         (GTM_CDTM3_DTM0_CH_DTV0)

/** Alias (User Manual Name) for GTM_CDTM3_DTM0_CH_DTV0.
 * To use register names with standard convension, please use GTM_CDTM3_DTM0_CH_DTV0.
 */
#define GTM_CDTM3_DTM0_CH0_DTV         (GTM_CDTM3_DTM0_CH_DTV0)

