Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  E4C18, CDTM0 DTM0 channel 0 dead time reload values */
#define GTM_CDTM3_DTM0_CH_DTV1         /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_DTV *)0xF01E4C18u)

/** Alias (User Manual Name) for GTM_CDTM3_DTM0_CH_DTV1.
 * To use register names with standard convension, please use GTM_CDTM3_DTM0_CH_DTV1.
 */
#define GTM_CDTM3_DTM0_CH1_DTV         (GTM_CDTM3_DTM0_CH_DTV1)

/** Alias (User Manual Name) for GTM_CDTM3_DTM0_CH_DTV1.
 * To use register names with standard convension, please use GTM_CDTM3_DTM0_CH_DTV1.
 */
#define GTM_CDTM3_DTM0_CH1_DTV         (GTM_CDTM3_DTM0_CH_DTV1)

/** \\brief  E4C1C, CDTM0 DTM0 channel 0 dead time reload values */
#define GTM_CDTM3_DTM0_CH_DTV2         /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_DTV *)0xF01E4C1Cu)

/** Alias (User Manual Name) for GTM_CDTM3_DTM0_CH_DTV2.
 * To use register names with standard convension, please use GTM_CDTM3_DTM0_CH_DTV2.
 */
#define GTM_CDTM3_DTM0_CH2_DTV         (GTM_CDTM3_DTM0_CH_DTV2)

/** Alias (User Manual Name) for GTM_CDTM3_DTM0_CH_DTV2.
 * To use register names with standard convension, please use GTM_CDTM3_DTM0_CH_DTV2.
 */
#define GTM_CDTM3_DTM0_CH2_DTV         (GTM_CDTM3_DTM0_CH_DTV2)

/** \\brief  E4C20, CDTM0 DTM0 channel 0 dead time reload values */
#define GTM_CDTM3_DTM0_CH_DTV3         /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_DTV *)0xF01E4C20u)

/** Alias (User Manual Name) for GTM_CDTM3_DTM0_CH_DTV3.
 * To use register names with standard convension, please use GTM_CDTM3_DTM0_CH_DTV3.
 */
#define GTM_CDTM3_DTM0_CH3_DTV         (GTM_CDTM3_DTM0_CH_DTV3)

/** Alias (User Manual Name) for GTM_CDTM3_DTM0_CH_DTV3.
 * To use register names with standard convension, please use GTM_CDTM3_DTM0_CH_DTV3.
 */
#define GTM_CDTM3_DTM0_CH3_DTV         (GTM_CDTM3_DTM0_CH_DTV3)

/** \\brief  E4C24, CDTM DTM0 channel shadow reg0ster */
#define GTM_CDTM3_DTM0_CH_SR           /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_SR *)0xF01E4C24u)

/** \\brief  E4C00, CDTM0 DTM0 global configuration and control register */
#define GTM_CDTM3_DTM0_CTRL            /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CTRL *)0xF01E4C00u)

/** \\brief  E4C10, CDTM0 DTM0 phase shift unit configuration and control
 * register */
#define GTM_CDTM3_DTM0_PS_CTRL         /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_PS_CTRL *)0xF01E4C10u)

/** \\brief  E4C44, CDTM0 DTM0 channel control register 1 */
#define GTM_CDTM3_DTM1_CH_CTRL1        /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_CTRL1 *)0xF01E4C44u)

/** \\brief  E4C48, CDTM0 DTM0 channel control register 2 */
#define GTM_CDTM3_DTM1_CH_CTRL2        /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_CTRL2 *)0xF01E4C48u)

/** \\brief  E4C4C, CDTM0 DTM0 channel control register 2 shadow */
#define GTM_CDTM3_DTM1_CH_CTRL2_SR     /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_CTRL2_SR *)0xF01E4C4Cu)

/** \\brief  E4C68, CDTM0 DTM0 channel control register 3 */
#define GTM_CDTM3_DTM1_CH_CTRL3        /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_CTRL3 *)0xF01E4C68u)

/** \\brief  E4C54, CDTM0 DTM0 channel 0 dead time reload values */
#define GTM_CDTM3_DTM1_CH_DTV0         /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_DTV *)0xF01E4C54u)

/** Alias (User Manual Name) for GTM_CDTM3_DTM1_CH_DTV0.
 * To use register names with standard convension, please use GTM_CDTM3_DTM1_CH_DTV0.
 */
#define GTM_CDTM3_DTM1_CH0_DTV         (GTM_CDTM3_DTM1_CH_DTV0)

/** Alias (User Manual Name) for GTM_CDTM3_DTM1_CH_DTV0.
 * To use register names with standard convension, please use GTM_CDTM3_DTM1_CH_DTV0.
 */
#define GTM_CDTM3_DTM1_CH0_DTV         (GTM_CDTM3_DTM1_CH_DTV0)

/** \\brief  E4C58, CDTM0 DTM0 channel 0 dead time reload values */
#define GTM_CDTM3_DTM1_CH_DTV1         /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_DTV *)0xF01E4C58u)

/** Alias (User Manual Name) for GTM_CDTM3_DTM1_CH_DTV1.
 * To use register names with standard convension, please use GTM_CDTM3_DTM1_CH_DTV1.
 */
#define GTM_CDTM3_DTM1_CH1_DTV         (GTM_CDTM3_DTM1_CH_DTV1)

/** Alias (User Manual Name) for GTM_CDTM3_DTM1_CH_DTV1.
 * To use register names with standard convension, please use GTM_CDTM3_DTM1_CH_DTV1.
 */
#define GTM_CDTM3_DTM1_CH1_DTV         (GTM_CDTM3_DTM1_CH_DTV1)

/** \\brief  E4C5C, CDTM0 DTM0 channel 0 dead time reload values */
#define GTM_CDTM3_DTM1_CH_DTV2         /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_DTV *)0xF01E4C5Cu)

/** Alias (User Manual Name) for GTM_CDTM3_DTM1_CH_DTV2.
 * To use register names with standard convension, please use GTM_CDTM3_DTM1_CH_DTV2.
 */
#define GTM_CDTM3_DTM1_CH2_DTV         (GTM_CDTM3_DTM1_CH_DTV2)

/** Alias (User Manual Name) for GTM_CDTM3_DTM1_CH_DTV2.
 * To use register names with standard convension, please use GTM_CDTM3_DTM1_CH_DTV2.
 */
#define GTM_CDTM3_DTM1_CH2_DTV         (GTM_CDTM3_DTM1_CH_DTV2)

/** \\brief  E4C60, CDTM0 DTM0 channel 0 dead time reload values */
#define GTM_CDTM3_DTM1_CH_DTV3         /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_DTV *)0xF01E4C60u)

/** Alias (User Manual Name) for GTM_CDTM3_DTM1_CH_DTV3.
 * To use register names with standard convension, please use GTM_CDTM3_DTM1_CH_DTV3.
 */
#define GTM_CDTM3_DTM1_CH3_DTV         (GTM_CDTM3_DTM1_CH_DTV3)

/** Alias (User Manual Name) for GTM_CDTM3_DTM1_CH_DTV3.
 * To use register names with standard convension, please use GTM_CDTM3_DTM1_CH_DTV3.
 */
#define GTM_CDTM3_DTM1_CH3_DTV         (GTM_CDTM3_DTM1_CH_DTV3)

/** \\brief  E4C64, CDTM DTM0 channel shadow reg0ster */
#define GTM_CDTM3_DTM1_CH_SR           /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_SR *)0xF01E4C64u)

/** \\brief  E4C40, CDTM0 DTM0 global configuration and control register */
#define GTM_CDTM3_DTM1_CTRL            /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CTRL *)0xF01E4C40u)

/** \\brief  E4C50, CDTM0 DTM0 phase shift unit configuration and control
 * register */
#define GTM_CDTM3_DTM1_PS_CTRL         /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_PS_CTRL *)0xF01E4C50u)

/** \\brief  E4C80, CDTM0 DTM2 global configuration and control register */
#define GTM_CDTM3_DTM2_CTRL            /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM2_CTRL *)0xF01E4C80u)

/** \\brief  E4CC0, CDTM0 DTM3 global configuration and control register */
#define GTM_CDTM3_DTM3_CTRL            /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM3_CTRL *)0xF01E4CC0u)

/** \\brief  E4D04, CDTM0 DTM0 channel control register 1 */
#define GTM_CDTM3_DTM4_CH_CTRL1        /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_CTRL1 *)0xF01E4D04u)

/** \\brief  E4D08, CDTM0 DTM0 channel control register 2 */
#define GTM_CDTM3_DTM4_CH_CTRL2        /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_CTRL2 *)0xF01E4D08u)

