Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  E4D0C, CDTM0 DTM0 channel control register 2 shadow */
#define GTM_CDTM3_DTM4_CH_CTRL2_SR     /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_CTRL2_SR *)0xF01E4D0Cu)

/** \\brief  E4D28, CDTM0 DTM0 channel control register 3 */
#define GTM_CDTM3_DTM4_CH_CTRL3        /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_CTRL3 *)0xF01E4D28u)

/** \\brief  E4D14, CDTM0 DTM0 channel 0 dead time reload values */
#define GTM_CDTM3_DTM4_CH_DTV0         /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_DTV *)0xF01E4D14u)

/** Alias (User Manual Name) for GTM_CDTM3_DTM4_CH_DTV0.
 * To use register names with standard convension, please use GTM_CDTM3_DTM4_CH_DTV0.
 */
#define GTM_CDTM3_DTM4_CH0_DTV         (GTM_CDTM3_DTM4_CH_DTV0)

/** Alias (User Manual Name) for GTM_CDTM3_DTM4_CH_DTV0.
 * To use register names with standard convension, please use GTM_CDTM3_DTM4_CH_DTV0.
 */
#define GTM_CDTM3_DTM4_CH0_DTV         (GTM_CDTM3_DTM4_CH_DTV0)

/** \\brief  E4D18, CDTM0 DTM0 channel 0 dead time reload values */
#define GTM_CDTM3_DTM4_CH_DTV1         /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_DTV *)0xF01E4D18u)

/** Alias (User Manual Name) for GTM_CDTM3_DTM4_CH_DTV1.
 * To use register names with standard convension, please use GTM_CDTM3_DTM4_CH_DTV1.
 */
#define GTM_CDTM3_DTM4_CH1_DTV         (GTM_CDTM3_DTM4_CH_DTV1)

/** Alias (User Manual Name) for GTM_CDTM3_DTM4_CH_DTV1.
 * To use register names with standard convension, please use GTM_CDTM3_DTM4_CH_DTV1.
 */
#define GTM_CDTM3_DTM4_CH1_DTV         (GTM_CDTM3_DTM4_CH_DTV1)

/** \\brief  E4D1C, CDTM0 DTM0 channel 0 dead time reload values */
#define GTM_CDTM3_DTM4_CH_DTV2         /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_DTV *)0xF01E4D1Cu)

/** Alias (User Manual Name) for GTM_CDTM3_DTM4_CH_DTV2.
 * To use register names with standard convension, please use GTM_CDTM3_DTM4_CH_DTV2.
 */
#define GTM_CDTM3_DTM4_CH2_DTV         (GTM_CDTM3_DTM4_CH_DTV2)

/** Alias (User Manual Name) for GTM_CDTM3_DTM4_CH_DTV2.
 * To use register names with standard convension, please use GTM_CDTM3_DTM4_CH_DTV2.
 */
#define GTM_CDTM3_DTM4_CH2_DTV         (GTM_CDTM3_DTM4_CH_DTV2)

/** \\brief  E4D20, CDTM0 DTM0 channel 0 dead time reload values */
#define GTM_CDTM3_DTM4_CH_DTV3         /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_DTV *)0xF01E4D20u)

/** Alias (User Manual Name) for GTM_CDTM3_DTM4_CH_DTV3.
 * To use register names with standard convension, please use GTM_CDTM3_DTM4_CH_DTV3.
 */
#define GTM_CDTM3_DTM4_CH3_DTV         (GTM_CDTM3_DTM4_CH_DTV3)

/** Alias (User Manual Name) for GTM_CDTM3_DTM4_CH_DTV3.
 * To use register names with standard convension, please use GTM_CDTM3_DTM4_CH_DTV3.
 */
#define GTM_CDTM3_DTM4_CH3_DTV         (GTM_CDTM3_DTM4_CH_DTV3)

/** \\brief  E4D24, CDTM DTM0 channel shadow reg0ster */
#define GTM_CDTM3_DTM4_CH_SR           /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_SR *)0xF01E4D24u)

/** \\brief  E4D00, CDTM0 DTM0 global configuration and control register */
#define GTM_CDTM3_DTM4_CTRL            /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CTRL *)0xF01E4D00u)

/** \\brief  E4D10, CDTM0 DTM0 phase shift unit configuration and control
 * register */
#define GTM_CDTM3_DTM4_PS_CTRL         /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_PS_CTRL *)0xF01E4D10u)

/** \\brief  E4D44, CDTM0 DTM0 channel control register 1 */
#define GTM_CDTM3_DTM5_CH_CTRL1        /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_CTRL1 *)0xF01E4D44u)

/** \\brief  E4D48, CDTM0 DTM0 channel control register 2 */
#define GTM_CDTM3_DTM5_CH_CTRL2        /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_CTRL2 *)0xF01E4D48u)

/** \\brief  E4D4C, CDTM0 DTM0 channel control register 2 shadow */
#define GTM_CDTM3_DTM5_CH_CTRL2_SR     /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_CTRL2_SR *)0xF01E4D4Cu)

/** \\brief  E4D68, CDTM0 DTM0 channel control register 3 */
#define GTM_CDTM3_DTM5_CH_CTRL3        /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_CTRL3 *)0xF01E4D68u)

/** \\brief  E4D54, CDTM0 DTM0 channel 0 dead time reload values */
#define GTM_CDTM3_DTM5_CH_DTV0         /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_DTV *)0xF01E4D54u)

/** Alias (User Manual Name) for GTM_CDTM3_DTM5_CH_DTV0.
 * To use register names with standard convension, please use GTM_CDTM3_DTM5_CH_DTV0.
 */
#define GTM_CDTM3_DTM5_CH0_DTV         (GTM_CDTM3_DTM5_CH_DTV0)

/** Alias (User Manual Name) for GTM_CDTM3_DTM5_CH_DTV0.
 * To use register names with standard convension, please use GTM_CDTM3_DTM5_CH_DTV0.
 */
#define GTM_CDTM3_DTM5_CH0_DTV         (GTM_CDTM3_DTM5_CH_DTV0)

/** \\brief  E4D58, CDTM0 DTM0 channel 0 dead time reload values */
#define GTM_CDTM3_DTM5_CH_DTV1         /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_DTV *)0xF01E4D58u)

/** Alias (User Manual Name) for GTM_CDTM3_DTM5_CH_DTV1.
 * To use register names with standard convension, please use GTM_CDTM3_DTM5_CH_DTV1.
 */
#define GTM_CDTM3_DTM5_CH1_DTV         (GTM_CDTM3_DTM5_CH_DTV1)

/** Alias (User Manual Name) for GTM_CDTM3_DTM5_CH_DTV1.
 * To use register names with standard convension, please use GTM_CDTM3_DTM5_CH_DTV1.
 */
#define GTM_CDTM3_DTM5_CH1_DTV         (GTM_CDTM3_DTM5_CH_DTV1)

/** \\brief  E4D5C, CDTM0 DTM0 channel 0 dead time reload values */
#define GTM_CDTM3_DTM5_CH_DTV2         /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_DTV *)0xF01E4D5Cu)

/** Alias (User Manual Name) for GTM_CDTM3_DTM5_CH_DTV2.
 * To use register names with standard convension, please use GTM_CDTM3_DTM5_CH_DTV2.
 */
#define GTM_CDTM3_DTM5_CH2_DTV         (GTM_CDTM3_DTM5_CH_DTV2)

/** Alias (User Manual Name) for GTM_CDTM3_DTM5_CH_DTV2.
 * To use register names with standard convension, please use GTM_CDTM3_DTM5_CH_DTV2.
 */
#define GTM_CDTM3_DTM5_CH2_DTV         (GTM_CDTM3_DTM5_CH_DTV2)

/** \\brief  E4D60, CDTM0 DTM0 channel 0 dead time reload values */
#define GTM_CDTM3_DTM5_CH_DTV3         /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_DTV *)0xF01E4D60u)

/** Alias (User Manual Name) for GTM_CDTM3_DTM5_CH_DTV3.
 * To use register names with standard convension, please use GTM_CDTM3_DTM5_CH_DTV3.
 */
#define GTM_CDTM3_DTM5_CH3_DTV         (GTM_CDTM3_DTM5_CH_DTV3)

