Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** Alias (User Manual Name) for GTM_CDTM3_DTM5_CH_DTV3.
 * To use register names with standard convension, please use GTM_CDTM3_DTM5_CH_DTV3.
 */
#define GTM_CDTM3_DTM5_CH3_DTV         (GTM_CDTM3_DTM5_CH_DTV3)

/** \\brief  E4D64, CDTM DTM0 channel shadow reg0ster */
#define GTM_CDTM3_DTM5_CH_SR           /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_SR *)0xF01E4D64u)

/** \\brief  E4D40, CDTM0 DTM0 global configuration and control register */
#define GTM_CDTM3_DTM5_CTRL            /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CTRL *)0xF01E4D40u)

/** \\brief  E4D50, CDTM0 DTM0 phase shift unit configuration and control
 * register */
#define GTM_CDTM3_DTM5_PS_CTRL         /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_PS_CTRL *)0xF01E4D50u)

/** \\brief  E5004, CDTM0 DTM0 channel control register 1 */
#define GTM_CDTM4_DTM0_CH_CTRL1        /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_CTRL1 *)0xF01E5004u)

/** \\brief  E5008, CDTM0 DTM0 channel control register 2 */
#define GTM_CDTM4_DTM0_CH_CTRL2        /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_CTRL2 *)0xF01E5008u)

/** \\brief  E500C, CDTM0 DTM0 channel control register 2 shadow */
#define GTM_CDTM4_DTM0_CH_CTRL2_SR     /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_CTRL2_SR *)0xF01E500Cu)

/** \\brief  E5028, CDTM0 DTM0 channel control register 3 */
#define GTM_CDTM4_DTM0_CH_CTRL3        /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_CTRL3 *)0xF01E5028u)

/** \\brief  E5014, CDTM0 DTM0 channel 0 dead time reload values */
#define GTM_CDTM4_DTM0_CH_DTV0         /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_DTV *)0xF01E5014u)

/** Alias (User Manual Name) for GTM_CDTM4_DTM0_CH_DTV0.
 * To use register names with standard convension, please use GTM_CDTM4_DTM0_CH_DTV0.
 */
#define GTM_CDTM4_DTM0_CH0_DTV         (GTM_CDTM4_DTM0_CH_DTV0)

/** Alias (User Manual Name) for GTM_CDTM4_DTM0_CH_DTV0.
 * To use register names with standard convension, please use GTM_CDTM4_DTM0_CH_DTV0.
 */
#define GTM_CDTM4_DTM0_CH0_DTV         (GTM_CDTM4_DTM0_CH_DTV0)

/** \\brief  E5018, CDTM0 DTM0 channel 0 dead time reload values */
#define GTM_CDTM4_DTM0_CH_DTV1         /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_DTV *)0xF01E5018u)

/** Alias (User Manual Name) for GTM_CDTM4_DTM0_CH_DTV1.
 * To use register names with standard convension, please use GTM_CDTM4_DTM0_CH_DTV1.
 */
#define GTM_CDTM4_DTM0_CH1_DTV         (GTM_CDTM4_DTM0_CH_DTV1)

/** Alias (User Manual Name) for GTM_CDTM4_DTM0_CH_DTV1.
 * To use register names with standard convension, please use GTM_CDTM4_DTM0_CH_DTV1.
 */
#define GTM_CDTM4_DTM0_CH1_DTV         (GTM_CDTM4_DTM0_CH_DTV1)

/** \\brief  E501C, CDTM0 DTM0 channel 0 dead time reload values */
#define GTM_CDTM4_DTM0_CH_DTV2         /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_DTV *)0xF01E501Cu)

/** Alias (User Manual Name) for GTM_CDTM4_DTM0_CH_DTV2.
 * To use register names with standard convension, please use GTM_CDTM4_DTM0_CH_DTV2.
 */
#define GTM_CDTM4_DTM0_CH2_DTV         (GTM_CDTM4_DTM0_CH_DTV2)

/** Alias (User Manual Name) for GTM_CDTM4_DTM0_CH_DTV2.
 * To use register names with standard convension, please use GTM_CDTM4_DTM0_CH_DTV2.
 */
#define GTM_CDTM4_DTM0_CH2_DTV         (GTM_CDTM4_DTM0_CH_DTV2)

/** \\brief  E5020, CDTM0 DTM0 channel 0 dead time reload values */
#define GTM_CDTM4_DTM0_CH_DTV3         /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_DTV *)0xF01E5020u)

/** Alias (User Manual Name) for GTM_CDTM4_DTM0_CH_DTV3.
 * To use register names with standard convension, please use GTM_CDTM4_DTM0_CH_DTV3.
 */
#define GTM_CDTM4_DTM0_CH3_DTV         (GTM_CDTM4_DTM0_CH_DTV3)

/** Alias (User Manual Name) for GTM_CDTM4_DTM0_CH_DTV3.
 * To use register names with standard convension, please use GTM_CDTM4_DTM0_CH_DTV3.
 */
#define GTM_CDTM4_DTM0_CH3_DTV         (GTM_CDTM4_DTM0_CH_DTV3)

/** \\brief  E5024, CDTM DTM0 channel shadow reg0ster */
#define GTM_CDTM4_DTM0_CH_SR           /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_SR *)0xF01E5024u)

/** \\brief  E5000, CDTM0 DTM0 global configuration and control register */
#define GTM_CDTM4_DTM0_CTRL            /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CTRL *)0xF01E5000u)

/** \\brief  E5010, CDTM0 DTM0 phase shift unit configuration and control
 * register */
#define GTM_CDTM4_DTM0_PS_CTRL         /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_PS_CTRL *)0xF01E5010u)

/** \\brief  E5044, CDTM0 DTM0 channel control register 1 */
#define GTM_CDTM4_DTM1_CH_CTRL1        /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_CTRL1 *)0xF01E5044u)

/** \\brief  E5048, CDTM0 DTM0 channel control register 2 */
#define GTM_CDTM4_DTM1_CH_CTRL2        /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_CTRL2 *)0xF01E5048u)

/** \\brief  E504C, CDTM0 DTM0 channel control register 2 shadow */
#define GTM_CDTM4_DTM1_CH_CTRL2_SR     /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_CTRL2_SR *)0xF01E504Cu)

/** \\brief  E5068, CDTM0 DTM0 channel control register 3 */
#define GTM_CDTM4_DTM1_CH_CTRL3        /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_CTRL3 *)0xF01E5068u)

/** \\brief  E5054, CDTM0 DTM0 channel 0 dead time reload values */
#define GTM_CDTM4_DTM1_CH_DTV0         /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_DTV *)0xF01E5054u)

/** Alias (User Manual Name) for GTM_CDTM4_DTM1_CH_DTV0.
 * To use register names with standard convension, please use GTM_CDTM4_DTM1_CH_DTV0.
 */
#define GTM_CDTM4_DTM1_CH0_DTV         (GTM_CDTM4_DTM1_CH_DTV0)

/** Alias (User Manual Name) for GTM_CDTM4_DTM1_CH_DTV0.
 * To use register names with standard convension, please use GTM_CDTM4_DTM1_CH_DTV0.
 */
#define GTM_CDTM4_DTM1_CH0_DTV         (GTM_CDTM4_DTM1_CH_DTV0)

/** \\brief  E5058, CDTM0 DTM0 channel 0 dead time reload values */
#define GTM_CDTM4_DTM1_CH_DTV1         /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_DTV *)0xF01E5058u)

/** Alias (User Manual Name) for GTM_CDTM4_DTM1_CH_DTV1.
 * To use register names with standard convension, please use GTM_CDTM4_DTM1_CH_DTV1.
 */
#define GTM_CDTM4_DTM1_CH1_DTV         (GTM_CDTM4_DTM1_CH_DTV1)

/** Alias (User Manual Name) for GTM_CDTM4_DTM1_CH_DTV1.
 * To use register names with standard convension, please use GTM_CDTM4_DTM1_CH_DTV1.
 */
#define GTM_CDTM4_DTM1_CH1_DTV         (GTM_CDTM4_DTM1_CH_DTV1)

