Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  E505C, CDTM0 DTM0 channel 0 dead time reload values */
#define GTM_CDTM4_DTM1_CH_DTV2         /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_DTV *)0xF01E505Cu)

/** Alias (User Manual Name) for GTM_CDTM4_DTM1_CH_DTV2.
 * To use register names with standard convension, please use GTM_CDTM4_DTM1_CH_DTV2.
 */
#define GTM_CDTM4_DTM1_CH2_DTV         (GTM_CDTM4_DTM1_CH_DTV2)

/** Alias (User Manual Name) for GTM_CDTM4_DTM1_CH_DTV2.
 * To use register names with standard convension, please use GTM_CDTM4_DTM1_CH_DTV2.
 */
#define GTM_CDTM4_DTM1_CH2_DTV         (GTM_CDTM4_DTM1_CH_DTV2)

/** \\brief  E5060, CDTM0 DTM0 channel 0 dead time reload values */
#define GTM_CDTM4_DTM1_CH_DTV3         /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_DTV *)0xF01E5060u)

/** Alias (User Manual Name) for GTM_CDTM4_DTM1_CH_DTV3.
 * To use register names with standard convension, please use GTM_CDTM4_DTM1_CH_DTV3.
 */
#define GTM_CDTM4_DTM1_CH3_DTV         (GTM_CDTM4_DTM1_CH_DTV3)

/** Alias (User Manual Name) for GTM_CDTM4_DTM1_CH_DTV3.
 * To use register names with standard convension, please use GTM_CDTM4_DTM1_CH_DTV3.
 */
#define GTM_CDTM4_DTM1_CH3_DTV         (GTM_CDTM4_DTM1_CH_DTV3)

/** \\brief  E5064, CDTM DTM0 channel shadow reg0ster */
#define GTM_CDTM4_DTM1_CH_SR           /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_SR *)0xF01E5064u)

/** \\brief  E5040, CDTM0 DTM0 global configuration and control register */
#define GTM_CDTM4_DTM1_CTRL            /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CTRL *)0xF01E5040u)

/** \\brief  E5050, CDTM0 DTM0 phase shift unit configuration and control
 * register */
#define GTM_CDTM4_DTM1_PS_CTRL         /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_PS_CTRL *)0xF01E5050u)

/** \\brief  E5080, CDTM0 DTM2 global configuration and control register */
#define GTM_CDTM4_DTM2_CTRL            /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM2_CTRL *)0xF01E5080u)

/** \\brief  E50C0, CDTM0 DTM3 global configuration and control register */
#define GTM_CDTM4_DTM3_CTRL            /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM3_CTRL *)0xF01E50C0u)

/** \\brief  E5104, CDTM0 DTM0 channel control register 1 */
#define GTM_CDTM4_DTM4_CH_CTRL1        /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_CTRL1 *)0xF01E5104u)

/** \\brief  E5108, CDTM0 DTM0 channel control register 2 */
#define GTM_CDTM4_DTM4_CH_CTRL2        /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_CTRL2 *)0xF01E5108u)

/** \\brief  E510C, CDTM0 DTM0 channel control register 2 shadow */
#define GTM_CDTM4_DTM4_CH_CTRL2_SR     /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_CTRL2_SR *)0xF01E510Cu)

/** \\brief  E5128, CDTM0 DTM0 channel control register 3 */
#define GTM_CDTM4_DTM4_CH_CTRL3        /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_CTRL3 *)0xF01E5128u)

/** \\brief  E5114, CDTM0 DTM0 channel 0 dead time reload values */
#define GTM_CDTM4_DTM4_CH_DTV0         /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_DTV *)0xF01E5114u)

/** Alias (User Manual Name) for GTM_CDTM4_DTM4_CH_DTV0.
 * To use register names with standard convension, please use GTM_CDTM4_DTM4_CH_DTV0.
 */
#define GTM_CDTM4_DTM4_CH0_DTV         (GTM_CDTM4_DTM4_CH_DTV0)

/** Alias (User Manual Name) for GTM_CDTM4_DTM4_CH_DTV0.
 * To use register names with standard convension, please use GTM_CDTM4_DTM4_CH_DTV0.
 */
#define GTM_CDTM4_DTM4_CH0_DTV         (GTM_CDTM4_DTM4_CH_DTV0)

/** \\brief  E5118, CDTM0 DTM0 channel 0 dead time reload values */
#define GTM_CDTM4_DTM4_CH_DTV1         /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_DTV *)0xF01E5118u)

/** Alias (User Manual Name) for GTM_CDTM4_DTM4_CH_DTV1.
 * To use register names with standard convension, please use GTM_CDTM4_DTM4_CH_DTV1.
 */
#define GTM_CDTM4_DTM4_CH1_DTV         (GTM_CDTM4_DTM4_CH_DTV1)

/** Alias (User Manual Name) for GTM_CDTM4_DTM4_CH_DTV1.
 * To use register names with standard convension, please use GTM_CDTM4_DTM4_CH_DTV1.
 */
#define GTM_CDTM4_DTM4_CH1_DTV         (GTM_CDTM4_DTM4_CH_DTV1)

/** \\brief  E511C, CDTM0 DTM0 channel 0 dead time reload values */
#define GTM_CDTM4_DTM4_CH_DTV2         /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_DTV *)0xF01E511Cu)

/** Alias (User Manual Name) for GTM_CDTM4_DTM4_CH_DTV2.
 * To use register names with standard convension, please use GTM_CDTM4_DTM4_CH_DTV2.
 */
#define GTM_CDTM4_DTM4_CH2_DTV         (GTM_CDTM4_DTM4_CH_DTV2)

/** Alias (User Manual Name) for GTM_CDTM4_DTM4_CH_DTV2.
 * To use register names with standard convension, please use GTM_CDTM4_DTM4_CH_DTV2.
 */
#define GTM_CDTM4_DTM4_CH2_DTV         (GTM_CDTM4_DTM4_CH_DTV2)

/** \\brief  E5120, CDTM0 DTM0 channel 0 dead time reload values */
#define GTM_CDTM4_DTM4_CH_DTV3         /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_DTV *)0xF01E5120u)

/** Alias (User Manual Name) for GTM_CDTM4_DTM4_CH_DTV3.
 * To use register names with standard convension, please use GTM_CDTM4_DTM4_CH_DTV3.
 */
#define GTM_CDTM4_DTM4_CH3_DTV         (GTM_CDTM4_DTM4_CH_DTV3)

/** Alias (User Manual Name) for GTM_CDTM4_DTM4_CH_DTV3.
 * To use register names with standard convension, please use GTM_CDTM4_DTM4_CH_DTV3.
 */
#define GTM_CDTM4_DTM4_CH3_DTV         (GTM_CDTM4_DTM4_CH_DTV3)

/** \\brief  E5124, CDTM DTM0 channel shadow reg0ster */
#define GTM_CDTM4_DTM4_CH_SR           /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_SR *)0xF01E5124u)

/** \\brief  E5100, CDTM0 DTM0 global configuration and control register */
#define GTM_CDTM4_DTM4_CTRL            /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CTRL *)0xF01E5100u)

/** \\brief  E5110, CDTM0 DTM0 phase shift unit configuration and control
 * register */
#define GTM_CDTM4_DTM4_PS_CTRL         /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_PS_CTRL *)0xF01E5110u)

/** \\brief  E5144, CDTM0 DTM0 channel control register 1 */
#define GTM_CDTM4_DTM5_CH_CTRL1        /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_CTRL1 *)0xF01E5144u)

/** \\brief  E5148, CDTM0 DTM0 channel control register 2 */
#define GTM_CDTM4_DTM5_CH_CTRL2        /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_CTRL2 *)0xF01E5148u)

