Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  E514C, CDTM0 DTM0 channel control register 2 shadow */
#define GTM_CDTM4_DTM5_CH_CTRL2_SR     /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_CTRL2_SR *)0xF01E514Cu)

/** \\brief  E5168, CDTM0 DTM0 channel control register 3 */
#define GTM_CDTM4_DTM5_CH_CTRL3        /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_CTRL3 *)0xF01E5168u)

/** \\brief  E5154, CDTM0 DTM0 channel 0 dead time reload values */
#define GTM_CDTM4_DTM5_CH_DTV0         /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_DTV *)0xF01E5154u)

/** Alias (User Manual Name) for GTM_CDTM4_DTM5_CH_DTV0.
 * To use register names with standard convension, please use GTM_CDTM4_DTM5_CH_DTV0.
 */
#define GTM_CDTM4_DTM5_CH0_DTV         (GTM_CDTM4_DTM5_CH_DTV0)

/** Alias (User Manual Name) for GTM_CDTM4_DTM5_CH_DTV0.
 * To use register names with standard convension, please use GTM_CDTM4_DTM5_CH_DTV0.
 */
#define GTM_CDTM4_DTM5_CH0_DTV         (GTM_CDTM4_DTM5_CH_DTV0)

/** \\brief  E5158, CDTM0 DTM0 channel 0 dead time reload values */
#define GTM_CDTM4_DTM5_CH_DTV1         /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_DTV *)0xF01E5158u)

/** Alias (User Manual Name) for GTM_CDTM4_DTM5_CH_DTV1.
 * To use register names with standard convension, please use GTM_CDTM4_DTM5_CH_DTV1.
 */
#define GTM_CDTM4_DTM5_CH1_DTV         (GTM_CDTM4_DTM5_CH_DTV1)

/** Alias (User Manual Name) for GTM_CDTM4_DTM5_CH_DTV1.
 * To use register names with standard convension, please use GTM_CDTM4_DTM5_CH_DTV1.
 */
#define GTM_CDTM4_DTM5_CH1_DTV         (GTM_CDTM4_DTM5_CH_DTV1)

/** \\brief  E515C, CDTM0 DTM0 channel 0 dead time reload values */
#define GTM_CDTM4_DTM5_CH_DTV2         /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_DTV *)0xF01E515Cu)

/** Alias (User Manual Name) for GTM_CDTM4_DTM5_CH_DTV2.
 * To use register names with standard convension, please use GTM_CDTM4_DTM5_CH_DTV2.
 */
#define GTM_CDTM4_DTM5_CH2_DTV         (GTM_CDTM4_DTM5_CH_DTV2)

/** Alias (User Manual Name) for GTM_CDTM4_DTM5_CH_DTV2.
 * To use register names with standard convension, please use GTM_CDTM4_DTM5_CH_DTV2.
 */
#define GTM_CDTM4_DTM5_CH2_DTV         (GTM_CDTM4_DTM5_CH_DTV2)

/** \\brief  E5160, CDTM0 DTM0 channel 0 dead time reload values */
#define GTM_CDTM4_DTM5_CH_DTV3         /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_DTV *)0xF01E5160u)

/** Alias (User Manual Name) for GTM_CDTM4_DTM5_CH_DTV3.
 * To use register names with standard convension, please use GTM_CDTM4_DTM5_CH_DTV3.
 */
#define GTM_CDTM4_DTM5_CH3_DTV         (GTM_CDTM4_DTM5_CH_DTV3)

/** Alias (User Manual Name) for GTM_CDTM4_DTM5_CH_DTV3.
 * To use register names with standard convension, please use GTM_CDTM4_DTM5_CH_DTV3.
 */
#define GTM_CDTM4_DTM5_CH3_DTV         (GTM_CDTM4_DTM5_CH_DTV3)

/** \\brief  E5164, CDTM DTM0 channel shadow reg0ster */
#define GTM_CDTM4_DTM5_CH_SR           /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CH_SR *)0xF01E5164u)

/** \\brief  E5140, CDTM0 DTM0 global configuration and control register */
#define GTM_CDTM4_DTM5_CTRL            /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_CTRL *)0xF01E5140u)

/** \\brief  E5150, CDTM0 DTM0 phase shift unit configuration and control
 * register */
#define GTM_CDTM4_DTM5_PS_CTRL         /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM_DTM_PS_CTRL *)0xF01E5150u)

/** \\brief  E5514, CDTM5 DTM4 channel 0 dead time reload values */
#define GTM_CDTM5_DTM4_CH0_DTV         /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM5_DTM4_CH0_DTV *)0xF01E5514u)

/** \\brief  E5518, CDTM5 DTM4 channel 1 dead t5me reload values */
#define GTM_CDTM5_DTM4_CH1_DTV         /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM5_DTM4_CH1_DTV *)0xF01E5518u)

/** \\brief  E551C, CDTM5 DTM4 channel 2 dead t5me reload values */
#define GTM_CDTM5_DTM4_CH2_DTV         /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM5_DTM4_CH2_DTV *)0xF01E551Cu)

/** \\brief  E5520, CDTM5 DTM4 channel 3 dead t5me reload values */
#define GTM_CDTM5_DTM4_CH3_DTV         /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM5_DTM4_CH3_DTV *)0xF01E5520u)

/** \\brief  E550C, CDTM5 DTM4 channel control register 2 shadow */
#define GTM_CDTM5_DTM4_CH_CTRL2_SR     /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM5_DTM4_CH_CTRL2_SR *)0xF01E550Cu)

/** \\brief  E5528, CDTM5 DTM4 channel control register 3 */
#define GTM_CDTM5_DTM4_CH_CTRL3        /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM5_DTM4_CH_CTRL3 *)0xF01E5528u)

/** \\brief  E5524, CDTM5 DTM4 channel shadow register */
#define GTM_CDTM5_DTM4_CH_SR           /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM5_DTM4_CH_SR *)0xF01E5524u)

/** \\brief  E5500, CDTM5 DTM4 global configuration and control register */
#define GTM_CDTM5_DTM4_CTRL            /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM5_DTM4_CTRL *)0xF01E5500u)

/** \\brief  E5510, CDTM5 DTM4 phase shift unit configuration and control
 * register */
#define GTM_CDTM5_DTM4_PS_CTRL         /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM5_DTM4_PS_CTRL *)0xF01E5510u)

/** \\brief  E5554, CDTM5 DTM5 channel 0 dead time reload values */
#define GTM_CDTM5_DTM5_CH0_DTV         /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM5_DTM5_CH0_DTV *)0xF01E5554u)

/** \\brief  E5558, CDTM5 DTM5 channel 1 dead t5me reload values */
#define GTM_CDTM5_DTM5_CH1_DTV         /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM5_DTM5_CH1_DTV *)0xF01E5558u)

/** \\brief  E555C, CDTM5 DTM5 channel 2 dead t5me reload values */
#define GTM_CDTM5_DTM5_CH2_DTV         /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM5_DTM5_CH2_DTV *)0xF01E555Cu)

/** \\brief  E5560, CDTM5 DTM5 channel 3 dead t5me reload values */
#define GTM_CDTM5_DTM5_CH3_DTV         /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM5_DTM5_CH3_DTV *)0xF01E5560u)

/** \\brief  E5544, CDTM5 DTM5 channel control register 1 */
#define GTM_CDTM5_DTM5_CH_CTRL1        /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM5_DTM5_CH_CTRL1 *)0xF01E5544u)

/** \\brief  E5548, CDTM5 DTM5 channel control register 2 */
#define GTM_CDTM5_DTM5_CH_CTRL2        /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM5_DTM5_CH_CTRL2 *)0xF01E5548u)

/** \\brief  E554C, CDTM5 DTM5 channel control register 2 shadow */
#define GTM_CDTM5_DTM5_CH_CTRL2_SR     /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM5_DTM5_CH_CTRL2_SR *)0xF01E554Cu)

/** \\brief  E5568, CDTM5 DTM5 channel control register 3 */
#define GTM_CDTM5_DTM5_CH_CTRL3        /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM5_DTM5_CH_CTRL3 *)0xF01E5568u)

/** \\brief  E5564, CDTM5 DTM5 channel shadow register */
#define GTM_CDTM5_DTM5_CH_SR           /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM5_DTM5_CH_SR *)0xF01E5564u)

/** \\brief  E5540, CDTM5 DTM5 global configuration and control register */
#define GTM_CDTM5_DTM5_CTRL            /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM5_DTM5_CTRL *)0xF01E5540u)

/** \\brief  E5550, CDTM5 DTM5 phase shift unit configuration and control
 * register */
#define GTM_CDTM5_DTM5_PS_CTRL         /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM5_DTM5_PS_CTRL *)0xF01E5550u)

/** \\brief  E5914, CDTM6 DTM4 channel 0 dead time reload values */
#define GTM_CDTM6_DTM4_CH0_DTV         /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM6_DTM4_CH0_DTV *)0xF01E5914u)

/** \\brief  E5918, CDTM6 DTM4 channel 1 dead time reload values */
#define GTM_CDTM6_DTM4_CH1_DTV         /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM6_DTM4_CH1_DTV *)0xF01E5918u)

/** \\brief  E591C, CDTM6 DTM4 channel 2 dead time reload values */
#define GTM_CDTM6_DTM4_CH2_DTV         /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM6_DTM4_CH2_DTV *)0xF01E591Cu)

/** \\brief  E5920, CDTM6 DTM4 channel 3 dead time reload values */
#define GTM_CDTM6_DTM4_CH3_DTV         /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM6_DTM4_CH3_DTV *)0xF01E5920u)

