Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  E590C, CDTM6 DTM4 channel control register 2 shadow */
#define GTM_CDTM6_DTM4_CH_CTRL2_SR     /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM6_DTM4_CH_CTRL2_SR *)0xF01E590Cu)

/** \\brief  E5928, CDTM6 DTM4 channel control register 3 */
#define GTM_CDTM6_DTM4_CH_CTRL3        /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM6_DTM4_CH_CTRL3 *)0xF01E5928u)

/** \\brief  E5924, CDTM6 DTM4 channel shadow register */
#define GTM_CDTM6_DTM4_CH_SR           /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM6_DTM4_CH_SR *)0xF01E5924u)

/** \\brief  E5900, CDTM6 DTM4 global configuration and control register */
#define GTM_CDTM6_DTM4_CTRL            /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM6_DTM4_CTRL *)0xF01E5900u)

/** \\brief  E5910, CDTM6 DTM4 phase shift unit configuration and control
 * register */
#define GTM_CDTM6_DTM4_PS_CTRL         /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM6_DTM4_PS_CTRL *)0xF01E5910u)

/** \\brief  E5954, CDTM6 DTM5 channel 0 dead time reload values */
#define GTM_CDTM6_DTM5_CH0_DTV         /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM6_DTM5_CH0_DTV *)0xF01E5954u)

/** \\brief  E5958, CDTM6 DTM5 channel 1 dead time reload values */
#define GTM_CDTM6_DTM5_CH1_DTV         /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM6_DTM5_CH1_DTV *)0xF01E5958u)

/** \\brief  E595C, CDTM6 DTM5 channel 2 dead time reload values */
#define GTM_CDTM6_DTM5_CH2_DTV         /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM6_DTM5_CH2_DTV *)0xF01E595Cu)

/** \\brief  E5960, CDTM6 DTM5 channel 3 dead time reload values */
#define GTM_CDTM6_DTM5_CH3_DTV         /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM6_DTM5_CH3_DTV *)0xF01E5960u)

/** \\brief  E5944, CDTM6 DTM5 channel control register 1 */
#define GTM_CDTM6_DTM5_CH_CTRL1        /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM6_DTM5_CH_CTRL1 *)0xF01E5944u)

/** \\brief  E5948, CDTM6 DTM5 channel control register 2 */
#define GTM_CDTM6_DTM5_CH_CTRL2        /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM6_DTM5_CH_CTRL2 *)0xF01E5948u)

/** \\brief  E594C, CDTM6 DTM5 channel control register 2 shadow */
#define GTM_CDTM6_DTM5_CH_CTRL2_SR     /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM6_DTM5_CH_CTRL2_SR *)0xF01E594Cu)

/** \\brief  E5968, CDTM6 DTM5 channel control register 3 */
#define GTM_CDTM6_DTM5_CH_CTRL3        /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM6_DTM5_CH_CTRL3 *)0xF01E5968u)

/** \\brief  E5964, CDTM6 DTM5 channel shadow register */
#define GTM_CDTM6_DTM5_CH_SR           /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM6_DTM5_CH_SR *)0xF01E5964u)

/** \\brief  E5940, CDTM6 DTM5 global configuration and control register */
#define GTM_CDTM6_DTM5_CTRL            /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM6_DTM5_CTRL *)0xF01E5940u)

/** \\brief  E5950, CDTM6 DTM5 phase shift unit configuration and control
 * register */
#define GTM_CDTM6_DTM5_PS_CTRL         /*lint --e(923)*/ (*(volatile Ifx_GTM_CDTM6_DTM5_PS_CTRL *)0xF01E5950u)

/** \\brief  28, GTM Configuration register */
#define GTM_CFG                        /*lint --e(923)*/ (*(volatile Ifx_GTM_CFG *)0xF0100028u)

/** \\brief  9FD00, Clock Control Register */
#define GTM_CLC                        /*lint --e(923)*/ (*(volatile Ifx_GTM_CLC *)0xF019FD00u)

/** \\brief  B0, GTM Cluster Clock Configuration */
#define GTM_CLS_CLK_CFG                /*lint --e(923)*/ (*(volatile Ifx_GTM_CLS_CLK_CFG *)0xF01000B0u)

/** \\brief  214, CMP error interrupt enable register */
#define GTM_CMP_EIRQ_EN                /*lint --e(923)*/ (*(volatile Ifx_GTM_CMP_EIRQ_EN *)0xF0100214u)

/** \\brief  200, CMP comparator enable register */
#define GTM_CMP_EN                     /*lint --e(923)*/ (*(volatile Ifx_GTM_CMP_EN *)0xF0100200u)

/** \\brief  208, CMP interrupt enable register */
#define GTM_CMP_IRQ_EN                 /*lint --e(923)*/ (*(volatile Ifx_GTM_CMP_IRQ_EN *)0xF0100208u)

/** \\brief  20C, CMP interrupt force register */
#define GTM_CMP_IRQ_FORCINT            /*lint --e(923)*/ (*(volatile Ifx_GTM_CMP_IRQ_FORCINT *)0xF010020Cu)

/** \\brief  210, CMP interrupt mode configuration register */
#define GTM_CMP_IRQ_MODE               /*lint --e(923)*/ (*(volatile Ifx_GTM_CMP_IRQ_MODE *)0xF0100210u)

/** \\brief  204, CMP event notification register */
#define GTM_CMP_IRQ_NOTIFY             /*lint --e(923)*/ (*(volatile Ifx_GTM_CMP_IRQ_NOTIFY *)0xF0100204u)

/** \\brief  30C, CMU control for clock source 0 */
#define GTM_CMU_CLK0_50_CTRL           /*lint --e(923)*/ (*(volatile Ifx_GTM_CMU_CLK0_5_CTRL *)0xF010030Cu)

/** Alias (User Manual Name) for GTM_CMU_CLK0_50_CTRL.
 * To use register names with standard convension, please use GTM_CMU_CLK0_50_CTRL.
 */
#define GTM_CMU_CLK_0_CTRL             (GTM_CMU_CLK0_50_CTRL)

/** Alias (User Manual Name) for GTM_CMU_CLK0_50_CTRL.
 * To use register names with standard convension, please use GTM_CMU_CLK0_50_CTRL.
 */
#define GTM_CMU_CLK_0_CTRL             (GTM_CMU_CLK0_50_CTRL)

/** \\brief  310, CMU control for clock source 0 */
#define GTM_CMU_CLK0_51_CTRL           /*lint --e(923)*/ (*(volatile Ifx_GTM_CMU_CLK0_5_CTRL *)0xF0100310u)

/** Alias (User Manual Name) for GTM_CMU_CLK0_51_CTRL.
 * To use register names with standard convension, please use GTM_CMU_CLK0_51_CTRL.
 */
#define GTM_CMU_CLK_1_CTRL             (GTM_CMU_CLK0_51_CTRL)

/** Alias (User Manual Name) for GTM_CMU_CLK0_51_CTRL.
 * To use register names with standard convension, please use GTM_CMU_CLK0_51_CTRL.
 */
#define GTM_CMU_CLK_1_CTRL             (GTM_CMU_CLK0_51_CTRL)

/** \\brief  314, CMU control for clock source 0 */
#define GTM_CMU_CLK0_52_CTRL           /*lint --e(923)*/ (*(volatile Ifx_GTM_CMU_CLK0_5_CTRL *)0xF0100314u)

/** Alias (User Manual Name) for GTM_CMU_CLK0_52_CTRL.
 * To use register names with standard convension, please use GTM_CMU_CLK0_52_CTRL.
 */
#define GTM_CMU_CLK_2_CTRL             (GTM_CMU_CLK0_52_CTRL)

/** Alias (User Manual Name) for GTM_CMU_CLK0_52_CTRL.
 * To use register names with standard convension, please use GTM_CMU_CLK0_52_CTRL.
 */
#define GTM_CMU_CLK_2_CTRL             (GTM_CMU_CLK0_52_CTRL)

/** \\brief  318, CMU control for clock source 0 */
#define GTM_CMU_CLK0_53_CTRL           /*lint --e(923)*/ (*(volatile Ifx_GTM_CMU_CLK0_5_CTRL *)0xF0100318u)

