Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** Alias (User Manual Name) for GTM_CMU_CLK0_53_CTRL.
 * To use register names with standard convension, please use GTM_CMU_CLK0_53_CTRL.
 */
#define GTM_CMU_CLK_3_CTRL             (GTM_CMU_CLK0_53_CTRL)

/** Alias (User Manual Name) for GTM_CMU_CLK0_53_CTRL.
 * To use register names with standard convension, please use GTM_CMU_CLK0_53_CTRL.
 */
#define GTM_CMU_CLK_3_CTRL             (GTM_CMU_CLK0_53_CTRL)

/** \\brief  31C, CMU control for clock source 0 */
#define GTM_CMU_CLK0_54_CTRL           /*lint --e(923)*/ (*(volatile Ifx_GTM_CMU_CLK0_5_CTRL *)0xF010031Cu)

/** Alias (User Manual Name) for GTM_CMU_CLK0_54_CTRL.
 * To use register names with standard convension, please use GTM_CMU_CLK0_54_CTRL.
 */
#define GTM_CMU_CLK_4_CTRL             (GTM_CMU_CLK0_54_CTRL)

/** Alias (User Manual Name) for GTM_CMU_CLK0_54_CTRL.
 * To use register names with standard convension, please use GTM_CMU_CLK0_54_CTRL.
 */
#define GTM_CMU_CLK_4_CTRL             (GTM_CMU_CLK0_54_CTRL)

/** \\brief  320, CMU control for clock source 0 */
#define GTM_CMU_CLK0_55_CTRL           /*lint --e(923)*/ (*(volatile Ifx_GTM_CMU_CLK0_5_CTRL *)0xF0100320u)

/** Alias (User Manual Name) for GTM_CMU_CLK0_55_CTRL.
 * To use register names with standard convension, please use GTM_CMU_CLK0_55_CTRL.
 */
#define GTM_CMU_CLK_5_CTRL             (GTM_CMU_CLK0_55_CTRL)

/** Alias (User Manual Name) for GTM_CMU_CLK0_55_CTRL.
 * To use register names with standard convension, please use GTM_CMU_CLK0_55_CTRL.
 */
#define GTM_CMU_CLK_5_CTRL             (GTM_CMU_CLK0_55_CTRL)

/** \\brief  324, CMU control for clock source 6 */
#define GTM_CMU_CLK_6_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_CMU_CLK_6_CTRL *)0xF0100324u)

/** \\brief  328, CMU control for clock source 7 */
#define GTM_CMU_CLK_7_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_CMU_CLK_7_CTRL *)0xF0100328u)

/** \\brief  34C, CMU control for clock source selection */
#define GTM_CMU_CLK_CTRL               /*lint --e(923)*/ (*(volatile Ifx_GTM_CMU_CLK_CTRL *)0xF010034Cu)

/** \\brief  300, CMU clock enable */
#define GTM_CMU_CLK_EN                 /*lint --e(923)*/ (*(volatile Ifx_GTM_CMU_CLK_EN *)0xF0100300u)

/** \\brief  330, CMU external clock 0 control denominator */
#define GTM_CMU_ECLK0_DEN              /*lint --e(923)*/ (*(volatile Ifx_GTM_CMU_ECLK_DEN *)0xF0100330u)

/** Alias (User Manual Name) for GTM_CMU_ECLK0_DEN.
 * To use register names with standard convension, please use GTM_CMU_ECLK0_DEN.
 */
#define GTM_CMU_ECLK_0_DEN             (GTM_CMU_ECLK0_DEN)

/** Alias (User Manual Name) for GTM_CMU_ECLK0_DEN.
 * To use register names with standard convension, please use GTM_CMU_ECLK0_DEN.
 */
#define GTM_CMU_ECLK_0_DEN             (GTM_CMU_ECLK0_DEN)

/** \\brief  32C, CMU external clock 0 control numerator */
#define GTM_CMU_ECLK0_NUM              /*lint --e(923)*/ (*(volatile Ifx_GTM_CMU_ECLK_NUM *)0xF010032Cu)

/** Alias (User Manual Name) for GTM_CMU_ECLK0_NUM.
 * To use register names with standard convension, please use GTM_CMU_ECLK0_NUM.
 */
#define GTM_CMU_ECLK_0_NUM             (GTM_CMU_ECLK0_NUM)

/** Alias (User Manual Name) for GTM_CMU_ECLK0_NUM.
 * To use register names with standard convension, please use GTM_CMU_ECLK0_NUM.
 */
#define GTM_CMU_ECLK_0_NUM             (GTM_CMU_ECLK0_NUM)

/** \\brief  338, CMU external clock 0 control denominator */
#define GTM_CMU_ECLK1_DEN              /*lint --e(923)*/ (*(volatile Ifx_GTM_CMU_ECLK_DEN *)0xF0100338u)

/** Alias (User Manual Name) for GTM_CMU_ECLK1_DEN.
 * To use register names with standard convension, please use GTM_CMU_ECLK1_DEN.
 */
#define GTM_CMU_ECLK_1_DEN             (GTM_CMU_ECLK1_DEN)

/** Alias (User Manual Name) for GTM_CMU_ECLK1_DEN.
 * To use register names with standard convension, please use GTM_CMU_ECLK1_DEN.
 */
#define GTM_CMU_ECLK_1_DEN             (GTM_CMU_ECLK1_DEN)

/** \\brief  334, CMU external clock 0 control numerator */
#define GTM_CMU_ECLK1_NUM              /*lint --e(923)*/ (*(volatile Ifx_GTM_CMU_ECLK_NUM *)0xF0100334u)

/** Alias (User Manual Name) for GTM_CMU_ECLK1_NUM.
 * To use register names with standard convension, please use GTM_CMU_ECLK1_NUM.
 */
#define GTM_CMU_ECLK_1_NUM             (GTM_CMU_ECLK1_NUM)

/** Alias (User Manual Name) for GTM_CMU_ECLK1_NUM.
 * To use register names with standard convension, please use GTM_CMU_ECLK1_NUM.
 */
#define GTM_CMU_ECLK_1_NUM             (GTM_CMU_ECLK1_NUM)

/** \\brief  340, CMU external clock 0 control denominator */
#define GTM_CMU_ECLK2_DEN              /*lint --e(923)*/ (*(volatile Ifx_GTM_CMU_ECLK_DEN *)0xF0100340u)

/** Alias (User Manual Name) for GTM_CMU_ECLK2_DEN.
 * To use register names with standard convension, please use GTM_CMU_ECLK2_DEN.
 */
#define GTM_CMU_ECLK_2_DEN             (GTM_CMU_ECLK2_DEN)

/** Alias (User Manual Name) for GTM_CMU_ECLK2_DEN.
 * To use register names with standard convension, please use GTM_CMU_ECLK2_DEN.
 */
#define GTM_CMU_ECLK_2_DEN             (GTM_CMU_ECLK2_DEN)

/** \\brief  33C, CMU external clock 0 control numerator */
#define GTM_CMU_ECLK2_NUM              /*lint --e(923)*/ (*(volatile Ifx_GTM_CMU_ECLK_NUM *)0xF010033Cu)

/** Alias (User Manual Name) for GTM_CMU_ECLK2_NUM.
 * To use register names with standard convension, please use GTM_CMU_ECLK2_NUM.
 */
#define GTM_CMU_ECLK_2_NUM             (GTM_CMU_ECLK2_NUM)

/** Alias (User Manual Name) for GTM_CMU_ECLK2_NUM.
 * To use register names with standard convension, please use GTM_CMU_ECLK2_NUM.
 */
#define GTM_CMU_ECLK_2_NUM             (GTM_CMU_ECLK2_NUM)

/** \\brief  344, CMU control FXCLK sub-unit input clock */
#define GTM_CMU_FXCLK_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_CMU_FXCLK_CTRL *)0xF0100344u)

/** \\brief  308, CMU global clock control denominator */
#define GTM_CMU_GCLK_DEN               /*lint --e(923)*/ (*(volatile Ifx_GTM_CMU_GCLK_DEN *)0xF0100308u)

/** \\brief  304, CMU global clock control numerator */
#define GTM_CMU_GCLK_NUM               /*lint --e(923)*/ (*(volatile Ifx_GTM_CMU_GCLK_NUM *)0xF0100304u)

/** \\brief  348, CMU synchronizing ARU and clock source */
#define GTM_CMU_GLB_CTRL               /*lint --e(923)*/ (*(volatile Ifx_GTM_CMU_GLB_CTRL *)0xF0100348u)

/** \\brief  8, GTM Global control register */
#define GTM_CTRL                       /*lint --e(923)*/ (*(volatile Ifx_GTM_CTRL *)0xF0100008u)

/** \\brief  28F00, DPLL Control Bits Register 0 for up to 32 Actions */
#define GTM_DPLL_ACB_0                 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ACB_0 *)0xF0128F00u)

/** \\brief  28F04, DPLL Control Bits Register 1 for up to 32 Actions */
#define GTM_DPLL_ACB_1                 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ACB_1 *)0xF0128F04u)

/** \\brief  28F08, DPLL Control Bits Register 2 for up to 32 Actions */
#define GTM_DPLL_ACB_2                 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ACB_2 *)0xF0128F08u)

