Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  28F0C, DPLL Control Bits Register 3 for up to 32 Actions */
#define GTM_DPLL_ACB_3                 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ACB_3 *)0xF0128F0Cu)

/** \\brief  28F10, DPLL Control Bits Register 4 for up to 32 Actions */
#define GTM_DPLL_ACB_4                 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ACB_4 *)0xF0128F10u)

/** \\brief  28F14, DPLL Control Bits Register 5 for up to 32 Actions */
#define GTM_DPLL_ACB_5                 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ACB_5 *)0xF0128F14u)

/** \\brief  28F18, DPLL Control Bits Register 6 for up to 32 Actions */
#define GTM_DPLL_ACB_6                 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ACB_6 *)0xF0128F18u)

/** \\brief  28F1C, DPLL Control Bits Register 7 for up to 32 Actions */
#define GTM_DPLL_ACB_7                 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ACB_7 *)0xF0128F1Cu)

/** \\brief  28018, DPLL ACTION Status Register with connected shadow register */
#define GTM_DPLL_ACT_STA               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ACT_STA *)0xF0128018u)

/** \\brief  28438, DPLL Calculated ADD_IN Value for SUB_INC1 Generation */
#define GTM_DPLL_ADD_IN_CAL1           /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADD_IN_CAL1 *)0xF0128438u)

/** \\brief  2843C, DPLL Calculated ADD_IN Value for SUB_INC2 Generation */
#define GTM_DPLL_ADD_IN_CAL2           /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADD_IN_CAL2 *)0xF012843Cu)

/** \\brief  280C8, DPLL Direct Load Input Value for SUB_INC1 */
#define GTM_DPLL_ADD_IN_LD1            /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADD_IN_LD1 *)0xF01280C8u)

/** \\brief  280CC, DPLL Direct Load Input Value for SUB_INC2 */
#define GTM_DPLL_ADD_IN_LD2            /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADD_IN_LD2 *)0xF01280CCu)

/** \\brief  28800, DPLL Adapt and Profile Values of the STATE Increments in
 * FULL_SCALE */
#define GTM_DPLL_ADT_S0                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S *)0xF0128800u)

/** \\brief  28804, DPLL Adapt and Profile Values of the STATE Increments in
 * FULL_SCALE */
#define GTM_DPLL_ADT_S1                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S *)0xF0128804u)

/** \\brief  28828, DPLL Adapt and Profile Values of the STATE Increments in
 * FULL_SCALE */
#define GTM_DPLL_ADT_S10               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S *)0xF0128828u)

/** \\brief  2882C, DPLL Adapt and Profile Values of the STATE Increments in
 * FULL_SCALE */
#define GTM_DPLL_ADT_S11               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S *)0xF012882Cu)

/** \\brief  28830, DPLL Adapt and Profile Values of the STATE Increments in
 * FULL_SCALE */
#define GTM_DPLL_ADT_S12               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S *)0xF0128830u)

/** \\brief  28834, DPLL Adapt and Profile Values of the STATE Increments in
 * FULL_SCALE */
#define GTM_DPLL_ADT_S13               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S *)0xF0128834u)

/** \\brief  28838, DPLL Adapt and Profile Values of the STATE Increments in
 * FULL_SCALE */
#define GTM_DPLL_ADT_S14               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S *)0xF0128838u)

/** \\brief  2883C, DPLL Adapt and Profile Values of the STATE Increments in
 * FULL_SCALE */
#define GTM_DPLL_ADT_S15               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S *)0xF012883Cu)

/** \\brief  28840, DPLL Adapt and Profile Values of the STATE Increments in
 * FULL_SCALE */
#define GTM_DPLL_ADT_S16               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S *)0xF0128840u)

/** \\brief  28844, DPLL Adapt and Profile Values of the STATE Increments in
 * FULL_SCALE */
#define GTM_DPLL_ADT_S17               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S *)0xF0128844u)

/** \\brief  28848, DPLL Adapt and Profile Values of the STATE Increments in
 * FULL_SCALE */
#define GTM_DPLL_ADT_S18               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S *)0xF0128848u)

/** \\brief  2884C, DPLL Adapt and Profile Values of the STATE Increments in
 * FULL_SCALE */
#define GTM_DPLL_ADT_S19               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S *)0xF012884Cu)

/** \\brief  28808, DPLL Adapt and Profile Values of the STATE Increments in
 * FULL_SCALE */
#define GTM_DPLL_ADT_S2                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S *)0xF0128808u)

/** \\brief  28850, DPLL Adapt and Profile Values of the STATE Increments in
 * FULL_SCALE */
#define GTM_DPLL_ADT_S20               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S *)0xF0128850u)

/** \\brief  28854, DPLL Adapt and Profile Values of the STATE Increments in
 * FULL_SCALE */
#define GTM_DPLL_ADT_S21               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S *)0xF0128854u)

/** \\brief  28858, DPLL Adapt and Profile Values of the STATE Increments in
 * FULL_SCALE */
#define GTM_DPLL_ADT_S22               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S *)0xF0128858u)

/** \\brief  2885C, DPLL Adapt and Profile Values of the STATE Increments in
 * FULL_SCALE */
#define GTM_DPLL_ADT_S23               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S *)0xF012885Cu)

/** \\brief  28860, DPLL Adapt and Profile Values of the STATE Increments in
 * FULL_SCALE */
#define GTM_DPLL_ADT_S24               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S *)0xF0128860u)

/** \\brief  28864, DPLL Adapt and Profile Values of the STATE Increments in
 * FULL_SCALE */
#define GTM_DPLL_ADT_S25               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S *)0xF0128864u)

/** \\brief  28868, DPLL Adapt and Profile Values of the STATE Increments in
 * FULL_SCALE */
#define GTM_DPLL_ADT_S26               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S *)0xF0128868u)

/** \\brief  2886C, DPLL Adapt and Profile Values of the STATE Increments in
 * FULL_SCALE */
#define GTM_DPLL_ADT_S27               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S *)0xF012886Cu)

/** \\brief  28870, DPLL Adapt and Profile Values of the STATE Increments in
 * FULL_SCALE */
#define GTM_DPLL_ADT_S28               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S *)0xF0128870u)

/** \\brief  28874, DPLL Adapt and Profile Values of the STATE Increments in
 * FULL_SCALE */
#define GTM_DPLL_ADT_S29               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S *)0xF0128874u)

/** \\brief  2880C, DPLL Adapt and Profile Values of the STATE Increments in
 * FULL_SCALE */
#define GTM_DPLL_ADT_S3                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S *)0xF012880Cu)

/** \\brief  28878, DPLL Adapt and Profile Values of the STATE Increments in
 * FULL_SCALE */
#define GTM_DPLL_ADT_S30               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S *)0xF0128878u)

/** \\brief  2887C, DPLL Adapt and Profile Values of the STATE Increments in
 * FULL_SCALE */
#define GTM_DPLL_ADT_S31               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S *)0xF012887Cu)

