Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  28880, DPLL Adapt and Profile Values of the STATE Increments in
 * FULL_SCALE */
#define GTM_DPLL_ADT_S32               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S *)0xF0128880u)

/** \\brief  28884, DPLL Adapt and Profile Values of the STATE Increments in
 * FULL_SCALE */
#define GTM_DPLL_ADT_S33               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S *)0xF0128884u)

/** \\brief  28888, DPLL Adapt and Profile Values of the STATE Increments in
 * FULL_SCALE */
#define GTM_DPLL_ADT_S34               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S *)0xF0128888u)

/** \\brief  2888C, DPLL Adapt and Profile Values of the STATE Increments in
 * FULL_SCALE */
#define GTM_DPLL_ADT_S35               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S *)0xF012888Cu)

/** \\brief  28890, DPLL Adapt and Profile Values of the STATE Increments in
 * FULL_SCALE */
#define GTM_DPLL_ADT_S36               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S *)0xF0128890u)

/** \\brief  28894, DPLL Adapt and Profile Values of the STATE Increments in
 * FULL_SCALE */
#define GTM_DPLL_ADT_S37               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S *)0xF0128894u)

/** \\brief  28898, DPLL Adapt and Profile Values of the STATE Increments in
 * FULL_SCALE */
#define GTM_DPLL_ADT_S38               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S *)0xF0128898u)

/** \\brief  2889C, DPLL Adapt and Profile Values of the STATE Increments in
 * FULL_SCALE */
#define GTM_DPLL_ADT_S39               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S *)0xF012889Cu)

/** \\brief  28810, DPLL Adapt and Profile Values of the STATE Increments in
 * FULL_SCALE */
#define GTM_DPLL_ADT_S4                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S *)0xF0128810u)

/** \\brief  288A0, DPLL Adapt and Profile Values of the STATE Increments in
 * FULL_SCALE */
#define GTM_DPLL_ADT_S40               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S *)0xF01288A0u)

/** \\brief  288A4, DPLL Adapt and Profile Values of the STATE Increments in
 * FULL_SCALE */
#define GTM_DPLL_ADT_S41               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S *)0xF01288A4u)

/** \\brief  288A8, DPLL Adapt and Profile Values of the STATE Increments in
 * FULL_SCALE */
#define GTM_DPLL_ADT_S42               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S *)0xF01288A8u)

/** \\brief  288AC, DPLL Adapt and Profile Values of the STATE Increments in
 * FULL_SCALE */
#define GTM_DPLL_ADT_S43               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S *)0xF01288ACu)

/** \\brief  288B0, DPLL Adapt and Profile Values of the STATE Increments in
 * FULL_SCALE */
#define GTM_DPLL_ADT_S44               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S *)0xF01288B0u)

/** \\brief  288B4, DPLL Adapt and Profile Values of the STATE Increments in
 * FULL_SCALE */
#define GTM_DPLL_ADT_S45               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S *)0xF01288B4u)

/** \\brief  288B8, DPLL Adapt and Profile Values of the STATE Increments in
 * FULL_SCALE */
#define GTM_DPLL_ADT_S46               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S *)0xF01288B8u)

/** \\brief  288BC, DPLL Adapt and Profile Values of the STATE Increments in
 * FULL_SCALE */
#define GTM_DPLL_ADT_S47               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S *)0xF01288BCu)

/** \\brief  288C0, DPLL Adapt and Profile Values of the STATE Increments in
 * FULL_SCALE */
#define GTM_DPLL_ADT_S48               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S *)0xF01288C0u)

/** \\brief  288C4, DPLL Adapt and Profile Values of the STATE Increments in
 * FULL_SCALE */
#define GTM_DPLL_ADT_S49               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S *)0xF01288C4u)

/** \\brief  28814, DPLL Adapt and Profile Values of the STATE Increments in
 * FULL_SCALE */
#define GTM_DPLL_ADT_S5                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S *)0xF0128814u)

/** \\brief  288C8, DPLL Adapt and Profile Values of the STATE Increments in
 * FULL_SCALE */
#define GTM_DPLL_ADT_S50               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S *)0xF01288C8u)

/** \\brief  288CC, DPLL Adapt and Profile Values of the STATE Increments in
 * FULL_SCALE */
#define GTM_DPLL_ADT_S51               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S *)0xF01288CCu)

/** \\brief  288D0, DPLL Adapt and Profile Values of the STATE Increments in
 * FULL_SCALE */
#define GTM_DPLL_ADT_S52               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S *)0xF01288D0u)

/** \\brief  288D4, DPLL Adapt and Profile Values of the STATE Increments in
 * FULL_SCALE */
#define GTM_DPLL_ADT_S53               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S *)0xF01288D4u)

/** \\brief  288D8, DPLL Adapt and Profile Values of the STATE Increments in
 * FULL_SCALE */
#define GTM_DPLL_ADT_S54               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S *)0xF01288D8u)

/** \\brief  288DC, DPLL Adapt and Profile Values of the STATE Increments in
 * FULL_SCALE */
#define GTM_DPLL_ADT_S55               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S *)0xF01288DCu)

/** \\brief  288E0, DPLL Adapt and Profile Values of the STATE Increments in
 * FULL_SCALE */
#define GTM_DPLL_ADT_S56               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S *)0xF01288E0u)

/** \\brief  288E4, DPLL Adapt and Profile Values of the STATE Increments in
 * FULL_SCALE */
#define GTM_DPLL_ADT_S57               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S *)0xF01288E4u)

/** \\brief  288E8, DPLL Adapt and Profile Values of the STATE Increments in
 * FULL_SCALE */
#define GTM_DPLL_ADT_S58               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S *)0xF01288E8u)

/** \\brief  288EC, DPLL Adapt and Profile Values of the STATE Increments in
 * FULL_SCALE */
#define GTM_DPLL_ADT_S59               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S *)0xF01288ECu)

/** \\brief  28818, DPLL Adapt and Profile Values of the STATE Increments in
 * FULL_SCALE */
#define GTM_DPLL_ADT_S6                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S *)0xF0128818u)

/** \\brief  288F0, DPLL Adapt and Profile Values of the STATE Increments in
 * FULL_SCALE */
#define GTM_DPLL_ADT_S60               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S *)0xF01288F0u)

