Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  288F4, DPLL Adapt and Profile Values of the STATE Increments in
 * FULL_SCALE */
#define GTM_DPLL_ADT_S61               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S *)0xF01288F4u)

/** \\brief  288F8, DPLL Adapt and Profile Values of the STATE Increments in
 * FULL_SCALE */
#define GTM_DPLL_ADT_S62               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S *)0xF01288F8u)

/** \\brief  288FC, DPLL Adapt and Profile Values of the STATE Increments in
 * FULL_SCALE */
#define GTM_DPLL_ADT_S63               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S *)0xF01288FCu)

/** \\brief  2881C, DPLL Adapt and Profile Values of the STATE Increments in
 * FULL_SCALE */
#define GTM_DPLL_ADT_S7                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S *)0xF012881Cu)

/** \\brief  28820, DPLL Adapt and Profile Values of the STATE Increments in
 * FULL_SCALE */
#define GTM_DPLL_ADT_S8                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S *)0xF0128820u)

/** \\brief  28824, DPLL Adapt and Profile Values of the STATE Increments in
 * FULL_SCALE */
#define GTM_DPLL_ADT_S9                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S *)0xF0128824u)

/** \\brief  28020, DPLL Address Offset Register of RAM 2 Regions */
#define GTM_DPLL_AOSV_2                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_AOSV_2 *)0xF0128020u)

/** \\brief  28028, DPLL Actual RAM Pointer Address for STATE */
#define GTM_DPLL_APS                   /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_APS *)0xF0128028u)

/** \\brief  28030, DPLL Actual RAM Pointer for RAM Region 1C3 */
#define GTM_DPLL_APS_1C3               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_APS_1C3 *)0xF0128030u)

/** \\brief  28F3C, DPLL Extension register for DPLL_APS_1C3) */
#define GTM_DPLL_APS_1C3_EXT           /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_APS_1C3_EXT *)0xF0128F3Cu)

/** \\brief  28F38, DPLL Extension register for DPLL_APS 4) */
#define GTM_DPLL_APS_EXT               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_APS_EXT *)0xF0128F38u)

/** \\brief  280BC, DPLL Old RAM Pointer and Offset Value for STATE */
#define GTM_DPLL_APS_SYNC              /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_APS_SYNC *)0xF01280BCu)

/** \\brief  28F30, DPLL Extension register for DPLL_APS_SYNC) */
#define GTM_DPLL_APS_SYNC_EXT          /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_APS_SYNC_EXT *)0xF0128F30u)

/** \\brief  28024, DPLL Actual RAM Pointer Address for TRIGGER */
#define GTM_DPLL_APT                   /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_APT *)0xF0128024u)

/** \\brief  2802C, DPLL Actual RAM Pointer for Region 2C */
#define GTM_DPLL_APT_2C                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_APT_2C *)0xF012802Cu)

/** \\brief  280B8, DPLL Old RAM Pointer and Offset Value for TRIGGER */
#define GTM_DPLL_APT_SYNC              /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_APT_SYNC *)0xF01280B8u)

/** \\brief  28494, DPLL Prediction of the Actual STATE Increment Duration */
#define GTM_DPLL_CDT_SX                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_CDT_SX *)0xF0128494u)

/** \\brief  2849C, DPLL Prediction of the Nominal STATE Increment Duration */
#define GTM_DPLL_CDT_SX_NOM            /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_CDT_SX_NOM *)0xF012849Cu)

/** \\brief  28490, DPLL Prediction of the Actual TRIGGER Increment Duration */
#define GTM_DPLL_CDT_TX                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_CDT_TX *)0xF0128490u)

/** \\brief  28498, DPLL Prediction of the Nominal TRIGGER Increment Duration */
#define GTM_DPLL_CDT_TX_NOM            /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_CDT_TX_NOM *)0xF0128498u)

/** \\brief  285C8, DPLL Number of Sub-Pulses of SUB_INC1 in Continuous Mode */
#define GTM_DPLL_CNT_NUM_1             /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_CNT_NUM_1 *)0xF01285C8u)

/** \\brief  285CC, DPLL Number of Sub-Pulses of SUB_INC2 in Continuous Mode */
#define GTM_DPLL_CNT_NUM_2             /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_CNT_NUM_2 *)0xF01285CCu)

/** \\brief  28F78, DPLL Maximum CDT_S Nominal Value Register */
#define GTM_DPLL_CSN_MAX               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_CSN_MAX *)0xF0128F78u)

/** \\brief  28F74, DPLL Minimum CDT_S Nominal Value Register */
#define GTM_DPLL_CSN_MIN               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_CSN_MIN *)0xF0128F74u)

/** \\brief  28F70, DPLL Maximum CDT_T Nominal Value Register */
#define GTM_DPLL_CTN_MAX               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_CTN_MAX *)0xF0128F70u)

/** \\brief  28F6C, DPLL Minimum CDT_T Nominal Value Register */
#define GTM_DPLL_CTN_MIN               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_CTN_MIN *)0xF0128F6Cu)

/** \\brief  28000, DPLL Control Register 0 */
#define GTM_DPLL_CTRL_0                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_CTRL_0 *)0xF0128000u)

/** \\brief  281E4, DPLL Control 0 Shadow STATE Register */
#define GTM_DPLL_CTRL_0_SHADOW_STATE   /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_CTRL_0_SHADOW_STATE *)0xF01281E4u)

/** \\brief  281E0, DPLL Control 0 Shadow Trigger Register */
#define GTM_DPLL_CTRL_0_SHADOW_TRIGGER /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_CTRL_0_SHADOW_TRIGGER *)0xF01281E0u)

/** \\brief  28004, DPLL Control Register 1 */
#define GTM_DPLL_CTRL_1                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_CTRL_1 *)0xF0128004u)

/** \\brief  28F20, DPLL Control Register 11 */
#define GTM_DPLL_CTRL_11               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_CTRL_11 *)0xF0128F20u)

/** \\brief  281EC, DPLL Control 1 Shadow STATE Register */
#define GTM_DPLL_CTRL_1_SHADOW_STATE   /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_CTRL_1_SHADOW_STATE *)0xF01281ECu)

/** \\brief  281E8, DPLL Control 1 Shadow TRIGGER Register */
#define GTM_DPLL_CTRL_1_SHADOW_TRIGGER /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_CTRL_1_SHADOW_TRIGGER *)0xF01281E8u)

/** \\brief  28008, DPLL Control Register 2 */
#define GTM_DPLL_CTRL_2                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_CTRL_2 *)0xF0128008u)

/** \\brief  2800C, DPLL Control Register 3 */
#define GTM_DPLL_CTRL_3                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_CTRL_3 *)0xF012800Cu)

/** \\brief  28010, DPLL Control Register 4 */
#define GTM_DPLL_CTRL_4                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_CTRL_4 *)0xF0128010u)

/** \\brief  28014, DPLL Control Register 5 */
#define GTM_DPLL_CTRL_5                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_CTRL_5 *)0xF0128014u)

