Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  28F34, DPLL Extension register for DPLL_CTRL) */
#define GTM_DPLL_CTRL_EXT              /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_CTRL_EXT *)0xF0128F34u)

/** \\brief  28280, DPLL ACTION Time To React Before PSAz */
#define GTM_DPLL_DLA0                  /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DLA *)0xF0128280u)

/** \\brief  28284, DPLL ACTION Time To React Before PSAz */
#define GTM_DPLL_DLA1                  /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DLA *)0xF0128284u)

/** \\brief  282A8, DPLL ACTION Time To React Before PSAz */
#define GTM_DPLL_DLA10                 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DLA *)0xF01282A8u)

/** \\brief  282AC, DPLL ACTION Time To React Before PSAz */
#define GTM_DPLL_DLA11                 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DLA *)0xF01282ACu)

/** \\brief  282B0, DPLL ACTION Time To React Before PSAz */
#define GTM_DPLL_DLA12                 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DLA *)0xF01282B0u)

/** \\brief  282B4, DPLL ACTION Time To React Before PSAz */
#define GTM_DPLL_DLA13                 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DLA *)0xF01282B4u)

/** \\brief  282B8, DPLL ACTION Time To React Before PSAz */
#define GTM_DPLL_DLA14                 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DLA *)0xF01282B8u)

/** \\brief  282BC, DPLL ACTION Time To React Before PSAz */
#define GTM_DPLL_DLA15                 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DLA *)0xF01282BCu)

/** \\brief  282C0, DPLL ACTION Time To React Before PSAz */
#define GTM_DPLL_DLA16                 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DLA *)0xF01282C0u)

/** \\brief  282C4, DPLL ACTION Time To React Before PSAz */
#define GTM_DPLL_DLA17                 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DLA *)0xF01282C4u)

/** \\brief  282C8, DPLL ACTION Time To React Before PSAz */
#define GTM_DPLL_DLA18                 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DLA *)0xF01282C8u)

/** \\brief  282CC, DPLL ACTION Time To React Before PSAz */
#define GTM_DPLL_DLA19                 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DLA *)0xF01282CCu)

/** \\brief  28288, DPLL ACTION Time To React Before PSAz */
#define GTM_DPLL_DLA2                  /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DLA *)0xF0128288u)

/** \\brief  282D0, DPLL ACTION Time To React Before PSAz */
#define GTM_DPLL_DLA20                 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DLA *)0xF01282D0u)

/** \\brief  282D4, DPLL ACTION Time To React Before PSAz */
#define GTM_DPLL_DLA21                 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DLA *)0xF01282D4u)

/** \\brief  282D8, DPLL ACTION Time To React Before PSAz */
#define GTM_DPLL_DLA22                 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DLA *)0xF01282D8u)

/** \\brief  282DC, DPLL ACTION Time To React Before PSAz */
#define GTM_DPLL_DLA23                 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DLA *)0xF01282DCu)

/** \\brief  282E0, DPLL ACTION Time To React Before PSAz */
#define GTM_DPLL_DLA24                 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DLA *)0xF01282E0u)

/** \\brief  282E4, DPLL ACTION Time To React Before PSAz */
#define GTM_DPLL_DLA25                 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DLA *)0xF01282E4u)

/** \\brief  282E8, DPLL ACTION Time To React Before PSAz */
#define GTM_DPLL_DLA26                 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DLA *)0xF01282E8u)

/** \\brief  282EC, DPLL ACTION Time To React Before PSAz */
#define GTM_DPLL_DLA27                 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DLA *)0xF01282ECu)

/** \\brief  282F0, DPLL ACTION Time To React Before PSAz */
#define GTM_DPLL_DLA28                 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DLA *)0xF01282F0u)

/** \\brief  282F4, DPLL ACTION Time To React Before PSAz */
#define GTM_DPLL_DLA29                 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DLA *)0xF01282F4u)

/** \\brief  2828C, DPLL ACTION Time To React Before PSAz */
#define GTM_DPLL_DLA3                  /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DLA *)0xF012828Cu)

/** \\brief  282F8, DPLL ACTION Time To React Before PSAz */
#define GTM_DPLL_DLA30                 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DLA *)0xF01282F8u)

/** \\brief  282FC, DPLL ACTION Time To React Before PSAz */
#define GTM_DPLL_DLA31                 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DLA *)0xF01282FCu)

/** \\brief  28290, DPLL ACTION Time To React Before PSAz */
#define GTM_DPLL_DLA4                  /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DLA *)0xF0128290u)

/** \\brief  28294, DPLL ACTION Time To React Before PSAz */
#define GTM_DPLL_DLA5                  /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DLA *)0xF0128294u)

/** \\brief  28298, DPLL ACTION Time To React Before PSAz */
#define GTM_DPLL_DLA6                  /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DLA *)0xF0128298u)

/** \\brief  2829C, DPLL ACTION Time To React Before PSAz */
#define GTM_DPLL_DLA7                  /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DLA *)0xF012829Cu)

/** \\brief  282A0, DPLL ACTION Time To React Before PSAz */
#define GTM_DPLL_DLA8                  /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DLA *)0xF01282A0u)

/** \\brief  282A4, DPLL ACTION Time To React Before PSAz */
#define GTM_DPLL_DLA9                  /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DLA *)0xF01282A4u)

/** \\brief  28900, DPLL Nominal STATE Increment Duration in FULL_SCALE */
#define GTM_DPLL_DT_S0                 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S *)0xF0128900u)

/** \\brief  28904, DPLL Nominal STATE Increment Duration in FULL_SCALE */
#define GTM_DPLL_DT_S1                 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S *)0xF0128904u)

/** \\brief  28928, DPLL Nominal STATE Increment Duration in FULL_SCALE */
#define GTM_DPLL_DT_S10                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S *)0xF0128928u)

/** \\brief  2892C, DPLL Nominal STATE Increment Duration in FULL_SCALE */
#define GTM_DPLL_DT_S11                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S *)0xF012892Cu)

/** \\brief  28930, DPLL Nominal STATE Increment Duration in FULL_SCALE */
#define GTM_DPLL_DT_S12                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S *)0xF0128930u)

/** \\brief  28934, DPLL Nominal STATE Increment Duration in FULL_SCALE */
#define GTM_DPLL_DT_S13                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S *)0xF0128934u)

/** \\brief  28938, DPLL Nominal STATE Increment Duration in FULL_SCALE */
#define GTM_DPLL_DT_S14                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S *)0xF0128938u)

