Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  2893C, DPLL Nominal STATE Increment Duration in FULL_SCALE */
#define GTM_DPLL_DT_S15                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S *)0xF012893Cu)

/** \\brief  28940, DPLL Nominal STATE Increment Duration in FULL_SCALE */
#define GTM_DPLL_DT_S16                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S *)0xF0128940u)

/** \\brief  28944, DPLL Nominal STATE Increment Duration in FULL_SCALE */
#define GTM_DPLL_DT_S17                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S *)0xF0128944u)

/** \\brief  28948, DPLL Nominal STATE Increment Duration in FULL_SCALE */
#define GTM_DPLL_DT_S18                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S *)0xF0128948u)

/** \\brief  2894C, DPLL Nominal STATE Increment Duration in FULL_SCALE */
#define GTM_DPLL_DT_S19                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S *)0xF012894Cu)

/** \\brief  28908, DPLL Nominal STATE Increment Duration in FULL_SCALE */
#define GTM_DPLL_DT_S2                 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S *)0xF0128908u)

/** \\brief  28950, DPLL Nominal STATE Increment Duration in FULL_SCALE */
#define GTM_DPLL_DT_S20                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S *)0xF0128950u)

/** \\brief  28954, DPLL Nominal STATE Increment Duration in FULL_SCALE */
#define GTM_DPLL_DT_S21                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S *)0xF0128954u)

/** \\brief  28958, DPLL Nominal STATE Increment Duration in FULL_SCALE */
#define GTM_DPLL_DT_S22                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S *)0xF0128958u)

/** \\brief  2895C, DPLL Nominal STATE Increment Duration in FULL_SCALE */
#define GTM_DPLL_DT_S23                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S *)0xF012895Cu)

/** \\brief  28960, DPLL Nominal STATE Increment Duration in FULL_SCALE */
#define GTM_DPLL_DT_S24                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S *)0xF0128960u)

/** \\brief  28964, DPLL Nominal STATE Increment Duration in FULL_SCALE */
#define GTM_DPLL_DT_S25                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S *)0xF0128964u)

/** \\brief  28968, DPLL Nominal STATE Increment Duration in FULL_SCALE */
#define GTM_DPLL_DT_S26                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S *)0xF0128968u)

/** \\brief  2896C, DPLL Nominal STATE Increment Duration in FULL_SCALE */
#define GTM_DPLL_DT_S27                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S *)0xF012896Cu)

/** \\brief  28970, DPLL Nominal STATE Increment Duration in FULL_SCALE */
#define GTM_DPLL_DT_S28                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S *)0xF0128970u)

/** \\brief  28974, DPLL Nominal STATE Increment Duration in FULL_SCALE */
#define GTM_DPLL_DT_S29                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S *)0xF0128974u)

/** \\brief  2890C, DPLL Nominal STATE Increment Duration in FULL_SCALE */
#define GTM_DPLL_DT_S3                 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S *)0xF012890Cu)

/** \\brief  28978, DPLL Nominal STATE Increment Duration in FULL_SCALE */
#define GTM_DPLL_DT_S30                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S *)0xF0128978u)

/** \\brief  2897C, DPLL Nominal STATE Increment Duration in FULL_SCALE */
#define GTM_DPLL_DT_S31                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S *)0xF012897Cu)

/** \\brief  28980, DPLL Nominal STATE Increment Duration in FULL_SCALE */
#define GTM_DPLL_DT_S32                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S *)0xF0128980u)

/** \\brief  28984, DPLL Nominal STATE Increment Duration in FULL_SCALE */
#define GTM_DPLL_DT_S33                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S *)0xF0128984u)

/** \\brief  28988, DPLL Nominal STATE Increment Duration in FULL_SCALE */
#define GTM_DPLL_DT_S34                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S *)0xF0128988u)

/** \\brief  2898C, DPLL Nominal STATE Increment Duration in FULL_SCALE */
#define GTM_DPLL_DT_S35                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S *)0xF012898Cu)

/** \\brief  28990, DPLL Nominal STATE Increment Duration in FULL_SCALE */
#define GTM_DPLL_DT_S36                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S *)0xF0128990u)

/** \\brief  28994, DPLL Nominal STATE Increment Duration in FULL_SCALE */
#define GTM_DPLL_DT_S37                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S *)0xF0128994u)

/** \\brief  28998, DPLL Nominal STATE Increment Duration in FULL_SCALE */
#define GTM_DPLL_DT_S38                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S *)0xF0128998u)

/** \\brief  2899C, DPLL Nominal STATE Increment Duration in FULL_SCALE */
#define GTM_DPLL_DT_S39                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S *)0xF012899Cu)

/** \\brief  28910, DPLL Nominal STATE Increment Duration in FULL_SCALE */
#define GTM_DPLL_DT_S4                 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S *)0xF0128910u)

/** \\brief  289A0, DPLL Nominal STATE Increment Duration in FULL_SCALE */
#define GTM_DPLL_DT_S40                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S *)0xF01289A0u)

/** \\brief  289A4, DPLL Nominal STATE Increment Duration in FULL_SCALE */
#define GTM_DPLL_DT_S41                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S *)0xF01289A4u)

/** \\brief  289A8, DPLL Nominal STATE Increment Duration in FULL_SCALE */
#define GTM_DPLL_DT_S42                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S *)0xF01289A8u)

/** \\brief  289AC, DPLL Nominal STATE Increment Duration in FULL_SCALE */
#define GTM_DPLL_DT_S43                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S *)0xF01289ACu)

/** \\brief  289B0, DPLL Nominal STATE Increment Duration in FULL_SCALE */
#define GTM_DPLL_DT_S44                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S *)0xF01289B0u)

/** \\brief  289B4, DPLL Nominal STATE Increment Duration in FULL_SCALE */
#define GTM_DPLL_DT_S45                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S *)0xF01289B4u)

/** \\brief  289B8, DPLL Nominal STATE Increment Duration in FULL_SCALE */
#define GTM_DPLL_DT_S46                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S *)0xF01289B8u)

