Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  289BC, DPLL Nominal STATE Increment Duration in FULL_SCALE */
#define GTM_DPLL_DT_S47                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S *)0xF01289BCu)

/** \\brief  289C0, DPLL Nominal STATE Increment Duration in FULL_SCALE */
#define GTM_DPLL_DT_S48                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S *)0xF01289C0u)

/** \\brief  289C4, DPLL Nominal STATE Increment Duration in FULL_SCALE */
#define GTM_DPLL_DT_S49                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S *)0xF01289C4u)

/** \\brief  28914, DPLL Nominal STATE Increment Duration in FULL_SCALE */
#define GTM_DPLL_DT_S5                 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S *)0xF0128914u)

/** \\brief  289C8, DPLL Nominal STATE Increment Duration in FULL_SCALE */
#define GTM_DPLL_DT_S50                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S *)0xF01289C8u)

/** \\brief  289CC, DPLL Nominal STATE Increment Duration in FULL_SCALE */
#define GTM_DPLL_DT_S51                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S *)0xF01289CCu)

/** \\brief  289D0, DPLL Nominal STATE Increment Duration in FULL_SCALE */
#define GTM_DPLL_DT_S52                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S *)0xF01289D0u)

/** \\brief  289D4, DPLL Nominal STATE Increment Duration in FULL_SCALE */
#define GTM_DPLL_DT_S53                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S *)0xF01289D4u)

/** \\brief  289D8, DPLL Nominal STATE Increment Duration in FULL_SCALE */
#define GTM_DPLL_DT_S54                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S *)0xF01289D8u)

/** \\brief  289DC, DPLL Nominal STATE Increment Duration in FULL_SCALE */
#define GTM_DPLL_DT_S55                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S *)0xF01289DCu)

/** \\brief  289E0, DPLL Nominal STATE Increment Duration in FULL_SCALE */
#define GTM_DPLL_DT_S56                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S *)0xF01289E0u)

/** \\brief  289E4, DPLL Nominal STATE Increment Duration in FULL_SCALE */
#define GTM_DPLL_DT_S57                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S *)0xF01289E4u)

/** \\brief  289E8, DPLL Nominal STATE Increment Duration in FULL_SCALE */
#define GTM_DPLL_DT_S58                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S *)0xF01289E8u)

/** \\brief  289EC, DPLL Nominal STATE Increment Duration in FULL_SCALE */
#define GTM_DPLL_DT_S59                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S *)0xF01289ECu)

/** \\brief  28918, DPLL Nominal STATE Increment Duration in FULL_SCALE */
#define GTM_DPLL_DT_S6                 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S *)0xF0128918u)

/** \\brief  289F0, DPLL Nominal STATE Increment Duration in FULL_SCALE */
#define GTM_DPLL_DT_S60                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S *)0xF01289F0u)

/** \\brief  289F4, DPLL Nominal STATE Increment Duration in FULL_SCALE */
#define GTM_DPLL_DT_S61                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S *)0xF01289F4u)

/** \\brief  289F8, DPLL Nominal STATE Increment Duration in FULL_SCALE */
#define GTM_DPLL_DT_S62                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S *)0xF01289F8u)

/** \\brief  289FC, DPLL Nominal STATE Increment Duration in FULL_SCALE */
#define GTM_DPLL_DT_S63                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S *)0xF01289FCu)

/** \\brief  2891C, DPLL Nominal STATE Increment Duration in FULL_SCALE */
#define GTM_DPLL_DT_S7                 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S *)0xF012891Cu)

/** \\brief  28920, DPLL Nominal STATE Increment Duration in FULL_SCALE */
#define GTM_DPLL_DT_S8                 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S *)0xF0128920u)

/** \\brief  28924, DPLL Nominal STATE Increment Duration in FULL_SCALE */
#define GTM_DPLL_DT_S9                 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S *)0xF0128924u)

/** \\brief  2847C, DPLL Duration of the Last STATE Increment */
#define GTM_DPLL_DT_S_ACT              /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S_ACT *)0xF012847Cu)

/** \\brief  28F50, DPLL Start Value of DPLL_DT_S_ACT for the first Increment
 * after SIP2 is set to 1 */
#define GTM_DPLL_DT_S_START            /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S_START *)0xF0128F50u)

/** \\brief  28478, DPLL Duration of the Last TRIGGER Increment */
#define GTM_DPLL_DT_T_ACT              /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_T_ACT *)0xF0128478u)

/** \\brief  28F4C, DPLL Start Value of DPLL_DT_T_ACT for the first Increment
 * after SIP1 is set to 1 */
#define GTM_DPLL_DT_T_START            /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_T_START *)0xF0128F4Cu)

/** \\brief  28380, DPLL Calculated Relative TIME To ACTION */
#define GTM_DPLL_DTA0                  /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DTA *)0xF0128380u)

/** \\brief  28384, DPLL Calculated Relative TIME To ACTION */
#define GTM_DPLL_DTA1                  /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DTA *)0xF0128384u)

/** \\brief  283A8, DPLL Calculated Relative TIME To ACTION */
#define GTM_DPLL_DTA10                 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DTA *)0xF01283A8u)

/** \\brief  283AC, DPLL Calculated Relative TIME To ACTION */
#define GTM_DPLL_DTA11                 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DTA *)0xF01283ACu)

/** \\brief  283B0, DPLL Calculated Relative TIME To ACTION */
#define GTM_DPLL_DTA12                 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DTA *)0xF01283B0u)

/** \\brief  283B4, DPLL Calculated Relative TIME To ACTION */
#define GTM_DPLL_DTA13                 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DTA *)0xF01283B4u)

/** \\brief  283B8, DPLL Calculated Relative TIME To ACTION */
#define GTM_DPLL_DTA14                 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DTA *)0xF01283B8u)

/** \\brief  283BC, DPLL Calculated Relative TIME To ACTION */
#define GTM_DPLL_DTA15                 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DTA *)0xF01283BCu)

