Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  283C0, DPLL Calculated Relative TIME To ACTION */
#define GTM_DPLL_DTA16                 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DTA *)0xF01283C0u)

/** \\brief  283C4, DPLL Calculated Relative TIME To ACTION */
#define GTM_DPLL_DTA17                 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DTA *)0xF01283C4u)

/** \\brief  283C8, DPLL Calculated Relative TIME To ACTION */
#define GTM_DPLL_DTA18                 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DTA *)0xF01283C8u)

/** \\brief  283CC, DPLL Calculated Relative TIME To ACTION */
#define GTM_DPLL_DTA19                 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DTA *)0xF01283CCu)

/** \\brief  28388, DPLL Calculated Relative TIME To ACTION */
#define GTM_DPLL_DTA2                  /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DTA *)0xF0128388u)

/** \\brief  283D0, DPLL Calculated Relative TIME To ACTION */
#define GTM_DPLL_DTA20                 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DTA *)0xF01283D0u)

/** \\brief  283D4, DPLL Calculated Relative TIME To ACTION */
#define GTM_DPLL_DTA21                 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DTA *)0xF01283D4u)

/** \\brief  283D8, DPLL Calculated Relative TIME To ACTION */
#define GTM_DPLL_DTA22                 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DTA *)0xF01283D8u)

/** \\brief  283DC, DPLL Calculated Relative TIME To ACTION */
#define GTM_DPLL_DTA23                 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DTA *)0xF01283DCu)

/** \\brief  283E0, DPLL Calculated Relative TIME To ACTION */
#define GTM_DPLL_DTA24                 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DTA *)0xF01283E0u)

/** \\brief  283E4, DPLL Calculated Relative TIME To ACTION */
#define GTM_DPLL_DTA25                 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DTA *)0xF01283E4u)

/** \\brief  283E8, DPLL Calculated Relative TIME To ACTION */
#define GTM_DPLL_DTA26                 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DTA *)0xF01283E8u)

/** \\brief  283EC, DPLL Calculated Relative TIME To ACTION */
#define GTM_DPLL_DTA27                 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DTA *)0xF01283ECu)

/** \\brief  283F0, DPLL Calculated Relative TIME To ACTION */
#define GTM_DPLL_DTA28                 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DTA *)0xF01283F0u)

/** \\brief  283F4, DPLL Calculated Relative TIME To ACTION */
#define GTM_DPLL_DTA29                 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DTA *)0xF01283F4u)

/** \\brief  2838C, DPLL Calculated Relative TIME To ACTION */
#define GTM_DPLL_DTA3                  /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DTA *)0xF012838Cu)

/** \\brief  283F8, DPLL Calculated Relative TIME To ACTION */
#define GTM_DPLL_DTA30                 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DTA *)0xF01283F8u)

/** \\brief  283FC, DPLL Calculated Relative TIME To ACTION */
#define GTM_DPLL_DTA31                 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DTA *)0xF01283FCu)

/** \\brief  28390, DPLL Calculated Relative TIME To ACTION */
#define GTM_DPLL_DTA4                  /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DTA *)0xF0128390u)

/** \\brief  28394, DPLL Calculated Relative TIME To ACTION */
#define GTM_DPLL_DTA5                  /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DTA *)0xF0128394u)

/** \\brief  28398, DPLL Calculated Relative TIME To ACTION */
#define GTM_DPLL_DTA6                  /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DTA *)0xF0128398u)

/** \\brief  2839C, DPLL Calculated Relative TIME To ACTION */
#define GTM_DPLL_DTA7                  /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DTA *)0xF012839Cu)

/** \\brief  283A0, DPLL Calculated Relative TIME To ACTION */
#define GTM_DPLL_DTA8                  /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DTA *)0xF01283A0u)

/** \\brief  283A4, DPLL Calculated Relative TIME To ACTION */
#define GTM_DPLL_DTA9                  /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DTA *)0xF01283A4u)

/** \\brief  28488, DPLL Difference of Prediction to Actual Value of the Last
 * STATE Increment */
#define GTM_DPLL_EDT_S                 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_EDT_S *)0xF0128488u)

/** \\brief  28480, DPLL Difference of Prediction to Actual Value of the Last
 * TRIGGER Increment */
#define GTM_DPLL_EDT_T                 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_EDT_T *)0xF0128480u)

/** \\brief  28050, DPLL Error Interrupt Enable Register */
#define GTM_DPLL_EIRQ_EN               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_EIRQ_EN *)0xF0128050u)

/** \\brief  28418, DPLL Actual STATE Filter Value */
#define GTM_DPLL_FTV_S                 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_FTV_S *)0xF0128418u)

/** \\brief  28408, DPLL Actual TRIGGER Filter Value */
#define GTM_DPLL_FTV_T                 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_FTV_T *)0xF0128408u)

/** \\brief  28100, DPLL ID Information For Input Signal PMT 0 Register */
#define GTM_DPLL_ID_PMTR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ID_PMTR *)0xF0128100u)

/** Alias (User Manual Name) for GTM_DPLL_ID_PMTR0.
 * To use register names with standard convension, please use GTM_DPLL_ID_PMTR0.
 */
#define GTM_DPLL_ID_PMTR_0             (GTM_DPLL_ID_PMTR0)

/** Alias (User Manual Name) for GTM_DPLL_ID_PMTR0.
 * To use register names with standard convension, please use GTM_DPLL_ID_PMTR0.
 */
#define GTM_DPLL_ID_PMTR_0             (GTM_DPLL_ID_PMTR0)

/** \\brief  28104, DPLL ID Information For Input Signal PMT 0 Register */
#define GTM_DPLL_ID_PMTR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ID_PMTR *)0xF0128104u)

/** Alias (User Manual Name) for GTM_DPLL_ID_PMTR1.
 * To use register names with standard convension, please use GTM_DPLL_ID_PMTR1.
 */
#define GTM_DPLL_ID_PMTR_1             (GTM_DPLL_ID_PMTR1)

/** Alias (User Manual Name) for GTM_DPLL_ID_PMTR1.
 * To use register names with standard convension, please use GTM_DPLL_ID_PMTR1.
 */
#define GTM_DPLL_ID_PMTR_1             (GTM_DPLL_ID_PMTR1)

/** \\brief  28128, DPLL ID Information For Input Signal PMT 0 Register */
#define GTM_DPLL_ID_PMTR10             /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ID_PMTR *)0xF0128128u)

/** Alias (User Manual Name) for GTM_DPLL_ID_PMTR10.
 * To use register names with standard convension, please use GTM_DPLL_ID_PMTR10.
 */
#define GTM_DPLL_ID_PMTR_10            (GTM_DPLL_ID_PMTR10)

/** Alias (User Manual Name) for GTM_DPLL_ID_PMTR10.
 * To use register names with standard convension, please use GTM_DPLL_ID_PMTR10.
 */
#define GTM_DPLL_ID_PMTR_10            (GTM_DPLL_ID_PMTR10)

/** \\brief  2812C, DPLL ID Information For Input Signal PMT 0 Register */
#define GTM_DPLL_ID_PMTR11             /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ID_PMTR *)0xF012812Cu)

/** Alias (User Manual Name) for GTM_DPLL_ID_PMTR11.
 * To use register names with standard convension, please use GTM_DPLL_ID_PMTR11.
 */
#define GTM_DPLL_ID_PMTR_11            (GTM_DPLL_ID_PMTR11)

/** Alias (User Manual Name) for GTM_DPLL_ID_PMTR11.
 * To use register names with standard convension, please use GTM_DPLL_ID_PMTR11.
 */
#define GTM_DPLL_ID_PMTR_11            (GTM_DPLL_ID_PMTR11)

