Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  28130, DPLL ID Information For Input Signal PMT 0 Register */
#define GTM_DPLL_ID_PMTR12             /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ID_PMTR *)0xF0128130u)

/** Alias (User Manual Name) for GTM_DPLL_ID_PMTR12.
 * To use register names with standard convension, please use GTM_DPLL_ID_PMTR12.
 */
#define GTM_DPLL_ID_PMTR_12            (GTM_DPLL_ID_PMTR12)

/** Alias (User Manual Name) for GTM_DPLL_ID_PMTR12.
 * To use register names with standard convension, please use GTM_DPLL_ID_PMTR12.
 */
#define GTM_DPLL_ID_PMTR_12            (GTM_DPLL_ID_PMTR12)

/** \\brief  28134, DPLL ID Information For Input Signal PMT 0 Register */
#define GTM_DPLL_ID_PMTR13             /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ID_PMTR *)0xF0128134u)

/** Alias (User Manual Name) for GTM_DPLL_ID_PMTR13.
 * To use register names with standard convension, please use GTM_DPLL_ID_PMTR13.
 */
#define GTM_DPLL_ID_PMTR_13            (GTM_DPLL_ID_PMTR13)

/** Alias (User Manual Name) for GTM_DPLL_ID_PMTR13.
 * To use register names with standard convension, please use GTM_DPLL_ID_PMTR13.
 */
#define GTM_DPLL_ID_PMTR_13            (GTM_DPLL_ID_PMTR13)

/** \\brief  28138, DPLL ID Information For Input Signal PMT 0 Register */
#define GTM_DPLL_ID_PMTR14             /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ID_PMTR *)0xF0128138u)

/** Alias (User Manual Name) for GTM_DPLL_ID_PMTR14.
 * To use register names with standard convension, please use GTM_DPLL_ID_PMTR14.
 */
#define GTM_DPLL_ID_PMTR_14            (GTM_DPLL_ID_PMTR14)

/** Alias (User Manual Name) for GTM_DPLL_ID_PMTR14.
 * To use register names with standard convension, please use GTM_DPLL_ID_PMTR14.
 */
#define GTM_DPLL_ID_PMTR_14            (GTM_DPLL_ID_PMTR14)

/** \\brief  2813C, DPLL ID Information For Input Signal PMT 0 Register */
#define GTM_DPLL_ID_PMTR15             /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ID_PMTR *)0xF012813Cu)

/** Alias (User Manual Name) for GTM_DPLL_ID_PMTR15.
 * To use register names with standard convension, please use GTM_DPLL_ID_PMTR15.
 */
#define GTM_DPLL_ID_PMTR_15            (GTM_DPLL_ID_PMTR15)

/** Alias (User Manual Name) for GTM_DPLL_ID_PMTR15.
 * To use register names with standard convension, please use GTM_DPLL_ID_PMTR15.
 */
#define GTM_DPLL_ID_PMTR_15            (GTM_DPLL_ID_PMTR15)

/** \\brief  28140, DPLL ID Information For Input Signal PMT 0 Register */
#define GTM_DPLL_ID_PMTR16             /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ID_PMTR *)0xF0128140u)

/** Alias (User Manual Name) for GTM_DPLL_ID_PMTR16.
 * To use register names with standard convension, please use GTM_DPLL_ID_PMTR16.
 */
#define GTM_DPLL_ID_PMTR_16            (GTM_DPLL_ID_PMTR16)

/** Alias (User Manual Name) for GTM_DPLL_ID_PMTR16.
 * To use register names with standard convension, please use GTM_DPLL_ID_PMTR16.
 */
#define GTM_DPLL_ID_PMTR_16            (GTM_DPLL_ID_PMTR16)

/** \\brief  28144, DPLL ID Information For Input Signal PMT 0 Register */
#define GTM_DPLL_ID_PMTR17             /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ID_PMTR *)0xF0128144u)

/** Alias (User Manual Name) for GTM_DPLL_ID_PMTR17.
 * To use register names with standard convension, please use GTM_DPLL_ID_PMTR17.
 */
#define GTM_DPLL_ID_PMTR_17            (GTM_DPLL_ID_PMTR17)

/** Alias (User Manual Name) for GTM_DPLL_ID_PMTR17.
 * To use register names with standard convension, please use GTM_DPLL_ID_PMTR17.
 */
#define GTM_DPLL_ID_PMTR_17            (GTM_DPLL_ID_PMTR17)

/** \\brief  28148, DPLL ID Information For Input Signal PMT 0 Register */
#define GTM_DPLL_ID_PMTR18             /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ID_PMTR *)0xF0128148u)

/** Alias (User Manual Name) for GTM_DPLL_ID_PMTR18.
 * To use register names with standard convension, please use GTM_DPLL_ID_PMTR18.
 */
#define GTM_DPLL_ID_PMTR_18            (GTM_DPLL_ID_PMTR18)

/** Alias (User Manual Name) for GTM_DPLL_ID_PMTR18.
 * To use register names with standard convension, please use GTM_DPLL_ID_PMTR18.
 */
#define GTM_DPLL_ID_PMTR_18            (GTM_DPLL_ID_PMTR18)

/** \\brief  2814C, DPLL ID Information For Input Signal PMT 0 Register */
#define GTM_DPLL_ID_PMTR19             /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ID_PMTR *)0xF012814Cu)

/** Alias (User Manual Name) for GTM_DPLL_ID_PMTR19.
 * To use register names with standard convension, please use GTM_DPLL_ID_PMTR19.
 */
#define GTM_DPLL_ID_PMTR_19            (GTM_DPLL_ID_PMTR19)

/** Alias (User Manual Name) for GTM_DPLL_ID_PMTR19.
 * To use register names with standard convension, please use GTM_DPLL_ID_PMTR19.
 */
#define GTM_DPLL_ID_PMTR_19            (GTM_DPLL_ID_PMTR19)

/** \\brief  28108, DPLL ID Information For Input Signal PMT 0 Register */
#define GTM_DPLL_ID_PMTR2              /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ID_PMTR *)0xF0128108u)

/** Alias (User Manual Name) for GTM_DPLL_ID_PMTR2.
 * To use register names with standard convension, please use GTM_DPLL_ID_PMTR2.
 */
#define GTM_DPLL_ID_PMTR_2             (GTM_DPLL_ID_PMTR2)

/** Alias (User Manual Name) for GTM_DPLL_ID_PMTR2.
 * To use register names with standard convension, please use GTM_DPLL_ID_PMTR2.
 */
#define GTM_DPLL_ID_PMTR_2             (GTM_DPLL_ID_PMTR2)

/** \\brief  28150, DPLL ID Information For Input Signal PMT 0 Register */
#define GTM_DPLL_ID_PMTR20             /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ID_PMTR *)0xF0128150u)

/** Alias (User Manual Name) for GTM_DPLL_ID_PMTR20.
 * To use register names with standard convension, please use GTM_DPLL_ID_PMTR20.
 */
#define GTM_DPLL_ID_PMTR_20            (GTM_DPLL_ID_PMTR20)

/** Alias (User Manual Name) for GTM_DPLL_ID_PMTR20.
 * To use register names with standard convension, please use GTM_DPLL_ID_PMTR20.
 */
#define GTM_DPLL_ID_PMTR_20            (GTM_DPLL_ID_PMTR20)

/** \\brief  28154, DPLL ID Information For Input Signal PMT 0 Register */
#define GTM_DPLL_ID_PMTR21             /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ID_PMTR *)0xF0128154u)

/** Alias (User Manual Name) for GTM_DPLL_ID_PMTR21.
 * To use register names with standard convension, please use GTM_DPLL_ID_PMTR21.
 */
#define GTM_DPLL_ID_PMTR_21            (GTM_DPLL_ID_PMTR21)

/** Alias (User Manual Name) for GTM_DPLL_ID_PMTR21.
 * To use register names with standard convension, please use GTM_DPLL_ID_PMTR21.
 */
#define GTM_DPLL_ID_PMTR_21            (GTM_DPLL_ID_PMTR21)

/** \\brief  28158, DPLL ID Information For Input Signal PMT 0 Register */
#define GTM_DPLL_ID_PMTR22             /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ID_PMTR *)0xF0128158u)

/** Alias (User Manual Name) for GTM_DPLL_ID_PMTR22.
 * To use register names with standard convension, please use GTM_DPLL_ID_PMTR22.
 */
#define GTM_DPLL_ID_PMTR_22            (GTM_DPLL_ID_PMTR22)

/** Alias (User Manual Name) for GTM_DPLL_ID_PMTR22.
 * To use register names with standard convension, please use GTM_DPLL_ID_PMTR22.
 */
#define GTM_DPLL_ID_PMTR_22            (GTM_DPLL_ID_PMTR22)

/** \\brief  2815C, DPLL ID Information For Input Signal PMT 0 Register */
#define GTM_DPLL_ID_PMTR23             /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ID_PMTR *)0xF012815Cu)

