Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** Alias (User Manual Name) for GTM_DPLL_ID_PMTR23.
 * To use register names with standard convension, please use GTM_DPLL_ID_PMTR23.
 */
#define GTM_DPLL_ID_PMTR_23            (GTM_DPLL_ID_PMTR23)

/** Alias (User Manual Name) for GTM_DPLL_ID_PMTR23.
 * To use register names with standard convension, please use GTM_DPLL_ID_PMTR23.
 */
#define GTM_DPLL_ID_PMTR_23            (GTM_DPLL_ID_PMTR23)

/** \\brief  28160, DPLL ID Information For Input Signal PMT 0 Register */
#define GTM_DPLL_ID_PMTR24             /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ID_PMTR *)0xF0128160u)

/** Alias (User Manual Name) for GTM_DPLL_ID_PMTR24.
 * To use register names with standard convension, please use GTM_DPLL_ID_PMTR24.
 */
#define GTM_DPLL_ID_PMTR_24            (GTM_DPLL_ID_PMTR24)

/** Alias (User Manual Name) for GTM_DPLL_ID_PMTR24.
 * To use register names with standard convension, please use GTM_DPLL_ID_PMTR24.
 */
#define GTM_DPLL_ID_PMTR_24            (GTM_DPLL_ID_PMTR24)

/** \\brief  28164, DPLL ID Information For Input Signal PMT 0 Register */
#define GTM_DPLL_ID_PMTR25             /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ID_PMTR *)0xF0128164u)

/** Alias (User Manual Name) for GTM_DPLL_ID_PMTR25.
 * To use register names with standard convension, please use GTM_DPLL_ID_PMTR25.
 */
#define GTM_DPLL_ID_PMTR_25            (GTM_DPLL_ID_PMTR25)

/** Alias (User Manual Name) for GTM_DPLL_ID_PMTR25.
 * To use register names with standard convension, please use GTM_DPLL_ID_PMTR25.
 */
#define GTM_DPLL_ID_PMTR_25            (GTM_DPLL_ID_PMTR25)

/** \\brief  28168, DPLL ID Information For Input Signal PMT 0 Register */
#define GTM_DPLL_ID_PMTR26             /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ID_PMTR *)0xF0128168u)

/** Alias (User Manual Name) for GTM_DPLL_ID_PMTR26.
 * To use register names with standard convension, please use GTM_DPLL_ID_PMTR26.
 */
#define GTM_DPLL_ID_PMTR_26            (GTM_DPLL_ID_PMTR26)

/** Alias (User Manual Name) for GTM_DPLL_ID_PMTR26.
 * To use register names with standard convension, please use GTM_DPLL_ID_PMTR26.
 */
#define GTM_DPLL_ID_PMTR_26            (GTM_DPLL_ID_PMTR26)

/** \\brief  2816C, DPLL ID Information For Input Signal PMT 0 Register */
#define GTM_DPLL_ID_PMTR27             /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ID_PMTR *)0xF012816Cu)

/** Alias (User Manual Name) for GTM_DPLL_ID_PMTR27.
 * To use register names with standard convension, please use GTM_DPLL_ID_PMTR27.
 */
#define GTM_DPLL_ID_PMTR_27            (GTM_DPLL_ID_PMTR27)

/** Alias (User Manual Name) for GTM_DPLL_ID_PMTR27.
 * To use register names with standard convension, please use GTM_DPLL_ID_PMTR27.
 */
#define GTM_DPLL_ID_PMTR_27            (GTM_DPLL_ID_PMTR27)

/** \\brief  28170, DPLL ID Information For Input Signal PMT 0 Register */
#define GTM_DPLL_ID_PMTR28             /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ID_PMTR *)0xF0128170u)

/** Alias (User Manual Name) for GTM_DPLL_ID_PMTR28.
 * To use register names with standard convension, please use GTM_DPLL_ID_PMTR28.
 */
#define GTM_DPLL_ID_PMTR_28            (GTM_DPLL_ID_PMTR28)

/** Alias (User Manual Name) for GTM_DPLL_ID_PMTR28.
 * To use register names with standard convension, please use GTM_DPLL_ID_PMTR28.
 */
#define GTM_DPLL_ID_PMTR_28            (GTM_DPLL_ID_PMTR28)

/** \\brief  28174, DPLL ID Information For Input Signal PMT 0 Register */
#define GTM_DPLL_ID_PMTR29             /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ID_PMTR *)0xF0128174u)

/** Alias (User Manual Name) for GTM_DPLL_ID_PMTR29.
 * To use register names with standard convension, please use GTM_DPLL_ID_PMTR29.
 */
#define GTM_DPLL_ID_PMTR_29            (GTM_DPLL_ID_PMTR29)

/** Alias (User Manual Name) for GTM_DPLL_ID_PMTR29.
 * To use register names with standard convension, please use GTM_DPLL_ID_PMTR29.
 */
#define GTM_DPLL_ID_PMTR_29            (GTM_DPLL_ID_PMTR29)

/** \\brief  2810C, DPLL ID Information For Input Signal PMT 0 Register */
#define GTM_DPLL_ID_PMTR3              /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ID_PMTR *)0xF012810Cu)

/** Alias (User Manual Name) for GTM_DPLL_ID_PMTR3.
 * To use register names with standard convension, please use GTM_DPLL_ID_PMTR3.
 */
#define GTM_DPLL_ID_PMTR_3             (GTM_DPLL_ID_PMTR3)

/** Alias (User Manual Name) for GTM_DPLL_ID_PMTR3.
 * To use register names with standard convension, please use GTM_DPLL_ID_PMTR3.
 */
#define GTM_DPLL_ID_PMTR_3             (GTM_DPLL_ID_PMTR3)

/** \\brief  28178, DPLL ID Information For Input Signal PMT 0 Register */
#define GTM_DPLL_ID_PMTR30             /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ID_PMTR *)0xF0128178u)

/** Alias (User Manual Name) for GTM_DPLL_ID_PMTR30.
 * To use register names with standard convension, please use GTM_DPLL_ID_PMTR30.
 */
#define GTM_DPLL_ID_PMTR_30            (GTM_DPLL_ID_PMTR30)

/** Alias (User Manual Name) for GTM_DPLL_ID_PMTR30.
 * To use register names with standard convension, please use GTM_DPLL_ID_PMTR30.
 */
#define GTM_DPLL_ID_PMTR_30            (GTM_DPLL_ID_PMTR30)

/** \\brief  2817C, DPLL ID Information For Input Signal PMT 0 Register */
#define GTM_DPLL_ID_PMTR31             /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ID_PMTR *)0xF012817Cu)

/** Alias (User Manual Name) for GTM_DPLL_ID_PMTR31.
 * To use register names with standard convension, please use GTM_DPLL_ID_PMTR31.
 */
#define GTM_DPLL_ID_PMTR_31            (GTM_DPLL_ID_PMTR31)

/** Alias (User Manual Name) for GTM_DPLL_ID_PMTR31.
 * To use register names with standard convension, please use GTM_DPLL_ID_PMTR31.
 */
#define GTM_DPLL_ID_PMTR_31            (GTM_DPLL_ID_PMTR31)

/** \\brief  28110, DPLL ID Information For Input Signal PMT 0 Register */
#define GTM_DPLL_ID_PMTR4              /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ID_PMTR *)0xF0128110u)

/** Alias (User Manual Name) for GTM_DPLL_ID_PMTR4.
 * To use register names with standard convension, please use GTM_DPLL_ID_PMTR4.
 */
#define GTM_DPLL_ID_PMTR_4             (GTM_DPLL_ID_PMTR4)

