Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** Alias (User Manual Name) for GTM_DPLL_ID_PMTR4.
 * To use register names with standard convension, please use GTM_DPLL_ID_PMTR4.
 */
#define GTM_DPLL_ID_PMTR_4             (GTM_DPLL_ID_PMTR4)

/** \\brief  28114, DPLL ID Information For Input Signal PMT 0 Register */
#define GTM_DPLL_ID_PMTR5              /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ID_PMTR *)0xF0128114u)

/** Alias (User Manual Name) for GTM_DPLL_ID_PMTR5.
 * To use register names with standard convension, please use GTM_DPLL_ID_PMTR5.
 */
#define GTM_DPLL_ID_PMTR_5             (GTM_DPLL_ID_PMTR5)

/** Alias (User Manual Name) for GTM_DPLL_ID_PMTR5.
 * To use register names with standard convension, please use GTM_DPLL_ID_PMTR5.
 */
#define GTM_DPLL_ID_PMTR_5             (GTM_DPLL_ID_PMTR5)

/** \\brief  28118, DPLL ID Information For Input Signal PMT 0 Register */
#define GTM_DPLL_ID_PMTR6              /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ID_PMTR *)0xF0128118u)

/** Alias (User Manual Name) for GTM_DPLL_ID_PMTR6.
 * To use register names with standard convension, please use GTM_DPLL_ID_PMTR6.
 */
#define GTM_DPLL_ID_PMTR_6             (GTM_DPLL_ID_PMTR6)

/** Alias (User Manual Name) for GTM_DPLL_ID_PMTR6.
 * To use register names with standard convension, please use GTM_DPLL_ID_PMTR6.
 */
#define GTM_DPLL_ID_PMTR_6             (GTM_DPLL_ID_PMTR6)

/** \\brief  2811C, DPLL ID Information For Input Signal PMT 0 Register */
#define GTM_DPLL_ID_PMTR7              /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ID_PMTR *)0xF012811Cu)

/** Alias (User Manual Name) for GTM_DPLL_ID_PMTR7.
 * To use register names with standard convension, please use GTM_DPLL_ID_PMTR7.
 */
#define GTM_DPLL_ID_PMTR_7             (GTM_DPLL_ID_PMTR7)

/** Alias (User Manual Name) for GTM_DPLL_ID_PMTR7.
 * To use register names with standard convension, please use GTM_DPLL_ID_PMTR7.
 */
#define GTM_DPLL_ID_PMTR_7             (GTM_DPLL_ID_PMTR7)

/** \\brief  28120, DPLL ID Information For Input Signal PMT 0 Register */
#define GTM_DPLL_ID_PMTR8              /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ID_PMTR *)0xF0128120u)

/** Alias (User Manual Name) for GTM_DPLL_ID_PMTR8.
 * To use register names with standard convension, please use GTM_DPLL_ID_PMTR8.
 */
#define GTM_DPLL_ID_PMTR_8             (GTM_DPLL_ID_PMTR8)

/** Alias (User Manual Name) for GTM_DPLL_ID_PMTR8.
 * To use register names with standard convension, please use GTM_DPLL_ID_PMTR8.
 */
#define GTM_DPLL_ID_PMTR_8             (GTM_DPLL_ID_PMTR8)

/** \\brief  28124, DPLL ID Information For Input Signal PMT 0 Register */
#define GTM_DPLL_ID_PMTR9              /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ID_PMTR *)0xF0128124u)

/** Alias (User Manual Name) for GTM_DPLL_ID_PMTR9.
 * To use register names with standard convension, please use GTM_DPLL_ID_PMTR9.
 */
#define GTM_DPLL_ID_PMTR_9             (GTM_DPLL_ID_PMTR9)

/** Alias (User Manual Name) for GTM_DPLL_ID_PMTR9.
 * To use register names with standard convension, please use GTM_DPLL_ID_PMTR9.
 */
#define GTM_DPLL_ID_PMTR_9             (GTM_DPLL_ID_PMTR9)

/** \\brief  280B0, DPLL Counter for Pulses for TBU_CH1_BASE to be sent in
 * Automatic End Mode */
#define GTM_DPLL_INC_CNT1              /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_INC_CNT1 *)0xF01280B0u)

/** \\brief  28F5C, DPLL INC_CNT1 Trigger Mask */
#define GTM_DPLL_INC_CNT1_MASK         /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_INC_CNT1_MASK *)0xF0128F5Cu)

/** \\brief  280B4, DPLL Counter for Pulses for TBU_TS2 to be sent in Automatic
 * End Mode */
#define GTM_DPLL_INC_CNT2              /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_INC_CNT2 *)0xF01280B4u)

/** \\brief  28F60, DPLL INC_CNT2 Trigger Mask */
#define GTM_DPLL_INC_CNT2_MASK         /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_INC_CNT2_MASK *)0xF0128F60u)

/** \\brief  28F44, DPLL Start Value of the ADD_IN_ADDER1 Register */
#define GTM_DPLL_INCF1_OFFSET          /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_INCF1_OFFSET *)0xF0128F44u)

/** \\brief  28F48, DPLL Start Value of the ADD_IN_ADDER2 Register */
#define GTM_DPLL_INCF2_OFFSET          /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_INCF2_OFFSET *)0xF0128F48u)

/** \\brief  28044, DPLL Interrupt Enable Register */
#define GTM_DPLL_IRQ_EN                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_IRQ_EN *)0xF0128044u)

/** \\brief  28048, DPLL Interrupt Force Register */
#define GTM_DPLL_IRQ_FORCINT           /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_IRQ_FORCINT *)0xF0128048u)

/** \\brief  2804C, DPLL Interrupt Mode Register */
#define GTM_DPLL_IRQ_MODE              /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_IRQ_MODE *)0xF012804Cu)

/** \\brief  28040, DPLL Interrupt Notification Register */
#define GTM_DPLL_IRQ_NOTIFY            /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_IRQ_NOTIFY *)0xF0128040u)

/** \\brief  2848C, DPLL Weighted Difference of Prediction Errors of STATE */
#define GTM_DPLL_MEDT_S                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_MEDT_S *)0xF012848Cu)

/** \\brief  28484, DPLL Weighted Difference of Prediction Errors of TRIGGER */
#define GTM_DPLL_MEDT_T                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_MEDT_T *)0xF0128484u)

/** \\brief  285C0, DPLL Calculated Number of Sub-Pulses between two nominal
 * STATE Events for SMC=0 */
#define GTM_DPLL_MLS1                  /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_MLS1 *)0xF01285C0u)

/** \\brief  285C4, DPLL Calculated Number of Sub-Pulses between two nominal
 * STATE Events for SMC=1 and RMO=1 */
#define GTM_DPLL_MLS2                  /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_MLS2 *)0xF01285C4u)

/** \\brief  28440, DPLL Missing Pulses to be Added or Subtracted Directly 1 */
#define GTM_DPLL_MPVAL1                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_MPVAL1 *)0xF0128440u)

/** \\brief  28444, DPLL Missing Pulses to be Added or Subtracted Directly 2 */
#define GTM_DPLL_MPVAL2                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_MPVAL2 *)0xF0128444u)

/** \\brief  28300, DPLL Calculated Number Of TRIGGER/STATE Increments To ACTION */
#define GTM_DPLL_NA0                   /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_NA *)0xF0128300u)

/** \\brief  28304, DPLL Calculated Number Of TRIGGER/STATE Increments To ACTION */
#define GTM_DPLL_NA1                   /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_NA *)0xF0128304u)

/** \\brief  28328, DPLL Calculated Number Of TRIGGER/STATE Increments To ACTION */
#define GTM_DPLL_NA10                  /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_NA *)0xF0128328u)

