Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  2832C, DPLL Calculated Number Of TRIGGER/STATE Increments To ACTION */
#define GTM_DPLL_NA11                  /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_NA *)0xF012832Cu)

/** \\brief  28330, DPLL Calculated Number Of TRIGGER/STATE Increments To ACTION */
#define GTM_DPLL_NA12                  /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_NA *)0xF0128330u)

/** \\brief  28334, DPLL Calculated Number Of TRIGGER/STATE Increments To ACTION */
#define GTM_DPLL_NA13                  /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_NA *)0xF0128334u)

/** \\brief  28338, DPLL Calculated Number Of TRIGGER/STATE Increments To ACTION */
#define GTM_DPLL_NA14                  /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_NA *)0xF0128338u)

/** \\brief  2833C, DPLL Calculated Number Of TRIGGER/STATE Increments To ACTION */
#define GTM_DPLL_NA15                  /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_NA *)0xF012833Cu)

/** \\brief  28340, DPLL Calculated Number Of TRIGGER/STATE Increments To ACTION */
#define GTM_DPLL_NA16                  /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_NA *)0xF0128340u)

/** \\brief  28344, DPLL Calculated Number Of TRIGGER/STATE Increments To ACTION */
#define GTM_DPLL_NA17                  /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_NA *)0xF0128344u)

/** \\brief  28348, DPLL Calculated Number Of TRIGGER/STATE Increments To ACTION */
#define GTM_DPLL_NA18                  /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_NA *)0xF0128348u)

/** \\brief  2834C, DPLL Calculated Number Of TRIGGER/STATE Increments To ACTION */
#define GTM_DPLL_NA19                  /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_NA *)0xF012834Cu)

/** \\brief  28308, DPLL Calculated Number Of TRIGGER/STATE Increments To ACTION */
#define GTM_DPLL_NA2                   /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_NA *)0xF0128308u)

/** \\brief  28350, DPLL Calculated Number Of TRIGGER/STATE Increments To ACTION */
#define GTM_DPLL_NA20                  /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_NA *)0xF0128350u)

/** \\brief  28354, DPLL Calculated Number Of TRIGGER/STATE Increments To ACTION */
#define GTM_DPLL_NA21                  /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_NA *)0xF0128354u)

/** \\brief  28358, DPLL Calculated Number Of TRIGGER/STATE Increments To ACTION */
#define GTM_DPLL_NA22                  /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_NA *)0xF0128358u)

/** \\brief  2835C, DPLL Calculated Number Of TRIGGER/STATE Increments To ACTION */
#define GTM_DPLL_NA23                  /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_NA *)0xF012835Cu)

/** \\brief  28360, DPLL Calculated Number Of TRIGGER/STATE Increments To ACTION */
#define GTM_DPLL_NA24                  /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_NA *)0xF0128360u)

/** \\brief  28364, DPLL Calculated Number Of TRIGGER/STATE Increments To ACTION */
#define GTM_DPLL_NA25                  /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_NA *)0xF0128364u)

/** \\brief  28368, DPLL Calculated Number Of TRIGGER/STATE Increments To ACTION */
#define GTM_DPLL_NA26                  /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_NA *)0xF0128368u)

/** \\brief  2836C, DPLL Calculated Number Of TRIGGER/STATE Increments To ACTION */
#define GTM_DPLL_NA27                  /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_NA *)0xF012836Cu)

/** \\brief  28370, DPLL Calculated Number Of TRIGGER/STATE Increments To ACTION */
#define GTM_DPLL_NA28                  /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_NA *)0xF0128370u)

/** \\brief  28374, DPLL Calculated Number Of TRIGGER/STATE Increments To ACTION */
#define GTM_DPLL_NA29                  /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_NA *)0xF0128374u)

/** \\brief  2830C, DPLL Calculated Number Of TRIGGER/STATE Increments To ACTION */
#define GTM_DPLL_NA3                   /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_NA *)0xF012830Cu)

/** \\brief  28378, DPLL Calculated Number Of TRIGGER/STATE Increments To ACTION */
#define GTM_DPLL_NA30                  /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_NA *)0xF0128378u)

/** \\brief  2837C, DPLL Calculated Number Of TRIGGER/STATE Increments To ACTION */
#define GTM_DPLL_NA31                  /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_NA *)0xF012837Cu)

/** \\brief  28310, DPLL Calculated Number Of TRIGGER/STATE Increments To ACTION */
#define GTM_DPLL_NA4                   /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_NA *)0xF0128310u)

/** \\brief  28314, DPLL Calculated Number Of TRIGGER/STATE Increments To ACTION */
#define GTM_DPLL_NA5                   /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_NA *)0xF0128314u)

/** \\brief  28318, DPLL Calculated Number Of TRIGGER/STATE Increments To ACTION */
#define GTM_DPLL_NA6                   /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_NA *)0xF0128318u)

/** \\brief  2831C, DPLL Calculated Number Of TRIGGER/STATE Increments To ACTION */
#define GTM_DPLL_NA7                   /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_NA *)0xF012831Cu)

/** \\brief  28320, DPLL Calculated Number Of TRIGGER/STATE Increments To ACTION */
#define GTM_DPLL_NA8                   /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_NA *)0xF0128320u)

/** \\brief  28324, DPLL Calculated Number Of TRIGGER/STATE Increments To ACTION */
#define GTM_DPLL_NA9                   /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_NA *)0xF0128324u)

/** \\brief  285FC, DPLL Number of Pulses to be Sent in Emergency Mode */
#define GTM_DPLL_NMB_S                 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_NMB_S *)0xF01285FCu)

/** \\brief  28450, DPLL Target Number of Pulses to be Sent in Emergency Mode */
#define GTM_DPLL_NMB_S_TAR             /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_NMB_S_TAR *)0xF0128450u)

/** \\brief  28454, DPLL Last but one Target Number of Pulses to be Sent in
 * Emergency Mode */
#define GTM_DPLL_NMB_S_TAR_OLD         /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_NMB_S_TAR_OLD *)0xF0128454u)

/** \\brief  285F8, DPLL Number of Pulses to be Sent in Normal Mode */
#define GTM_DPLL_NMB_T                 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_NMB_T *)0xF01285F8u)

/** \\brief  28448, DPLL Target Number of Pulses to be Sent in Normal Mode */
#define GTM_DPLL_NMB_T_TAR             /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_NMB_T_TAR *)0xF0128448u)

/** \\brief  2844C, DPLL Last but one Target Number of Pulses to be Sent in
 * Normal Mode */
#define GTM_DPLL_NMB_T_TAR_OLD         /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_NMB_T_TAR_OLD *)0xF012844Cu)

/** \\brief  2803C, DPLL Number of Active TRIGGER Events to Interrupt */
#define GTM_DPLL_NTI_CNT               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_NTI_CNT *)0xF012803Cu)

/** \\brief  28038, DPLL Number of Recent STATE Events Used for Calculations */
#define GTM_DPLL_NUSC                  /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_NUSC *)0xF0128038u)

/** \\brief  28F64, DPLL Extension register number 1 for DPLL_NUSC 4 */
#define GTM_DPLL_NUSC_EXT1             /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_NUSC_EXT1 *)0xF0128F64u)

/** \\brief  28F68, DPLL Extension register number 2 for DPLL_NUSC 4 */
#define GTM_DPLL_NUSC_EXT2             /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_NUSC_EXT2 *)0xF0128F68u)

/** \\brief  28034, DPLL Number of Recent TRIGGER Events Used for Calculations */
#define GTM_DPLL_NUTC                  /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_NUTC *)0xF0128034u)

