Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  2801C, DPLL Offset And Switch Old/New Address Register */
#define GTM_DPLL_OSW                   /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_OSW *)0xF012801Cu)

/** \\brief  28500, DPLL Projected Increment Sum Relations for Action 0 */
#define GTM_DPLL_PDT_0                 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PDT_0 *)0xF0128500u)

/** \\brief  28504, DPLL Projected Increment Sum Relations for Action 1 */
#define GTM_DPLL_PDT_1                 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PDT_1 *)0xF0128504u)

/** \\brief  28528, DPLL Projected Increment Sum Relations for Action 10 */
#define GTM_DPLL_PDT_10                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PDT_10 *)0xF0128528u)

/** \\brief  2852C, DPLL Projected Increment Sum Relations for Action 11 */
#define GTM_DPLL_PDT_11                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PDT_11 *)0xF012852Cu)

/** \\brief  28530, DPLL Projected Increment Sum Relations for Action 12 */
#define GTM_DPLL_PDT_12                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PDT_12 *)0xF0128530u)

/** \\brief  28534, DPLL Projected Increment Sum Relations for Action 13 */
#define GTM_DPLL_PDT_13                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PDT_13 *)0xF0128534u)

/** \\brief  28538, DPLL Projected Increment Sum Relations for Action 14 */
#define GTM_DPLL_PDT_14                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PDT_14 *)0xF0128538u)

/** \\brief  2853C, DPLL Projected Increment Sum Relations for Action 15 */
#define GTM_DPLL_PDT_15                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PDT_15 *)0xF012853Cu)

/** \\brief  28540, DPLL Projected Increment Sum Relations for Action 16 */
#define GTM_DPLL_PDT_16                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PDT_16 *)0xF0128540u)

/** \\brief  28544, DPLL Projected Increment Sum Relations for Action 17 */
#define GTM_DPLL_PDT_17                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PDT_17 *)0xF0128544u)

/** \\brief  28548, DPLL Projected Increment Sum Relations for Action 18 */
#define GTM_DPLL_PDT_18                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PDT_18 *)0xF0128548u)

/** \\brief  2854C, DPLL Projected Increment Sum Relations for Action 19 */
#define GTM_DPLL_PDT_19                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PDT_19 *)0xF012854Cu)

/** \\brief  28508, DPLL Projected Increment Sum Relations for Action 2 */
#define GTM_DPLL_PDT_2                 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PDT_2 *)0xF0128508u)

/** \\brief  28550, DPLL Projected Increment Sum Relations for Action 20 */
#define GTM_DPLL_PDT_20                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PDT_20 *)0xF0128550u)

/** \\brief  28554, DPLL Projected Increment Sum Relations for Action 21 */
#define GTM_DPLL_PDT_21                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PDT_21 *)0xF0128554u)

/** \\brief  28558, DPLL Projected Increment Sum Relations for Action 22 */
#define GTM_DPLL_PDT_22                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PDT_22 *)0xF0128558u)

/** \\brief  2855C, DPLL Projected Increment Sum Relations for Action 23 */
#define GTM_DPLL_PDT_23                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PDT_23 *)0xF012855Cu)

/** \\brief  28560, DPLL Projected Increment Sum Relations for Action 24 */
#define GTM_DPLL_PDT_24                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PDT_24 *)0xF0128560u)

/** \\brief  28564, DPLL Projected Increment Sum Relations for Action 25 */
#define GTM_DPLL_PDT_25                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PDT_25 *)0xF0128564u)

/** \\brief  28568, DPLL Projected Increment Sum Relations for Action 26 */
#define GTM_DPLL_PDT_26                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PDT_26 *)0xF0128568u)

/** \\brief  2856C, DPLL Projected Increment Sum Relations for Action 27 */
#define GTM_DPLL_PDT_27                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PDT_27 *)0xF012856Cu)

/** \\brief  28570, DPLL Projected Increment Sum Relations for Action 28 */
#define GTM_DPLL_PDT_28                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PDT_28 *)0xF0128570u)

/** \\brief  28574, DPLL Projected Increment Sum Relations for Action 29 */
#define GTM_DPLL_PDT_29                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PDT_29 *)0xF0128574u)

/** \\brief  2850C, DPLL Projected Increment Sum Relations for Action 3 */
#define GTM_DPLL_PDT_3                 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PDT_3 *)0xF012850Cu)

/** \\brief  28578, DPLL Projected Increment Sum Relations for Action 30 */
#define GTM_DPLL_PDT_30                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PDT_30 *)0xF0128578u)

/** \\brief  2857C, DPLL Projected Increment Sum Relations for Action 31 */
#define GTM_DPLL_PDT_31                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PDT_31 *)0xF012857Cu)

/** \\brief  28510, DPLL Projected Increment Sum Relations for Action 4 */
#define GTM_DPLL_PDT_4                 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PDT_4 *)0xF0128510u)

/** \\brief  28514, DPLL Projected Increment Sum Relations for Action 5 */
#define GTM_DPLL_PDT_5                 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PDT_5 *)0xF0128514u)

/** \\brief  28518, DPLL Projected Increment Sum Relations for Action 6 */
#define GTM_DPLL_PDT_6                 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PDT_6 *)0xF0128518u)

/** \\brief  2851C, DPLL Projected Increment Sum Relations for Action 7 */
#define GTM_DPLL_PDT_7                 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PDT_7 *)0xF012851Cu)

/** \\brief  28520, DPLL Projected Increment Sum Relations for Action 8 */
#define GTM_DPLL_PDT_8                 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PDT_8 *)0xF0128520u)

/** \\brief  28524, DPLL Projected Increment Sum Relations for Action 9 */
#define GTM_DPLL_PDT_9                 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PDT_9 *)0xF0128524u)

/** \\brief  28200, DPLL ACTION Position/Value Request */
#define GTM_DPLL_PSA0                  /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSA *)0xF0128200u)

/** \\brief  28204, DPLL ACTION Position/Value Request */
#define GTM_DPLL_PSA1                  /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSA *)0xF0128204u)

/** \\brief  28228, DPLL ACTION Position/Value Request */
#define GTM_DPLL_PSA10                 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSA *)0xF0128228u)

