Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  2822C, DPLL ACTION Position/Value Request */
#define GTM_DPLL_PSA11                 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSA *)0xF012822Cu)

/** \\brief  28230, DPLL ACTION Position/Value Request */
#define GTM_DPLL_PSA12                 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSA *)0xF0128230u)

/** \\brief  28234, DPLL ACTION Position/Value Request */
#define GTM_DPLL_PSA13                 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSA *)0xF0128234u)

/** \\brief  28238, DPLL ACTION Position/Value Request */
#define GTM_DPLL_PSA14                 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSA *)0xF0128238u)

/** \\brief  2823C, DPLL ACTION Position/Value Request */
#define GTM_DPLL_PSA15                 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSA *)0xF012823Cu)

/** \\brief  28240, DPLL ACTION Position/Value Request */
#define GTM_DPLL_PSA16                 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSA *)0xF0128240u)

/** \\brief  28244, DPLL ACTION Position/Value Request */
#define GTM_DPLL_PSA17                 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSA *)0xF0128244u)

/** \\brief  28248, DPLL ACTION Position/Value Request */
#define GTM_DPLL_PSA18                 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSA *)0xF0128248u)

/** \\brief  2824C, DPLL ACTION Position/Value Request */
#define GTM_DPLL_PSA19                 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSA *)0xF012824Cu)

/** \\brief  28208, DPLL ACTION Position/Value Request */
#define GTM_DPLL_PSA2                  /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSA *)0xF0128208u)

/** \\brief  28250, DPLL ACTION Position/Value Request */
#define GTM_DPLL_PSA20                 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSA *)0xF0128250u)

/** \\brief  28254, DPLL ACTION Position/Value Request */
#define GTM_DPLL_PSA21                 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSA *)0xF0128254u)

/** \\brief  28258, DPLL ACTION Position/Value Request */
#define GTM_DPLL_PSA22                 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSA *)0xF0128258u)

/** \\brief  2825C, DPLL ACTION Position/Value Request */
#define GTM_DPLL_PSA23                 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSA *)0xF012825Cu)

/** \\brief  28260, DPLL ACTION Position/Value Request */
#define GTM_DPLL_PSA24                 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSA *)0xF0128260u)

/** \\brief  28264, DPLL ACTION Position/Value Request */
#define GTM_DPLL_PSA25                 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSA *)0xF0128264u)

/** \\brief  28268, DPLL ACTION Position/Value Request */
#define GTM_DPLL_PSA26                 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSA *)0xF0128268u)

/** \\brief  2826C, DPLL ACTION Position/Value Request */
#define GTM_DPLL_PSA27                 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSA *)0xF012826Cu)

/** \\brief  28270, DPLL ACTION Position/Value Request */
#define GTM_DPLL_PSA28                 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSA *)0xF0128270u)

/** \\brief  28274, DPLL ACTION Position/Value Request */
#define GTM_DPLL_PSA29                 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSA *)0xF0128274u)

/** \\brief  2820C, DPLL ACTION Position/Value Request */
#define GTM_DPLL_PSA3                  /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSA *)0xF012820Cu)

/** \\brief  28278, DPLL ACTION Position/Value Request */
#define GTM_DPLL_PSA30                 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSA *)0xF0128278u)

/** \\brief  2827C, DPLL ACTION Position/Value Request */
#define GTM_DPLL_PSA31                 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSA *)0xF012827Cu)

/** \\brief  28210, DPLL ACTION Position/Value Request */
#define GTM_DPLL_PSA4                  /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSA *)0xF0128210u)

/** \\brief  28214, DPLL ACTION Position/Value Request */
#define GTM_DPLL_PSA5                  /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSA *)0xF0128214u)

/** \\brief  28218, DPLL ACTION Position/Value Request */
#define GTM_DPLL_PSA6                  /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSA *)0xF0128218u)

/** \\brief  2821C, DPLL ACTION Position/Value Request */
#define GTM_DPLL_PSA7                  /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSA *)0xF012821Cu)

/** \\brief  28220, DPLL ACTION Position/Value Request */
#define GTM_DPLL_PSA8                  /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSA *)0xF0128220u)

/** \\brief  28224, DPLL ACTION Position/Value Request */
#define GTM_DPLL_PSA9                  /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSA *)0xF0128224u)

/** \\brief  28E80, DPLL ACTION Position/Value Action 0 Request Register */
#define GTM_DPLL_PSAC0                 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSAC *)0xF0128E80u)

/** \\brief  28E84, DPLL ACTION Position/Value Action 0 Request Register */
#define GTM_DPLL_PSAC1                 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSAC *)0xF0128E84u)

/** \\brief  28EA8, DPLL ACTION Position/Value Action 0 Request Register */
#define GTM_DPLL_PSAC10                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSAC *)0xF0128EA8u)

/** \\brief  28EAC, DPLL ACTION Position/Value Action 0 Request Register */
#define GTM_DPLL_PSAC11                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSAC *)0xF0128EACu)

/** \\brief  28EB0, DPLL ACTION Position/Value Action 0 Request Register */
#define GTM_DPLL_PSAC12                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSAC *)0xF0128EB0u)

/** \\brief  28EB4, DPLL ACTION Position/Value Action 0 Request Register */
#define GTM_DPLL_PSAC13                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSAC *)0xF0128EB4u)

/** \\brief  28EB8, DPLL ACTION Position/Value Action 0 Request Register */
#define GTM_DPLL_PSAC14                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSAC *)0xF0128EB8u)

/** \\brief  28EBC, DPLL ACTION Position/Value Action 0 Request Register */
#define GTM_DPLL_PSAC15                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSAC *)0xF0128EBCu)

/** \\brief  28EC0, DPLL ACTION Position/Value Action 0 Request Register */
#define GTM_DPLL_PSAC16                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSAC *)0xF0128EC0u)

/** \\brief  28EC4, DPLL ACTION Position/Value Action 0 Request Register */
#define GTM_DPLL_PSAC17                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSAC *)0xF0128EC4u)

/** \\brief  28EC8, DPLL ACTION Position/Value Action 0 Request Register */
#define GTM_DPLL_PSAC18                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSAC *)0xF0128EC8u)

