Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  28ECC, DPLL ACTION Position/Value Action 0 Request Register */
#define GTM_DPLL_PSAC19                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSAC *)0xF0128ECCu)

/** \\brief  28E88, DPLL ACTION Position/Value Action 0 Request Register */
#define GTM_DPLL_PSAC2                 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSAC *)0xF0128E88u)

/** \\brief  28ED0, DPLL ACTION Position/Value Action 0 Request Register */
#define GTM_DPLL_PSAC20                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSAC *)0xF0128ED0u)

/** \\brief  28ED4, DPLL ACTION Position/Value Action 0 Request Register */
#define GTM_DPLL_PSAC21                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSAC *)0xF0128ED4u)

/** \\brief  28ED8, DPLL ACTION Position/Value Action 0 Request Register */
#define GTM_DPLL_PSAC22                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSAC *)0xF0128ED8u)

/** \\brief  28EDC, DPLL ACTION Position/Value Action 0 Request Register */
#define GTM_DPLL_PSAC23                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSAC *)0xF0128EDCu)

/** \\brief  28EE0, DPLL ACTION Position/Value Action 0 Request Register */
#define GTM_DPLL_PSAC24                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSAC *)0xF0128EE0u)

/** \\brief  28EE4, DPLL ACTION Position/Value Action 0 Request Register */
#define GTM_DPLL_PSAC25                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSAC *)0xF0128EE4u)

/** \\brief  28EE8, DPLL ACTION Position/Value Action 0 Request Register */
#define GTM_DPLL_PSAC26                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSAC *)0xF0128EE8u)

/** \\brief  28EEC, DPLL ACTION Position/Value Action 0 Request Register */
#define GTM_DPLL_PSAC27                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSAC *)0xF0128EECu)

/** \\brief  28EF0, DPLL ACTION Position/Value Action 0 Request Register */
#define GTM_DPLL_PSAC28                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSAC *)0xF0128EF0u)

/** \\brief  28EF4, DPLL ACTION Position/Value Action 0 Request Register */
#define GTM_DPLL_PSAC29                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSAC *)0xF0128EF4u)

/** \\brief  28E8C, DPLL ACTION Position/Value Action 0 Request Register */
#define GTM_DPLL_PSAC3                 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSAC *)0xF0128E8Cu)

/** \\brief  28EF8, DPLL ACTION Position/Value Action 0 Request Register */
#define GTM_DPLL_PSAC30                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSAC *)0xF0128EF8u)

/** \\brief  28EFC, DPLL ACTION Position/Value Action 0 Request Register */
#define GTM_DPLL_PSAC31                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSAC *)0xF0128EFCu)

/** \\brief  28E90, DPLL ACTION Position/Value Action 0 Request Register */
#define GTM_DPLL_PSAC4                 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSAC *)0xF0128E90u)

/** \\brief  28E94, DPLL ACTION Position/Value Action 0 Request Register */
#define GTM_DPLL_PSAC5                 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSAC *)0xF0128E94u)

/** \\brief  28E98, DPLL ACTION Position/Value Action 0 Request Register */
#define GTM_DPLL_PSAC6                 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSAC *)0xF0128E98u)

/** \\brief  28E9C, DPLL ACTION Position/Value Action 0 Request Register */
#define GTM_DPLL_PSAC7                 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSAC *)0xF0128E9Cu)

/** \\brief  28EA0, DPLL ACTION Position/Value Action 0 Request Register */
#define GTM_DPLL_PSAC8                 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSAC *)0xF0128EA0u)

/** \\brief  28EA4, DPLL ACTION Position/Value Action 0 Request Register */
#define GTM_DPLL_PSAC9                 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSAC *)0xF0128EA4u)

/** \\brief  285E4, DPLL Actual Calculated Position Stamp of STATE */
#define GTM_DPLL_PSSC                  /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSSC *)0xF01285E4u)

/** \\brief  285F0, DPLL Measured Position Stamp at Last STATE Input */
#define GTM_DPLL_PSSM                  /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSSM *)0xF01285F0u)

/** \\brief  285F4, DPLL Measured Position Stamp at Last but one STATE Input */
#define GTM_DPLL_PSSM_OLD              /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSSM_OLD *)0xF01285F4u)

/** \\brief  285E0, DPLL Actual Calculated Position Stamp of TRIGGER */
#define GTM_DPLL_PSTC                  /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSTC *)0xF01285E0u)

/** \\brief  285E8, DPLL Measured Position Stamp at Last TRIGGER Input */
#define GTM_DPLL_PSTM                  /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSTM *)0xF01285E8u)

/** \\brief  285EC, DPLL Measured Position Stamp at Last but one TRIGGER Input */
#define GTM_DPLL_PSTM_OLD              /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSTM_OLD *)0xF01285ECu)

/** \\brief  285D0, DPLL Plausibility Value of Next TRIGGER Slope */
#define GTM_DPLL_PVT                   /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PVT *)0xF01285D0u)

/** \\brief  281FC, DPLL RAM Initialization Register */
#define GTM_DPLL_RAM_INI               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RAM_INI *)0xF01281FCu)

/** \\brief  28464, DPLL Reciprocal Value of the Expected Increment Duration of
 * STATE */
#define GTM_DPLL_RCDT_SX               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RCDT_SX *)0xF0128464u)

/** \\brief  2846C, DPLL Reciprocal Value of the Expected Nominal Increment
 * Duration of STATE */
#define GTM_DPLL_RCDT_SX_NOM           /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RCDT_SX_NOM *)0xF012846Cu)

/** \\brief  28460, DPLL Reciprocal Value of the Expected Increment Duration of
 * TRIGGER */
#define GTM_DPLL_RCDT_TX               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RCDT_TX *)0xF0128460u)

/** \\brief  28468, DPLL Reciprocal Value of the Expected Nominal Increment
 * Duration of TRIGGER */
#define GTM_DPLL_RCDT_TX_NOM           /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RCDT_TX_NOM *)0xF0128468u)

/** \\brief  28600, DPLL Reciprocal Values of the Nominal STATE Increment
 * Duration in FULL_SCALE */
#define GTM_DPLL_RDT_S0                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S *)0xF0128600u)

