Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  28604, DPLL Reciprocal Values of the Nominal STATE Increment
 * Duration in FULL_SCALE */
#define GTM_DPLL_RDT_S1                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S *)0xF0128604u)

/** \\brief  28628, DPLL Reciprocal Values of the Nominal STATE Increment
 * Duration in FULL_SCALE */
#define GTM_DPLL_RDT_S10               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S *)0xF0128628u)

/** \\brief  2862C, DPLL Reciprocal Values of the Nominal STATE Increment
 * Duration in FULL_SCALE */
#define GTM_DPLL_RDT_S11               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S *)0xF012862Cu)

/** \\brief  28630, DPLL Reciprocal Values of the Nominal STATE Increment
 * Duration in FULL_SCALE */
#define GTM_DPLL_RDT_S12               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S *)0xF0128630u)

/** \\brief  28634, DPLL Reciprocal Values of the Nominal STATE Increment
 * Duration in FULL_SCALE */
#define GTM_DPLL_RDT_S13               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S *)0xF0128634u)

/** \\brief  28638, DPLL Reciprocal Values of the Nominal STATE Increment
 * Duration in FULL_SCALE */
#define GTM_DPLL_RDT_S14               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S *)0xF0128638u)

/** \\brief  2863C, DPLL Reciprocal Values of the Nominal STATE Increment
 * Duration in FULL_SCALE */
#define GTM_DPLL_RDT_S15               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S *)0xF012863Cu)

/** \\brief  28640, DPLL Reciprocal Values of the Nominal STATE Increment
 * Duration in FULL_SCALE */
#define GTM_DPLL_RDT_S16               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S *)0xF0128640u)

/** \\brief  28644, DPLL Reciprocal Values of the Nominal STATE Increment
 * Duration in FULL_SCALE */
#define GTM_DPLL_RDT_S17               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S *)0xF0128644u)

/** \\brief  28648, DPLL Reciprocal Values of the Nominal STATE Increment
 * Duration in FULL_SCALE */
#define GTM_DPLL_RDT_S18               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S *)0xF0128648u)

/** \\brief  2864C, DPLL Reciprocal Values of the Nominal STATE Increment
 * Duration in FULL_SCALE */
#define GTM_DPLL_RDT_S19               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S *)0xF012864Cu)

/** \\brief  28608, DPLL Reciprocal Values of the Nominal STATE Increment
 * Duration in FULL_SCALE */
#define GTM_DPLL_RDT_S2                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S *)0xF0128608u)

/** \\brief  28650, DPLL Reciprocal Values of the Nominal STATE Increment
 * Duration in FULL_SCALE */
#define GTM_DPLL_RDT_S20               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S *)0xF0128650u)

/** \\brief  28654, DPLL Reciprocal Values of the Nominal STATE Increment
 * Duration in FULL_SCALE */
#define GTM_DPLL_RDT_S21               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S *)0xF0128654u)

/** \\brief  28658, DPLL Reciprocal Values of the Nominal STATE Increment
 * Duration in FULL_SCALE */
#define GTM_DPLL_RDT_S22               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S *)0xF0128658u)

/** \\brief  2865C, DPLL Reciprocal Values of the Nominal STATE Increment
 * Duration in FULL_SCALE */
#define GTM_DPLL_RDT_S23               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S *)0xF012865Cu)

/** \\brief  28660, DPLL Reciprocal Values of the Nominal STATE Increment
 * Duration in FULL_SCALE */
#define GTM_DPLL_RDT_S24               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S *)0xF0128660u)

/** \\brief  28664, DPLL Reciprocal Values of the Nominal STATE Increment
 * Duration in FULL_SCALE */
#define GTM_DPLL_RDT_S25               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S *)0xF0128664u)

/** \\brief  28668, DPLL Reciprocal Values of the Nominal STATE Increment
 * Duration in FULL_SCALE */
#define GTM_DPLL_RDT_S26               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S *)0xF0128668u)

/** \\brief  2866C, DPLL Reciprocal Values of the Nominal STATE Increment
 * Duration in FULL_SCALE */
#define GTM_DPLL_RDT_S27               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S *)0xF012866Cu)

/** \\brief  28670, DPLL Reciprocal Values of the Nominal STATE Increment
 * Duration in FULL_SCALE */
#define GTM_DPLL_RDT_S28               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S *)0xF0128670u)

/** \\brief  28674, DPLL Reciprocal Values of the Nominal STATE Increment
 * Duration in FULL_SCALE */
#define GTM_DPLL_RDT_S29               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S *)0xF0128674u)

/** \\brief  2860C, DPLL Reciprocal Values of the Nominal STATE Increment
 * Duration in FULL_SCALE */
#define GTM_DPLL_RDT_S3                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S *)0xF012860Cu)

/** \\brief  28678, DPLL Reciprocal Values of the Nominal STATE Increment
 * Duration in FULL_SCALE */
#define GTM_DPLL_RDT_S30               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S *)0xF0128678u)

/** \\brief  2867C, DPLL Reciprocal Values of the Nominal STATE Increment
 * Duration in FULL_SCALE */
#define GTM_DPLL_RDT_S31               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S *)0xF012867Cu)

/** \\brief  28680, DPLL Reciprocal Values of the Nominal STATE Increment
 * Duration in FULL_SCALE */
#define GTM_DPLL_RDT_S32               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S *)0xF0128680u)

/** \\brief  28684, DPLL Reciprocal Values of the Nominal STATE Increment
 * Duration in FULL_SCALE */
#define GTM_DPLL_RDT_S33               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S *)0xF0128684u)

/** \\brief  28688, DPLL Reciprocal Values of the Nominal STATE Increment
 * Duration in FULL_SCALE */
#define GTM_DPLL_RDT_S34               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S *)0xF0128688u)

/** \\brief  2868C, DPLL Reciprocal Values of the Nominal STATE Increment
 * Duration in FULL_SCALE */
#define GTM_DPLL_RDT_S35               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S *)0xF012868Cu)

