Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  28690, DPLL Reciprocal Values of the Nominal STATE Increment
 * Duration in FULL_SCALE */
#define GTM_DPLL_RDT_S36               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S *)0xF0128690u)

/** \\brief  28694, DPLL Reciprocal Values of the Nominal STATE Increment
 * Duration in FULL_SCALE */
#define GTM_DPLL_RDT_S37               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S *)0xF0128694u)

/** \\brief  28698, DPLL Reciprocal Values of the Nominal STATE Increment
 * Duration in FULL_SCALE */
#define GTM_DPLL_RDT_S38               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S *)0xF0128698u)

/** \\brief  2869C, DPLL Reciprocal Values of the Nominal STATE Increment
 * Duration in FULL_SCALE */
#define GTM_DPLL_RDT_S39               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S *)0xF012869Cu)

/** \\brief  28610, DPLL Reciprocal Values of the Nominal STATE Increment
 * Duration in FULL_SCALE */
#define GTM_DPLL_RDT_S4                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S *)0xF0128610u)

/** \\brief  286A0, DPLL Reciprocal Values of the Nominal STATE Increment
 * Duration in FULL_SCALE */
#define GTM_DPLL_RDT_S40               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S *)0xF01286A0u)

/** \\brief  286A4, DPLL Reciprocal Values of the Nominal STATE Increment
 * Duration in FULL_SCALE */
#define GTM_DPLL_RDT_S41               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S *)0xF01286A4u)

/** \\brief  286A8, DPLL Reciprocal Values of the Nominal STATE Increment
 * Duration in FULL_SCALE */
#define GTM_DPLL_RDT_S42               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S *)0xF01286A8u)

/** \\brief  286AC, DPLL Reciprocal Values of the Nominal STATE Increment
 * Duration in FULL_SCALE */
#define GTM_DPLL_RDT_S43               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S *)0xF01286ACu)

/** \\brief  286B0, DPLL Reciprocal Values of the Nominal STATE Increment
 * Duration in FULL_SCALE */
#define GTM_DPLL_RDT_S44               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S *)0xF01286B0u)

/** \\brief  286B4, DPLL Reciprocal Values of the Nominal STATE Increment
 * Duration in FULL_SCALE */
#define GTM_DPLL_RDT_S45               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S *)0xF01286B4u)

/** \\brief  286B8, DPLL Reciprocal Values of the Nominal STATE Increment
 * Duration in FULL_SCALE */
#define GTM_DPLL_RDT_S46               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S *)0xF01286B8u)

/** \\brief  286BC, DPLL Reciprocal Values of the Nominal STATE Increment
 * Duration in FULL_SCALE */
#define GTM_DPLL_RDT_S47               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S *)0xF01286BCu)

/** \\brief  286C0, DPLL Reciprocal Values of the Nominal STATE Increment
 * Duration in FULL_SCALE */
#define GTM_DPLL_RDT_S48               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S *)0xF01286C0u)

/** \\brief  286C4, DPLL Reciprocal Values of the Nominal STATE Increment
 * Duration in FULL_SCALE */
#define GTM_DPLL_RDT_S49               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S *)0xF01286C4u)

/** \\brief  28614, DPLL Reciprocal Values of the Nominal STATE Increment
 * Duration in FULL_SCALE */
#define GTM_DPLL_RDT_S5                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S *)0xF0128614u)

/** \\brief  286C8, DPLL Reciprocal Values of the Nominal STATE Increment
 * Duration in FULL_SCALE */
#define GTM_DPLL_RDT_S50               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S *)0xF01286C8u)

/** \\brief  286CC, DPLL Reciprocal Values of the Nominal STATE Increment
 * Duration in FULL_SCALE */
#define GTM_DPLL_RDT_S51               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S *)0xF01286CCu)

/** \\brief  286D0, DPLL Reciprocal Values of the Nominal STATE Increment
 * Duration in FULL_SCALE */
#define GTM_DPLL_RDT_S52               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S *)0xF01286D0u)

/** \\brief  286D4, DPLL Reciprocal Values of the Nominal STATE Increment
 * Duration in FULL_SCALE */
#define GTM_DPLL_RDT_S53               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S *)0xF01286D4u)

/** \\brief  286D8, DPLL Reciprocal Values of the Nominal STATE Increment
 * Duration in FULL_SCALE */
#define GTM_DPLL_RDT_S54               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S *)0xF01286D8u)

/** \\brief  286DC, DPLL Reciprocal Values of the Nominal STATE Increment
 * Duration in FULL_SCALE */
#define GTM_DPLL_RDT_S55               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S *)0xF01286DCu)

/** \\brief  286E0, DPLL Reciprocal Values of the Nominal STATE Increment
 * Duration in FULL_SCALE */
#define GTM_DPLL_RDT_S56               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S *)0xF01286E0u)

/** \\brief  286E4, DPLL Reciprocal Values of the Nominal STATE Increment
 * Duration in FULL_SCALE */
#define GTM_DPLL_RDT_S57               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S *)0xF01286E4u)

/** \\brief  286E8, DPLL Reciprocal Values of the Nominal STATE Increment
 * Duration in FULL_SCALE */
#define GTM_DPLL_RDT_S58               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S *)0xF01286E8u)

/** \\brief  286EC, DPLL Reciprocal Values of the Nominal STATE Increment
 * Duration in FULL_SCALE */
#define GTM_DPLL_RDT_S59               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S *)0xF01286ECu)

/** \\brief  28618, DPLL Reciprocal Values of the Nominal STATE Increment
 * Duration in FULL_SCALE */
#define GTM_DPLL_RDT_S6                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S *)0xF0128618u)

/** \\brief  286F0, DPLL Reciprocal Values of the Nominal STATE Increment
 * Duration in FULL_SCALE */
#define GTM_DPLL_RDT_S60               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S *)0xF01286F0u)

/** \\brief  286F4, DPLL Reciprocal Values of the Nominal STATE Increment
 * Duration in FULL_SCALE */
#define GTM_DPLL_RDT_S61               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S *)0xF01286F4u)

/** \\brief  286F8, DPLL Reciprocal Values of the Nominal STATE Increment
 * Duration in FULL_SCALE */
#define GTM_DPLL_RDT_S62               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S *)0xF01286F8u)

