Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  286FC, DPLL Reciprocal Values of the Nominal STATE Increment
 * Duration in FULL_SCALE */
#define GTM_DPLL_RDT_S63               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S *)0xF01286FCu)

/** \\brief  2861C, DPLL Reciprocal Values of the Nominal STATE Increment
 * Duration in FULL_SCALE */
#define GTM_DPLL_RDT_S7                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S *)0xF012861Cu)

/** \\brief  28620, DPLL Reciprocal Values of the Nominal STATE Increment
 * Duration in FULL_SCALE */
#define GTM_DPLL_RDT_S8                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S *)0xF0128620u)

/** \\brief  28624, DPLL Reciprocal Values of the Nominal STATE Increment
 * Duration in FULL_SCALE */
#define GTM_DPLL_RDT_S9                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S *)0xF0128624u)

/** \\brief  28474, DPLL Reciprocal Value of the Last Increment of STATE */
#define GTM_DPLL_RDT_S_ACT             /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S_ACT *)0xF0128474u)

/** \\brief  28470, DPLL Reciprocal Value of the Last Increment of TRIGGER */
#define GTM_DPLL_RDT_T_ACT             /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_T_ACT *)0xF0128470u)

/** \\brief  28F2C, DPLL Additional STATE Input Delay Register */
#define GTM_DPLL_SIDEL                 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_SIDEL *)0xF0128F2Cu)

/** \\brief  284A4, DPLL STATE Locking Range */
#define GTM_DPLL_SLR                   /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_SLR *)0xF01284A4u)

/** \\brief  28F40, DPLL Status of the State Machine States Register */
#define GTM_DPLL_STA                   /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_STA *)0xF0128F40u)

/** \\brief  28F58, DPLL STA Flag Register */
#define GTM_DPLL_STA_FLAG              /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_STA_FLAG *)0xF0128F58u)

/** \\brief  28F54, DPLL Trigger Masks for Signals DPLL_STA_T and DPLL_STA_S */
#define GTM_DPLL_STA_MASK              /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_STA_MASK *)0xF0128F54u)

/** \\brief  280FC, DPLL Status Register */
#define GTM_DPLL_STATUS                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_STATUS *)0xF01280FCu)

/** \\brief  280C4, DPLL TBU_TS0 Value at last STATE Event */
#define GTM_DPLL_TBU_TS0_S             /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TBU_TS0_S *)0xF01280C4u)

/** \\brief  280C0, DPLL TBU_TS0 Value at last TRIGGER Event */
#define GTM_DPLL_TBU_TS0_T             /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TBU_TS0_T *)0xF01280C0u)

/** \\brief  28424, DPLL TRIGGER Hold Time Maximum Value */
#define GTM_DPLL_THMA                  /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_THMA *)0xF0128424u)

/** \\brief  28420, DPLL TRIGGER Hold Time Minimum Value */
#define GTM_DPLL_THMI                  /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_THMI *)0xF0128420u)

/** \\brief  28428, DPLL Measured TRIGGER Hold Time Value */
#define GTM_DPLL_THVAL                 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_THVAL *)0xF0128428u)

/** \\brief  28F24, DPLL Immediate THVAL Value Register */
#define GTM_DPLL_THVAL2                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_THVAL2 *)0xF0128F24u)

/** \\brief  28F28, DPLL Additional TRIGGER Input Register */
#define GTM_DPLL_TIDEL                 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TIDEL *)0xF0128F28u)

/** \\brief  284A0, DPLL TRIGGER Locking Range */
#define GTM_DPLL_TLR                   /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TLR *)0xF01284A0u)

/** \\brief  28430, DPLL Time Out Value of Active TRIGGER Slope */
#define GTM_DPLL_TOV                   /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TOV *)0xF0128430u)

/** \\brief  28434, DPLL Time Out Value of active STATE Slope */
#define GTM_DPLL_TOV_S                 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TOV_S *)0xF0128434u)

/** \\brief  28410, DPLL Actual STATE Time Stamp */
#define GTM_DPLL_TS_S                  /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TS_S *)0xF0128410u)

/** \\brief  28414, DPLL Previous STATE Time Stamp */
#define GTM_DPLL_TS_S_OLD              /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TS_S_OLD *)0xF0128414u)

/** \\brief  28400, DPLL Actual TRIGGER Time Stamp Value */
#define GTM_DPLL_TS_T                  /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TS_T *)0xF0128400u)

/** \\brief  28404, DPLL Previous TRIGGER Time Stamp Value */
#define GTM_DPLL_TS_T_OLD              /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TS_T_OLD *)0xF0128404u)

/** \\brief  28E00, DPLL Calculated Time Value to start Action 0 Register */
#define GTM_DPLL_TSAC0                 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSAC *)0xF0128E00u)

/** \\brief  28E04, DPLL Calculated Time Value to start Action 0 Register */
#define GTM_DPLL_TSAC1                 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSAC *)0xF0128E04u)

/** \\brief  28E28, DPLL Calculated Time Value to start Action 0 Register */
#define GTM_DPLL_TSAC10                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSAC *)0xF0128E28u)

/** \\brief  28E2C, DPLL Calculated Time Value to start Action 0 Register */
#define GTM_DPLL_TSAC11                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSAC *)0xF0128E2Cu)

/** \\brief  28E30, DPLL Calculated Time Value to start Action 0 Register */
#define GTM_DPLL_TSAC12                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSAC *)0xF0128E30u)

/** \\brief  28E34, DPLL Calculated Time Value to start Action 0 Register */
#define GTM_DPLL_TSAC13                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSAC *)0xF0128E34u)

/** \\brief  28E38, DPLL Calculated Time Value to start Action 0 Register */
#define GTM_DPLL_TSAC14                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSAC *)0xF0128E38u)

/** \\brief  28E3C, DPLL Calculated Time Value to start Action 0 Register */
#define GTM_DPLL_TSAC15                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSAC *)0xF0128E3Cu)

/** \\brief  28E40, DPLL Calculated Time Value to start Action 0 Register */
#define GTM_DPLL_TSAC16                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSAC *)0xF0128E40u)

/** \\brief  28E44, DPLL Calculated Time Value to start Action 0 Register */
#define GTM_DPLL_TSAC17                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSAC *)0xF0128E44u)

/** \\brief  28E48, DPLL Calculated Time Value to start Action 0 Register */
#define GTM_DPLL_TSAC18                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSAC *)0xF0128E48u)

/** \\brief  28E4C, DPLL Calculated Time Value to start Action 0 Register */
#define GTM_DPLL_TSAC19                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSAC *)0xF0128E4Cu)

/** \\brief  28E08, DPLL Calculated Time Value to start Action 0 Register */
#define GTM_DPLL_TSAC2                 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSAC *)0xF0128E08u)

