Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  28E50, DPLL Calculated Time Value to start Action 0 Register */
#define GTM_DPLL_TSAC20                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSAC *)0xF0128E50u)

/** \\brief  28E54, DPLL Calculated Time Value to start Action 0 Register */
#define GTM_DPLL_TSAC21                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSAC *)0xF0128E54u)

/** \\brief  28E58, DPLL Calculated Time Value to start Action 0 Register */
#define GTM_DPLL_TSAC22                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSAC *)0xF0128E58u)

/** \\brief  28E5C, DPLL Calculated Time Value to start Action 0 Register */
#define GTM_DPLL_TSAC23                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSAC *)0xF0128E5Cu)

/** \\brief  28E60, DPLL Calculated Time Value to start Action 0 Register */
#define GTM_DPLL_TSAC24                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSAC *)0xF0128E60u)

/** \\brief  28E64, DPLL Calculated Time Value to start Action 0 Register */
#define GTM_DPLL_TSAC25                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSAC *)0xF0128E64u)

/** \\brief  28E68, DPLL Calculated Time Value to start Action 0 Register */
#define GTM_DPLL_TSAC26                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSAC *)0xF0128E68u)

/** \\brief  28E6C, DPLL Calculated Time Value to start Action 0 Register */
#define GTM_DPLL_TSAC27                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSAC *)0xF0128E6Cu)

/** \\brief  28E70, DPLL Calculated Time Value to start Action 0 Register */
#define GTM_DPLL_TSAC28                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSAC *)0xF0128E70u)

/** \\brief  28E74, DPLL Calculated Time Value to start Action 0 Register */
#define GTM_DPLL_TSAC29                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSAC *)0xF0128E74u)

/** \\brief  28E0C, DPLL Calculated Time Value to start Action 0 Register */
#define GTM_DPLL_TSAC3                 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSAC *)0xF0128E0Cu)

/** \\brief  28E78, DPLL Calculated Time Value to start Action 0 Register */
#define GTM_DPLL_TSAC30                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSAC *)0xF0128E78u)

/** \\brief  28E7C, DPLL Calculated Time Value to start Action 0 Register */
#define GTM_DPLL_TSAC31                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSAC *)0xF0128E7Cu)

/** \\brief  28E10, DPLL Calculated Time Value to start Action 0 Register */
#define GTM_DPLL_TSAC4                 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSAC *)0xF0128E10u)

/** \\brief  28E14, DPLL Calculated Time Value to start Action 0 Register */
#define GTM_DPLL_TSAC5                 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSAC *)0xF0128E14u)

/** \\brief  28E18, DPLL Calculated Time Value to start Action 0 Register */
#define GTM_DPLL_TSAC6                 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSAC *)0xF0128E18u)

/** \\brief  28E1C, DPLL Calculated Time Value to start Action 0 Register */
#define GTM_DPLL_TSAC7                 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSAC *)0xF0128E1Cu)

/** \\brief  28E20, DPLL Calculated Time Value to start Action 0 Register */
#define GTM_DPLL_TSAC8                 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSAC *)0xF0128E20u)

/** \\brief  28E24, DPLL Calculated Time Value to start Action 0 Register */
#define GTM_DPLL_TSAC9                 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSAC *)0xF0128E24u)

/** \\brief  28700, DPLL Time Stamp Values of the Nominal STATE Events in
 * FULL_SCALE */
#define GTM_DPLL_TSF_S0                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSF_S *)0xF0128700u)

/** \\brief  28704, DPLL Time Stamp Values of the Nominal STATE Events in
 * FULL_SCALE */
#define GTM_DPLL_TSF_S1                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSF_S *)0xF0128704u)

/** \\brief  28728, DPLL Time Stamp Values of the Nominal STATE Events in
 * FULL_SCALE */
#define GTM_DPLL_TSF_S10               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSF_S *)0xF0128728u)

/** \\brief  2872C, DPLL Time Stamp Values of the Nominal STATE Events in
 * FULL_SCALE */
#define GTM_DPLL_TSF_S11               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSF_S *)0xF012872Cu)

/** \\brief  28730, DPLL Time Stamp Values of the Nominal STATE Events in
 * FULL_SCALE */
#define GTM_DPLL_TSF_S12               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSF_S *)0xF0128730u)

/** \\brief  28734, DPLL Time Stamp Values of the Nominal STATE Events in
 * FULL_SCALE */
#define GTM_DPLL_TSF_S13               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSF_S *)0xF0128734u)

/** \\brief  28738, DPLL Time Stamp Values of the Nominal STATE Events in
 * FULL_SCALE */
#define GTM_DPLL_TSF_S14               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSF_S *)0xF0128738u)

/** \\brief  2873C, DPLL Time Stamp Values of the Nominal STATE Events in
 * FULL_SCALE */
#define GTM_DPLL_TSF_S15               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSF_S *)0xF012873Cu)

/** \\brief  28740, DPLL Time Stamp Values of the Nominal STATE Events in
 * FULL_SCALE */
#define GTM_DPLL_TSF_S16               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSF_S *)0xF0128740u)

/** \\brief  28744, DPLL Time Stamp Values of the Nominal STATE Events in
 * FULL_SCALE */
#define GTM_DPLL_TSF_S17               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSF_S *)0xF0128744u)

/** \\brief  28748, DPLL Time Stamp Values of the Nominal STATE Events in
 * FULL_SCALE */
#define GTM_DPLL_TSF_S18               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSF_S *)0xF0128748u)

/** \\brief  2874C, DPLL Time Stamp Values of the Nominal STATE Events in
 * FULL_SCALE */
#define GTM_DPLL_TSF_S19               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSF_S *)0xF012874Cu)

/** \\brief  28708, DPLL Time Stamp Values of the Nominal STATE Events in
 * FULL_SCALE */
#define GTM_DPLL_TSF_S2                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSF_S *)0xF0128708u)

/** \\brief  28750, DPLL Time Stamp Values of the Nominal STATE Events in
 * FULL_SCALE */
#define GTM_DPLL_TSF_S20               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSF_S *)0xF0128750u)

/** \\brief  28754, DPLL Time Stamp Values of the Nominal STATE Events in
 * FULL_SCALE */
#define GTM_DPLL_TSF_S21               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSF_S *)0xF0128754u)

/** \\brief  28758, DPLL Time Stamp Values of the Nominal STATE Events in
 * FULL_SCALE */
#define GTM_DPLL_TSF_S22               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSF_S *)0xF0128758u)

/** \\brief  2875C, DPLL Time Stamp Values of the Nominal STATE Events in
 * FULL_SCALE */
#define GTM_DPLL_TSF_S23               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSF_S *)0xF012875Cu)

/** \\brief  28760, DPLL Time Stamp Values of the Nominal STATE Events in
 * FULL_SCALE */
#define GTM_DPLL_TSF_S24               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSF_S *)0xF0128760u)

/** \\brief  28764, DPLL Time Stamp Values of the Nominal STATE Events in
 * FULL_SCALE */
#define GTM_DPLL_TSF_S25               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSF_S *)0xF0128764u)

/** \\brief  28768, DPLL Time Stamp Values of the Nominal STATE Events in
 * FULL_SCALE */
#define GTM_DPLL_TSF_S26               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSF_S *)0xF0128768u)

/** \\brief  2876C, DPLL Time Stamp Values of the Nominal STATE Events in
 * FULL_SCALE */
#define GTM_DPLL_TSF_S27               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSF_S *)0xF012876Cu)

/** \\brief  28770, DPLL Time Stamp Values of the Nominal STATE Events in
 * FULL_SCALE */
#define GTM_DPLL_TSF_S28               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSF_S *)0xF0128770u)

/** \\brief  28774, DPLL Time Stamp Values of the Nominal STATE Events in
 * FULL_SCALE */
#define GTM_DPLL_TSF_S29               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSF_S *)0xF0128774u)

/** \\brief  2870C, DPLL Time Stamp Values of the Nominal STATE Events in
 * FULL_SCALE */
#define GTM_DPLL_TSF_S3                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSF_S *)0xF012870Cu)

/** \\brief  28778, DPLL Time Stamp Values of the Nominal STATE Events in
 * FULL_SCALE */
#define GTM_DPLL_TSF_S30               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSF_S *)0xF0128778u)

/** \\brief  2877C, DPLL Time Stamp Values of the Nominal STATE Events in
 * FULL_SCALE */
#define GTM_DPLL_TSF_S31               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSF_S *)0xF012877Cu)

/** \\brief  28780, DPLL Time Stamp Values of the Nominal STATE Events in
 * FULL_SCALE */
#define GTM_DPLL_TSF_S32               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSF_S *)0xF0128780u)

/** \\brief  28784, DPLL Time Stamp Values of the Nominal STATE Events in
 * FULL_SCALE */
#define GTM_DPLL_TSF_S33               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSF_S *)0xF0128784u)

/** \\brief  28788, DPLL Time Stamp Values of the Nominal STATE Events in
 * FULL_SCALE */
#define GTM_DPLL_TSF_S34               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSF_S *)0xF0128788u)

/** \\brief  2878C, DPLL Time Stamp Values of the Nominal STATE Events in
 * FULL_SCALE */
#define GTM_DPLL_TSF_S35               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSF_S *)0xF012878Cu)

/** \\brief  28790, DPLL Time Stamp Values of the Nominal STATE Events in
 * FULL_SCALE */
#define GTM_DPLL_TSF_S36               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSF_S *)0xF0128790u)

/** \\brief  28794, DPLL Time Stamp Values of the Nominal STATE Events in
 * FULL_SCALE */
#define GTM_DPLL_TSF_S37               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSF_S *)0xF0128794u)

/** \\brief  28798, DPLL Time Stamp Values of the Nominal STATE Events in
 * FULL_SCALE */
#define GTM_DPLL_TSF_S38               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSF_S *)0xF0128798u)

/** \\brief  2879C, DPLL Time Stamp Values of the Nominal STATE Events in
 * FULL_SCALE */
#define GTM_DPLL_TSF_S39               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSF_S *)0xF012879Cu)

/** \\brief  28710, DPLL Time Stamp Values of the Nominal STATE Events in
 * FULL_SCALE */
#define GTM_DPLL_TSF_S4                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSF_S *)0xF0128710u)

/** \\brief  287A0, DPLL Time Stamp Values of the Nominal STATE Events in
 * FULL_SCALE */
#define GTM_DPLL_TSF_S40               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSF_S *)0xF01287A0u)

/** \\brief  287A4, DPLL Time Stamp Values of the Nominal STATE Events in
 * FULL_SCALE */
#define GTM_DPLL_TSF_S41               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSF_S *)0xF01287A4u)

/** \\brief  287A8, DPLL Time Stamp Values of the Nominal STATE Events in
 * FULL_SCALE */
#define GTM_DPLL_TSF_S42               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSF_S *)0xF01287A8u)

/** \\brief  287AC, DPLL Time Stamp Values of the Nominal STATE Events in
 * FULL_SCALE */
#define GTM_DPLL_TSF_S43               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSF_S *)0xF01287ACu)

/** \\brief  287B0, DPLL Time Stamp Values of the Nominal STATE Events in
 * FULL_SCALE */
#define GTM_DPLL_TSF_S44               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSF_S *)0xF01287B0u)

/** \\brief  287B4, DPLL Time Stamp Values of the Nominal STATE Events in
 * FULL_SCALE */
#define GTM_DPLL_TSF_S45               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSF_S *)0xF01287B4u)

/** \\brief  287B8, DPLL Time Stamp Values of the Nominal STATE Events in
 * FULL_SCALE */
#define GTM_DPLL_TSF_S46               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSF_S *)0xF01287B8u)

/** \\brief  287BC, DPLL Time Stamp Values of the Nominal STATE Events in
 * FULL_SCALE */
#define GTM_DPLL_TSF_S47               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSF_S *)0xF01287BCu)

/** \\brief  287C0, DPLL Time Stamp Values of the Nominal STATE Events in
 * FULL_SCALE */
#define GTM_DPLL_TSF_S48               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSF_S *)0xF01287C0u)

/** \\brief  287C4, DPLL Time Stamp Values of the Nominal STATE Events in
 * FULL_SCALE */
#define GTM_DPLL_TSF_S49               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSF_S *)0xF01287C4u)

/** \\brief  28714, DPLL Time Stamp Values of the Nominal STATE Events in
 * FULL_SCALE */
#define GTM_DPLL_TSF_S5                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSF_S *)0xF0128714u)

/** \\brief  287C8, DPLL Time Stamp Values of the Nominal STATE Events in
 * FULL_SCALE */
#define GTM_DPLL_TSF_S50               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSF_S *)0xF01287C8u)

/** \\brief  287CC, DPLL Time Stamp Values of the Nominal STATE Events in
 * FULL_SCALE */
#define GTM_DPLL_TSF_S51               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSF_S *)0xF01287CCu)

/** \\brief  287D0, DPLL Time Stamp Values of the Nominal STATE Events in
 * FULL_SCALE */
#define GTM_DPLL_TSF_S52               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSF_S *)0xF01287D0u)

/** \\brief  287D4, DPLL Time Stamp Values of the Nominal STATE Events in
 * FULL_SCALE */
#define GTM_DPLL_TSF_S53               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSF_S *)0xF01287D4u)

/** \\brief  287D8, DPLL Time Stamp Values of the Nominal STATE Events in
 * FULL_SCALE */
#define GTM_DPLL_TSF_S54               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSF_S *)0xF01287D8u)

/** \\brief  287DC, DPLL Time Stamp Values of the Nominal STATE Events in
 * FULL_SCALE */
#define GTM_DPLL_TSF_S55               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSF_S *)0xF01287DCu)

/** \\brief  287E0, DPLL Time Stamp Values of the Nominal STATE Events in
 * FULL_SCALE */
#define GTM_DPLL_TSF_S56               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSF_S *)0xF01287E0u)

/** \\brief  287E4, DPLL Time Stamp Values of the Nominal STATE Events in
 * FULL_SCALE */
#define GTM_DPLL_TSF_S57               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSF_S *)0xF01287E4u)

/** \\brief  287E8, DPLL Time Stamp Values of the Nominal STATE Events in
 * FULL_SCALE */
#define GTM_DPLL_TSF_S58               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSF_S *)0xF01287E8u)

/** \\brief  287EC, DPLL Time Stamp Values of the Nominal STATE Events in
 * FULL_SCALE */
#define GTM_DPLL_TSF_S59               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSF_S *)0xF01287ECu)

/** \\brief  28718, DPLL Time Stamp Values of the Nominal STATE Events in
 * FULL_SCALE */
#define GTM_DPLL_TSF_S6                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSF_S *)0xF0128718u)

/** \\brief  287F0, DPLL Time Stamp Values of the Nominal STATE Events in
 * FULL_SCALE */
#define GTM_DPLL_TSF_S60               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSF_S *)0xF01287F0u)

/** \\brief  287F4, DPLL Time Stamp Values of the Nominal STATE Events in
 * FULL_SCALE */
#define GTM_DPLL_TSF_S61               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSF_S *)0xF01287F4u)

/** \\brief  287F8, DPLL Time Stamp Values of the Nominal STATE Events in
 * FULL_SCALE */
#define GTM_DPLL_TSF_S62               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSF_S *)0xF01287F8u)

/** \\brief  287FC, DPLL Time Stamp Values of the Nominal STATE Events in
 * FULL_SCALE */
#define GTM_DPLL_TSF_S63               /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSF_S *)0xF01287FCu)

/** \\brief  2871C, DPLL Time Stamp Values of the Nominal STATE Events in
 * FULL_SCALE */
#define GTM_DPLL_TSF_S7                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSF_S *)0xF012871Cu)

/** \\brief  28720, DPLL Time Stamp Values of the Nominal STATE Events in
 * FULL_SCALE */
#define GTM_DPLL_TSF_S8                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSF_S *)0xF0128720u)

/** \\brief  28724, DPLL Time Stamp Values of the Nominal STATE Events in
 * FULL_SCALE */
#define GTM_DPLL_TSF_S9                /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSF_S *)0xF0128724u)

/** \\brief  9FFAC, DTM_AUX Input Selection Register */
#define GTM_DTMAUXINSEL                /*lint --e(923)*/ (*(volatile Ifx_GTM_DTMAUXINSEL *)0xF019FFACu)

