Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  20, GTM Error interrupt enable register */
#define GTM_EIRQ_EN                    /*lint --e(923)*/ (*(volatile Ifx_GTM_EIRQ_EN *)0xF0100020u)

/** \\brief  5C, GTM external capture trigger enable 0 */
#define GTM_EXT_CAP_EN0                /*lint --e(923)*/ (*(volatile Ifx_GTM_EXT_CAP_EN *)0xF010005Cu)

/** Alias (User Manual Name) for GTM_EXT_CAP_EN0.
 * To use register names with standard convension, please use GTM_EXT_CAP_EN0.
 */
#define GTM_EXT_CAP_EN_0               (GTM_EXT_CAP_EN0)

/** Alias (User Manual Name) for GTM_EXT_CAP_EN0.
 * To use register names with standard convension, please use GTM_EXT_CAP_EN0.
 */
#define GTM_EXT_CAP_EN_0               (GTM_EXT_CAP_EN0)

/** \\brief  60, GTM external capture trigger enable 0 */
#define GTM_EXT_CAP_EN1                /*lint --e(923)*/ (*(volatile Ifx_GTM_EXT_CAP_EN *)0xF0100060u)

/** Alias (User Manual Name) for GTM_EXT_CAP_EN1.
 * To use register names with standard convension, please use GTM_EXT_CAP_EN1.
 */
#define GTM_EXT_CAP_EN_1               (GTM_EXT_CAP_EN1)

/** Alias (User Manual Name) for GTM_EXT_CAP_EN1.
 * To use register names with standard convension, please use GTM_EXT_CAP_EN1.
 */
#define GTM_EXT_CAP_EN_1               (GTM_EXT_CAP_EN1)

/** \\brief  64, GTM external capture trigger enable 0 */
#define GTM_EXT_CAP_EN2                /*lint --e(923)*/ (*(volatile Ifx_GTM_EXT_CAP_EN *)0xF0100064u)

/** Alias (User Manual Name) for GTM_EXT_CAP_EN2.
 * To use register names with standard convension, please use GTM_EXT_CAP_EN2.
 */
#define GTM_EXT_CAP_EN_2               (GTM_EXT_CAP_EN2)

/** Alias (User Manual Name) for GTM_EXT_CAP_EN2.
 * To use register names with standard convension, please use GTM_EXT_CAP_EN2.
 */
#define GTM_EXT_CAP_EN_2               (GTM_EXT_CAP_EN2)

/** \\brief  68, GTM external capture trigger enable 0 */
#define GTM_EXT_CAP_EN3                /*lint --e(923)*/ (*(volatile Ifx_GTM_EXT_CAP_EN *)0xF0100068u)

/** Alias (User Manual Name) for GTM_EXT_CAP_EN3.
 * To use register names with standard convension, please use GTM_EXT_CAP_EN3.
 */
#define GTM_EXT_CAP_EN_3               (GTM_EXT_CAP_EN3)

/** Alias (User Manual Name) for GTM_EXT_CAP_EN3.
 * To use register names with standard convension, please use GTM_EXT_CAP_EN3.
 */
#define GTM_EXT_CAP_EN_3               (GTM_EXT_CAP_EN3)

/** \\brief  6C, GTM external capture trigger enable 0 */
#define GTM_EXT_CAP_EN4                /*lint --e(923)*/ (*(volatile Ifx_GTM_EXT_CAP_EN *)0xF010006Cu)

/** Alias (User Manual Name) for GTM_EXT_CAP_EN4.
 * To use register names with standard convension, please use GTM_EXT_CAP_EN4.
 */
#define GTM_EXT_CAP_EN_4               (GTM_EXT_CAP_EN4)

/** Alias (User Manual Name) for GTM_EXT_CAP_EN4.
 * To use register names with standard convension, please use GTM_EXT_CAP_EN4.
 */
#define GTM_EXT_CAP_EN_4               (GTM_EXT_CAP_EN4)

/** \\brief  70, GTM external capture trigger enable 0 */
#define GTM_EXT_CAP_EN5                /*lint --e(923)*/ (*(volatile Ifx_GTM_EXT_CAP_EN *)0xF0100070u)

/** Alias (User Manual Name) for GTM_EXT_CAP_EN5.
 * To use register names with standard convension, please use GTM_EXT_CAP_EN5.
 */
#define GTM_EXT_CAP_EN_5               (GTM_EXT_CAP_EN5)

/** Alias (User Manual Name) for GTM_EXT_CAP_EN5.
 * To use register names with standard convension, please use GTM_EXT_CAP_EN5.
 */
#define GTM_EXT_CAP_EN_5               (GTM_EXT_CAP_EN5)

/** \\brief  74, GTM external capture trigger enable 0 */
#define GTM_EXT_CAP_EN6                /*lint --e(923)*/ (*(volatile Ifx_GTM_EXT_CAP_EN *)0xF0100074u)

/** Alias (User Manual Name) for GTM_EXT_CAP_EN6.
 * To use register names with standard convension, please use GTM_EXT_CAP_EN6.
 */
#define GTM_EXT_CAP_EN_6               (GTM_EXT_CAP_EN6)

/** Alias (User Manual Name) for GTM_EXT_CAP_EN6.
 * To use register names with standard convension, please use GTM_EXT_CAP_EN6.
 */
#define GTM_EXT_CAP_EN_6               (GTM_EXT_CAP_EN6)

/** \\brief  78, GTM external capture trigger enable 0 */
#define GTM_EXT_CAP_EN7                /*lint --e(923)*/ (*(volatile Ifx_GTM_EXT_CAP_EN *)0xF0100078u)

/** Alias (User Manual Name) for GTM_EXT_CAP_EN7.
 * To use register names with standard convension, please use GTM_EXT_CAP_EN7.
 */
#define GTM_EXT_CAP_EN_7               (GTM_EXT_CAP_EN7)

/** Alias (User Manual Name) for GTM_EXT_CAP_EN7.
 * To use register names with standard convension, please use GTM_EXT_CAP_EN7.
 */
#define GTM_EXT_CAP_EN_7               (GTM_EXT_CAP_EN7)

/** \\brief  18044, F2A0 stream control register */
#define GTM_F2A0_CTRL                  /*lint --e(923)*/ (*(volatile Ifx_GTM_F2A_CTRL *)0xF0118044u)

/** \\brief  18040, F2A0 stream activation register */
#define GTM_F2A0_ENABLE                /*lint --e(923)*/ (*(volatile Ifx_GTM_F2A_ENABLE *)0xF0118040u)

/** \\brief  18000, F2A0 stream 0 read address register */
#define GTM_F2A0_RD_CH0_ARU_RD_FIFO    /*lint --e(923)*/ (*(volatile Ifx_GTM_F2A_RD_CH_ARU_RD_FIFO *)0xF0118000u)

/** Alias (User Manual Name) for GTM_F2A0_RD_CH0_ARU_RD_FIFO.
 * To use register names with standard convension, please use GTM_F2A0_RD_CH0_ARU_RD_FIFO.
 */
#define GTM_F2A0_CH0_ARU_RD_FIFO       (GTM_F2A0_RD_CH0_ARU_RD_FIFO)

/** Alias (User Manual Name) for GTM_F2A0_RD_CH0_ARU_RD_FIFO.
 * To use register names with standard convension, please use GTM_F2A0_RD_CH0_ARU_RD_FIFO.
 */
#define GTM_F2A0_CH0_ARU_RD_FIFO       (GTM_F2A0_RD_CH0_ARU_RD_FIFO)

/** \\brief  18004, F2A0 stream 0 read address register */
#define GTM_F2A0_RD_CH1_ARU_RD_FIFO    /*lint --e(923)*/ (*(volatile Ifx_GTM_F2A_RD_CH_ARU_RD_FIFO *)0xF0118004u)

/** Alias (User Manual Name) for GTM_F2A0_RD_CH1_ARU_RD_FIFO.
 * To use register names with standard convension, please use GTM_F2A0_RD_CH1_ARU_RD_FIFO.
 */
#define GTM_F2A0_CH1_ARU_RD_FIFO       (GTM_F2A0_RD_CH1_ARU_RD_FIFO)

/** Alias (User Manual Name) for GTM_F2A0_RD_CH1_ARU_RD_FIFO.
 * To use register names with standard convension, please use GTM_F2A0_RD_CH1_ARU_RD_FIFO.
 */
#define GTM_F2A0_CH1_ARU_RD_FIFO       (GTM_F2A0_RD_CH1_ARU_RD_FIFO)

