Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  18008, F2A0 stream 0 read address register */
#define GTM_F2A0_RD_CH2_ARU_RD_FIFO    /*lint --e(923)*/ (*(volatile Ifx_GTM_F2A_RD_CH_ARU_RD_FIFO *)0xF0118008u)

/** Alias (User Manual Name) for GTM_F2A0_RD_CH2_ARU_RD_FIFO.
 * To use register names with standard convension, please use GTM_F2A0_RD_CH2_ARU_RD_FIFO.
 */
#define GTM_F2A0_CH2_ARU_RD_FIFO       (GTM_F2A0_RD_CH2_ARU_RD_FIFO)

/** Alias (User Manual Name) for GTM_F2A0_RD_CH2_ARU_RD_FIFO.
 * To use register names with standard convension, please use GTM_F2A0_RD_CH2_ARU_RD_FIFO.
 */
#define GTM_F2A0_CH2_ARU_RD_FIFO       (GTM_F2A0_RD_CH2_ARU_RD_FIFO)

/** \\brief  1800C, F2A0 stream 0 read address register */
#define GTM_F2A0_RD_CH3_ARU_RD_FIFO    /*lint --e(923)*/ (*(volatile Ifx_GTM_F2A_RD_CH_ARU_RD_FIFO *)0xF011800Cu)

/** Alias (User Manual Name) for GTM_F2A0_RD_CH3_ARU_RD_FIFO.
 * To use register names with standard convension, please use GTM_F2A0_RD_CH3_ARU_RD_FIFO.
 */
#define GTM_F2A0_CH3_ARU_RD_FIFO       (GTM_F2A0_RD_CH3_ARU_RD_FIFO)

/** Alias (User Manual Name) for GTM_F2A0_RD_CH3_ARU_RD_FIFO.
 * To use register names with standard convension, please use GTM_F2A0_RD_CH3_ARU_RD_FIFO.
 */
#define GTM_F2A0_CH3_ARU_RD_FIFO       (GTM_F2A0_RD_CH3_ARU_RD_FIFO)

/** \\brief  18010, F2A0 stream 0 read address register */
#define GTM_F2A0_RD_CH4_ARU_RD_FIFO    /*lint --e(923)*/ (*(volatile Ifx_GTM_F2A_RD_CH_ARU_RD_FIFO *)0xF0118010u)

/** Alias (User Manual Name) for GTM_F2A0_RD_CH4_ARU_RD_FIFO.
 * To use register names with standard convension, please use GTM_F2A0_RD_CH4_ARU_RD_FIFO.
 */
#define GTM_F2A0_CH4_ARU_RD_FIFO       (GTM_F2A0_RD_CH4_ARU_RD_FIFO)

/** Alias (User Manual Name) for GTM_F2A0_RD_CH4_ARU_RD_FIFO.
 * To use register names with standard convension, please use GTM_F2A0_RD_CH4_ARU_RD_FIFO.
 */
#define GTM_F2A0_CH4_ARU_RD_FIFO       (GTM_F2A0_RD_CH4_ARU_RD_FIFO)

/** \\brief  18014, F2A0 stream 0 read address register */
#define GTM_F2A0_RD_CH5_ARU_RD_FIFO    /*lint --e(923)*/ (*(volatile Ifx_GTM_F2A_RD_CH_ARU_RD_FIFO *)0xF0118014u)

/** Alias (User Manual Name) for GTM_F2A0_RD_CH5_ARU_RD_FIFO.
 * To use register names with standard convension, please use GTM_F2A0_RD_CH5_ARU_RD_FIFO.
 */
#define GTM_F2A0_CH5_ARU_RD_FIFO       (GTM_F2A0_RD_CH5_ARU_RD_FIFO)

/** Alias (User Manual Name) for GTM_F2A0_RD_CH5_ARU_RD_FIFO.
 * To use register names with standard convension, please use GTM_F2A0_RD_CH5_ARU_RD_FIFO.
 */
#define GTM_F2A0_CH5_ARU_RD_FIFO       (GTM_F2A0_RD_CH5_ARU_RD_FIFO)

/** \\brief  18018, F2A0 stream 0 read address register */
#define GTM_F2A0_RD_CH6_ARU_RD_FIFO    /*lint --e(923)*/ (*(volatile Ifx_GTM_F2A_RD_CH_ARU_RD_FIFO *)0xF0118018u)

/** Alias (User Manual Name) for GTM_F2A0_RD_CH6_ARU_RD_FIFO.
 * To use register names with standard convension, please use GTM_F2A0_RD_CH6_ARU_RD_FIFO.
 */
#define GTM_F2A0_CH6_ARU_RD_FIFO       (GTM_F2A0_RD_CH6_ARU_RD_FIFO)

/** Alias (User Manual Name) for GTM_F2A0_RD_CH6_ARU_RD_FIFO.
 * To use register names with standard convension, please use GTM_F2A0_RD_CH6_ARU_RD_FIFO.
 */
#define GTM_F2A0_CH6_ARU_RD_FIFO       (GTM_F2A0_RD_CH6_ARU_RD_FIFO)

/** \\brief  1801C, F2A0 stream 0 read address register */
#define GTM_F2A0_RD_CH7_ARU_RD_FIFO    /*lint --e(923)*/ (*(volatile Ifx_GTM_F2A_RD_CH_ARU_RD_FIFO *)0xF011801Cu)

/** Alias (User Manual Name) for GTM_F2A0_RD_CH7_ARU_RD_FIFO.
 * To use register names with standard convension, please use GTM_F2A0_RD_CH7_ARU_RD_FIFO.
 */
#define GTM_F2A0_CH7_ARU_RD_FIFO       (GTM_F2A0_RD_CH7_ARU_RD_FIFO)

/** Alias (User Manual Name) for GTM_F2A0_RD_CH7_ARU_RD_FIFO.
 * To use register names with standard convension, please use GTM_F2A0_RD_CH7_ARU_RD_FIFO.
 */
#define GTM_F2A0_CH7_ARU_RD_FIFO       (GTM_F2A0_RD_CH7_ARU_RD_FIFO)

/** \\brief  18020, F2A0 stream 0 configuration register */
#define GTM_F2A0_STR_CH0_STR_CFG       /*lint --e(923)*/ (*(volatile Ifx_GTM_F2A_STR_CH_STR_CFG *)0xF0118020u)

/** Alias (User Manual Name) for GTM_F2A0_STR_CH0_STR_CFG.
 * To use register names with standard convension, please use GTM_F2A0_STR_CH0_STR_CFG.
 */
#define GTM_F2A0_CH0_STR_CFG           (GTM_F2A0_STR_CH0_STR_CFG)

/** Alias (User Manual Name) for GTM_F2A0_STR_CH0_STR_CFG.
 * To use register names with standard convension, please use GTM_F2A0_STR_CH0_STR_CFG.
 */
#define GTM_F2A0_CH0_STR_CFG           (GTM_F2A0_STR_CH0_STR_CFG)

/** \\brief  18024, F2A0 stream 0 configuration register */
#define GTM_F2A0_STR_CH1_STR_CFG       /*lint --e(923)*/ (*(volatile Ifx_GTM_F2A_STR_CH_STR_CFG *)0xF0118024u)

/** Alias (User Manual Name) for GTM_F2A0_STR_CH1_STR_CFG.
 * To use register names with standard convension, please use GTM_F2A0_STR_CH1_STR_CFG.
 */
#define GTM_F2A0_CH1_STR_CFG           (GTM_F2A0_STR_CH1_STR_CFG)

/** Alias (User Manual Name) for GTM_F2A0_STR_CH1_STR_CFG.
 * To use register names with standard convension, please use GTM_F2A0_STR_CH1_STR_CFG.
 */
#define GTM_F2A0_CH1_STR_CFG           (GTM_F2A0_STR_CH1_STR_CFG)

/** \\brief  18028, F2A0 stream 0 configuration register */
#define GTM_F2A0_STR_CH2_STR_CFG       /*lint --e(923)*/ (*(volatile Ifx_GTM_F2A_STR_CH_STR_CFG *)0xF0118028u)

/** Alias (User Manual Name) for GTM_F2A0_STR_CH2_STR_CFG.
 * To use register names with standard convension, please use GTM_F2A0_STR_CH2_STR_CFG.
 */
#define GTM_F2A0_CH2_STR_CFG           (GTM_F2A0_STR_CH2_STR_CFG)

/** Alias (User Manual Name) for GTM_F2A0_STR_CH2_STR_CFG.
 * To use register names with standard convension, please use GTM_F2A0_STR_CH2_STR_CFG.
 */
#define GTM_F2A0_CH2_STR_CFG           (GTM_F2A0_STR_CH2_STR_CFG)

/** \\brief  1802C, F2A0 stream 0 configuration register */
#define GTM_F2A0_STR_CH3_STR_CFG       /*lint --e(923)*/ (*(volatile Ifx_GTM_F2A_STR_CH_STR_CFG *)0xF011802Cu)

/** Alias (User Manual Name) for GTM_F2A0_STR_CH3_STR_CFG.
 * To use register names with standard convension, please use GTM_F2A0_STR_CH3_STR_CFG.
 */
#define GTM_F2A0_CH3_STR_CFG           (GTM_F2A0_STR_CH3_STR_CFG)

/** Alias (User Manual Name) for GTM_F2A0_STR_CH3_STR_CFG.
 * To use register names with standard convension, please use GTM_F2A0_STR_CH3_STR_CFG.
 */
#define GTM_F2A0_CH3_STR_CFG           (GTM_F2A0_STR_CH3_STR_CFG)

/** \\brief  18030, F2A0 stream 0 configuration register */
#define GTM_F2A0_STR_CH4_STR_CFG       /*lint --e(923)*/ (*(volatile Ifx_GTM_F2A_STR_CH_STR_CFG *)0xF0118030u)

