Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** Alias (User Manual Name) for GTM_F2A0_STR_CH4_STR_CFG.
 * To use register names with standard convension, please use GTM_F2A0_STR_CH4_STR_CFG.
 */
#define GTM_F2A0_CH4_STR_CFG           (GTM_F2A0_STR_CH4_STR_CFG)

/** Alias (User Manual Name) for GTM_F2A0_STR_CH4_STR_CFG.
 * To use register names with standard convension, please use GTM_F2A0_STR_CH4_STR_CFG.
 */
#define GTM_F2A0_CH4_STR_CFG           (GTM_F2A0_STR_CH4_STR_CFG)

/** \\brief  18034, F2A0 stream 0 configuration register */
#define GTM_F2A0_STR_CH5_STR_CFG       /*lint --e(923)*/ (*(volatile Ifx_GTM_F2A_STR_CH_STR_CFG *)0xF0118034u)

/** Alias (User Manual Name) for GTM_F2A0_STR_CH5_STR_CFG.
 * To use register names with standard convension, please use GTM_F2A0_STR_CH5_STR_CFG.
 */
#define GTM_F2A0_CH5_STR_CFG           (GTM_F2A0_STR_CH5_STR_CFG)

/** Alias (User Manual Name) for GTM_F2A0_STR_CH5_STR_CFG.
 * To use register names with standard convension, please use GTM_F2A0_STR_CH5_STR_CFG.
 */
#define GTM_F2A0_CH5_STR_CFG           (GTM_F2A0_STR_CH5_STR_CFG)

/** \\brief  18038, F2A0 stream 0 configuration register */
#define GTM_F2A0_STR_CH6_STR_CFG       /*lint --e(923)*/ (*(volatile Ifx_GTM_F2A_STR_CH_STR_CFG *)0xF0118038u)

/** Alias (User Manual Name) for GTM_F2A0_STR_CH6_STR_CFG.
 * To use register names with standard convension, please use GTM_F2A0_STR_CH6_STR_CFG.
 */
#define GTM_F2A0_CH6_STR_CFG           (GTM_F2A0_STR_CH6_STR_CFG)

/** Alias (User Manual Name) for GTM_F2A0_STR_CH6_STR_CFG.
 * To use register names with standard convension, please use GTM_F2A0_STR_CH6_STR_CFG.
 */
#define GTM_F2A0_CH6_STR_CFG           (GTM_F2A0_STR_CH6_STR_CFG)

/** \\brief  1803C, F2A0 stream 0 configuration register */
#define GTM_F2A0_STR_CH7_STR_CFG       /*lint --e(923)*/ (*(volatile Ifx_GTM_F2A_STR_CH_STR_CFG *)0xF011803Cu)

/** Alias (User Manual Name) for GTM_F2A0_STR_CH7_STR_CFG.
 * To use register names with standard convension, please use GTM_F2A0_STR_CH7_STR_CFG.
 */
#define GTM_F2A0_CH7_STR_CFG           (GTM_F2A0_STR_CH7_STR_CFG)

/** Alias (User Manual Name) for GTM_F2A0_STR_CH7_STR_CFG.
 * To use register names with standard convension, please use GTM_F2A0_STR_CH7_STR_CFG.
 */
#define GTM_F2A0_CH7_STR_CFG           (GTM_F2A0_STR_CH7_STR_CFG)

/** \\brief  1C044, F2A0 stream control register */
#define GTM_F2A1_CTRL                  /*lint --e(923)*/ (*(volatile Ifx_GTM_F2A_CTRL *)0xF011C044u)

/** \\brief  1C040, F2A0 stream activation register */
#define GTM_F2A1_ENABLE                /*lint --e(923)*/ (*(volatile Ifx_GTM_F2A_ENABLE *)0xF011C040u)

/** \\brief  1C000, F2A0 stream 0 read address register */
#define GTM_F2A1_RD_CH0_ARU_RD_FIFO    /*lint --e(923)*/ (*(volatile Ifx_GTM_F2A_RD_CH_ARU_RD_FIFO *)0xF011C000u)

/** Alias (User Manual Name) for GTM_F2A1_RD_CH0_ARU_RD_FIFO.
 * To use register names with standard convension, please use GTM_F2A1_RD_CH0_ARU_RD_FIFO.
 */
#define GTM_F2A1_CH0_ARU_RD_FIFO       (GTM_F2A1_RD_CH0_ARU_RD_FIFO)

/** Alias (User Manual Name) for GTM_F2A1_RD_CH0_ARU_RD_FIFO.
 * To use register names with standard convension, please use GTM_F2A1_RD_CH0_ARU_RD_FIFO.
 */
#define GTM_F2A1_CH0_ARU_RD_FIFO       (GTM_F2A1_RD_CH0_ARU_RD_FIFO)

/** \\brief  1C004, F2A0 stream 0 read address register */
#define GTM_F2A1_RD_CH1_ARU_RD_FIFO    /*lint --e(923)*/ (*(volatile Ifx_GTM_F2A_RD_CH_ARU_RD_FIFO *)0xF011C004u)

/** Alias (User Manual Name) for GTM_F2A1_RD_CH1_ARU_RD_FIFO.
 * To use register names with standard convension, please use GTM_F2A1_RD_CH1_ARU_RD_FIFO.
 */
#define GTM_F2A1_CH1_ARU_RD_FIFO       (GTM_F2A1_RD_CH1_ARU_RD_FIFO)

/** Alias (User Manual Name) for GTM_F2A1_RD_CH1_ARU_RD_FIFO.
 * To use register names with standard convension, please use GTM_F2A1_RD_CH1_ARU_RD_FIFO.
 */
#define GTM_F2A1_CH1_ARU_RD_FIFO       (GTM_F2A1_RD_CH1_ARU_RD_FIFO)

/** \\brief  1C008, F2A0 stream 0 read address register */
#define GTM_F2A1_RD_CH2_ARU_RD_FIFO    /*lint --e(923)*/ (*(volatile Ifx_GTM_F2A_RD_CH_ARU_RD_FIFO *)0xF011C008u)

/** Alias (User Manual Name) for GTM_F2A1_RD_CH2_ARU_RD_FIFO.
 * To use register names with standard convension, please use GTM_F2A1_RD_CH2_ARU_RD_FIFO.
 */
#define GTM_F2A1_CH2_ARU_RD_FIFO       (GTM_F2A1_RD_CH2_ARU_RD_FIFO)

/** Alias (User Manual Name) for GTM_F2A1_RD_CH2_ARU_RD_FIFO.
 * To use register names with standard convension, please use GTM_F2A1_RD_CH2_ARU_RD_FIFO.
 */
#define GTM_F2A1_CH2_ARU_RD_FIFO       (GTM_F2A1_RD_CH2_ARU_RD_FIFO)

/** \\brief  1C00C, F2A0 stream 0 read address register */
#define GTM_F2A1_RD_CH3_ARU_RD_FIFO    /*lint --e(923)*/ (*(volatile Ifx_GTM_F2A_RD_CH_ARU_RD_FIFO *)0xF011C00Cu)

/** Alias (User Manual Name) for GTM_F2A1_RD_CH3_ARU_RD_FIFO.
 * To use register names with standard convension, please use GTM_F2A1_RD_CH3_ARU_RD_FIFO.
 */
#define GTM_F2A1_CH3_ARU_RD_FIFO       (GTM_F2A1_RD_CH3_ARU_RD_FIFO)

/** Alias (User Manual Name) for GTM_F2A1_RD_CH3_ARU_RD_FIFO.
 * To use register names with standard convension, please use GTM_F2A1_RD_CH3_ARU_RD_FIFO.
 */
#define GTM_F2A1_CH3_ARU_RD_FIFO       (GTM_F2A1_RD_CH3_ARU_RD_FIFO)

/** \\brief  1C010, F2A0 stream 0 read address register */
#define GTM_F2A1_RD_CH4_ARU_RD_FIFO    /*lint --e(923)*/ (*(volatile Ifx_GTM_F2A_RD_CH_ARU_RD_FIFO *)0xF011C010u)

/** Alias (User Manual Name) for GTM_F2A1_RD_CH4_ARU_RD_FIFO.
 * To use register names with standard convension, please use GTM_F2A1_RD_CH4_ARU_RD_FIFO.
 */
#define GTM_F2A1_CH4_ARU_RD_FIFO       (GTM_F2A1_RD_CH4_ARU_RD_FIFO)

/** Alias (User Manual Name) for GTM_F2A1_RD_CH4_ARU_RD_FIFO.
 * To use register names with standard convension, please use GTM_F2A1_RD_CH4_ARU_RD_FIFO.
 */
#define GTM_F2A1_CH4_ARU_RD_FIFO       (GTM_F2A1_RD_CH4_ARU_RD_FIFO)

/** \\brief  1C014, F2A0 stream 0 read address register */
#define GTM_F2A1_RD_CH5_ARU_RD_FIFO    /*lint --e(923)*/ (*(volatile Ifx_GTM_F2A_RD_CH_ARU_RD_FIFO *)0xF011C014u)

/** Alias (User Manual Name) for GTM_F2A1_RD_CH5_ARU_RD_FIFO.
 * To use register names with standard convension, please use GTM_F2A1_RD_CH5_ARU_RD_FIFO.
 */
#define GTM_F2A1_CH5_ARU_RD_FIFO       (GTM_F2A1_RD_CH5_ARU_RD_FIFO)

