Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** Alias (User Manual Name) for GTM_F2A1_RD_CH5_ARU_RD_FIFO.
 * To use register names with standard convension, please use GTM_F2A1_RD_CH5_ARU_RD_FIFO.
 */
#define GTM_F2A1_CH5_ARU_RD_FIFO       (GTM_F2A1_RD_CH5_ARU_RD_FIFO)

/** \\brief  1C018, F2A0 stream 0 read address register */
#define GTM_F2A1_RD_CH6_ARU_RD_FIFO    /*lint --e(923)*/ (*(volatile Ifx_GTM_F2A_RD_CH_ARU_RD_FIFO *)0xF011C018u)

/** Alias (User Manual Name) for GTM_F2A1_RD_CH6_ARU_RD_FIFO.
 * To use register names with standard convension, please use GTM_F2A1_RD_CH6_ARU_RD_FIFO.
 */
#define GTM_F2A1_CH6_ARU_RD_FIFO       (GTM_F2A1_RD_CH6_ARU_RD_FIFO)

/** Alias (User Manual Name) for GTM_F2A1_RD_CH6_ARU_RD_FIFO.
 * To use register names with standard convension, please use GTM_F2A1_RD_CH6_ARU_RD_FIFO.
 */
#define GTM_F2A1_CH6_ARU_RD_FIFO       (GTM_F2A1_RD_CH6_ARU_RD_FIFO)

/** \\brief  1C01C, F2A0 stream 0 read address register */
#define GTM_F2A1_RD_CH7_ARU_RD_FIFO    /*lint --e(923)*/ (*(volatile Ifx_GTM_F2A_RD_CH_ARU_RD_FIFO *)0xF011C01Cu)

/** Alias (User Manual Name) for GTM_F2A1_RD_CH7_ARU_RD_FIFO.
 * To use register names with standard convension, please use GTM_F2A1_RD_CH7_ARU_RD_FIFO.
 */
#define GTM_F2A1_CH7_ARU_RD_FIFO       (GTM_F2A1_RD_CH7_ARU_RD_FIFO)

/** Alias (User Manual Name) for GTM_F2A1_RD_CH7_ARU_RD_FIFO.
 * To use register names with standard convension, please use GTM_F2A1_RD_CH7_ARU_RD_FIFO.
 */
#define GTM_F2A1_CH7_ARU_RD_FIFO       (GTM_F2A1_RD_CH7_ARU_RD_FIFO)

/** \\brief  1C020, F2A0 stream 0 configuration register */
#define GTM_F2A1_STR_CH0_STR_CFG       /*lint --e(923)*/ (*(volatile Ifx_GTM_F2A_STR_CH_STR_CFG *)0xF011C020u)

/** Alias (User Manual Name) for GTM_F2A1_STR_CH0_STR_CFG.
 * To use register names with standard convension, please use GTM_F2A1_STR_CH0_STR_CFG.
 */
#define GTM_F2A1_CH0_STR_CFG           (GTM_F2A1_STR_CH0_STR_CFG)

/** Alias (User Manual Name) for GTM_F2A1_STR_CH0_STR_CFG.
 * To use register names with standard convension, please use GTM_F2A1_STR_CH0_STR_CFG.
 */
#define GTM_F2A1_CH0_STR_CFG           (GTM_F2A1_STR_CH0_STR_CFG)

/** \\brief  1C024, F2A0 stream 0 configuration register */
#define GTM_F2A1_STR_CH1_STR_CFG       /*lint --e(923)*/ (*(volatile Ifx_GTM_F2A_STR_CH_STR_CFG *)0xF011C024u)

/** Alias (User Manual Name) for GTM_F2A1_STR_CH1_STR_CFG.
 * To use register names with standard convension, please use GTM_F2A1_STR_CH1_STR_CFG.
 */
#define GTM_F2A1_CH1_STR_CFG           (GTM_F2A1_STR_CH1_STR_CFG)

/** Alias (User Manual Name) for GTM_F2A1_STR_CH1_STR_CFG.
 * To use register names with standard convension, please use GTM_F2A1_STR_CH1_STR_CFG.
 */
#define GTM_F2A1_CH1_STR_CFG           (GTM_F2A1_STR_CH1_STR_CFG)

/** \\brief  1C028, F2A0 stream 0 configuration register */
#define GTM_F2A1_STR_CH2_STR_CFG       /*lint --e(923)*/ (*(volatile Ifx_GTM_F2A_STR_CH_STR_CFG *)0xF011C028u)

/** Alias (User Manual Name) for GTM_F2A1_STR_CH2_STR_CFG.
 * To use register names with standard convension, please use GTM_F2A1_STR_CH2_STR_CFG.
 */
#define GTM_F2A1_CH2_STR_CFG           (GTM_F2A1_STR_CH2_STR_CFG)

/** Alias (User Manual Name) for GTM_F2A1_STR_CH2_STR_CFG.
 * To use register names with standard convension, please use GTM_F2A1_STR_CH2_STR_CFG.
 */
#define GTM_F2A1_CH2_STR_CFG           (GTM_F2A1_STR_CH2_STR_CFG)

/** \\brief  1C02C, F2A0 stream 0 configuration register */
#define GTM_F2A1_STR_CH3_STR_CFG       /*lint --e(923)*/ (*(volatile Ifx_GTM_F2A_STR_CH_STR_CFG *)0xF011C02Cu)

/** Alias (User Manual Name) for GTM_F2A1_STR_CH3_STR_CFG.
 * To use register names with standard convension, please use GTM_F2A1_STR_CH3_STR_CFG.
 */
#define GTM_F2A1_CH3_STR_CFG           (GTM_F2A1_STR_CH3_STR_CFG)

/** Alias (User Manual Name) for GTM_F2A1_STR_CH3_STR_CFG.
 * To use register names with standard convension, please use GTM_F2A1_STR_CH3_STR_CFG.
 */
#define GTM_F2A1_CH3_STR_CFG           (GTM_F2A1_STR_CH3_STR_CFG)

/** \\brief  1C030, F2A0 stream 0 configuration register */
#define GTM_F2A1_STR_CH4_STR_CFG       /*lint --e(923)*/ (*(volatile Ifx_GTM_F2A_STR_CH_STR_CFG *)0xF011C030u)

/** Alias (User Manual Name) for GTM_F2A1_STR_CH4_STR_CFG.
 * To use register names with standard convension, please use GTM_F2A1_STR_CH4_STR_CFG.
 */
#define GTM_F2A1_CH4_STR_CFG           (GTM_F2A1_STR_CH4_STR_CFG)

/** Alias (User Manual Name) for GTM_F2A1_STR_CH4_STR_CFG.
 * To use register names with standard convension, please use GTM_F2A1_STR_CH4_STR_CFG.
 */
#define GTM_F2A1_CH4_STR_CFG           (GTM_F2A1_STR_CH4_STR_CFG)

/** \\brief  1C034, F2A0 stream 0 configuration register */
#define GTM_F2A1_STR_CH5_STR_CFG       /*lint --e(923)*/ (*(volatile Ifx_GTM_F2A_STR_CH_STR_CFG *)0xF011C034u)

/** Alias (User Manual Name) for GTM_F2A1_STR_CH5_STR_CFG.
 * To use register names with standard convension, please use GTM_F2A1_STR_CH5_STR_CFG.
 */
#define GTM_F2A1_CH5_STR_CFG           (GTM_F2A1_STR_CH5_STR_CFG)

/** Alias (User Manual Name) for GTM_F2A1_STR_CH5_STR_CFG.
 * To use register names with standard convension, please use GTM_F2A1_STR_CH5_STR_CFG.
 */
#define GTM_F2A1_CH5_STR_CFG           (GTM_F2A1_STR_CH5_STR_CFG)

/** \\brief  1C038, F2A0 stream 0 configuration register */
#define GTM_F2A1_STR_CH6_STR_CFG       /*lint --e(923)*/ (*(volatile Ifx_GTM_F2A_STR_CH_STR_CFG *)0xF011C038u)

/** Alias (User Manual Name) for GTM_F2A1_STR_CH6_STR_CFG.
 * To use register names with standard convension, please use GTM_F2A1_STR_CH6_STR_CFG.
 */
#define GTM_F2A1_CH6_STR_CFG           (GTM_F2A1_STR_CH6_STR_CFG)

/** Alias (User Manual Name) for GTM_F2A1_STR_CH6_STR_CFG.
 * To use register names with standard convension, please use GTM_F2A1_STR_CH6_STR_CFG.
 */
#define GTM_F2A1_CH6_STR_CFG           (GTM_F2A1_STR_CH6_STR_CFG)

/** \\brief  1C03C, F2A0 stream 0 configuration register */
#define GTM_F2A1_STR_CH7_STR_CFG       /*lint --e(923)*/ (*(volatile Ifx_GTM_F2A_STR_CH_STR_CFG *)0xF011C03Cu)

/** Alias (User Manual Name) for GTM_F2A1_STR_CH7_STR_CFG.
 * To use register names with standard convension, please use GTM_F2A1_STR_CH7_STR_CFG.
 */
#define GTM_F2A1_CH7_STR_CFG           (GTM_F2A1_STR_CH7_STR_CFG)

/** Alias (User Manual Name) for GTM_F2A1_STR_CH7_STR_CFG.
 * To use register names with standard convension, please use GTM_F2A1_STR_CH7_STR_CFG.
 */
#define GTM_F2A1_CH7_STR_CFG           (GTM_F2A1_STR_CH7_STR_CFG)

/** \\brief  20044, F2A0 stream control register */
#define GTM_F2A2_CTRL                  /*lint --e(923)*/ (*(volatile Ifx_GTM_F2A_CTRL *)0xF0120044u)

/** \\brief  20040, F2A0 stream activation register */
#define GTM_F2A2_ENABLE                /*lint --e(923)*/ (*(volatile Ifx_GTM_F2A_ENABLE *)0xF0120040u)

