Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  20000, F2A0 stream 0 read address register */
#define GTM_F2A2_RD_CH0_ARU_RD_FIFO    /*lint --e(923)*/ (*(volatile Ifx_GTM_F2A_RD_CH_ARU_RD_FIFO *)0xF0120000u)

/** Alias (User Manual Name) for GTM_F2A2_RD_CH0_ARU_RD_FIFO.
 * To use register names with standard convension, please use GTM_F2A2_RD_CH0_ARU_RD_FIFO.
 */
#define GTM_F2A2_CH0_ARU_RD_FIFO       (GTM_F2A2_RD_CH0_ARU_RD_FIFO)

/** Alias (User Manual Name) for GTM_F2A2_RD_CH0_ARU_RD_FIFO.
 * To use register names with standard convension, please use GTM_F2A2_RD_CH0_ARU_RD_FIFO.
 */
#define GTM_F2A2_CH0_ARU_RD_FIFO       (GTM_F2A2_RD_CH0_ARU_RD_FIFO)

/** \\brief  20004, F2A0 stream 0 read address register */
#define GTM_F2A2_RD_CH1_ARU_RD_FIFO    /*lint --e(923)*/ (*(volatile Ifx_GTM_F2A_RD_CH_ARU_RD_FIFO *)0xF0120004u)

/** Alias (User Manual Name) for GTM_F2A2_RD_CH1_ARU_RD_FIFO.
 * To use register names with standard convension, please use GTM_F2A2_RD_CH1_ARU_RD_FIFO.
 */
#define GTM_F2A2_CH1_ARU_RD_FIFO       (GTM_F2A2_RD_CH1_ARU_RD_FIFO)

/** Alias (User Manual Name) for GTM_F2A2_RD_CH1_ARU_RD_FIFO.
 * To use register names with standard convension, please use GTM_F2A2_RD_CH1_ARU_RD_FIFO.
 */
#define GTM_F2A2_CH1_ARU_RD_FIFO       (GTM_F2A2_RD_CH1_ARU_RD_FIFO)

/** \\brief  20008, F2A0 stream 0 read address register */
#define GTM_F2A2_RD_CH2_ARU_RD_FIFO    /*lint --e(923)*/ (*(volatile Ifx_GTM_F2A_RD_CH_ARU_RD_FIFO *)0xF0120008u)

/** Alias (User Manual Name) for GTM_F2A2_RD_CH2_ARU_RD_FIFO.
 * To use register names with standard convension, please use GTM_F2A2_RD_CH2_ARU_RD_FIFO.
 */
#define GTM_F2A2_CH2_ARU_RD_FIFO       (GTM_F2A2_RD_CH2_ARU_RD_FIFO)

/** Alias (User Manual Name) for GTM_F2A2_RD_CH2_ARU_RD_FIFO.
 * To use register names with standard convension, please use GTM_F2A2_RD_CH2_ARU_RD_FIFO.
 */
#define GTM_F2A2_CH2_ARU_RD_FIFO       (GTM_F2A2_RD_CH2_ARU_RD_FIFO)

/** \\brief  2000C, F2A0 stream 0 read address register */
#define GTM_F2A2_RD_CH3_ARU_RD_FIFO    /*lint --e(923)*/ (*(volatile Ifx_GTM_F2A_RD_CH_ARU_RD_FIFO *)0xF012000Cu)

/** Alias (User Manual Name) for GTM_F2A2_RD_CH3_ARU_RD_FIFO.
 * To use register names with standard convension, please use GTM_F2A2_RD_CH3_ARU_RD_FIFO.
 */
#define GTM_F2A2_CH3_ARU_RD_FIFO       (GTM_F2A2_RD_CH3_ARU_RD_FIFO)

/** Alias (User Manual Name) for GTM_F2A2_RD_CH3_ARU_RD_FIFO.
 * To use register names with standard convension, please use GTM_F2A2_RD_CH3_ARU_RD_FIFO.
 */
#define GTM_F2A2_CH3_ARU_RD_FIFO       (GTM_F2A2_RD_CH3_ARU_RD_FIFO)

/** \\brief  20010, F2A0 stream 0 read address register */
#define GTM_F2A2_RD_CH4_ARU_RD_FIFO    /*lint --e(923)*/ (*(volatile Ifx_GTM_F2A_RD_CH_ARU_RD_FIFO *)0xF0120010u)

/** Alias (User Manual Name) for GTM_F2A2_RD_CH4_ARU_RD_FIFO.
 * To use register names with standard convension, please use GTM_F2A2_RD_CH4_ARU_RD_FIFO.
 */
#define GTM_F2A2_CH4_ARU_RD_FIFO       (GTM_F2A2_RD_CH4_ARU_RD_FIFO)

/** Alias (User Manual Name) for GTM_F2A2_RD_CH4_ARU_RD_FIFO.
 * To use register names with standard convension, please use GTM_F2A2_RD_CH4_ARU_RD_FIFO.
 */
#define GTM_F2A2_CH4_ARU_RD_FIFO       (GTM_F2A2_RD_CH4_ARU_RD_FIFO)

/** \\brief  20014, F2A0 stream 0 read address register */
#define GTM_F2A2_RD_CH5_ARU_RD_FIFO    /*lint --e(923)*/ (*(volatile Ifx_GTM_F2A_RD_CH_ARU_RD_FIFO *)0xF0120014u)

/** Alias (User Manual Name) for GTM_F2A2_RD_CH5_ARU_RD_FIFO.
 * To use register names with standard convension, please use GTM_F2A2_RD_CH5_ARU_RD_FIFO.
 */
#define GTM_F2A2_CH5_ARU_RD_FIFO       (GTM_F2A2_RD_CH5_ARU_RD_FIFO)

/** Alias (User Manual Name) for GTM_F2A2_RD_CH5_ARU_RD_FIFO.
 * To use register names with standard convension, please use GTM_F2A2_RD_CH5_ARU_RD_FIFO.
 */
#define GTM_F2A2_CH5_ARU_RD_FIFO       (GTM_F2A2_RD_CH5_ARU_RD_FIFO)

/** \\brief  20018, F2A0 stream 0 read address register */
#define GTM_F2A2_RD_CH6_ARU_RD_FIFO    /*lint --e(923)*/ (*(volatile Ifx_GTM_F2A_RD_CH_ARU_RD_FIFO *)0xF0120018u)

/** Alias (User Manual Name) for GTM_F2A2_RD_CH6_ARU_RD_FIFO.
 * To use register names with standard convension, please use GTM_F2A2_RD_CH6_ARU_RD_FIFO.
 */
#define GTM_F2A2_CH6_ARU_RD_FIFO       (GTM_F2A2_RD_CH6_ARU_RD_FIFO)

/** Alias (User Manual Name) for GTM_F2A2_RD_CH6_ARU_RD_FIFO.
 * To use register names with standard convension, please use GTM_F2A2_RD_CH6_ARU_RD_FIFO.
 */
#define GTM_F2A2_CH6_ARU_RD_FIFO       (GTM_F2A2_RD_CH6_ARU_RD_FIFO)

/** \\brief  2001C, F2A0 stream 0 read address register */
#define GTM_F2A2_RD_CH7_ARU_RD_FIFO    /*lint --e(923)*/ (*(volatile Ifx_GTM_F2A_RD_CH_ARU_RD_FIFO *)0xF012001Cu)

/** Alias (User Manual Name) for GTM_F2A2_RD_CH7_ARU_RD_FIFO.
 * To use register names with standard convension, please use GTM_F2A2_RD_CH7_ARU_RD_FIFO.
 */
#define GTM_F2A2_CH7_ARU_RD_FIFO       (GTM_F2A2_RD_CH7_ARU_RD_FIFO)

/** Alias (User Manual Name) for GTM_F2A2_RD_CH7_ARU_RD_FIFO.
 * To use register names with standard convension, please use GTM_F2A2_RD_CH7_ARU_RD_FIFO.
 */
#define GTM_F2A2_CH7_ARU_RD_FIFO       (GTM_F2A2_RD_CH7_ARU_RD_FIFO)

/** \\brief  20020, F2A0 stream 0 configuration register */
#define GTM_F2A2_STR_CH0_STR_CFG       /*lint --e(923)*/ (*(volatile Ifx_GTM_F2A_STR_CH_STR_CFG *)0xF0120020u)

/** Alias (User Manual Name) for GTM_F2A2_STR_CH0_STR_CFG.
 * To use register names with standard convension, please use GTM_F2A2_STR_CH0_STR_CFG.
 */
#define GTM_F2A2_CH0_STR_CFG           (GTM_F2A2_STR_CH0_STR_CFG)

/** Alias (User Manual Name) for GTM_F2A2_STR_CH0_STR_CFG.
 * To use register names with standard convension, please use GTM_F2A2_STR_CH0_STR_CFG.
 */
#define GTM_F2A2_CH0_STR_CFG           (GTM_F2A2_STR_CH0_STR_CFG)

/** \\brief  20024, F2A0 stream 0 configuration register */
#define GTM_F2A2_STR_CH1_STR_CFG       /*lint --e(923)*/ (*(volatile Ifx_GTM_F2A_STR_CH_STR_CFG *)0xF0120024u)

/** Alias (User Manual Name) for GTM_F2A2_STR_CH1_STR_CFG.
 * To use register names with standard convension, please use GTM_F2A2_STR_CH1_STR_CFG.
 */
#define GTM_F2A2_CH1_STR_CFG           (GTM_F2A2_STR_CH1_STR_CFG)

/** Alias (User Manual Name) for GTM_F2A2_STR_CH1_STR_CFG.
 * To use register names with standard convension, please use GTM_F2A2_STR_CH1_STR_CFG.
 */
#define GTM_F2A2_CH1_STR_CFG           (GTM_F2A2_STR_CH1_STR_CFG)

/** \\brief  20028, F2A0 stream 0 configuration register */
#define GTM_F2A2_STR_CH2_STR_CFG       /*lint --e(923)*/ (*(volatile Ifx_GTM_F2A_STR_CH_STR_CFG *)0xF0120028u)

