Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** Alias (User Manual Name) for GTM_F2A2_STR_CH2_STR_CFG.
 * To use register names with standard convension, please use GTM_F2A2_STR_CH2_STR_CFG.
 */
#define GTM_F2A2_CH2_STR_CFG           (GTM_F2A2_STR_CH2_STR_CFG)

/** Alias (User Manual Name) for GTM_F2A2_STR_CH2_STR_CFG.
 * To use register names with standard convension, please use GTM_F2A2_STR_CH2_STR_CFG.
 */
#define GTM_F2A2_CH2_STR_CFG           (GTM_F2A2_STR_CH2_STR_CFG)

/** \\brief  2002C, F2A0 stream 0 configuration register */
#define GTM_F2A2_STR_CH3_STR_CFG       /*lint --e(923)*/ (*(volatile Ifx_GTM_F2A_STR_CH_STR_CFG *)0xF012002Cu)

/** Alias (User Manual Name) for GTM_F2A2_STR_CH3_STR_CFG.
 * To use register names with standard convension, please use GTM_F2A2_STR_CH3_STR_CFG.
 */
#define GTM_F2A2_CH3_STR_CFG           (GTM_F2A2_STR_CH3_STR_CFG)

/** Alias (User Manual Name) for GTM_F2A2_STR_CH3_STR_CFG.
 * To use register names with standard convension, please use GTM_F2A2_STR_CH3_STR_CFG.
 */
#define GTM_F2A2_CH3_STR_CFG           (GTM_F2A2_STR_CH3_STR_CFG)

/** \\brief  20030, F2A0 stream 0 configuration register */
#define GTM_F2A2_STR_CH4_STR_CFG       /*lint --e(923)*/ (*(volatile Ifx_GTM_F2A_STR_CH_STR_CFG *)0xF0120030u)

/** Alias (User Manual Name) for GTM_F2A2_STR_CH4_STR_CFG.
 * To use register names with standard convension, please use GTM_F2A2_STR_CH4_STR_CFG.
 */
#define GTM_F2A2_CH4_STR_CFG           (GTM_F2A2_STR_CH4_STR_CFG)

/** Alias (User Manual Name) for GTM_F2A2_STR_CH4_STR_CFG.
 * To use register names with standard convension, please use GTM_F2A2_STR_CH4_STR_CFG.
 */
#define GTM_F2A2_CH4_STR_CFG           (GTM_F2A2_STR_CH4_STR_CFG)

/** \\brief  20034, F2A0 stream 0 configuration register */
#define GTM_F2A2_STR_CH5_STR_CFG       /*lint --e(923)*/ (*(volatile Ifx_GTM_F2A_STR_CH_STR_CFG *)0xF0120034u)

/** Alias (User Manual Name) for GTM_F2A2_STR_CH5_STR_CFG.
 * To use register names with standard convension, please use GTM_F2A2_STR_CH5_STR_CFG.
 */
#define GTM_F2A2_CH5_STR_CFG           (GTM_F2A2_STR_CH5_STR_CFG)

/** Alias (User Manual Name) for GTM_F2A2_STR_CH5_STR_CFG.
 * To use register names with standard convension, please use GTM_F2A2_STR_CH5_STR_CFG.
 */
#define GTM_F2A2_CH5_STR_CFG           (GTM_F2A2_STR_CH5_STR_CFG)

/** \\brief  20038, F2A0 stream 0 configuration register */
#define GTM_F2A2_STR_CH6_STR_CFG       /*lint --e(923)*/ (*(volatile Ifx_GTM_F2A_STR_CH_STR_CFG *)0xF0120038u)

/** Alias (User Manual Name) for GTM_F2A2_STR_CH6_STR_CFG.
 * To use register names with standard convension, please use GTM_F2A2_STR_CH6_STR_CFG.
 */
#define GTM_F2A2_CH6_STR_CFG           (GTM_F2A2_STR_CH6_STR_CFG)

/** Alias (User Manual Name) for GTM_F2A2_STR_CH6_STR_CFG.
 * To use register names with standard convension, please use GTM_F2A2_STR_CH6_STR_CFG.
 */
#define GTM_F2A2_CH6_STR_CFG           (GTM_F2A2_STR_CH6_STR_CFG)

/** \\brief  2003C, F2A0 stream 0 configuration register */
#define GTM_F2A2_STR_CH7_STR_CFG       /*lint --e(923)*/ (*(volatile Ifx_GTM_F2A_STR_CH_STR_CFG *)0xF012003Cu)

/** Alias (User Manual Name) for GTM_F2A2_STR_CH7_STR_CFG.
 * To use register names with standard convension, please use GTM_F2A2_STR_CH7_STR_CFG.
 */
#define GTM_F2A2_CH7_STR_CFG           (GTM_F2A2_STR_CH7_STR_CFG)

/** Alias (User Manual Name) for GTM_F2A2_STR_CH7_STR_CFG.
 * To use register names with standard convension, please use GTM_F2A2_STR_CH7_STR_CFG.
 */
#define GTM_F2A2_CH7_STR_CFG           (GTM_F2A2_STR_CH7_STR_CFG)

/** \\brief  18400, FIFO0 channel 0 control register */
#define GTM_FIFO0_CH0_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_CTRL *)0xF0118400u)

/** \\brief  18434, FIFO0 channel 0 error interrupt enable register */
#define GTM_FIFO0_CH0_EIRQ_EN          /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_EIRQ_EN *)0xF0118434u)

/** \\brief  18404, FIFO0 channel 0 end address register */
#define GTM_FIFO0_CH0_END_ADDR         /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_END_ADDR *)0xF0118404u)

/** \\brief  18418, FIFO0 channel 0 fill level register */
#define GTM_FIFO0_CH0_FILL_LEVEL       /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_FILL_LEVEL *)0xF0118418u)

/** \\brief  18428, FIFO0 channel 0 interrupt enable register */
#define GTM_FIFO0_CH0_IRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_EN *)0xF0118428u)

/** \\brief  1842C, FIFO0 channel 0 force interrupt register */
#define GTM_FIFO0_CH0_IRQ_FORCINT      /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_FORCINT *)0xF011842Cu)

/** \\brief  18430, FIFO0 channel 0 interrupt mode control register */
#define GTM_FIFO0_CH0_IRQ_MODE         /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_MODE *)0xF0118430u)

/** \\brief  18424, FIFO0 channel 0 interrupt notification register */
#define GTM_FIFO0_CH0_IRQ_NOTIFY       /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_NOTIFY *)0xF0118424u)

/** \\brief  18410, FIFO0 channel 0 lower watermark register */
#define GTM_FIFO0_CH0_LOWER_WM         /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_LOWER_WM *)0xF0118410u)

/** \\brief  18420, FIFO0 channel 0 read pointer register */
#define GTM_FIFO0_CH0_RD_PTR           /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_RD_PTR *)0xF0118420u)

/** \\brief  18408, FIFO0 channel 0 start address register */
#define GTM_FIFO0_CH0_START_ADDR       /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_START_ADDR *)0xF0118408u)

/** \\brief  18414, FIFO0 channel 0 status register */
#define GTM_FIFO0_CH0_STATUS           /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_STATUS *)0xF0118414u)

/** \\brief  1840C, FIFO0 channel 0 upper watermark register */
#define GTM_FIFO0_CH0_UPPER_WM         /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_UPPER_WM *)0xF011840Cu)

/** \\brief  1841C, FIFO0 channel 0 write pointer register */
#define GTM_FIFO0_CH0_WR_PTR           /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_WR_PTR *)0xF011841Cu)

/** \\brief  18440, FIFO0 channel 0 control register */
#define GTM_FIFO0_CH1_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_CTRL *)0xF0118440u)

/** \\brief  18474, FIFO0 channel 0 error interrupt enable register */
#define GTM_FIFO0_CH1_EIRQ_EN          /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_EIRQ_EN *)0xF0118474u)

