Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  18444, FIFO0 channel 0 end address register */
#define GTM_FIFO0_CH1_END_ADDR         /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_END_ADDR *)0xF0118444u)

/** \\brief  18458, FIFO0 channel 0 fill level register */
#define GTM_FIFO0_CH1_FILL_LEVEL       /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_FILL_LEVEL *)0xF0118458u)

/** \\brief  18468, FIFO0 channel 0 interrupt enable register */
#define GTM_FIFO0_CH1_IRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_EN *)0xF0118468u)

/** \\brief  1846C, FIFO0 channel 0 force interrupt register */
#define GTM_FIFO0_CH1_IRQ_FORCINT      /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_FORCINT *)0xF011846Cu)

/** \\brief  18470, FIFO0 channel 0 interrupt mode control register */
#define GTM_FIFO0_CH1_IRQ_MODE         /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_MODE *)0xF0118470u)

/** \\brief  18464, FIFO0 channel 0 interrupt notification register */
#define GTM_FIFO0_CH1_IRQ_NOTIFY       /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_NOTIFY *)0xF0118464u)

/** \\brief  18450, FIFO0 channel 0 lower watermark register */
#define GTM_FIFO0_CH1_LOWER_WM         /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_LOWER_WM *)0xF0118450u)

/** \\brief  18460, FIFO0 channel 0 read pointer register */
#define GTM_FIFO0_CH1_RD_PTR           /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_RD_PTR *)0xF0118460u)

/** \\brief  18448, FIFO0 channel 0 start address register */
#define GTM_FIFO0_CH1_START_ADDR       /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_START_ADDR *)0xF0118448u)

/** \\brief  18454, FIFO0 channel 0 status register */
#define GTM_FIFO0_CH1_STATUS           /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_STATUS *)0xF0118454u)

/** \\brief  1844C, FIFO0 channel 0 upper watermark register */
#define GTM_FIFO0_CH1_UPPER_WM         /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_UPPER_WM *)0xF011844Cu)

/** \\brief  1845C, FIFO0 channel 0 write pointer register */
#define GTM_FIFO0_CH1_WR_PTR           /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_WR_PTR *)0xF011845Cu)

/** \\brief  18480, FIFO0 channel 0 control register */
#define GTM_FIFO0_CH2_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_CTRL *)0xF0118480u)

/** \\brief  184B4, FIFO0 channel 0 error interrupt enable register */
#define GTM_FIFO0_CH2_EIRQ_EN          /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_EIRQ_EN *)0xF01184B4u)

/** \\brief  18484, FIFO0 channel 0 end address register */
#define GTM_FIFO0_CH2_END_ADDR         /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_END_ADDR *)0xF0118484u)

/** \\brief  18498, FIFO0 channel 0 fill level register */
#define GTM_FIFO0_CH2_FILL_LEVEL       /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_FILL_LEVEL *)0xF0118498u)

/** \\brief  184A8, FIFO0 channel 0 interrupt enable register */
#define GTM_FIFO0_CH2_IRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_EN *)0xF01184A8u)

/** \\brief  184AC, FIFO0 channel 0 force interrupt register */
#define GTM_FIFO0_CH2_IRQ_FORCINT      /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_FORCINT *)0xF01184ACu)

/** \\brief  184B0, FIFO0 channel 0 interrupt mode control register */
#define GTM_FIFO0_CH2_IRQ_MODE         /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_MODE *)0xF01184B0u)

/** \\brief  184A4, FIFO0 channel 0 interrupt notification register */
#define GTM_FIFO0_CH2_IRQ_NOTIFY       /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_NOTIFY *)0xF01184A4u)

/** \\brief  18490, FIFO0 channel 0 lower watermark register */
#define GTM_FIFO0_CH2_LOWER_WM         /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_LOWER_WM *)0xF0118490u)

/** \\brief  184A0, FIFO0 channel 0 read pointer register */
#define GTM_FIFO0_CH2_RD_PTR           /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_RD_PTR *)0xF01184A0u)

/** \\brief  18488, FIFO0 channel 0 start address register */
#define GTM_FIFO0_CH2_START_ADDR       /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_START_ADDR *)0xF0118488u)

/** \\brief  18494, FIFO0 channel 0 status register */
#define GTM_FIFO0_CH2_STATUS           /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_STATUS *)0xF0118494u)

/** \\brief  1848C, FIFO0 channel 0 upper watermark register */
#define GTM_FIFO0_CH2_UPPER_WM         /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_UPPER_WM *)0xF011848Cu)

/** \\brief  1849C, FIFO0 channel 0 write pointer register */
#define GTM_FIFO0_CH2_WR_PTR           /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_WR_PTR *)0xF011849Cu)

/** \\brief  184C0, FIFO0 channel 0 control register */
#define GTM_FIFO0_CH3_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_CTRL *)0xF01184C0u)

/** \\brief  184F4, FIFO0 channel 0 error interrupt enable register */
#define GTM_FIFO0_CH3_EIRQ_EN          /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_EIRQ_EN *)0xF01184F4u)

/** \\brief  184C4, FIFO0 channel 0 end address register */
#define GTM_FIFO0_CH3_END_ADDR         /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_END_ADDR *)0xF01184C4u)

/** \\brief  184D8, FIFO0 channel 0 fill level register */
#define GTM_FIFO0_CH3_FILL_LEVEL       /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_FILL_LEVEL *)0xF01184D8u)

/** \\brief  184E8, FIFO0 channel 0 interrupt enable register */
#define GTM_FIFO0_CH3_IRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_EN *)0xF01184E8u)

/** \\brief  184EC, FIFO0 channel 0 force interrupt register */
#define GTM_FIFO0_CH3_IRQ_FORCINT      /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_FORCINT *)0xF01184ECu)

/** \\brief  184F0, FIFO0 channel 0 interrupt mode control register */
#define GTM_FIFO0_CH3_IRQ_MODE         /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_MODE *)0xF01184F0u)

/** \\brief  184E4, FIFO0 channel 0 interrupt notification register */
#define GTM_FIFO0_CH3_IRQ_NOTIFY       /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_NOTIFY *)0xF01184E4u)

/** \\brief  184D0, FIFO0 channel 0 lower watermark register */
#define GTM_FIFO0_CH3_LOWER_WM         /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_LOWER_WM *)0xF01184D0u)

/** \\brief  184E0, FIFO0 channel 0 read pointer register */
#define GTM_FIFO0_CH3_RD_PTR           /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_RD_PTR *)0xF01184E0u)

/** \\brief  184C8, FIFO0 channel 0 start address register */
#define GTM_FIFO0_CH3_START_ADDR       /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_START_ADDR *)0xF01184C8u)

/** \\brief  184D4, FIFO0 channel 0 status register */
#define GTM_FIFO0_CH3_STATUS           /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_STATUS *)0xF01184D4u)

/** \\brief  184CC, FIFO0 channel 0 upper watermark register */
#define GTM_FIFO0_CH3_UPPER_WM         /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_UPPER_WM *)0xF01184CCu)

/** \\brief  184DC, FIFO0 channel 0 write pointer register */
#define GTM_FIFO0_CH3_WR_PTR           /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_WR_PTR *)0xF01184DCu)

/** \\brief  18500, FIFO0 channel 0 control register */
#define GTM_FIFO0_CH4_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_CTRL *)0xF0118500u)

/** \\brief  18534, FIFO0 channel 0 error interrupt enable register */
#define GTM_FIFO0_CH4_EIRQ_EN          /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_EIRQ_EN *)0xF0118534u)

/** \\brief  18504, FIFO0 channel 0 end address register */
#define GTM_FIFO0_CH4_END_ADDR         /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_END_ADDR *)0xF0118504u)

/** \\brief  18518, FIFO0 channel 0 fill level register */
#define GTM_FIFO0_CH4_FILL_LEVEL       /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_FILL_LEVEL *)0xF0118518u)

/** \\brief  18528, FIFO0 channel 0 interrupt enable register */
#define GTM_FIFO0_CH4_IRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_EN *)0xF0118528u)

/** \\brief  1852C, FIFO0 channel 0 force interrupt register */
#define GTM_FIFO0_CH4_IRQ_FORCINT      /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_FORCINT *)0xF011852Cu)

/** \\brief  18530, FIFO0 channel 0 interrupt mode control register */
#define GTM_FIFO0_CH4_IRQ_MODE         /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_MODE *)0xF0118530u)

/** \\brief  18524, FIFO0 channel 0 interrupt notification register */
#define GTM_FIFO0_CH4_IRQ_NOTIFY       /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_NOTIFY *)0xF0118524u)

/** \\brief  18510, FIFO0 channel 0 lower watermark register */
#define GTM_FIFO0_CH4_LOWER_WM         /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_LOWER_WM *)0xF0118510u)

/** \\brief  18520, FIFO0 channel 0 read pointer register */
#define GTM_FIFO0_CH4_RD_PTR           /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_RD_PTR *)0xF0118520u)

/** \\brief  18508, FIFO0 channel 0 start address register */
#define GTM_FIFO0_CH4_START_ADDR       /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_START_ADDR *)0xF0118508u)

