Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  18514, FIFO0 channel 0 status register */
#define GTM_FIFO0_CH4_STATUS           /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_STATUS *)0xF0118514u)

/** \\brief  1850C, FIFO0 channel 0 upper watermark register */
#define GTM_FIFO0_CH4_UPPER_WM         /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_UPPER_WM *)0xF011850Cu)

/** \\brief  1851C, FIFO0 channel 0 write pointer register */
#define GTM_FIFO0_CH4_WR_PTR           /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_WR_PTR *)0xF011851Cu)

/** \\brief  18540, FIFO0 channel 0 control register */
#define GTM_FIFO0_CH5_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_CTRL *)0xF0118540u)

/** \\brief  18574, FIFO0 channel 0 error interrupt enable register */
#define GTM_FIFO0_CH5_EIRQ_EN          /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_EIRQ_EN *)0xF0118574u)

/** \\brief  18544, FIFO0 channel 0 end address register */
#define GTM_FIFO0_CH5_END_ADDR         /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_END_ADDR *)0xF0118544u)

/** \\brief  18558, FIFO0 channel 0 fill level register */
#define GTM_FIFO0_CH5_FILL_LEVEL       /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_FILL_LEVEL *)0xF0118558u)

/** \\brief  18568, FIFO0 channel 0 interrupt enable register */
#define GTM_FIFO0_CH5_IRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_EN *)0xF0118568u)

/** \\brief  1856C, FIFO0 channel 0 force interrupt register */
#define GTM_FIFO0_CH5_IRQ_FORCINT      /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_FORCINT *)0xF011856Cu)

/** \\brief  18570, FIFO0 channel 0 interrupt mode control register */
#define GTM_FIFO0_CH5_IRQ_MODE         /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_MODE *)0xF0118570u)

/** \\brief  18564, FIFO0 channel 0 interrupt notification register */
#define GTM_FIFO0_CH5_IRQ_NOTIFY       /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_NOTIFY *)0xF0118564u)

/** \\brief  18550, FIFO0 channel 0 lower watermark register */
#define GTM_FIFO0_CH5_LOWER_WM         /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_LOWER_WM *)0xF0118550u)

/** \\brief  18560, FIFO0 channel 0 read pointer register */
#define GTM_FIFO0_CH5_RD_PTR           /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_RD_PTR *)0xF0118560u)

/** \\brief  18548, FIFO0 channel 0 start address register */
#define GTM_FIFO0_CH5_START_ADDR       /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_START_ADDR *)0xF0118548u)

/** \\brief  18554, FIFO0 channel 0 status register */
#define GTM_FIFO0_CH5_STATUS           /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_STATUS *)0xF0118554u)

/** \\brief  1854C, FIFO0 channel 0 upper watermark register */
#define GTM_FIFO0_CH5_UPPER_WM         /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_UPPER_WM *)0xF011854Cu)

/** \\brief  1855C, FIFO0 channel 0 write pointer register */
#define GTM_FIFO0_CH5_WR_PTR           /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_WR_PTR *)0xF011855Cu)

/** \\brief  18580, FIFO0 channel 0 control register */
#define GTM_FIFO0_CH6_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_CTRL *)0xF0118580u)

/** \\brief  185B4, FIFO0 channel 0 error interrupt enable register */
#define GTM_FIFO0_CH6_EIRQ_EN          /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_EIRQ_EN *)0xF01185B4u)

/** \\brief  18584, FIFO0 channel 0 end address register */
#define GTM_FIFO0_CH6_END_ADDR         /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_END_ADDR *)0xF0118584u)

/** \\brief  18598, FIFO0 channel 0 fill level register */
#define GTM_FIFO0_CH6_FILL_LEVEL       /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_FILL_LEVEL *)0xF0118598u)

/** \\brief  185A8, FIFO0 channel 0 interrupt enable register */
#define GTM_FIFO0_CH6_IRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_EN *)0xF01185A8u)

/** \\brief  185AC, FIFO0 channel 0 force interrupt register */
#define GTM_FIFO0_CH6_IRQ_FORCINT      /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_FORCINT *)0xF01185ACu)

/** \\brief  185B0, FIFO0 channel 0 interrupt mode control register */
#define GTM_FIFO0_CH6_IRQ_MODE         /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_MODE *)0xF01185B0u)

/** \\brief  185A4, FIFO0 channel 0 interrupt notification register */
#define GTM_FIFO0_CH6_IRQ_NOTIFY       /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_NOTIFY *)0xF01185A4u)

/** \\brief  18590, FIFO0 channel 0 lower watermark register */
#define GTM_FIFO0_CH6_LOWER_WM         /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_LOWER_WM *)0xF0118590u)

/** \\brief  185A0, FIFO0 channel 0 read pointer register */
#define GTM_FIFO0_CH6_RD_PTR           /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_RD_PTR *)0xF01185A0u)

/** \\brief  18588, FIFO0 channel 0 start address register */
#define GTM_FIFO0_CH6_START_ADDR       /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_START_ADDR *)0xF0118588u)

/** \\brief  18594, FIFO0 channel 0 status register */
#define GTM_FIFO0_CH6_STATUS           /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_STATUS *)0xF0118594u)

/** \\brief  1858C, FIFO0 channel 0 upper watermark register */
#define GTM_FIFO0_CH6_UPPER_WM         /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_UPPER_WM *)0xF011858Cu)

/** \\brief  1859C, FIFO0 channel 0 write pointer register */
#define GTM_FIFO0_CH6_WR_PTR           /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_WR_PTR *)0xF011859Cu)

/** \\brief  185C0, FIFO0 channel 0 control register */
#define GTM_FIFO0_CH7_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_CTRL *)0xF01185C0u)

/** \\brief  185F4, FIFO0 channel 0 error interrupt enable register */
#define GTM_FIFO0_CH7_EIRQ_EN          /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_EIRQ_EN *)0xF01185F4u)

/** \\brief  185C4, FIFO0 channel 0 end address register */
#define GTM_FIFO0_CH7_END_ADDR         /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_END_ADDR *)0xF01185C4u)

/** \\brief  185D8, FIFO0 channel 0 fill level register */
#define GTM_FIFO0_CH7_FILL_LEVEL       /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_FILL_LEVEL *)0xF01185D8u)

