Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  185E8, FIFO0 channel 0 interrupt enable register */
#define GTM_FIFO0_CH7_IRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_EN *)0xF01185E8u)

/** \\brief  185EC, FIFO0 channel 0 force interrupt register */
#define GTM_FIFO0_CH7_IRQ_FORCINT      /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_FORCINT *)0xF01185ECu)

/** \\brief  185F0, FIFO0 channel 0 interrupt mode control register */
#define GTM_FIFO0_CH7_IRQ_MODE         /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_MODE *)0xF01185F0u)

/** \\brief  185E4, FIFO0 channel 0 interrupt notification register */
#define GTM_FIFO0_CH7_IRQ_NOTIFY       /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_NOTIFY *)0xF01185E4u)

/** \\brief  185D0, FIFO0 channel 0 lower watermark register */
#define GTM_FIFO0_CH7_LOWER_WM         /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_LOWER_WM *)0xF01185D0u)

/** \\brief  185E0, FIFO0 channel 0 read pointer register */
#define GTM_FIFO0_CH7_RD_PTR           /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_RD_PTR *)0xF01185E0u)

/** \\brief  185C8, FIFO0 channel 0 start address register */
#define GTM_FIFO0_CH7_START_ADDR       /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_START_ADDR *)0xF01185C8u)

/** \\brief  185D4, FIFO0 channel 0 status register */
#define GTM_FIFO0_CH7_STATUS           /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_STATUS *)0xF01185D4u)

/** \\brief  185CC, FIFO0 channel 0 upper watermark register */
#define GTM_FIFO0_CH7_UPPER_WM         /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_UPPER_WM *)0xF01185CCu)

/** \\brief  185DC, FIFO0 channel 0 write pointer register */
#define GTM_FIFO0_CH7_WR_PTR           /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_WR_PTR *)0xF01185DCu)

/** \\brief  1C400, FIFO0 channel 0 control register */
#define GTM_FIFO1_CH0_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_CTRL *)0xF011C400u)

/** \\brief  1C434, FIFO0 channel 0 error interrupt enable register */
#define GTM_FIFO1_CH0_EIRQ_EN          /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_EIRQ_EN *)0xF011C434u)

/** \\brief  1C404, FIFO0 channel 0 end address register */
#define GTM_FIFO1_CH0_END_ADDR         /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_END_ADDR *)0xF011C404u)

/** \\brief  1C418, FIFO0 channel 0 fill level register */
#define GTM_FIFO1_CH0_FILL_LEVEL       /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_FILL_LEVEL *)0xF011C418u)

/** \\brief  1C428, FIFO0 channel 0 interrupt enable register */
#define GTM_FIFO1_CH0_IRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_EN *)0xF011C428u)

/** \\brief  1C42C, FIFO0 channel 0 force interrupt register */
#define GTM_FIFO1_CH0_IRQ_FORCINT      /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_FORCINT *)0xF011C42Cu)

/** \\brief  1C430, FIFO0 channel 0 interrupt mode control register */
#define GTM_FIFO1_CH0_IRQ_MODE         /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_MODE *)0xF011C430u)

/** \\brief  1C424, FIFO0 channel 0 interrupt notification register */
#define GTM_FIFO1_CH0_IRQ_NOTIFY       /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_NOTIFY *)0xF011C424u)

/** \\brief  1C410, FIFO0 channel 0 lower watermark register */
#define GTM_FIFO1_CH0_LOWER_WM         /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_LOWER_WM *)0xF011C410u)

/** \\brief  1C420, FIFO0 channel 0 read pointer register */
#define GTM_FIFO1_CH0_RD_PTR           /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_RD_PTR *)0xF011C420u)

/** \\brief  1C408, FIFO0 channel 0 start address register */
#define GTM_FIFO1_CH0_START_ADDR       /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_START_ADDR *)0xF011C408u)

/** \\brief  1C414, FIFO0 channel 0 status register */
#define GTM_FIFO1_CH0_STATUS           /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_STATUS *)0xF011C414u)

/** \\brief  1C40C, FIFO0 channel 0 upper watermark register */
#define GTM_FIFO1_CH0_UPPER_WM         /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_UPPER_WM *)0xF011C40Cu)

/** \\brief  1C41C, FIFO0 channel 0 write pointer register */
#define GTM_FIFO1_CH0_WR_PTR           /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_WR_PTR *)0xF011C41Cu)

/** \\brief  1C440, FIFO0 channel 0 control register */
#define GTM_FIFO1_CH1_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_CTRL *)0xF011C440u)

/** \\brief  1C474, FIFO0 channel 0 error interrupt enable register */
#define GTM_FIFO1_CH1_EIRQ_EN          /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_EIRQ_EN *)0xF011C474u)

/** \\brief  1C444, FIFO0 channel 0 end address register */
#define GTM_FIFO1_CH1_END_ADDR         /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_END_ADDR *)0xF011C444u)

/** \\brief  1C458, FIFO0 channel 0 fill level register */
#define GTM_FIFO1_CH1_FILL_LEVEL       /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_FILL_LEVEL *)0xF011C458u)

/** \\brief  1C468, FIFO0 channel 0 interrupt enable register */
#define GTM_FIFO1_CH1_IRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_EN *)0xF011C468u)

/** \\brief  1C46C, FIFO0 channel 0 force interrupt register */
#define GTM_FIFO1_CH1_IRQ_FORCINT      /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_FORCINT *)0xF011C46Cu)

/** \\brief  1C470, FIFO0 channel 0 interrupt mode control register */
#define GTM_FIFO1_CH1_IRQ_MODE         /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_MODE *)0xF011C470u)

/** \\brief  1C464, FIFO0 channel 0 interrupt notification register */
#define GTM_FIFO1_CH1_IRQ_NOTIFY       /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_NOTIFY *)0xF011C464u)

/** \\brief  1C450, FIFO0 channel 0 lower watermark register */
#define GTM_FIFO1_CH1_LOWER_WM         /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_LOWER_WM *)0xF011C450u)

/** \\brief  1C460, FIFO0 channel 0 read pointer register */
#define GTM_FIFO1_CH1_RD_PTR           /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_RD_PTR *)0xF011C460u)

/** \\brief  1C448, FIFO0 channel 0 start address register */
#define GTM_FIFO1_CH1_START_ADDR       /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_START_ADDR *)0xF011C448u)

