Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  1C454, FIFO0 channel 0 status register */
#define GTM_FIFO1_CH1_STATUS           /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_STATUS *)0xF011C454u)

/** \\brief  1C44C, FIFO0 channel 0 upper watermark register */
#define GTM_FIFO1_CH1_UPPER_WM         /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_UPPER_WM *)0xF011C44Cu)

/** \\brief  1C45C, FIFO0 channel 0 write pointer register */
#define GTM_FIFO1_CH1_WR_PTR           /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_WR_PTR *)0xF011C45Cu)

/** \\brief  1C480, FIFO0 channel 0 control register */
#define GTM_FIFO1_CH2_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_CTRL *)0xF011C480u)

/** \\brief  1C4B4, FIFO0 channel 0 error interrupt enable register */
#define GTM_FIFO1_CH2_EIRQ_EN          /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_EIRQ_EN *)0xF011C4B4u)

/** \\brief  1C484, FIFO0 channel 0 end address register */
#define GTM_FIFO1_CH2_END_ADDR         /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_END_ADDR *)0xF011C484u)

/** \\brief  1C498, FIFO0 channel 0 fill level register */
#define GTM_FIFO1_CH2_FILL_LEVEL       /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_FILL_LEVEL *)0xF011C498u)

/** \\brief  1C4A8, FIFO0 channel 0 interrupt enable register */
#define GTM_FIFO1_CH2_IRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_EN *)0xF011C4A8u)

/** \\brief  1C4AC, FIFO0 channel 0 force interrupt register */
#define GTM_FIFO1_CH2_IRQ_FORCINT      /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_FORCINT *)0xF011C4ACu)

/** \\brief  1C4B0, FIFO0 channel 0 interrupt mode control register */
#define GTM_FIFO1_CH2_IRQ_MODE         /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_MODE *)0xF011C4B0u)

/** \\brief  1C4A4, FIFO0 channel 0 interrupt notification register */
#define GTM_FIFO1_CH2_IRQ_NOTIFY       /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_NOTIFY *)0xF011C4A4u)

/** \\brief  1C490, FIFO0 channel 0 lower watermark register */
#define GTM_FIFO1_CH2_LOWER_WM         /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_LOWER_WM *)0xF011C490u)

/** \\brief  1C4A0, FIFO0 channel 0 read pointer register */
#define GTM_FIFO1_CH2_RD_PTR           /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_RD_PTR *)0xF011C4A0u)

/** \\brief  1C488, FIFO0 channel 0 start address register */
#define GTM_FIFO1_CH2_START_ADDR       /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_START_ADDR *)0xF011C488u)

/** \\brief  1C494, FIFO0 channel 0 status register */
#define GTM_FIFO1_CH2_STATUS           /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_STATUS *)0xF011C494u)

/** \\brief  1C48C, FIFO0 channel 0 upper watermark register */
#define GTM_FIFO1_CH2_UPPER_WM         /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_UPPER_WM *)0xF011C48Cu)

/** \\brief  1C49C, FIFO0 channel 0 write pointer register */
#define GTM_FIFO1_CH2_WR_PTR           /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_WR_PTR *)0xF011C49Cu)

/** \\brief  1C4C0, FIFO0 channel 0 control register */
#define GTM_FIFO1_CH3_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_CTRL *)0xF011C4C0u)

/** \\brief  1C4F4, FIFO0 channel 0 error interrupt enable register */
#define GTM_FIFO1_CH3_EIRQ_EN          /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_EIRQ_EN *)0xF011C4F4u)

/** \\brief  1C4C4, FIFO0 channel 0 end address register */
#define GTM_FIFO1_CH3_END_ADDR         /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_END_ADDR *)0xF011C4C4u)

/** \\brief  1C4D8, FIFO0 channel 0 fill level register */
#define GTM_FIFO1_CH3_FILL_LEVEL       /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_FILL_LEVEL *)0xF011C4D8u)

/** \\brief  1C4E8, FIFO0 channel 0 interrupt enable register */
#define GTM_FIFO1_CH3_IRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_EN *)0xF011C4E8u)

/** \\brief  1C4EC, FIFO0 channel 0 force interrupt register */
#define GTM_FIFO1_CH3_IRQ_FORCINT      /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_FORCINT *)0xF011C4ECu)

/** \\brief  1C4F0, FIFO0 channel 0 interrupt mode control register */
#define GTM_FIFO1_CH3_IRQ_MODE         /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_MODE *)0xF011C4F0u)

/** \\brief  1C4E4, FIFO0 channel 0 interrupt notification register */
#define GTM_FIFO1_CH3_IRQ_NOTIFY       /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_NOTIFY *)0xF011C4E4u)

/** \\brief  1C4D0, FIFO0 channel 0 lower watermark register */
#define GTM_FIFO1_CH3_LOWER_WM         /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_LOWER_WM *)0xF011C4D0u)

/** \\brief  1C4E0, FIFO0 channel 0 read pointer register */
#define GTM_FIFO1_CH3_RD_PTR           /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_RD_PTR *)0xF011C4E0u)

/** \\brief  1C4C8, FIFO0 channel 0 start address register */
#define GTM_FIFO1_CH3_START_ADDR       /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_START_ADDR *)0xF011C4C8u)

/** \\brief  1C4D4, FIFO0 channel 0 status register */
#define GTM_FIFO1_CH3_STATUS           /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_STATUS *)0xF011C4D4u)

/** \\brief  1C4CC, FIFO0 channel 0 upper watermark register */
#define GTM_FIFO1_CH3_UPPER_WM         /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_UPPER_WM *)0xF011C4CCu)

/** \\brief  1C4DC, FIFO0 channel 0 write pointer register */
#define GTM_FIFO1_CH3_WR_PTR           /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_WR_PTR *)0xF011C4DCu)

/** \\brief  1C500, FIFO0 channel 0 control register */
#define GTM_FIFO1_CH4_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_CTRL *)0xF011C500u)

/** \\brief  1C534, FIFO0 channel 0 error interrupt enable register */
#define GTM_FIFO1_CH4_EIRQ_EN          /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_EIRQ_EN *)0xF011C534u)

/** \\brief  1C504, FIFO0 channel 0 end address register */
#define GTM_FIFO1_CH4_END_ADDR         /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_END_ADDR *)0xF011C504u)

/** \\brief  1C518, FIFO0 channel 0 fill level register */
#define GTM_FIFO1_CH4_FILL_LEVEL       /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_FILL_LEVEL *)0xF011C518u)

