Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  1C528, FIFO0 channel 0 interrupt enable register */
#define GTM_FIFO1_CH4_IRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_EN *)0xF011C528u)

/** \\brief  1C52C, FIFO0 channel 0 force interrupt register */
#define GTM_FIFO1_CH4_IRQ_FORCINT      /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_FORCINT *)0xF011C52Cu)

/** \\brief  1C530, FIFO0 channel 0 interrupt mode control register */
#define GTM_FIFO1_CH4_IRQ_MODE         /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_MODE *)0xF011C530u)

/** \\brief  1C524, FIFO0 channel 0 interrupt notification register */
#define GTM_FIFO1_CH4_IRQ_NOTIFY       /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_NOTIFY *)0xF011C524u)

/** \\brief  1C510, FIFO0 channel 0 lower watermark register */
#define GTM_FIFO1_CH4_LOWER_WM         /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_LOWER_WM *)0xF011C510u)

/** \\brief  1C520, FIFO0 channel 0 read pointer register */
#define GTM_FIFO1_CH4_RD_PTR           /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_RD_PTR *)0xF011C520u)

/** \\brief  1C508, FIFO0 channel 0 start address register */
#define GTM_FIFO1_CH4_START_ADDR       /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_START_ADDR *)0xF011C508u)

/** \\brief  1C514, FIFO0 channel 0 status register */
#define GTM_FIFO1_CH4_STATUS           /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_STATUS *)0xF011C514u)

/** \\brief  1C50C, FIFO0 channel 0 upper watermark register */
#define GTM_FIFO1_CH4_UPPER_WM         /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_UPPER_WM *)0xF011C50Cu)

/** \\brief  1C51C, FIFO0 channel 0 write pointer register */
#define GTM_FIFO1_CH4_WR_PTR           /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_WR_PTR *)0xF011C51Cu)

/** \\brief  1C540, FIFO0 channel 0 control register */
#define GTM_FIFO1_CH5_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_CTRL *)0xF011C540u)

/** \\brief  1C574, FIFO0 channel 0 error interrupt enable register */
#define GTM_FIFO1_CH5_EIRQ_EN          /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_EIRQ_EN *)0xF011C574u)

/** \\brief  1C544, FIFO0 channel 0 end address register */
#define GTM_FIFO1_CH5_END_ADDR         /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_END_ADDR *)0xF011C544u)

/** \\brief  1C558, FIFO0 channel 0 fill level register */
#define GTM_FIFO1_CH5_FILL_LEVEL       /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_FILL_LEVEL *)0xF011C558u)

/** \\brief  1C568, FIFO0 channel 0 interrupt enable register */
#define GTM_FIFO1_CH5_IRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_EN *)0xF011C568u)

/** \\brief  1C56C, FIFO0 channel 0 force interrupt register */
#define GTM_FIFO1_CH5_IRQ_FORCINT      /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_FORCINT *)0xF011C56Cu)

/** \\brief  1C570, FIFO0 channel 0 interrupt mode control register */
#define GTM_FIFO1_CH5_IRQ_MODE         /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_MODE *)0xF011C570u)

/** \\brief  1C564, FIFO0 channel 0 interrupt notification register */
#define GTM_FIFO1_CH5_IRQ_NOTIFY       /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_NOTIFY *)0xF011C564u)

/** \\brief  1C550, FIFO0 channel 0 lower watermark register */
#define GTM_FIFO1_CH5_LOWER_WM         /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_LOWER_WM *)0xF011C550u)

/** \\brief  1C560, FIFO0 channel 0 read pointer register */
#define GTM_FIFO1_CH5_RD_PTR           /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_RD_PTR *)0xF011C560u)

/** \\brief  1C548, FIFO0 channel 0 start address register */
#define GTM_FIFO1_CH5_START_ADDR       /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_START_ADDR *)0xF011C548u)

/** \\brief  1C554, FIFO0 channel 0 status register */
#define GTM_FIFO1_CH5_STATUS           /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_STATUS *)0xF011C554u)

/** \\brief  1C54C, FIFO0 channel 0 upper watermark register */
#define GTM_FIFO1_CH5_UPPER_WM         /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_UPPER_WM *)0xF011C54Cu)

/** \\brief  1C55C, FIFO0 channel 0 write pointer register */
#define GTM_FIFO1_CH5_WR_PTR           /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_WR_PTR *)0xF011C55Cu)

/** \\brief  1C580, FIFO0 channel 0 control register */
#define GTM_FIFO1_CH6_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_CTRL *)0xF011C580u)

/** \\brief  1C5B4, FIFO0 channel 0 error interrupt enable register */
#define GTM_FIFO1_CH6_EIRQ_EN          /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_EIRQ_EN *)0xF011C5B4u)

/** \\brief  1C584, FIFO0 channel 0 end address register */
#define GTM_FIFO1_CH6_END_ADDR         /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_END_ADDR *)0xF011C584u)

/** \\brief  1C598, FIFO0 channel 0 fill level register */
#define GTM_FIFO1_CH6_FILL_LEVEL       /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_FILL_LEVEL *)0xF011C598u)

/** \\brief  1C5A8, FIFO0 channel 0 interrupt enable register */
#define GTM_FIFO1_CH6_IRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_EN *)0xF011C5A8u)

/** \\brief  1C5AC, FIFO0 channel 0 force interrupt register */
#define GTM_FIFO1_CH6_IRQ_FORCINT      /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_FORCINT *)0xF011C5ACu)

/** \\brief  1C5B0, FIFO0 channel 0 interrupt mode control register */
#define GTM_FIFO1_CH6_IRQ_MODE         /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_MODE *)0xF011C5B0u)

/** \\brief  1C5A4, FIFO0 channel 0 interrupt notification register */
#define GTM_FIFO1_CH6_IRQ_NOTIFY       /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_NOTIFY *)0xF011C5A4u)

/** \\brief  1C590, FIFO0 channel 0 lower watermark register */
#define GTM_FIFO1_CH6_LOWER_WM         /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_LOWER_WM *)0xF011C590u)

/** \\brief  1C5A0, FIFO0 channel 0 read pointer register */
#define GTM_FIFO1_CH6_RD_PTR           /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_RD_PTR *)0xF011C5A0u)

/** \\brief  1C588, FIFO0 channel 0 start address register */
#define GTM_FIFO1_CH6_START_ADDR       /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_START_ADDR *)0xF011C588u)

