Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  1C594, FIFO0 channel 0 status register */
#define GTM_FIFO1_CH6_STATUS           /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_STATUS *)0xF011C594u)

/** \\brief  1C58C, FIFO0 channel 0 upper watermark register */
#define GTM_FIFO1_CH6_UPPER_WM         /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_UPPER_WM *)0xF011C58Cu)

/** \\brief  1C59C, FIFO0 channel 0 write pointer register */
#define GTM_FIFO1_CH6_WR_PTR           /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_WR_PTR *)0xF011C59Cu)

/** \\brief  1C5C0, FIFO0 channel 0 control register */
#define GTM_FIFO1_CH7_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_CTRL *)0xF011C5C0u)

/** \\brief  1C5F4, FIFO0 channel 0 error interrupt enable register */
#define GTM_FIFO1_CH7_EIRQ_EN          /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_EIRQ_EN *)0xF011C5F4u)

/** \\brief  1C5C4, FIFO0 channel 0 end address register */
#define GTM_FIFO1_CH7_END_ADDR         /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_END_ADDR *)0xF011C5C4u)

/** \\brief  1C5D8, FIFO0 channel 0 fill level register */
#define GTM_FIFO1_CH7_FILL_LEVEL       /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_FILL_LEVEL *)0xF011C5D8u)

/** \\brief  1C5E8, FIFO0 channel 0 interrupt enable register */
#define GTM_FIFO1_CH7_IRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_EN *)0xF011C5E8u)

/** \\brief  1C5EC, FIFO0 channel 0 force interrupt register */
#define GTM_FIFO1_CH7_IRQ_FORCINT      /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_FORCINT *)0xF011C5ECu)

/** \\brief  1C5F0, FIFO0 channel 0 interrupt mode control register */
#define GTM_FIFO1_CH7_IRQ_MODE         /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_MODE *)0xF011C5F0u)

/** \\brief  1C5E4, FIFO0 channel 0 interrupt notification register */
#define GTM_FIFO1_CH7_IRQ_NOTIFY       /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_NOTIFY *)0xF011C5E4u)

/** \\brief  1C5D0, FIFO0 channel 0 lower watermark register */
#define GTM_FIFO1_CH7_LOWER_WM         /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_LOWER_WM *)0xF011C5D0u)

/** \\brief  1C5E0, FIFO0 channel 0 read pointer register */
#define GTM_FIFO1_CH7_RD_PTR           /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_RD_PTR *)0xF011C5E0u)

/** \\brief  1C5C8, FIFO0 channel 0 start address register */
#define GTM_FIFO1_CH7_START_ADDR       /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_START_ADDR *)0xF011C5C8u)

/** \\brief  1C5D4, FIFO0 channel 0 status register */
#define GTM_FIFO1_CH7_STATUS           /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_STATUS *)0xF011C5D4u)

/** \\brief  1C5CC, FIFO0 channel 0 upper watermark register */
#define GTM_FIFO1_CH7_UPPER_WM         /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_UPPER_WM *)0xF011C5CCu)

/** \\brief  1C5DC, FIFO0 channel 0 write pointer register */
#define GTM_FIFO1_CH7_WR_PTR           /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_WR_PTR *)0xF011C5DCu)

/** \\brief  20400, FIFO0 channel 0 control register */
#define GTM_FIFO2_CH0_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_CTRL *)0xF0120400u)

/** \\brief  20434, FIFO0 channel 0 error interrupt enable register */
#define GTM_FIFO2_CH0_EIRQ_EN          /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_EIRQ_EN *)0xF0120434u)

/** \\brief  20404, FIFO0 channel 0 end address register */
#define GTM_FIFO2_CH0_END_ADDR         /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_END_ADDR *)0xF0120404u)

/** \\brief  20418, FIFO0 channel 0 fill level register */
#define GTM_FIFO2_CH0_FILL_LEVEL       /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_FILL_LEVEL *)0xF0120418u)

/** \\brief  20428, FIFO0 channel 0 interrupt enable register */
#define GTM_FIFO2_CH0_IRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_EN *)0xF0120428u)

/** \\brief  2042C, FIFO0 channel 0 force interrupt register */
#define GTM_FIFO2_CH0_IRQ_FORCINT      /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_FORCINT *)0xF012042Cu)

/** \\brief  20430, FIFO0 channel 0 interrupt mode control register */
#define GTM_FIFO2_CH0_IRQ_MODE         /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_MODE *)0xF0120430u)

/** \\brief  20424, FIFO0 channel 0 interrupt notification register */
#define GTM_FIFO2_CH0_IRQ_NOTIFY       /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_NOTIFY *)0xF0120424u)

/** \\brief  20410, FIFO0 channel 0 lower watermark register */
#define GTM_FIFO2_CH0_LOWER_WM         /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_LOWER_WM *)0xF0120410u)

/** \\brief  20420, FIFO0 channel 0 read pointer register */
#define GTM_FIFO2_CH0_RD_PTR           /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_RD_PTR *)0xF0120420u)

/** \\brief  20408, FIFO0 channel 0 start address register */
#define GTM_FIFO2_CH0_START_ADDR       /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_START_ADDR *)0xF0120408u)

/** \\brief  20414, FIFO0 channel 0 status register */
#define GTM_FIFO2_CH0_STATUS           /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_STATUS *)0xF0120414u)

/** \\brief  2040C, FIFO0 channel 0 upper watermark register */
#define GTM_FIFO2_CH0_UPPER_WM         /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_UPPER_WM *)0xF012040Cu)

/** \\brief  2041C, FIFO0 channel 0 write pointer register */
#define GTM_FIFO2_CH0_WR_PTR           /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_WR_PTR *)0xF012041Cu)

/** \\brief  20440, FIFO0 channel 0 control register */
#define GTM_FIFO2_CH1_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_CTRL *)0xF0120440u)

/** \\brief  20474, FIFO0 channel 0 error interrupt enable register */
#define GTM_FIFO2_CH1_EIRQ_EN          /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_EIRQ_EN *)0xF0120474u)

/** \\brief  20444, FIFO0 channel 0 end address register */
#define GTM_FIFO2_CH1_END_ADDR         /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_END_ADDR *)0xF0120444u)

/** \\brief  20458, FIFO0 channel 0 fill level register */
#define GTM_FIFO2_CH1_FILL_LEVEL       /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_FILL_LEVEL *)0xF0120458u)

/** \\brief  20468, FIFO0 channel 0 interrupt enable register */
#define GTM_FIFO2_CH1_IRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_EN *)0xF0120468u)

/** \\brief  2046C, FIFO0 channel 0 force interrupt register */
#define GTM_FIFO2_CH1_IRQ_FORCINT      /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_FORCINT *)0xF012046Cu)

/** \\brief  20470, FIFO0 channel 0 interrupt mode control register */
#define GTM_FIFO2_CH1_IRQ_MODE         /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_MODE *)0xF0120470u)

/** \\brief  20464, FIFO0 channel 0 interrupt notification register */
#define GTM_FIFO2_CH1_IRQ_NOTIFY       /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_NOTIFY *)0xF0120464u)

/** \\brief  20450, FIFO0 channel 0 lower watermark register */
#define GTM_FIFO2_CH1_LOWER_WM         /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_LOWER_WM *)0xF0120450u)

/** \\brief  20460, FIFO0 channel 0 read pointer register */
#define GTM_FIFO2_CH1_RD_PTR           /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_RD_PTR *)0xF0120460u)

