Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  20448, FIFO0 channel 0 start address register */
#define GTM_FIFO2_CH1_START_ADDR       /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_START_ADDR *)0xF0120448u)

/** \\brief  20454, FIFO0 channel 0 status register */
#define GTM_FIFO2_CH1_STATUS           /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_STATUS *)0xF0120454u)

/** \\brief  2044C, FIFO0 channel 0 upper watermark register */
#define GTM_FIFO2_CH1_UPPER_WM         /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_UPPER_WM *)0xF012044Cu)

/** \\brief  2045C, FIFO0 channel 0 write pointer register */
#define GTM_FIFO2_CH1_WR_PTR           /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_WR_PTR *)0xF012045Cu)

/** \\brief  20480, FIFO0 channel 0 control register */
#define GTM_FIFO2_CH2_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_CTRL *)0xF0120480u)

/** \\brief  204B4, FIFO0 channel 0 error interrupt enable register */
#define GTM_FIFO2_CH2_EIRQ_EN          /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_EIRQ_EN *)0xF01204B4u)

/** \\brief  20484, FIFO0 channel 0 end address register */
#define GTM_FIFO2_CH2_END_ADDR         /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_END_ADDR *)0xF0120484u)

/** \\brief  20498, FIFO0 channel 0 fill level register */
#define GTM_FIFO2_CH2_FILL_LEVEL       /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_FILL_LEVEL *)0xF0120498u)

/** \\brief  204A8, FIFO0 channel 0 interrupt enable register */
#define GTM_FIFO2_CH2_IRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_EN *)0xF01204A8u)

/** \\brief  204AC, FIFO0 channel 0 force interrupt register */
#define GTM_FIFO2_CH2_IRQ_FORCINT      /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_FORCINT *)0xF01204ACu)

/** \\brief  204B0, FIFO0 channel 0 interrupt mode control register */
#define GTM_FIFO2_CH2_IRQ_MODE         /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_MODE *)0xF01204B0u)

/** \\brief  204A4, FIFO0 channel 0 interrupt notification register */
#define GTM_FIFO2_CH2_IRQ_NOTIFY       /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_NOTIFY *)0xF01204A4u)

/** \\brief  20490, FIFO0 channel 0 lower watermark register */
#define GTM_FIFO2_CH2_LOWER_WM         /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_LOWER_WM *)0xF0120490u)

/** \\brief  204A0, FIFO0 channel 0 read pointer register */
#define GTM_FIFO2_CH2_RD_PTR           /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_RD_PTR *)0xF01204A0u)

/** \\brief  20488, FIFO0 channel 0 start address register */
#define GTM_FIFO2_CH2_START_ADDR       /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_START_ADDR *)0xF0120488u)

/** \\brief  20494, FIFO0 channel 0 status register */
#define GTM_FIFO2_CH2_STATUS           /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_STATUS *)0xF0120494u)

/** \\brief  2048C, FIFO0 channel 0 upper watermark register */
#define GTM_FIFO2_CH2_UPPER_WM         /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_UPPER_WM *)0xF012048Cu)

/** \\brief  2049C, FIFO0 channel 0 write pointer register */
#define GTM_FIFO2_CH2_WR_PTR           /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_WR_PTR *)0xF012049Cu)

/** \\brief  204C0, FIFO0 channel 0 control register */
#define GTM_FIFO2_CH3_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_CTRL *)0xF01204C0u)

/** \\brief  204F4, FIFO0 channel 0 error interrupt enable register */
#define GTM_FIFO2_CH3_EIRQ_EN          /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_EIRQ_EN *)0xF01204F4u)

/** \\brief  204C4, FIFO0 channel 0 end address register */
#define GTM_FIFO2_CH3_END_ADDR         /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_END_ADDR *)0xF01204C4u)

/** \\brief  204D8, FIFO0 channel 0 fill level register */
#define GTM_FIFO2_CH3_FILL_LEVEL       /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_FILL_LEVEL *)0xF01204D8u)

/** \\brief  204E8, FIFO0 channel 0 interrupt enable register */
#define GTM_FIFO2_CH3_IRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_EN *)0xF01204E8u)

/** \\brief  204EC, FIFO0 channel 0 force interrupt register */
#define GTM_FIFO2_CH3_IRQ_FORCINT      /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_FORCINT *)0xF01204ECu)

/** \\brief  204F0, FIFO0 channel 0 interrupt mode control register */
#define GTM_FIFO2_CH3_IRQ_MODE         /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_MODE *)0xF01204F0u)

/** \\brief  204E4, FIFO0 channel 0 interrupt notification register */
#define GTM_FIFO2_CH3_IRQ_NOTIFY       /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_NOTIFY *)0xF01204E4u)

/** \\brief  204D0, FIFO0 channel 0 lower watermark register */
#define GTM_FIFO2_CH3_LOWER_WM         /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_LOWER_WM *)0xF01204D0u)

/** \\brief  204E0, FIFO0 channel 0 read pointer register */
#define GTM_FIFO2_CH3_RD_PTR           /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_RD_PTR *)0xF01204E0u)

/** \\brief  204C8, FIFO0 channel 0 start address register */
#define GTM_FIFO2_CH3_START_ADDR       /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_START_ADDR *)0xF01204C8u)

/** \\brief  204D4, FIFO0 channel 0 status register */
#define GTM_FIFO2_CH3_STATUS           /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_STATUS *)0xF01204D4u)

/** \\brief  204CC, FIFO0 channel 0 upper watermark register */
#define GTM_FIFO2_CH3_UPPER_WM         /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_UPPER_WM *)0xF01204CCu)

/** \\brief  204DC, FIFO0 channel 0 write pointer register */
#define GTM_FIFO2_CH3_WR_PTR           /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_WR_PTR *)0xF01204DCu)

/** \\brief  20500, FIFO0 channel 0 control register */
#define GTM_FIFO2_CH4_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_CTRL *)0xF0120500u)

/** \\brief  20534, FIFO0 channel 0 error interrupt enable register */
#define GTM_FIFO2_CH4_EIRQ_EN          /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_EIRQ_EN *)0xF0120534u)

/** \\brief  20504, FIFO0 channel 0 end address register */
#define GTM_FIFO2_CH4_END_ADDR         /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_END_ADDR *)0xF0120504u)

/** \\brief  20518, FIFO0 channel 0 fill level register */
#define GTM_FIFO2_CH4_FILL_LEVEL       /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_FILL_LEVEL *)0xF0120518u)

/** \\brief  20528, FIFO0 channel 0 interrupt enable register */
#define GTM_FIFO2_CH4_IRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_EN *)0xF0120528u)

/** \\brief  2052C, FIFO0 channel 0 force interrupt register */
#define GTM_FIFO2_CH4_IRQ_FORCINT      /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_FORCINT *)0xF012052Cu)

/** \\brief  20530, FIFO0 channel 0 interrupt mode control register */
#define GTM_FIFO2_CH4_IRQ_MODE         /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_MODE *)0xF0120530u)

/** \\brief  20524, FIFO0 channel 0 interrupt notification register */
#define GTM_FIFO2_CH4_IRQ_NOTIFY       /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_NOTIFY *)0xF0120524u)

/** \\brief  20510, FIFO0 channel 0 lower watermark register */
#define GTM_FIFO2_CH4_LOWER_WM         /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_LOWER_WM *)0xF0120510u)

/** \\brief  20520, FIFO0 channel 0 read pointer register */
#define GTM_FIFO2_CH4_RD_PTR           /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_RD_PTR *)0xF0120520u)

