Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  20508, FIFO0 channel 0 start address register */
#define GTM_FIFO2_CH4_START_ADDR       /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_START_ADDR *)0xF0120508u)

/** \\brief  20514, FIFO0 channel 0 status register */
#define GTM_FIFO2_CH4_STATUS           /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_STATUS *)0xF0120514u)

/** \\brief  2050C, FIFO0 channel 0 upper watermark register */
#define GTM_FIFO2_CH4_UPPER_WM         /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_UPPER_WM *)0xF012050Cu)

/** \\brief  2051C, FIFO0 channel 0 write pointer register */
#define GTM_FIFO2_CH4_WR_PTR           /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_WR_PTR *)0xF012051Cu)

/** \\brief  20540, FIFO0 channel 0 control register */
#define GTM_FIFO2_CH5_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_CTRL *)0xF0120540u)

/** \\brief  20574, FIFO0 channel 0 error interrupt enable register */
#define GTM_FIFO2_CH5_EIRQ_EN          /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_EIRQ_EN *)0xF0120574u)

/** \\brief  20544, FIFO0 channel 0 end address register */
#define GTM_FIFO2_CH5_END_ADDR         /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_END_ADDR *)0xF0120544u)

/** \\brief  20558, FIFO0 channel 0 fill level register */
#define GTM_FIFO2_CH5_FILL_LEVEL       /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_FILL_LEVEL *)0xF0120558u)

/** \\brief  20568, FIFO0 channel 0 interrupt enable register */
#define GTM_FIFO2_CH5_IRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_EN *)0xF0120568u)

/** \\brief  2056C, FIFO0 channel 0 force interrupt register */
#define GTM_FIFO2_CH5_IRQ_FORCINT      /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_FORCINT *)0xF012056Cu)

/** \\brief  20570, FIFO0 channel 0 interrupt mode control register */
#define GTM_FIFO2_CH5_IRQ_MODE         /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_MODE *)0xF0120570u)

/** \\brief  20564, FIFO0 channel 0 interrupt notification register */
#define GTM_FIFO2_CH5_IRQ_NOTIFY       /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_NOTIFY *)0xF0120564u)

/** \\brief  20550, FIFO0 channel 0 lower watermark register */
#define GTM_FIFO2_CH5_LOWER_WM         /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_LOWER_WM *)0xF0120550u)

/** \\brief  20560, FIFO0 channel 0 read pointer register */
#define GTM_FIFO2_CH5_RD_PTR           /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_RD_PTR *)0xF0120560u)

/** \\brief  20548, FIFO0 channel 0 start address register */
#define GTM_FIFO2_CH5_START_ADDR       /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_START_ADDR *)0xF0120548u)

/** \\brief  20554, FIFO0 channel 0 status register */
#define GTM_FIFO2_CH5_STATUS           /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_STATUS *)0xF0120554u)

/** \\brief  2054C, FIFO0 channel 0 upper watermark register */
#define GTM_FIFO2_CH5_UPPER_WM         /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_UPPER_WM *)0xF012054Cu)

/** \\brief  2055C, FIFO0 channel 0 write pointer register */
#define GTM_FIFO2_CH5_WR_PTR           /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_WR_PTR *)0xF012055Cu)

/** \\brief  20580, FIFO0 channel 0 control register */
#define GTM_FIFO2_CH6_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_CTRL *)0xF0120580u)

/** \\brief  205B4, FIFO0 channel 0 error interrupt enable register */
#define GTM_FIFO2_CH6_EIRQ_EN          /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_EIRQ_EN *)0xF01205B4u)

/** \\brief  20584, FIFO0 channel 0 end address register */
#define GTM_FIFO2_CH6_END_ADDR         /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_END_ADDR *)0xF0120584u)

/** \\brief  20598, FIFO0 channel 0 fill level register */
#define GTM_FIFO2_CH6_FILL_LEVEL       /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_FILL_LEVEL *)0xF0120598u)

/** \\brief  205A8, FIFO0 channel 0 interrupt enable register */
#define GTM_FIFO2_CH6_IRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_EN *)0xF01205A8u)

/** \\brief  205AC, FIFO0 channel 0 force interrupt register */
#define GTM_FIFO2_CH6_IRQ_FORCINT      /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_FORCINT *)0xF01205ACu)

/** \\brief  205B0, FIFO0 channel 0 interrupt mode control register */
#define GTM_FIFO2_CH6_IRQ_MODE         /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_MODE *)0xF01205B0u)

/** \\brief  205A4, FIFO0 channel 0 interrupt notification register */
#define GTM_FIFO2_CH6_IRQ_NOTIFY       /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_NOTIFY *)0xF01205A4u)

/** \\brief  20590, FIFO0 channel 0 lower watermark register */
#define GTM_FIFO2_CH6_LOWER_WM         /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_LOWER_WM *)0xF0120590u)

/** \\brief  205A0, FIFO0 channel 0 read pointer register */
#define GTM_FIFO2_CH6_RD_PTR           /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_RD_PTR *)0xF01205A0u)

/** \\brief  20588, FIFO0 channel 0 start address register */
#define GTM_FIFO2_CH6_START_ADDR       /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_START_ADDR *)0xF0120588u)

/** \\brief  20594, FIFO0 channel 0 status register */
#define GTM_FIFO2_CH6_STATUS           /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_STATUS *)0xF0120594u)

/** \\brief  2058C, FIFO0 channel 0 upper watermark register */
#define GTM_FIFO2_CH6_UPPER_WM         /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_UPPER_WM *)0xF012058Cu)

/** \\brief  2059C, FIFO0 channel 0 write pointer register */
#define GTM_FIFO2_CH6_WR_PTR           /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_WR_PTR *)0xF012059Cu)

/** \\brief  205C0, FIFO0 channel 0 control register */
#define GTM_FIFO2_CH7_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_CTRL *)0xF01205C0u)

/** \\brief  205F4, FIFO0 channel 0 error interrupt enable register */
#define GTM_FIFO2_CH7_EIRQ_EN          /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_EIRQ_EN *)0xF01205F4u)

/** \\brief  205C4, FIFO0 channel 0 end address register */
#define GTM_FIFO2_CH7_END_ADDR         /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_END_ADDR *)0xF01205C4u)

