Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  205D8, FIFO0 channel 0 fill level register */
#define GTM_FIFO2_CH7_FILL_LEVEL       /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_FILL_LEVEL *)0xF01205D8u)

/** \\brief  205E8, FIFO0 channel 0 interrupt enable register */
#define GTM_FIFO2_CH7_IRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_EN *)0xF01205E8u)

/** \\brief  205EC, FIFO0 channel 0 force interrupt register */
#define GTM_FIFO2_CH7_IRQ_FORCINT      /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_FORCINT *)0xF01205ECu)

/** \\brief  205F0, FIFO0 channel 0 interrupt mode control register */
#define GTM_FIFO2_CH7_IRQ_MODE         /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_MODE *)0xF01205F0u)

/** \\brief  205E4, FIFO0 channel 0 interrupt notification register */
#define GTM_FIFO2_CH7_IRQ_NOTIFY       /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_IRQ_NOTIFY *)0xF01205E4u)

/** \\brief  205D0, FIFO0 channel 0 lower watermark register */
#define GTM_FIFO2_CH7_LOWER_WM         /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_LOWER_WM *)0xF01205D0u)

/** \\brief  205E0, FIFO0 channel 0 read pointer register */
#define GTM_FIFO2_CH7_RD_PTR           /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_RD_PTR *)0xF01205E0u)

/** \\brief  205C8, FIFO0 channel 0 start address register */
#define GTM_FIFO2_CH7_START_ADDR       /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_START_ADDR *)0xF01205C8u)

/** \\brief  205D4, FIFO0 channel 0 status register */
#define GTM_FIFO2_CH7_STATUS           /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_STATUS *)0xF01205D4u)

/** \\brief  205CC, FIFO0 channel 0 upper watermark register */
#define GTM_FIFO2_CH7_UPPER_WM         /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_UPPER_WM *)0xF01205CCu)

/** \\brief  205DC, FIFO0 channel 0 write pointer register */
#define GTM_FIFO2_CH7_WR_PTR           /*lint --e(923)*/ (*(volatile Ifx_GTM_FIFO_CH_WR_PTR *)0xF01205DCu)

/** \\brief  24, GTM Hardware Configuration */
#define GTM_HW_CONF                    /*lint --e(923)*/ (*(volatile Ifx_GTM_HW_CONF *)0xF0100024u)

/** \\brief  600, ICM Interrupt group register covering infrastructure and
 * safety components ARU, BRC, AEI, PSM0, PSM1, MAP, CMP,SPE */
#define GTM_ICM_IRQG_0                 /*lint --e(923)*/ (*(volatile Ifx_GTM_ICM_IRQG_0 *)0xF0100600u)

/** \\brief  604, ICM Interrupt group register covering DPLL */
#define GTM_ICM_IRQG_1                 /*lint --e(923)*/ (*(volatile Ifx_GTM_ICM_IRQG_1 *)0xF0100604u)

/** \\brief  628, ICM Interrupt group register covering GTM output sub-modules
 * ATOM4 to ATOM7 */
#define GTM_ICM_IRQG_10                /*lint --e(923)*/ (*(volatile Ifx_GTM_ICM_IRQG_10 *)0xF0100628u)

/** \\brief  62C, ICM Interrupt group register covering GTM output sub-modules
 * ATOM8 to ATOM11 */
#define GTM_ICM_IRQG_11                /*lint --e(923)*/ (*(volatile Ifx_GTM_ICM_IRQG_11 *)0xF010062Cu)

/** \\brief  608, ICM Interrupt group register covering TIM0, TIM1, TIM2, TIM3 */
#define GTM_ICM_IRQG_2                 /*lint --e(923)*/ (*(volatile Ifx_GTM_ICM_IRQG_2 *)0xF0100608u)

/** \\brief  60C, ICM Interrupt group register covering TIM4, TIM5, TIM6, TIM7 */
#define GTM_ICM_IRQG_3                 /*lint --e(923)*/ (*(volatile Ifx_GTM_ICM_IRQG_3 *)0xF010060Cu)

/** \\brief  610, ICM Interrupt group register covering MCS0 to MCS3 sub-modules */
#define GTM_ICM_IRQG_4                 /*lint --e(923)*/ (*(volatile Ifx_GTM_ICM_IRQG_4 *)0xF0100610u)

/** \\brief  614, ICM Interrupt group register covering MCS4 to MCS6 sub-modules */
#define GTM_ICM_IRQG_5                 /*lint --e(923)*/ (*(volatile Ifx_GTM_ICM_IRQG_5 *)0xF0100614u)

/** \\brief  618, ICM Interrupt group register covering GTM output sub-modules
 * TOM0 to TOM1 */
#define GTM_ICM_IRQG_6                 /*lint --e(923)*/ (*(volatile Ifx_GTM_ICM_IRQG_6 *)0xF0100618u)

/** \\brief  61C, ICM Interrupt group register covering GTM output sub-modules
 * TOM2 to TOM3 */
#define GTM_ICM_IRQG_7                 /*lint --e(923)*/ (*(volatile Ifx_GTM_ICM_IRQG_7 *)0xF010061Cu)

/** \\brief  620, ICM Interrupt group register covering GTM output sub-modules
 * TOM4 to TOM5 */
#define GTM_ICM_IRQG_8                 /*lint --e(923)*/ (*(volatile Ifx_GTM_ICM_IRQG_8 *)0xF0100620u)

/** \\brief  624, ICM Interrupt group register covering GTM output sub-modules
 * ATOM0, ATOM1, ATOM2 and ATOM3 */
#define GTM_ICM_IRQG_9                 /*lint --e(923)*/ (*(volatile Ifx_GTM_ICM_IRQG_9 *)0xF0100624u)

/** \\brief  790, ICM Interrupt group ATOM 0 for Channel Interrupt information
 * of ATOMm */
#define GTM_ICM_IRQG_ATOM_0_CI         /*lint --e(923)*/ (*(volatile Ifx_GTM_ICM_IRQG_ATOM_0_CI *)0xF0100790u)

/** \\brief  794, ICM Interrupt group ATOM 1 for Channel Interrupt information
 * of ATOMm */
#define GTM_ICM_IRQG_ATOM_1_CI         /*lint --e(923)*/ (*(volatile Ifx_GTM_ICM_IRQG_ATOM_1_CI *)0xF0100794u)

/** \\brief  798, ICM Interrupt group ATOM 2 for Channel Interrupt information
 * of ATOMm */
#define GTM_ICM_IRQG_ATOM_2_CI         /*lint --e(923)*/ (*(volatile Ifx_GTM_ICM_IRQG_ATOM_2_CI *)0xF0100798u)

/** \\brief  634, ICM Interrupt group register 0 for channel error interrupt
 * information */
#define GTM_ICM_IRQG_CEI0              /*lint --e(923)*/ (*(volatile Ifx_GTM_ICM_IRQG_CEI0 *)0xF0100634u)

/** \\brief  638, ICM Interrupt group register 1 for channel error interrupt
 * information */
#define GTM_ICM_IRQG_CEI1              /*lint --e(923)*/ (*(volatile Ifx_GTM_ICM_IRQG_CEI1 *)0xF0100638u)

/** \\brief  63C, ICM Interrupt group register 2 for channel error interrupt
 * information */
#define GTM_ICM_IRQG_CEI2              /*lint --e(923)*/ (*(volatile Ifx_GTM_ICM_IRQG_CEI2 *)0xF010063Cu)

/** \\brief  640, ICM Interrupt group register 3 for channel error interrupt
 * information */
#define GTM_ICM_IRQG_CEI3              /*lint --e(923)*/ (*(volatile Ifx_GTM_ICM_IRQG_CEI3 *)0xF0100640u)

/** \\brief  644, ICM Interrupt group register 4 for channel error interrupt
 * information */
#define GTM_ICM_IRQG_CEI4              /*lint --e(923)*/ (*(volatile Ifx_GTM_ICM_IRQG_CEI4 *)0xF0100644u)

/** \\brief  710, ICM Interrupt group for module Error Interrupt information for
 * each TIMm, MCSm, SPEm, FIFOm */
#define GTM_ICM_IRQG_CLS_0_MEI         /*lint --e(923)*/ (*(volatile Ifx_GTM_ICM_IRQG_CLS_0_MEI *)0xF0100710u)

/** \\brief  714, ICM Interrupt group for module Error Interrupt information for
 * each TIMm, MCSm, SPEm, FIFOm */
#define GTM_ICM_IRQG_CLS_1_MEI         /*lint --e(923)*/ (*(volatile Ifx_GTM_ICM_IRQG_CLS_1_MEI *)0xF0100714u)

/** \\brief  718, ICM Interrupt group for module Error Interrupt information for
 * each TIMm, MCSm, SPEm, FIFOm */
#define GTM_ICM_IRQG_CLS_2_MEI         /*lint --e(923)*/ (*(volatile Ifx_GTM_ICM_IRQG_CLS_2_MEI *)0xF0100718u)

/** \\brief  664, ICM Interrupt group MCS 0 for Channel Error Interrupt
 * information */
#define GTM_ICM_IRQG_MCS0_CEI          /*lint --e(923)*/ (*(volatile Ifx_GTM_ICM_IRQG_MCS0_CEI *)0xF0100664u)

/** \\brief  720, ICM Interrupt group MCS 0 for Channel Interrupt information */
#define GTM_ICM_IRQG_MCS0_CI           /*lint --e(923)*/ (*(volatile Ifx_GTM_ICM_IRQG_MCS0_CI *)0xF0100720u)

/** \\brief  668, ICM Interrupt group MCS 1 for Channel Error Interrupt
 * information */
#define GTM_ICM_IRQG_MCS1_CEI          /*lint --e(923)*/ (*(volatile Ifx_GTM_ICM_IRQG_MCS1_CEI *)0xF0100668u)

