Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  724, ICM Interrupt group MCS 1 for Channel Interrupt information */
#define GTM_ICM_IRQG_MCS1_CI           /*lint --e(923)*/ (*(volatile Ifx_GTM_ICM_IRQG_MCS1_CI *)0xF0100724u)

/** \\brief  66C, ICM Interrupt group MCS 2 for Channel Error Interrupt
 * information */
#define GTM_ICM_IRQG_MCS2_CEI          /*lint --e(923)*/ (*(volatile Ifx_GTM_ICM_IRQG_MCS2_CEI *)0xF010066Cu)

/** \\brief  728, ICM Interrupt group MCS 2 for Channel Interrupt information */
#define GTM_ICM_IRQG_MCS2_CI           /*lint --e(923)*/ (*(volatile Ifx_GTM_ICM_IRQG_MCS2_CI *)0xF0100728u)

/** \\brief  670, ICM Interrupt group MCS 3 for Channel Error Interrupt
 * information */
#define GTM_ICM_IRQG_MCS3_CEI          /*lint --e(923)*/ (*(volatile Ifx_GTM_ICM_IRQG_MCS3_CEI *)0xF0100670u)

/** \\brief  72C, ICM Interrupt group MCS 3 for Channel Interrupt information */
#define GTM_ICM_IRQG_MCS3_CI           /*lint --e(923)*/ (*(volatile Ifx_GTM_ICM_IRQG_MCS3_CI *)0xF010072Cu)

/** \\brief  674, ICM Interrupt group MCS 4 for Channel Error Interrupt
 * information */
#define GTM_ICM_IRQG_MCS4_CEI          /*lint --e(923)*/ (*(volatile Ifx_GTM_ICM_IRQG_MCS4_CEI *)0xF0100674u)

/** \\brief  730, ICM Interrupt group MCS 4 for Channel Interrupt information */
#define GTM_ICM_IRQG_MCS4_CI           /*lint --e(923)*/ (*(volatile Ifx_GTM_ICM_IRQG_MCS4_CI *)0xF0100730u)

/** \\brief  678, ICM Interrupt group MCS 5 for Channel Error Interrupt
 * information */
#define GTM_ICM_IRQG_MCS5_CEI          /*lint --e(923)*/ (*(volatile Ifx_GTM_ICM_IRQG_MCS5_CEI *)0xF0100678u)

/** \\brief  734, ICM Interrupt group MCS 5 for Channel Interrupt information */
#define GTM_ICM_IRQG_MCS5_CI           /*lint --e(923)*/ (*(volatile Ifx_GTM_ICM_IRQG_MCS5_CI *)0xF0100734u)

/** \\brief  67C, ICM Interrupt group MCS 6 for Channel Error Interrupt
 * information */
#define GTM_ICM_IRQG_MCS6_CEI          /*lint --e(923)*/ (*(volatile Ifx_GTM_ICM_IRQG_MCS6_CEI *)0xF010067Cu)

/** \\brief  738, ICM Interrupt group MCS 6 for Channel Interrupt information */
#define GTM_ICM_IRQG_MCS6_CI           /*lint --e(923)*/ (*(volatile Ifx_GTM_ICM_IRQG_MCS6_CI *)0xF0100738u)

/** \\brief  680, ICM Interrupt group MCS 7 for Channel Error Interrupt
 * information */
#define GTM_ICM_IRQG_MCS7_CEI          /*lint --e(923)*/ (*(volatile Ifx_GTM_ICM_IRQG_MCS7_CEI *)0xF0100680u)

/** \\brief  73C, ICM Interrupt group MCS 7 for Channel Interrupt information */
#define GTM_ICM_IRQG_MCS7_CI           /*lint --e(923)*/ (*(volatile Ifx_GTM_ICM_IRQG_MCS7_CI *)0xF010073Cu)

/** \\brief  684, ICM Interrupt group MCS 8 for Channel Error Interrupt
 * information */
#define GTM_ICM_IRQG_MCS8_CEI          /*lint --e(923)*/ (*(volatile Ifx_GTM_ICM_IRQG_MCS8_CEI *)0xF0100684u)

/** \\brief  740, ICM Interrupt group MCS 8 for Channel Interrupt information */
#define GTM_ICM_IRQG_MCS8_CI           /*lint --e(923)*/ (*(volatile Ifx_GTM_ICM_IRQG_MCS8_CI *)0xF0100740u)

/** \\brief  688, ICM Interrupt group MCS 9 for Channel Error Interrupt
 * information */
#define GTM_ICM_IRQG_MCS9_CEI          /*lint --e(923)*/ (*(volatile Ifx_GTM_ICM_IRQG_MCS9_CEI *)0xF0100688u)

/** \\brief  744, ICM Interrupt group MCS 9 for Channel Interrupt information */
#define GTM_ICM_IRQG_MCS9_CI           /*lint --e(923)*/ (*(volatile Ifx_GTM_ICM_IRQG_MCS9_CI *)0xF0100744u)

/** \\brief  630, ICM Interrupt group register for module error interrupt
 * information */
#define GTM_ICM_IRQG_MEI               /*lint --e(923)*/ (*(volatile Ifx_GTM_ICM_IRQG_MEI *)0xF0100630u)

/** \\brief  6A4, ICM Interrupt group PSM 0 for Channel Error Interrupt
 * information of FIFO0, FIFO1, FIFO2 */
#define GTM_ICM_IRQG_PSM_0_CEI         /*lint --e(923)*/ (*(volatile Ifx_GTM_ICM_IRQG_PSM_0_CEI *)0xF01006A4u)

/** \\brief  760, ICM Interrupt group PSM 0 for Channel Interrupt information of
 * FIFO0, FIFO1, FIFO2 */
#define GTM_ICM_IRQG_PSM_0_CI          /*lint --e(923)*/ (*(volatile Ifx_GTM_ICM_IRQG_PSM_0_CI *)0xF0100760u)

/** \\brief  6B4, ICM Interrupt group SPE for module Error Interrupt information */
#define GTM_ICM_IRQG_SPE_CEI           /*lint --e(923)*/ (*(volatile Ifx_GTM_ICM_IRQG_SPE_CEI *)0xF01006B4u)

/** \\brief  770, ICM Interrupt group SPE for module Interrupt information */
#define GTM_ICM_IRQG_SPE_CI            /*lint --e(923)*/ (*(volatile Ifx_GTM_ICM_IRQG_SPE_CI *)0xF0100770u)

/** \\brief  7A0, ICM Interrupt group TOM 0 for Channel Interrupt information of
 * TOMm */
#define GTM_ICM_IRQG_TOM_0_CI          /*lint --e(923)*/ (*(volatile Ifx_GTM_ICM_IRQG_TOM_0_CI *)0xF01007A0u)

/** \\brief  7A4, ICM Interrupt group TOM 1 for Channel Interrupt information of
 * TOMm */
#define GTM_ICM_IRQG_TOM_1_CI          /*lint --e(923)*/ (*(volatile Ifx_GTM_ICM_IRQG_TOM_1_CI *)0xF01007A4u)

/** \\brief  7A8, ICM Interrupt group TOM 2 for Channel Interrupt information of
 * TOMm */
#define GTM_ICM_IRQG_TOM_2_CI          /*lint --e(923)*/ (*(volatile Ifx_GTM_ICM_IRQG_TOM_2_CI *)0xF01007A8u)

/** \\brief  9FE44, Access Enable Register 0 */
#define GTM_INOUTSEL_ACCEN0            /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_ACCEN0 *)0xF019FE44u)

/** Alias (User Manual Name) for GTM_INOUTSEL_ACCEN0.
 * To use register names with standard convension, please use GTM_INOUTSEL_ACCEN0.
 */
#define GTM_ACCEN0                     (GTM_INOUTSEL_ACCEN0)

/** Alias (User Manual Name) for GTM_INOUTSEL_ACCEN0.
 * To use register names with standard convension, please use GTM_INOUTSEL_ACCEN0.
 */
#define GTM_ACCEN0                     (GTM_INOUTSEL_ACCEN0)

/** \\brief  9FE40, Access Enable Register 1 */
#define GTM_INOUTSEL_ACCEN1            /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_ACCEN1 *)0xF019FE40u)

/** Alias (User Manual Name) for GTM_INOUTSEL_ACCEN1.
 * To use register names with standard convension, please use GTM_INOUTSEL_ACCEN1.
 */
#define GTM_ACCEN1                     (GTM_INOUTSEL_ACCEN1)

/** Alias (User Manual Name) for GTM_INOUTSEL_ACCEN1.
 * To use register names with standard convension, please use GTM_INOUTSEL_ACCEN1.
 */
#define GTM_ACCEN1                     (GTM_INOUTSEL_ACCEN1)

/** \\brief  9FDF0, ADC Trigger 0 Output Select 1 Register */
#define GTM_INOUTSEL_ADCTRIG_OUT00     /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_ADCTRIG_OUT00 *)0xF019FDF0u)

/** Alias (User Manual Name) for GTM_INOUTSEL_ADCTRIG_OUT00.
 * To use register names with standard convension, please use GTM_INOUTSEL_ADCTRIG_OUT00.
 */
#define GTM_ADCTRIG0OUT0               (GTM_INOUTSEL_ADCTRIG_OUT00)

/** Alias (User Manual Name) for GTM_INOUTSEL_ADCTRIG_OUT00.
 * To use register names with standard convension, please use GTM_INOUTSEL_ADCTRIG_OUT00.
 */
#define GTM_ADCTRIG0OUT0               (GTM_INOUTSEL_ADCTRIG_OUT00)

/** \\brief  9FDF4, ADC Trigger 0 Output Select 1 Register */
#define GTM_INOUTSEL_ADCTRIG_OUT01     /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_ADCTRIG_OUT01 *)0xF019FDF4u)

/** Alias (User Manual Name) for GTM_INOUTSEL_ADCTRIG_OUT01.
 * To use register names with standard convension, please use GTM_INOUTSEL_ADCTRIG_OUT01.
 */
#define GTM_ADCTRIG0OUT1               (GTM_INOUTSEL_ADCTRIG_OUT01)

/** Alias (User Manual Name) for GTM_INOUTSEL_ADCTRIG_OUT01.
 * To use register names with standard convension, please use GTM_INOUTSEL_ADCTRIG_OUT01.
 */
#define GTM_ADCTRIG0OUT1               (GTM_INOUTSEL_ADCTRIG_OUT01)

/** \\brief  9FDF8, ADC Trigger 1 Output Select 1 Register */
#define GTM_INOUTSEL_ADCTRIG_OUT10     /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_ADCTRIG_OUT10 *)0xF019FDF8u)

/** Alias (User Manual Name) for GTM_INOUTSEL_ADCTRIG_OUT10.
 * To use register names with standard convension, please use GTM_INOUTSEL_ADCTRIG_OUT10.
 */
#define GTM_ADCTRIG1OUT0               (GTM_INOUTSEL_ADCTRIG_OUT10)

/** Alias (User Manual Name) for GTM_INOUTSEL_ADCTRIG_OUT10.
 * To use register names with standard convension, please use GTM_INOUTSEL_ADCTRIG_OUT10.
 */
#define GTM_ADCTRIG1OUT0               (GTM_INOUTSEL_ADCTRIG_OUT10)

/** \\brief  9FDFC, ADC Trigger 1 Output Select 1 Register */
#define GTM_INOUTSEL_ADCTRIG_OUT11     /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_ADCTRIG_OUT11 *)0xF019FDFCu)

