Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** Alias (User Manual Name) for GTM_INOUTSEL_ADCTRIG_OUT11.
 * To use register names with standard convension, please use GTM_INOUTSEL_ADCTRIG_OUT11.
 */
#define GTM_ADCTRIG1OUT1               (GTM_INOUTSEL_ADCTRIG_OUT11)

/** Alias (User Manual Name) for GTM_INOUTSEL_ADCTRIG_OUT11.
 * To use register names with standard convension, please use GTM_INOUTSEL_ADCTRIG_OUT11.
 */
#define GTM_ADCTRIG1OUT1               (GTM_INOUTSEL_ADCTRIG_OUT11)

/** \\brief  9FE00, ADC Trigger 2 Output Select 1 Register */
#define GTM_INOUTSEL_ADCTRIG_OUT20     /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_ADCTRIG_OUT20 *)0xF019FE00u)

/** Alias (User Manual Name) for GTM_INOUTSEL_ADCTRIG_OUT20.
 * To use register names with standard convension, please use GTM_INOUTSEL_ADCTRIG_OUT20.
 */
#define GTM_ADCTRIG2OUT0               (GTM_INOUTSEL_ADCTRIG_OUT20)

/** Alias (User Manual Name) for GTM_INOUTSEL_ADCTRIG_OUT20.
 * To use register names with standard convension, please use GTM_INOUTSEL_ADCTRIG_OUT20.
 */
#define GTM_ADCTRIG2OUT0               (GTM_INOUTSEL_ADCTRIG_OUT20)

/** \\brief  9FE04, ADC Trigger 1 Output Select 1 Register */
#define GTM_INOUTSEL_ADCTRIG_OUT21     /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_ADCTRIG_OUT21 *)0xF019FE04u)

/** Alias (User Manual Name) for GTM_INOUTSEL_ADCTRIG_OUT21.
 * To use register names with standard convension, please use GTM_INOUTSEL_ADCTRIG_OUT21.
 */
#define GTM_ADCTRIG2OUT1               (GTM_INOUTSEL_ADCTRIG_OUT21)

/** Alias (User Manual Name) for GTM_INOUTSEL_ADCTRIG_OUT21.
 * To use register names with standard convension, please use GTM_INOUTSEL_ADCTRIG_OUT21.
 */
#define GTM_ADCTRIG2OUT1               (GTM_INOUTSEL_ADCTRIG_OUT21)

/** \\brief  9FE08, ADC Trigger 3Output Select 1 Register */
#define GTM_INOUTSEL_ADCTRIG_OUT30     /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_ADCTRIG_OUT30 *)0xF019FE08u)

/** Alias (User Manual Name) for GTM_INOUTSEL_ADCTRIG_OUT30.
 * To use register names with standard convension, please use GTM_INOUTSEL_ADCTRIG_OUT30.
 */
#define GTM_ADCTRIG3OUT0               (GTM_INOUTSEL_ADCTRIG_OUT30)

/** Alias (User Manual Name) for GTM_INOUTSEL_ADCTRIG_OUT30.
 * To use register names with standard convension, please use GTM_INOUTSEL_ADCTRIG_OUT30.
 */
#define GTM_ADCTRIG3OUT0               (GTM_INOUTSEL_ADCTRIG_OUT30)

/** \\brief  9FE0C, ADC Trigger 1 Output Select 1 Register */
#define GTM_INOUTSEL_ADCTRIG_OUT31     /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_ADCTRIG_OUT31 *)0xF019FE0Cu)

/** Alias (User Manual Name) for GTM_INOUTSEL_ADCTRIG_OUT31.
 * To use register names with standard convension, please use GTM_INOUTSEL_ADCTRIG_OUT31.
 */
#define GTM_ADCTRIG3OUT1               (GTM_INOUTSEL_ADCTRIG_OUT31)

/** Alias (User Manual Name) for GTM_INOUTSEL_ADCTRIG_OUT31.
 * To use register names with standard convension, please use GTM_INOUTSEL_ADCTRIG_OUT31.
 */
#define GTM_ADCTRIG3OUT1               (GTM_INOUTSEL_ADCTRIG_OUT31)

/** \\brief  9FE10, CAN Output Select Register */
#define GTM_INOUTSEL_CAN_OUTSEL        /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_CAN_OUTSEL *)0xF019FE10u)

/** Alias (User Manual Name) for GTM_INOUTSEL_CAN_OUTSEL.
 * To use register names with standard convension, please use GTM_INOUTSEL_CAN_OUTSEL.
 */
#define GTM_CANOUTSEL                  (GTM_INOUTSEL_CAN_OUTSEL)

/** Alias (User Manual Name) for GTM_INOUTSEL_CAN_OUTSEL.
 * To use register names with standard convension, please use GTM_INOUTSEL_CAN_OUTSEL.
 */
#define GTM_CANOUTSEL                  (GTM_INOUTSEL_CAN_OUTSEL)

/** \\brief  9FEAC, Data Input n Register */
#define GTM_INOUTSEL_DATA_IN0          /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_DATA_IN0 *)0xF019FEACu)

/** Alias (User Manual Name) for GTM_INOUTSEL_DATA_IN0.
 * To use register names with standard convension, please use GTM_INOUTSEL_DATA_IN0.
 */
#define GTM_DATAIN0                    (GTM_INOUTSEL_DATA_IN0)

/** Alias (User Manual Name) for GTM_INOUTSEL_DATA_IN0.
 * To use register names with standard convension, please use GTM_INOUTSEL_DATA_IN0.
 */
#define GTM_DATAIN0                    (GTM_INOUTSEL_DATA_IN0)

/** \\brief  9FEB0, Data Input n Register */
#define GTM_INOUTSEL_DATA_IN1          /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_DATA_IN1 *)0xF019FEB0u)

/** Alias (User Manual Name) for GTM_INOUTSEL_DATA_IN1.
 * To use register names with standard convension, please use GTM_INOUTSEL_DATA_IN1.
 */
#define GTM_DATAIN1                    (GTM_INOUTSEL_DATA_IN1)

/** Alias (User Manual Name) for GTM_INOUTSEL_DATA_IN1.
 * To use register names with standard convension, please use GTM_INOUTSEL_DATA_IN1.
 */
#define GTM_DATAIN1                    (GTM_INOUTSEL_DATA_IN1)

/** \\brief  9FEB4, Data Input n Register */
#define GTM_INOUTSEL_DATA_IN2          /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_DATA_IN2 *)0xF019FEB4u)

/** Alias (User Manual Name) for GTM_INOUTSEL_DATA_IN2.
 * To use register names with standard convension, please use GTM_INOUTSEL_DATA_IN2.
 */
#define GTM_DATAIN2                    (GTM_INOUTSEL_DATA_IN2)

/** Alias (User Manual Name) for GTM_INOUTSEL_DATA_IN2.
 * To use register names with standard convension, please use GTM_INOUTSEL_DATA_IN2.
 */
#define GTM_DATAIN2                    (GTM_INOUTSEL_DATA_IN2)

/** \\brief  9FEB8, Data Input n Register */
#define GTM_INOUTSEL_DATA_IN3          /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_DATA_IN3 *)0xF019FEB8u)

/** Alias (User Manual Name) for GTM_INOUTSEL_DATA_IN3.
 * To use register names with standard convension, please use GTM_INOUTSEL_DATA_IN3.
 */
#define GTM_DATAIN3                    (GTM_INOUTSEL_DATA_IN3)

/** Alias (User Manual Name) for GTM_INOUTSEL_DATA_IN3.
 * To use register names with standard convension, please use GTM_INOUTSEL_DATA_IN3.
 */
#define GTM_DATAIN3                    (GTM_INOUTSEL_DATA_IN3)

/** \\brief  9FEBC, Data Input n Register */
#define GTM_INOUTSEL_DATA_IN4          /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_DATA_IN4 *)0xF019FEBCu)

/** Alias (User Manual Name) for GTM_INOUTSEL_DATA_IN4.
 * To use register names with standard convension, please use GTM_INOUTSEL_DATA_IN4.
 */
#define GTM_DATAIN4                    (GTM_INOUTSEL_DATA_IN4)

/** Alias (User Manual Name) for GTM_INOUTSEL_DATA_IN4.
 * To use register names with standard convension, please use GTM_INOUTSEL_DATA_IN4.
 */
#define GTM_DATAIN4                    (GTM_INOUTSEL_DATA_IN4)

/** \\brief  9FEC0, Data Input n Register */
#define GTM_INOUTSEL_DATA_IN5          /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_DATA_IN5 *)0xF019FEC0u)

/** Alias (User Manual Name) for GTM_INOUTSEL_DATA_IN5.
 * To use register names with standard convension, please use GTM_INOUTSEL_DATA_IN5.
 */
#define GTM_DATAIN5                    (GTM_INOUTSEL_DATA_IN5)

/** Alias (User Manual Name) for GTM_INOUTSEL_DATA_IN5.
 * To use register names with standard convension, please use GTM_INOUTSEL_DATA_IN5.
 */
#define GTM_DATAIN5                    (GTM_INOUTSEL_DATA_IN5)

/** \\brief  9FEC4, Data Input n Register */
#define GTM_INOUTSEL_DATA_IN6          /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_DATA_IN6 *)0xF019FEC4u)

