Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** Alias (User Manual Name) for GTM_INOUTSEL_DATA_IN6.
 * To use register names with standard convension, please use GTM_INOUTSEL_DATA_IN6.
 */
#define GTM_DATAIN6                    (GTM_INOUTSEL_DATA_IN6)

/** Alias (User Manual Name) for GTM_INOUTSEL_DATA_IN6.
 * To use register names with standard convension, please use GTM_INOUTSEL_DATA_IN6.
 */
#define GTM_DATAIN6                    (GTM_INOUTSEL_DATA_IN6)

/** \\brief  9FEC8, Data Input n Register */
#define GTM_INOUTSEL_DATA_IN7          /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_DATA_IN7 *)0xF019FEC8u)

/** Alias (User Manual Name) for GTM_INOUTSEL_DATA_IN7.
 * To use register names with standard convension, please use GTM_INOUTSEL_DATA_IN7.
 */
#define GTM_DATAIN7                    (GTM_INOUTSEL_DATA_IN7)

/** Alias (User Manual Name) for GTM_INOUTSEL_DATA_IN7.
 * To use register names with standard convension, please use GTM_INOUTSEL_DATA_IN7.
 */
#define GTM_DATAIN7                    (GTM_INOUTSEL_DATA_IN7)

/** \\brief  9FECC, Data Input n Register */
#define GTM_INOUTSEL_DATA_IN8          /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_DATA_IN8 *)0xF019FECCu)

/** Alias (User Manual Name) for GTM_INOUTSEL_DATA_IN8.
 * To use register names with standard convension, please use GTM_INOUTSEL_DATA_IN8.
 */
#define GTM_DATAIN8                    (GTM_INOUTSEL_DATA_IN8)

/** Alias (User Manual Name) for GTM_INOUTSEL_DATA_IN8.
 * To use register names with standard convension, please use GTM_INOUTSEL_DATA_IN8.
 */
#define GTM_DATAIN8                    (GTM_INOUTSEL_DATA_IN8)

/** \\brief  9FED0, Data Input n Register */
#define GTM_INOUTSEL_DATA_IN9          /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_DATA_IN9 *)0xF019FED0u)

/** Alias (User Manual Name) for GTM_INOUTSEL_DATA_IN9.
 * To use register names with standard convension, please use GTM_INOUTSEL_DATA_IN9.
 */
#define GTM_DATAIN9                    (GTM_INOUTSEL_DATA_IN9)

/** Alias (User Manual Name) for GTM_INOUTSEL_DATA_IN9.
 * To use register names with standard convension, please use GTM_INOUTSEL_DATA_IN9.
 */
#define GTM_DATAIN9                    (GTM_INOUTSEL_DATA_IN9)

/** \\brief  9FDB8, DSADC Input Select Register */
#define GTM_INOUTSEL_DSADC_INSEL0      /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_DSADC_INSEL *)0xF019FDB8u)

/** Alias (User Manual Name) for GTM_INOUTSEL_DSADC_INSEL0.
 * To use register names with standard convension, please use GTM_INOUTSEL_DSADC_INSEL0.
 */
#define GTM_DSADCINSEL0                (GTM_INOUTSEL_DSADC_INSEL0)

/** Alias (User Manual Name) for GTM_INOUTSEL_DSADC_INSEL0.
 * To use register names with standard convension, please use GTM_INOUTSEL_DSADC_INSEL0.
 */
#define GTM_DSADCINSEL0                (GTM_INOUTSEL_DSADC_INSEL0)

/** \\brief  9FDBC, DSADC Input Select Register */
#define GTM_INOUTSEL_DSADC_INSEL1      /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_DSADC_INSEL *)0xF019FDBCu)

/** Alias (User Manual Name) for GTM_INOUTSEL_DSADC_INSEL1.
 * To use register names with standard convension, please use GTM_INOUTSEL_DSADC_INSEL1.
 */
#define GTM_DSADCINSEL1                (GTM_INOUTSEL_DSADC_INSEL1)

/** Alias (User Manual Name) for GTM_INOUTSEL_DSADC_INSEL1.
 * To use register names with standard convension, please use GTM_INOUTSEL_DSADC_INSEL1.
 */
#define GTM_DSADCINSEL1                (GTM_INOUTSEL_DSADC_INSEL1)

/** \\brief  9FDC0, DSADC Input Select Register */
#define GTM_INOUTSEL_DSADC_INSEL2      /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_DSADC_INSEL *)0xF019FDC0u)

/** Alias (User Manual Name) for GTM_INOUTSEL_DSADC_INSEL2.
 * To use register names with standard convension, please use GTM_INOUTSEL_DSADC_INSEL2.
 */
#define GTM_DSADCINSEL2                (GTM_INOUTSEL_DSADC_INSEL2)

/** Alias (User Manual Name) for GTM_INOUTSEL_DSADC_INSEL2.
 * To use register names with standard convension, please use GTM_INOUTSEL_DSADC_INSEL2.
 */
#define GTM_DSADCINSEL2                (GTM_INOUTSEL_DSADC_INSEL2)

/** \\brief  9FDC4, DSADC Input Select Register */
#define GTM_INOUTSEL_DSADC_INSEL3      /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_DSADC_INSEL *)0xF019FDC4u)

/** Alias (User Manual Name) for GTM_INOUTSEL_DSADC_INSEL3.
 * To use register names with standard convension, please use GTM_INOUTSEL_DSADC_INSEL3.
 */
#define GTM_DSADCINSEL3                (GTM_INOUTSEL_DSADC_INSEL3)

/** Alias (User Manual Name) for GTM_INOUTSEL_DSADC_INSEL3.
 * To use register names with standard convension, please use GTM_INOUTSEL_DSADC_INSEL3.
 */
#define GTM_DSADCINSEL3                (GTM_INOUTSEL_DSADC_INSEL3)

/** \\brief  9FDC8, DSADC Input Select Register */
#define GTM_INOUTSEL_DSADC_INSEL4      /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_DSADC_INSEL *)0xF019FDC8u)

/** Alias (User Manual Name) for GTM_INOUTSEL_DSADC_INSEL4.
 * To use register names with standard convension, please use GTM_INOUTSEL_DSADC_INSEL4.
 */
#define GTM_DSADCINSEL4                (GTM_INOUTSEL_DSADC_INSEL4)

/** Alias (User Manual Name) for GTM_INOUTSEL_DSADC_INSEL4.
 * To use register names with standard convension, please use GTM_INOUTSEL_DSADC_INSEL4.
 */
#define GTM_DSADCINSEL4                (GTM_INOUTSEL_DSADC_INSEL4)

/** \\brief  9FDCC, DSADC Input Select Register */
#define GTM_INOUTSEL_DSADC_INSEL5      /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_DSADC_INSEL *)0xF019FDCCu)

/** Alias (User Manual Name) for GTM_INOUTSEL_DSADC_INSEL5.
 * To use register names with standard convension, please use GTM_INOUTSEL_DSADC_INSEL5.
 */
#define GTM_DSADCINSEL5                (GTM_INOUTSEL_DSADC_INSEL5)

/** Alias (User Manual Name) for GTM_INOUTSEL_DSADC_INSEL5.
 * To use register names with standard convension, please use GTM_INOUTSEL_DSADC_INSEL5.
 */
#define GTM_DSADCINSEL5                (GTM_INOUTSEL_DSADC_INSEL5)

/** \\brief  9FDD0, DSADC Output Select 00 Register */
#define GTM_INOUTSEL_DSADC_OUTSEL00    /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_DSADC_OUTSEL0 *)0xF019FDD0u)

/** Alias (User Manual Name) for GTM_INOUTSEL_DSADC_OUTSEL00.
 * To use register names with standard convension, please use GTM_INOUTSEL_DSADC_OUTSEL00.
 */
#define GTM_DSADCOUTSEL00              (GTM_INOUTSEL_DSADC_OUTSEL00)

/** Alias (User Manual Name) for GTM_INOUTSEL_DSADC_OUTSEL00.
 * To use register names with standard convension, please use GTM_INOUTSEL_DSADC_OUTSEL00.
 */
#define GTM_DSADCOUTSEL00              (GTM_INOUTSEL_DSADC_OUTSEL00)

