Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  9FDD4, DSADC Output Select 01 Register */
#define GTM_INOUTSEL_DSADC_OUTSEL01    /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_DSADC_OUTSEL1 *)0xF019FDD4u)

/** Alias (User Manual Name) for GTM_INOUTSEL_DSADC_OUTSEL01.
 * To use register names with standard convension, please use GTM_INOUTSEL_DSADC_OUTSEL01.
 */
#define GTM_DSADCOUTSEL01              (GTM_INOUTSEL_DSADC_OUTSEL01)

/** Alias (User Manual Name) for GTM_INOUTSEL_DSADC_OUTSEL01.
 * To use register names with standard convension, please use GTM_INOUTSEL_DSADC_OUTSEL01.
 */
#define GTM_DSADCOUTSEL01              (GTM_INOUTSEL_DSADC_OUTSEL01)

/** \\brief  9FDD8, DSADC Output Select 10 Register */
#define GTM_INOUTSEL_DSADC_OUTSEL10    /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_DSADC_OUTSEL0 *)0xF019FDD8u)

/** Alias (User Manual Name) for GTM_INOUTSEL_DSADC_OUTSEL10.
 * To use register names with standard convension, please use GTM_INOUTSEL_DSADC_OUTSEL10.
 */
#define GTM_DSADCOUTSEL10              (GTM_INOUTSEL_DSADC_OUTSEL10)

/** Alias (User Manual Name) for GTM_INOUTSEL_DSADC_OUTSEL10.
 * To use register names with standard convension, please use GTM_INOUTSEL_DSADC_OUTSEL10.
 */
#define GTM_DSADCOUTSEL10              (GTM_INOUTSEL_DSADC_OUTSEL10)

/** \\brief  9FDDC, DSADC Output Select 11 Register */
#define GTM_INOUTSEL_DSADC_OUTSEL11    /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_DSADC_OUTSEL1 *)0xF019FDDCu)

/** Alias (User Manual Name) for GTM_INOUTSEL_DSADC_OUTSEL11.
 * To use register names with standard convension, please use GTM_INOUTSEL_DSADC_OUTSEL11.
 */
#define GTM_DSADCOUTSEL11              (GTM_INOUTSEL_DSADC_OUTSEL11)

/** Alias (User Manual Name) for GTM_INOUTSEL_DSADC_OUTSEL11.
 * To use register names with standard convension, please use GTM_INOUTSEL_DSADC_OUTSEL11.
 */
#define GTM_DSADCOUTSEL11              (GTM_INOUTSEL_DSADC_OUTSEL11)

/** \\brief  9FDE0, DSADC Output Select 20 Register */
#define GTM_INOUTSEL_DSADC_OUTSEL20    /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_DSADC_OUTSEL0 *)0xF019FDE0u)

/** Alias (User Manual Name) for GTM_INOUTSEL_DSADC_OUTSEL20.
 * To use register names with standard convension, please use GTM_INOUTSEL_DSADC_OUTSEL20.
 */
#define GTM_DSADCOUTSEL20              (GTM_INOUTSEL_DSADC_OUTSEL20)

/** Alias (User Manual Name) for GTM_INOUTSEL_DSADC_OUTSEL20.
 * To use register names with standard convension, please use GTM_INOUTSEL_DSADC_OUTSEL20.
 */
#define GTM_DSADCOUTSEL20              (GTM_INOUTSEL_DSADC_OUTSEL20)

/** \\brief  9FDE4, DSADC Output Select 21 Register */
#define GTM_INOUTSEL_DSADC_OUTSEL21    /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_DSADC_OUTSEL1 *)0xF019FDE4u)

/** Alias (User Manual Name) for GTM_INOUTSEL_DSADC_OUTSEL21.
 * To use register names with standard convension, please use GTM_INOUTSEL_DSADC_OUTSEL21.
 */
#define GTM_DSADCOUTSEL21              (GTM_INOUTSEL_DSADC_OUTSEL21)

/** Alias (User Manual Name) for GTM_INOUTSEL_DSADC_OUTSEL21.
 * To use register names with standard convension, please use GTM_INOUTSEL_DSADC_OUTSEL21.
 */
#define GTM_DSADCOUTSEL21              (GTM_INOUTSEL_DSADC_OUTSEL21)

/** \\brief  9FDE8, DSADC Output Select 30 Register */
#define GTM_INOUTSEL_DSADC_OUTSEL30    /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_DSADC_OUTSEL0 *)0xF019FDE8u)

/** Alias (User Manual Name) for GTM_INOUTSEL_DSADC_OUTSEL30.
 * To use register names with standard convension, please use GTM_INOUTSEL_DSADC_OUTSEL30.
 */
#define GTM_DSADCOUTSEL30              (GTM_INOUTSEL_DSADC_OUTSEL30)

/** Alias (User Manual Name) for GTM_INOUTSEL_DSADC_OUTSEL30.
 * To use register names with standard convension, please use GTM_INOUTSEL_DSADC_OUTSEL30.
 */
#define GTM_DSADCOUTSEL30              (GTM_INOUTSEL_DSADC_OUTSEL30)

/** \\brief  9FDEC, DSADC Output Select 31 Register */
#define GTM_INOUTSEL_DSADC_OUTSEL31    /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_DSADC_OUTSEL1 *)0xF019FDECu)

/** Alias (User Manual Name) for GTM_INOUTSEL_DSADC_OUTSEL31.
 * To use register names with standard convension, please use GTM_INOUTSEL_DSADC_OUTSEL31.
 */
#define GTM_DSADCOUTSEL31              (GTM_INOUTSEL_DSADC_OUTSEL31)

/** Alias (User Manual Name) for GTM_INOUTSEL_DSADC_OUTSEL31.
 * To use register names with standard convension, please use GTM_INOUTSEL_DSADC_OUTSEL31.
 */
#define GTM_DSADCOUTSEL31              (GTM_INOUTSEL_DSADC_OUTSEL31)

/** \\brief  9FEA8, Data Exchange Input Control Register */
#define GTM_INOUTSEL_DXINCON           /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_DXINCON *)0xF019FEA8u)

/** Alias (User Manual Name) for GTM_INOUTSEL_DXINCON.
 * To use register names with standard convension, please use GTM_INOUTSEL_DXINCON.
 */
#define GTM_DXINCON                    (GTM_INOUTSEL_DXINCON)

/** Alias (User Manual Name) for GTM_INOUTSEL_DXINCON.
 * To use register names with standard convension, please use GTM_INOUTSEL_DXINCON.
 */
#define GTM_DXINCON                    (GTM_INOUTSEL_DXINCON)

/** \\brief  9FE48, Data Exchange Output Control Register */
#define GTM_INOUTSEL_DXOUTCON          /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_DXOUTCON *)0xF019FE48u)

/** Alias (User Manual Name) for GTM_INOUTSEL_DXOUTCON.
 * To use register names with standard convension, please use GTM_INOUTSEL_DXOUTCON.
 */
#define GTM_DXOUTCON                   (GTM_INOUTSEL_DXOUTCON)

/** Alias (User Manual Name) for GTM_INOUTSEL_DXOUTCON.
 * To use register names with standard convension, please use GTM_INOUTSEL_DXOUTCON.
 */
#define GTM_DXOUTCON                   (GTM_INOUTSEL_DXOUTCON)

/** \\brief  9FE74, I0terrupt Output Register n */
#define GTM_INOUTSEL_INT_OUT0          /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_INT_OUT0 *)0xF019FE74u)

/** Alias (User Manual Name) for GTM_INOUTSEL_INT_OUT0.
 * To use register names with standard convension, please use GTM_INOUTSEL_INT_OUT0.
 */
#define GTM_INTOUT0                    (GTM_INOUTSEL_INT_OUT0)

/** Alias (User Manual Name) for GTM_INOUTSEL_INT_OUT0.
 * To use register names with standard convension, please use GTM_INOUTSEL_INT_OUT0.
 */
#define GTM_INTOUT0                    (GTM_INOUTSEL_INT_OUT0)

