Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  9FE78, I1terrupt Output Register n */
#define GTM_INOUTSEL_INT_OUT1          /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_INT_OUT1 *)0xF019FE78u)

/** Alias (User Manual Name) for GTM_INOUTSEL_INT_OUT1.
 * To use register names with standard convension, please use GTM_INOUTSEL_INT_OUT1.
 */
#define GTM_INTOUT1                    (GTM_INOUTSEL_INT_OUT1)

/** Alias (User Manual Name) for GTM_INOUTSEL_INT_OUT1.
 * To use register names with standard convension, please use GTM_INOUTSEL_INT_OUT1.
 */
#define GTM_INTOUT1                    (GTM_INOUTSEL_INT_OUT1)

/** \\brief  9FE7C, I2terrupt Output Register n */
#define GTM_INOUTSEL_INT_OUT2          /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_INT_OUT2 *)0xF019FE7Cu)

/** Alias (User Manual Name) for GTM_INOUTSEL_INT_OUT2.
 * To use register names with standard convension, please use GTM_INOUTSEL_INT_OUT2.
 */
#define GTM_INTOUT2                    (GTM_INOUTSEL_INT_OUT2)

/** Alias (User Manual Name) for GTM_INOUTSEL_INT_OUT2.
 * To use register names with standard convension, please use GTM_INOUTSEL_INT_OUT2.
 */
#define GTM_INTOUT2                    (GTM_INOUTSEL_INT_OUT2)

/** \\brief  9FE80, I3terrupt Output Register n */
#define GTM_INOUTSEL_INT_OUT3          /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_INT_OUT3 *)0xF019FE80u)

/** Alias (User Manual Name) for GTM_INOUTSEL_INT_OUT3.
 * To use register names with standard convension, please use GTM_INOUTSEL_INT_OUT3.
 */
#define GTM_INTOUT3                    (GTM_INOUTSEL_INT_OUT3)

/** Alias (User Manual Name) for GTM_INOUTSEL_INT_OUT3.
 * To use register names with standard convension, please use GTM_INOUTSEL_INT_OUT3.
 */
#define GTM_INTOUT3                    (GTM_INOUTSEL_INT_OUT3)

/** \\brief  9FE84, I4terrupt Output Register n */
#define GTM_INOUTSEL_INT_OUT4          /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_INT_OUT4 *)0xF019FE84u)

/** Alias (User Manual Name) for GTM_INOUTSEL_INT_OUT4.
 * To use register names with standard convension, please use GTM_INOUTSEL_INT_OUT4.
 */
#define GTM_INTOUT4                    (GTM_INOUTSEL_INT_OUT4)

/** Alias (User Manual Name) for GTM_INOUTSEL_INT_OUT4.
 * To use register names with standard convension, please use GTM_INOUTSEL_INT_OUT4.
 */
#define GTM_INTOUT4                    (GTM_INOUTSEL_INT_OUT4)

/** \\brief  9FE88, I5terrupt Output Register n */
#define GTM_INOUTSEL_INT_OUT5          /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_INT_OUT5 *)0xF019FE88u)

/** Alias (User Manual Name) for GTM_INOUTSEL_INT_OUT5.
 * To use register names with standard convension, please use GTM_INOUTSEL_INT_OUT5.
 */
#define GTM_INTOUT5                    (GTM_INOUTSEL_INT_OUT5)

/** Alias (User Manual Name) for GTM_INOUTSEL_INT_OUT5.
 * To use register names with standard convension, please use GTM_INOUTSEL_INT_OUT5.
 */
#define GTM_INTOUT5                    (GTM_INOUTSEL_INT_OUT5)

/** \\brief  9FE8C, I6terrupt Output Register n */
#define GTM_INOUTSEL_INT_OUT6          /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_INT_OUT6 *)0xF019FE8Cu)

/** Alias (User Manual Name) for GTM_INOUTSEL_INT_OUT6.
 * To use register names with standard convension, please use GTM_INOUTSEL_INT_OUT6.
 */
#define GTM_INTOUT6                    (GTM_INOUTSEL_INT_OUT6)

/** Alias (User Manual Name) for GTM_INOUTSEL_INT_OUT6.
 * To use register names with standard convension, please use GTM_INOUTSEL_INT_OUT6.
 */
#define GTM_INTOUT6                    (GTM_INOUTSEL_INT_OUT6)

/** \\brief  9FE90, I7terrupt Output Register n */
#define GTM_INOUTSEL_INT_OUT7          /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_INT_OUT7 *)0xF019FE90u)

/** Alias (User Manual Name) for GTM_INOUTSEL_INT_OUT7.
 * To use register names with standard convension, please use GTM_INOUTSEL_INT_OUT7.
 */
#define GTM_INTOUT7                    (GTM_INOUTSEL_INT_OUT7)

/** Alias (User Manual Name) for GTM_INOUTSEL_INT_OUT7.
 * To use register names with standard convension, please use GTM_INOUTSEL_INT_OUT7.
 */
#define GTM_INTOUT7                    (GTM_INOUTSEL_INT_OUT7)

/** \\brief  9FE94, I8terrupt Output Register n */
#define GTM_INOUTSEL_INT_OUT8          /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_INT_OUT8 *)0xF019FE94u)

/** Alias (User Manual Name) for GTM_INOUTSEL_INT_OUT8.
 * To use register names with standard convension, please use GTM_INOUTSEL_INT_OUT8.
 */
#define GTM_INTOUT8                    (GTM_INOUTSEL_INT_OUT8)

/** Alias (User Manual Name) for GTM_INOUTSEL_INT_OUT8.
 * To use register names with standard convension, please use GTM_INOUTSEL_INT_OUT8.
 */
#define GTM_INTOUT8                    (GTM_INOUTSEL_INT_OUT8)

/** \\brief  9FE98, I9terrupt Output Register n */
#define GTM_INOUTSEL_INT_OUT9          /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_INT_OUT9 *)0xF019FE98u)

/** Alias (User Manual Name) for GTM_INOUTSEL_INT_OUT9.
 * To use register names with standard convension, please use GTM_INOUTSEL_INT_OUT9.
 */
#define GTM_INTOUT9                    (GTM_INOUTSEL_INT_OUT9)

/** Alias (User Manual Name) for GTM_INOUTSEL_INT_OUT9.
 * To use register names with standard convension, please use GTM_INOUTSEL_INT_OUT9.
 */
#define GTM_INTOUT9                    (GTM_INOUTSEL_INT_OUT9)

/** \\brief  9FEA4, MCS Interrupt Clear Register */
#define GTM_INOUTSEL_MCSINTCLR         /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_MCSINTCLR *)0xF019FEA4u)

/** Alias (User Manual Name) for GTM_INOUTSEL_MCSINTCLR.
 * To use register names with standard convension, please use GTM_INOUTSEL_MCSINTCLR.
 */
#define GTM_MCSINTCLR                  (GTM_INOUTSEL_MCSINTCLR)

/** Alias (User Manual Name) for GTM_INOUTSEL_MCSINTCLR.
 * To use register names with standard convension, please use GTM_INOUTSEL_MCSINTCLR.
 */
#define GTM_MCSINTCLR                  (GTM_INOUTSEL_MCSINTCLR)

/** \\brief  9FEA0, MCS Interrupt Status Register */
#define GTM_INOUTSEL_MCSINTSTAT        /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_MCSINTSTAT *)0xF019FEA0u)

/** Alias (User Manual Name) for GTM_INOUTSEL_MCSINTSTAT.
 * To use register names with standard convension, please use GTM_INOUTSEL_MCSINTSTAT.
 */
#define GTM_MCSINTSTAT                 (GTM_INOUTSEL_MCSINTSTAT)

/** Alias (User Manual Name) for GTM_INOUTSEL_MCSINTSTAT.
 * To use register names with standard convension, please use GTM_INOUTSEL_MCSINTSTAT.
 */
#define GTM_MCSINTSTAT                 (GTM_INOUTSEL_MCSINTSTAT)

/** \\brief  9FE9C, Trigger Output Sel Register */
#define GTM_INOUTSEL_MCSTRIGOUTSEL     /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_MCSTRIGOUTSEL *)0xF019FE9Cu)

