Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** Alias (User Manual Name) for GTM_INOUTSEL_MCSTRIGOUTSEL.
 * To use register names with standard convension, please use GTM_INOUTSEL_MCSTRIGOUTSEL.
 */
#define GTM_MCSTRIGOUTSEL              (GTM_INOUTSEL_MCSTRIGOUTSEL)

/** Alias (User Manual Name) for GTM_INOUTSEL_MCSTRIGOUTSEL.
 * To use register names with standard convension, please use GTM_INOUTSEL_MCSTRIGOUTSEL.
 */
#define GTM_MCSTRIGOUTSEL              (GTM_INOUTSEL_MCSTRIGOUTSEL)

/** \\brief  9FF68, MSC0 Input High Control Register */
#define GTM_INOUTSEL_MSC_IN0_INHCON    /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_MSC_IN_INHCON *)0xF019FF68u)

/** Alias (User Manual Name) for GTM_INOUTSEL_MSC_IN0_INHCON.
 * To use register names with standard convension, please use GTM_INOUTSEL_MSC_IN0_INHCON.
 */
#define GTM_MSC0INHCON                 (GTM_INOUTSEL_MSC_IN0_INHCON)

/** Alias (User Manual Name) for GTM_INOUTSEL_MSC_IN0_INHCON.
 * To use register names with standard convension, please use GTM_INOUTSEL_MSC_IN0_INHCON.
 */
#define GTM_MSC0INHCON                 (GTM_INOUTSEL_MSC_IN0_INHCON)

/** \\brief  9FF64, MSC0 Input Low Control Register */
#define GTM_INOUTSEL_MSC_IN0_INLCON    /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_MSC_IN_INLCON *)0xF019FF64u)

/** Alias (User Manual Name) for GTM_INOUTSEL_MSC_IN0_INLCON.
 * To use register names with standard convension, please use GTM_INOUTSEL_MSC_IN0_INLCON.
 */
#define GTM_MSC0INLCON                 (GTM_INOUTSEL_MSC_IN0_INLCON)

/** Alias (User Manual Name) for GTM_INOUTSEL_MSC_IN0_INLCON.
 * To use register names with standard convension, please use GTM_INOUTSEL_MSC_IN0_INLCON.
 */
#define GTM_MSC0INLCON                 (GTM_INOUTSEL_MSC_IN0_INLCON)

/** \\brief  9FF6C, MSC0 Input Low Extended Control Register */
#define GTM_INOUTSEL_MSC_IN0_INLEXTCON /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_MSC_IN_INLEXTCON *)0xF019FF6Cu)

/** Alias (User Manual Name) for GTM_INOUTSEL_MSC_IN0_INLEXTCON.
 * To use register names with standard convension, please use GTM_INOUTSEL_MSC_IN0_INLEXTCON.
 */
#define GTM_MSC0INLEXTCON              (GTM_INOUTSEL_MSC_IN0_INLEXTCON)

/** Alias (User Manual Name) for GTM_INOUTSEL_MSC_IN0_INLEXTCON.
 * To use register names with standard convension, please use GTM_INOUTSEL_MSC_IN0_INLEXTCON.
 */
#define GTM_MSC0INLEXTCON              (GTM_INOUTSEL_MSC_IN0_INLEXTCON)

/** \\brief  9FF74, MSC0 Input High Control Register */
#define GTM_INOUTSEL_MSC_IN1_INHCON    /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_MSC_IN_INHCON *)0xF019FF74u)

/** Alias (User Manual Name) for GTM_INOUTSEL_MSC_IN1_INHCON.
 * To use register names with standard convension, please use GTM_INOUTSEL_MSC_IN1_INHCON.
 */
#define GTM_MSC1INHCON                 (GTM_INOUTSEL_MSC_IN1_INHCON)

/** Alias (User Manual Name) for GTM_INOUTSEL_MSC_IN1_INHCON.
 * To use register names with standard convension, please use GTM_INOUTSEL_MSC_IN1_INHCON.
 */
#define GTM_MSC1INHCON                 (GTM_INOUTSEL_MSC_IN1_INHCON)

/** \\brief  9FF70, MSC0 Input Low Control Register */
#define GTM_INOUTSEL_MSC_IN1_INLCON    /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_MSC_IN_INLCON *)0xF019FF70u)

/** Alias (User Manual Name) for GTM_INOUTSEL_MSC_IN1_INLCON.
 * To use register names with standard convension, please use GTM_INOUTSEL_MSC_IN1_INLCON.
 */
#define GTM_MSC1INLCON                 (GTM_INOUTSEL_MSC_IN1_INLCON)

/** Alias (User Manual Name) for GTM_INOUTSEL_MSC_IN1_INLCON.
 * To use register names with standard convension, please use GTM_INOUTSEL_MSC_IN1_INLCON.
 */
#define GTM_MSC1INLCON                 (GTM_INOUTSEL_MSC_IN1_INLCON)

/** \\brief  9FF78, MSC0 Input Low Extended Control Register */
#define GTM_INOUTSEL_MSC_IN1_INLEXTCON /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_MSC_IN_INLEXTCON *)0xF019FF78u)

/** Alias (User Manual Name) for GTM_INOUTSEL_MSC_IN1_INLEXTCON.
 * To use register names with standard convension, please use GTM_INOUTSEL_MSC_IN1_INLEXTCON.
 */
#define GTM_MSC1INLEXTCON              (GTM_INOUTSEL_MSC_IN1_INLEXTCON)

/** Alias (User Manual Name) for GTM_INOUTSEL_MSC_IN1_INLEXTCON.
 * To use register names with standard convension, please use GTM_INOUTSEL_MSC_IN1_INLEXTCON.
 */
#define GTM_MSC1INLEXTCON              (GTM_INOUTSEL_MSC_IN1_INLEXTCON)

/** \\brief  9FF80, MSC0 Input High Control Register */
#define GTM_INOUTSEL_MSC_IN2_INHCON    /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_MSC_IN_INHCON *)0xF019FF80u)

/** Alias (User Manual Name) for GTM_INOUTSEL_MSC_IN2_INHCON.
 * To use register names with standard convension, please use GTM_INOUTSEL_MSC_IN2_INHCON.
 */
#define GTM_MSC2INHCON                 (GTM_INOUTSEL_MSC_IN2_INHCON)

/** Alias (User Manual Name) for GTM_INOUTSEL_MSC_IN2_INHCON.
 * To use register names with standard convension, please use GTM_INOUTSEL_MSC_IN2_INHCON.
 */
#define GTM_MSC2INHCON                 (GTM_INOUTSEL_MSC_IN2_INHCON)

/** \\brief  9FF7C, MSC0 Input Low Control Register */
#define GTM_INOUTSEL_MSC_IN2_INLCON    /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_MSC_IN_INLCON *)0xF019FF7Cu)

/** Alias (User Manual Name) for GTM_INOUTSEL_MSC_IN2_INLCON.
 * To use register names with standard convension, please use GTM_INOUTSEL_MSC_IN2_INLCON.
 */
#define GTM_MSC2INLCON                 (GTM_INOUTSEL_MSC_IN2_INLCON)

/** Alias (User Manual Name) for GTM_INOUTSEL_MSC_IN2_INLCON.
 * To use register names with standard convension, please use GTM_INOUTSEL_MSC_IN2_INLCON.
 */
#define GTM_MSC2INLCON                 (GTM_INOUTSEL_MSC_IN2_INLCON)

/** \\brief  9FF84, MSC0 Input Low Extended Control Register */
#define GTM_INOUTSEL_MSC_IN2_INLEXTCON /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_MSC_IN_INLEXTCON *)0xF019FF84u)

/** Alias (User Manual Name) for GTM_INOUTSEL_MSC_IN2_INLEXTCON.
 * To use register names with standard convension, please use GTM_INOUTSEL_MSC_IN2_INLEXTCON.
 */
#define GTM_MSC2INLEXTCON              (GTM_INOUTSEL_MSC_IN2_INLEXTCON)

/** Alias (User Manual Name) for GTM_INOUTSEL_MSC_IN2_INLEXTCON.
 * To use register names with standard convension, please use GTM_INOUTSEL_MSC_IN2_INLEXTCON.
 */
#define GTM_MSC2INLEXTCON              (GTM_INOUTSEL_MSC_IN2_INLEXTCON)

/** \\brief  9FF8C, MSC0 Input High Control Register */
#define GTM_INOUTSEL_MSC_IN3_INHCON    /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_MSC_IN_INHCON *)0xF019FF8Cu)

/** Alias (User Manual Name) for GTM_INOUTSEL_MSC_IN3_INHCON.
 * To use register names with standard convension, please use GTM_INOUTSEL_MSC_IN3_INHCON.
 */
#define GTM_MSC3INHCON                 (GTM_INOUTSEL_MSC_IN3_INHCON)

/** Alias (User Manual Name) for GTM_INOUTSEL_MSC_IN3_INHCON.
 * To use register names with standard convension, please use GTM_INOUTSEL_MSC_IN3_INHCON.
 */
#define GTM_MSC3INHCON                 (GTM_INOUTSEL_MSC_IN3_INHCON)

/** \\brief  9FF88, MSC0 Input Low Control Register */
#define GTM_INOUTSEL_MSC_IN3_INLCON    /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_MSC_IN_INLCON *)0xF019FF88u)

/** Alias (User Manual Name) for GTM_INOUTSEL_MSC_IN3_INLCON.
 * To use register names with standard convension, please use GTM_INOUTSEL_MSC_IN3_INLCON.
 */
#define GTM_MSC3INLCON                 (GTM_INOUTSEL_MSC_IN3_INLCON)

/** Alias (User Manual Name) for GTM_INOUTSEL_MSC_IN3_INLCON.
 * To use register names with standard convension, please use GTM_INOUTSEL_MSC_IN3_INLCON.
 */
#define GTM_MSC3INLCON                 (GTM_INOUTSEL_MSC_IN3_INLCON)

