Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  9FF90, MSC0 Input Low Extended Control Register */
#define GTM_INOUTSEL_MSC_IN3_INLEXTCON /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_MSC_IN_INLEXTCON *)0xF019FF90u)

/** Alias (User Manual Name) for GTM_INOUTSEL_MSC_IN3_INLEXTCON.
 * To use register names with standard convension, please use GTM_INOUTSEL_MSC_IN3_INLEXTCON.
 */
#define GTM_MSC3INLEXTCON              (GTM_INOUTSEL_MSC_IN3_INLEXTCON)

/** Alias (User Manual Name) for GTM_INOUTSEL_MSC_IN3_INLEXTCON.
 * To use register names with standard convension, please use GTM_INOUTSEL_MSC_IN3_INLEXTCON.
 */
#define GTM_MSC3INLEXTCON              (GTM_INOUTSEL_MSC_IN3_INLEXTCON)

/** \\brief  9FED4, MSC Set 1 Control 0 Register */
#define GTM_INOUTSEL_MSC_SET1CON0      /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_MSC_SET1CON0 *)0xF019FED4u)

/** Alias (User Manual Name) for GTM_INOUTSEL_MSC_SET1CON0.
 * To use register names with standard convension, please use GTM_INOUTSEL_MSC_SET1CON0.
 */
#define GTM_MSCSET1CON0                (GTM_INOUTSEL_MSC_SET1CON0)

/** Alias (User Manual Name) for GTM_INOUTSEL_MSC_SET1CON0.
 * To use register names with standard convension, please use GTM_INOUTSEL_MSC_SET1CON0.
 */
#define GTM_MSCSET1CON0                (GTM_INOUTSEL_MSC_SET1CON0)

/** \\brief  9FED8, MSC Set 1 Control 1 Register */
#define GTM_INOUTSEL_MSC_SET1CON1      /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_MSC_SET1CON1 *)0xF019FED8u)

/** Alias (User Manual Name) for GTM_INOUTSEL_MSC_SET1CON1.
 * To use register names with standard convension, please use GTM_INOUTSEL_MSC_SET1CON1.
 */
#define GTM_MSCSET1CON1                (GTM_INOUTSEL_MSC_SET1CON1)

/** Alias (User Manual Name) for GTM_INOUTSEL_MSC_SET1CON1.
 * To use register names with standard convension, please use GTM_INOUTSEL_MSC_SET1CON1.
 */
#define GTM_MSCSET1CON1                (GTM_INOUTSEL_MSC_SET1CON1)

/** \\brief  9FEDC, MSC Set 1 Control 2 Register */
#define GTM_INOUTSEL_MSC_SET1CON2      /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_MSC_SET1CON2 *)0xF019FEDCu)

/** Alias (User Manual Name) for GTM_INOUTSEL_MSC_SET1CON2.
 * To use register names with standard convension, please use GTM_INOUTSEL_MSC_SET1CON2.
 */
#define GTM_MSCSET1CON2                (GTM_INOUTSEL_MSC_SET1CON2)

/** Alias (User Manual Name) for GTM_INOUTSEL_MSC_SET1CON2.
 * To use register names with standard convension, please use GTM_INOUTSEL_MSC_SET1CON2.
 */
#define GTM_MSCSET1CON2                (GTM_INOUTSEL_MSC_SET1CON2)

/** \\brief  9FEE0, MSC Set 1 Control 3 Register */
#define GTM_INOUTSEL_MSC_SET1CON3      /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_MSC_SET1CON3 *)0xF019FEE0u)

/** Alias (User Manual Name) for GTM_INOUTSEL_MSC_SET1CON3.
 * To use register names with standard convension, please use GTM_INOUTSEL_MSC_SET1CON3.
 */
#define GTM_MSCSET1CON3                (GTM_INOUTSEL_MSC_SET1CON3)

/** Alias (User Manual Name) for GTM_INOUTSEL_MSC_SET1CON3.
 * To use register names with standard convension, please use GTM_INOUTSEL_MSC_SET1CON3.
 */
#define GTM_MSCSET1CON3                (GTM_INOUTSEL_MSC_SET1CON3)

/** \\brief  9FEE4, MSC Set 2 Control 0 Register */
#define GTM_INOUTSEL_MSC_SET2CON0      /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_MSC_SET2CON0 *)0xF019FEE4u)

/** Alias (User Manual Name) for GTM_INOUTSEL_MSC_SET2CON0.
 * To use register names with standard convension, please use GTM_INOUTSEL_MSC_SET2CON0.
 */
#define GTM_MSCSET2CON0                (GTM_INOUTSEL_MSC_SET2CON0)

/** Alias (User Manual Name) for GTM_INOUTSEL_MSC_SET2CON0.
 * To use register names with standard convension, please use GTM_INOUTSEL_MSC_SET2CON0.
 */
#define GTM_MSCSET2CON0                (GTM_INOUTSEL_MSC_SET2CON0)

/** \\brief  9FEE8, MSC Set 2 Control 1 Register */
#define GTM_INOUTSEL_MSC_SET2CON1      /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_MSC_SET2CON1 *)0xF019FEE8u)

/** Alias (User Manual Name) for GTM_INOUTSEL_MSC_SET2CON1.
 * To use register names with standard convension, please use GTM_INOUTSEL_MSC_SET2CON1.
 */
#define GTM_MSCSET2CON1                (GTM_INOUTSEL_MSC_SET2CON1)

/** Alias (User Manual Name) for GTM_INOUTSEL_MSC_SET2CON1.
 * To use register names with standard convension, please use GTM_INOUTSEL_MSC_SET2CON1.
 */
#define GTM_MSCSET2CON1                (GTM_INOUTSEL_MSC_SET2CON1)

/** \\brief  9FEEC, MSC Set 2 Control 2 Register */
#define GTM_INOUTSEL_MSC_SET2CON2      /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_MSC_SET2CON2 *)0xF019FEECu)

/** Alias (User Manual Name) for GTM_INOUTSEL_MSC_SET2CON2.
 * To use register names with standard convension, please use GTM_INOUTSEL_MSC_SET2CON2.
 */
#define GTM_MSCSET2CON2                (GTM_INOUTSEL_MSC_SET2CON2)

/** Alias (User Manual Name) for GTM_INOUTSEL_MSC_SET2CON2.
 * To use register names with standard convension, please use GTM_INOUTSEL_MSC_SET2CON2.
 */
#define GTM_MSCSET2CON2                (GTM_INOUTSEL_MSC_SET2CON2)

/** \\brief  9FEF0, MSC Set 2 Control 3 Register */
#define GTM_INOUTSEL_MSC_SET2CON3      /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_MSC_SET2CON3 *)0xF019FEF0u)

/** Alias (User Manual Name) for GTM_INOUTSEL_MSC_SET2CON3.
 * To use register names with standard convension, please use GTM_INOUTSEL_MSC_SET2CON3.
 */
#define GTM_MSCSET2CON3                (GTM_INOUTSEL_MSC_SET2CON3)

/** Alias (User Manual Name) for GTM_INOUTSEL_MSC_SET2CON3.
 * To use register names with standard convension, please use GTM_INOUTSEL_MSC_SET2CON3.
 */
#define GTM_MSCSET2CON3                (GTM_INOUTSEL_MSC_SET2CON3)

/** \\brief  9FEF4, MSC Set 3Control 0 Register */
#define GTM_INOUTSEL_MSC_SET3CON0      /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_MSC_SET3CON0 *)0xF019FEF4u)

/** Alias (User Manual Name) for GTM_INOUTSEL_MSC_SET3CON0.
 * To use register names with standard convension, please use GTM_INOUTSEL_MSC_SET3CON0.
 */
#define GTM_MSCSET3CON0                (GTM_INOUTSEL_MSC_SET3CON0)

/** Alias (User Manual Name) for GTM_INOUTSEL_MSC_SET3CON0.
 * To use register names with standard convension, please use GTM_INOUTSEL_MSC_SET3CON0.
 */
#define GTM_MSCSET3CON0                (GTM_INOUTSEL_MSC_SET3CON0)

/** \\brief  9FEF8, MSC Set 3Control 1 Register */
#define GTM_INOUTSEL_MSC_SET3CON1      /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_MSC_SET3CON1 *)0xF019FEF8u)

/** Alias (User Manual Name) for GTM_INOUTSEL_MSC_SET3CON1.
 * To use register names with standard convension, please use GTM_INOUTSEL_MSC_SET3CON1.
 */
#define GTM_MSCSET3CON1                (GTM_INOUTSEL_MSC_SET3CON1)

/** Alias (User Manual Name) for GTM_INOUTSEL_MSC_SET3CON1.
 * To use register names with standard convension, please use GTM_INOUTSEL_MSC_SET3CON1.
 */
#define GTM_MSCSET3CON1                (GTM_INOUTSEL_MSC_SET3CON1)

/** \\brief  9FEFC, MSC Set 3 Control 2 Register */
#define GTM_INOUTSEL_MSC_SET3CON2      /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_MSC_SET3CON2 *)0xF019FEFCu)

