Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** Alias (User Manual Name) for GTM_INOUTSEL_MSC_SET3CON2.
 * To use register names with standard convension, please use GTM_INOUTSEL_MSC_SET3CON2.
 */
#define GTM_MSCSET3CON2                (GTM_INOUTSEL_MSC_SET3CON2)

/** Alias (User Manual Name) for GTM_INOUTSEL_MSC_SET3CON2.
 * To use register names with standard convension, please use GTM_INOUTSEL_MSC_SET3CON2.
 */
#define GTM_MSCSET3CON2                (GTM_INOUTSEL_MSC_SET3CON2)

/** \\brief  9FF00, MSC Set 3 Control 3 Register */
#define GTM_INOUTSEL_MSC_SET3CON3      /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_MSC_SET3CON3 *)0xF019FF00u)

/** Alias (User Manual Name) for GTM_INOUTSEL_MSC_SET3CON3.
 * To use register names with standard convension, please use GTM_INOUTSEL_MSC_SET3CON3.
 */
#define GTM_MSCSET3CON3                (GTM_INOUTSEL_MSC_SET3CON3)

/** Alias (User Manual Name) for GTM_INOUTSEL_MSC_SET3CON3.
 * To use register names with standard convension, please use GTM_INOUTSEL_MSC_SET3CON3.
 */
#define GTM_MSCSET3CON3                (GTM_INOUTSEL_MSC_SET3CON3)

/** \\brief  9FF04, MSC Set 4 Control 0 Register */
#define GTM_INOUTSEL_MSC_SET4CON0      /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_MSC_SET4CON0 *)0xF019FF04u)

/** Alias (User Manual Name) for GTM_INOUTSEL_MSC_SET4CON0.
 * To use register names with standard convension, please use GTM_INOUTSEL_MSC_SET4CON0.
 */
#define GTM_MSCSET4CON0                (GTM_INOUTSEL_MSC_SET4CON0)

/** Alias (User Manual Name) for GTM_INOUTSEL_MSC_SET4CON0.
 * To use register names with standard convension, please use GTM_INOUTSEL_MSC_SET4CON0.
 */
#define GTM_MSCSET4CON0                (GTM_INOUTSEL_MSC_SET4CON0)

/** \\brief  9FF08, MSC Set 4 Control 1 Register */
#define GTM_INOUTSEL_MSC_SET4CON1      /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_MSC_SET4CON1 *)0xF019FF08u)

/** Alias (User Manual Name) for GTM_INOUTSEL_MSC_SET4CON1.
 * To use register names with standard convension, please use GTM_INOUTSEL_MSC_SET4CON1.
 */
#define GTM_MSCSET4CON1                (GTM_INOUTSEL_MSC_SET4CON1)

/** Alias (User Manual Name) for GTM_INOUTSEL_MSC_SET4CON1.
 * To use register names with standard convension, please use GTM_INOUTSEL_MSC_SET4CON1.
 */
#define GTM_MSCSET4CON1                (GTM_INOUTSEL_MSC_SET4CON1)

/** \\brief  9FF0C, MSC Set 4 Control 2 Register */
#define GTM_INOUTSEL_MSC_SET4CON2      /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_MSC_SET4CON2 *)0xF019FF0Cu)

/** Alias (User Manual Name) for GTM_INOUTSEL_MSC_SET4CON2.
 * To use register names with standard convension, please use GTM_INOUTSEL_MSC_SET4CON2.
 */
#define GTM_MSCSET4CON2                (GTM_INOUTSEL_MSC_SET4CON2)

/** Alias (User Manual Name) for GTM_INOUTSEL_MSC_SET4CON2.
 * To use register names with standard convension, please use GTM_INOUTSEL_MSC_SET4CON2.
 */
#define GTM_MSCSET4CON2                (GTM_INOUTSEL_MSC_SET4CON2)

/** \\brief  9FF10, MSC Set 4 Control 3 Register */
#define GTM_INOUTSEL_MSC_SET4CON3      /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_MSC_SET4CON3 *)0xF019FF10u)

/** Alias (User Manual Name) for GTM_INOUTSEL_MSC_SET4CON3.
 * To use register names with standard convension, please use GTM_INOUTSEL_MSC_SET4CON3.
 */
#define GTM_MSCSET4CON3                (GTM_INOUTSEL_MSC_SET4CON3)

/** Alias (User Manual Name) for GTM_INOUTSEL_MSC_SET4CON3.
 * To use register names with standard convension, please use GTM_INOUTSEL_MSC_SET4CON3.
 */
#define GTM_MSCSET4CON3                (GTM_INOUTSEL_MSC_SET4CON3)

/** \\brief  9FF14, MSC Set 5 Control 0 Register */
#define GTM_INOUTSEL_MSC_SET5CON0      /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_MSC_SET5CON0 *)0xF019FF14u)

/** Alias (User Manual Name) for GTM_INOUTSEL_MSC_SET5CON0.
 * To use register names with standard convension, please use GTM_INOUTSEL_MSC_SET5CON0.
 */
#define GTM_MSCSET5CON0                (GTM_INOUTSEL_MSC_SET5CON0)

/** Alias (User Manual Name) for GTM_INOUTSEL_MSC_SET5CON0.
 * To use register names with standard convension, please use GTM_INOUTSEL_MSC_SET5CON0.
 */
#define GTM_MSCSET5CON0                (GTM_INOUTSEL_MSC_SET5CON0)

/** \\brief  9FF18, MSC Set 5 Control 1 Register */
#define GTM_INOUTSEL_MSC_SET5CON1      /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_MSC_SET5CON1 *)0xF019FF18u)

/** Alias (User Manual Name) for GTM_INOUTSEL_MSC_SET5CON1.
 * To use register names with standard convension, please use GTM_INOUTSEL_MSC_SET5CON1.
 */
#define GTM_MSCSET5CON1                (GTM_INOUTSEL_MSC_SET5CON1)

/** Alias (User Manual Name) for GTM_INOUTSEL_MSC_SET5CON1.
 * To use register names with standard convension, please use GTM_INOUTSEL_MSC_SET5CON1.
 */
#define GTM_MSCSET5CON1                (GTM_INOUTSEL_MSC_SET5CON1)

/** \\brief  9FF1C, MSC Set 5 Control 2 Register */
#define GTM_INOUTSEL_MSC_SET5CON2      /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_MSC_SET5CON2 *)0xF019FF1Cu)

/** Alias (User Manual Name) for GTM_INOUTSEL_MSC_SET5CON2.
 * To use register names with standard convension, please use GTM_INOUTSEL_MSC_SET5CON2.
 */
#define GTM_MSCSET5CON2                (GTM_INOUTSEL_MSC_SET5CON2)

/** Alias (User Manual Name) for GTM_INOUTSEL_MSC_SET5CON2.
 * To use register names with standard convension, please use GTM_INOUTSEL_MSC_SET5CON2.
 */
#define GTM_MSCSET5CON2                (GTM_INOUTSEL_MSC_SET5CON2)

/** \\brief  9FF20, MSC Set 5 Control 3 Register */
#define GTM_INOUTSEL_MSC_SET5CON3      /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_MSC_SET5CON3 *)0xF019FF20u)

/** Alias (User Manual Name) for GTM_INOUTSEL_MSC_SET5CON3.
 * To use register names with standard convension, please use GTM_INOUTSEL_MSC_SET5CON3.
 */
#define GTM_MSCSET5CON3                (GTM_INOUTSEL_MSC_SET5CON3)

/** Alias (User Manual Name) for GTM_INOUTSEL_MSC_SET5CON3.
 * To use register names with standard convension, please use GTM_INOUTSEL_MSC_SET5CON3.
 */
#define GTM_MSCSET5CON3                (GTM_INOUTSEL_MSC_SET5CON3)

/** \\brief  9FF24, MSC Set 6 Control 0 Register */
#define GTM_INOUTSEL_MSC_SET6CON0      /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_MSC_SET6CON0 *)0xF019FF24u)

/** Alias (User Manual Name) for GTM_INOUTSEL_MSC_SET6CON0.
 * To use register names with standard convension, please use GTM_INOUTSEL_MSC_SET6CON0.
 */
#define GTM_MSCSET6CON0                (GTM_INOUTSEL_MSC_SET6CON0)

/** Alias (User Manual Name) for GTM_INOUTSEL_MSC_SET6CON0.
 * To use register names with standard convension, please use GTM_INOUTSEL_MSC_SET6CON0.
 */
#define GTM_MSCSET6CON0                (GTM_INOUTSEL_MSC_SET6CON0)

/** \\brief  9FF28, MSC Set 6 Control 1 Register */
#define GTM_INOUTSEL_MSC_SET6CON1      /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_MSC_SET6CON1 *)0xF019FF28u)

