Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** Alias (User Manual Name) for GTM_INOUTSEL_MSC_SET6CON1.
 * To use register names with standard convension, please use GTM_INOUTSEL_MSC_SET6CON1.
 */
#define GTM_MSCSET6CON1                (GTM_INOUTSEL_MSC_SET6CON1)

/** Alias (User Manual Name) for GTM_INOUTSEL_MSC_SET6CON1.
 * To use register names with standard convension, please use GTM_INOUTSEL_MSC_SET6CON1.
 */
#define GTM_MSCSET6CON1                (GTM_INOUTSEL_MSC_SET6CON1)

/** \\brief  9FF2C, MSC Set 6 Control 2 Register */
#define GTM_INOUTSEL_MSC_SET6CON2      /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_MSC_SET6CON2 *)0xF019FF2Cu)

/** Alias (User Manual Name) for GTM_INOUTSEL_MSC_SET6CON2.
 * To use register names with standard convension, please use GTM_INOUTSEL_MSC_SET6CON2.
 */
#define GTM_MSCSET6CON2                (GTM_INOUTSEL_MSC_SET6CON2)

/** Alias (User Manual Name) for GTM_INOUTSEL_MSC_SET6CON2.
 * To use register names with standard convension, please use GTM_INOUTSEL_MSC_SET6CON2.
 */
#define GTM_MSCSET6CON2                (GTM_INOUTSEL_MSC_SET6CON2)

/** \\brief  9FF30, MSC Set 6 Control 3 Register */
#define GTM_INOUTSEL_MSC_SET6CON3      /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_MSC_SET6CON3 *)0xF019FF30u)

/** Alias (User Manual Name) for GTM_INOUTSEL_MSC_SET6CON3.
 * To use register names with standard convension, please use GTM_INOUTSEL_MSC_SET6CON3.
 */
#define GTM_MSCSET6CON3                (GTM_INOUTSEL_MSC_SET6CON3)

/** Alias (User Manual Name) for GTM_INOUTSEL_MSC_SET6CON3.
 * To use register names with standard convension, please use GTM_INOUTSEL_MSC_SET6CON3.
 */
#define GTM_MSCSET6CON3                (GTM_INOUTSEL_MSC_SET6CON3)

/** \\brief  9FF34, MSC Set 7Control 0 Register */
#define GTM_INOUTSEL_MSC_SET7CON0      /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_MSC_SET7CON0 *)0xF019FF34u)

/** Alias (User Manual Name) for GTM_INOUTSEL_MSC_SET7CON0.
 * To use register names with standard convension, please use GTM_INOUTSEL_MSC_SET7CON0.
 */
#define GTM_MSCSET7CON0                (GTM_INOUTSEL_MSC_SET7CON0)

/** Alias (User Manual Name) for GTM_INOUTSEL_MSC_SET7CON0.
 * To use register names with standard convension, please use GTM_INOUTSEL_MSC_SET7CON0.
 */
#define GTM_MSCSET7CON0                (GTM_INOUTSEL_MSC_SET7CON0)

/** \\brief  9FF38, MSC Set 7 Control 1 Register */
#define GTM_INOUTSEL_MSC_SET7CON1      /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_MSC_SET7CON1 *)0xF019FF38u)

/** Alias (User Manual Name) for GTM_INOUTSEL_MSC_SET7CON1.
 * To use register names with standard convension, please use GTM_INOUTSEL_MSC_SET7CON1.
 */
#define GTM_MSCSET7CON1                (GTM_INOUTSEL_MSC_SET7CON1)

/** Alias (User Manual Name) for GTM_INOUTSEL_MSC_SET7CON1.
 * To use register names with standard convension, please use GTM_INOUTSEL_MSC_SET7CON1.
 */
#define GTM_MSCSET7CON1                (GTM_INOUTSEL_MSC_SET7CON1)

/** \\brief  9FF3C, MSC Set 7 Control 2 Register */
#define GTM_INOUTSEL_MSC_SET7CON2      /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_MSC_SET7CON2 *)0xF019FF3Cu)

/** Alias (User Manual Name) for GTM_INOUTSEL_MSC_SET7CON2.
 * To use register names with standard convension, please use GTM_INOUTSEL_MSC_SET7CON2.
 */
#define GTM_MSCSET7CON2                (GTM_INOUTSEL_MSC_SET7CON2)

/** Alias (User Manual Name) for GTM_INOUTSEL_MSC_SET7CON2.
 * To use register names with standard convension, please use GTM_INOUTSEL_MSC_SET7CON2.
 */
#define GTM_MSCSET7CON2                (GTM_INOUTSEL_MSC_SET7CON2)

/** \\brief  9FF40, MSC Set 7 Control 3 Register */
#define GTM_INOUTSEL_MSC_SET7CON3      /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_MSC_SET7CON3 *)0xF019FF40u)

/** Alias (User Manual Name) for GTM_INOUTSEL_MSC_SET7CON3.
 * To use register names with standard convension, please use GTM_INOUTSEL_MSC_SET7CON3.
 */
#define GTM_MSCSET7CON3                (GTM_INOUTSEL_MSC_SET7CON3)

/** Alias (User Manual Name) for GTM_INOUTSEL_MSC_SET7CON3.
 * To use register names with standard convension, please use GTM_INOUTSEL_MSC_SET7CON3.
 */
#define GTM_MSCSET7CON3                (GTM_INOUTSEL_MSC_SET7CON3)

/** \\brief  9FF44, MSC Set 8Control 0 Register */
#define GTM_INOUTSEL_MSC_SET8CON0      /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_MSC_SET8CON0 *)0xF019FF44u)

/** Alias (User Manual Name) for GTM_INOUTSEL_MSC_SET8CON0.
 * To use register names with standard convension, please use GTM_INOUTSEL_MSC_SET8CON0.
 */
#define GTM_MSCSET8CON0                (GTM_INOUTSEL_MSC_SET8CON0)

/** Alias (User Manual Name) for GTM_INOUTSEL_MSC_SET8CON0.
 * To use register names with standard convension, please use GTM_INOUTSEL_MSC_SET8CON0.
 */
#define GTM_MSCSET8CON0                (GTM_INOUTSEL_MSC_SET8CON0)

/** \\brief  9FF48, MSC Set 8 Control 1 Register */
#define GTM_INOUTSEL_MSC_SET8CON1      /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_MSC_SET8CON1 *)0xF019FF48u)

/** Alias (User Manual Name) for GTM_INOUTSEL_MSC_SET8CON1.
 * To use register names with standard convension, please use GTM_INOUTSEL_MSC_SET8CON1.
 */
#define GTM_MSCSET8CON1                (GTM_INOUTSEL_MSC_SET8CON1)

/** Alias (User Manual Name) for GTM_INOUTSEL_MSC_SET8CON1.
 * To use register names with standard convension, please use GTM_INOUTSEL_MSC_SET8CON1.
 */
#define GTM_MSCSET8CON1                (GTM_INOUTSEL_MSC_SET8CON1)

/** \\brief  9FF4C, MSC Set 8 Control 2 Register */
#define GTM_INOUTSEL_MSC_SET8CON2      /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_MSC_SET8CON2 *)0xF019FF4Cu)

/** Alias (User Manual Name) for GTM_INOUTSEL_MSC_SET8CON2.
 * To use register names with standard convension, please use GTM_INOUTSEL_MSC_SET8CON2.
 */
#define GTM_MSCSET8CON2                (GTM_INOUTSEL_MSC_SET8CON2)

/** Alias (User Manual Name) for GTM_INOUTSEL_MSC_SET8CON2.
 * To use register names with standard convension, please use GTM_INOUTSEL_MSC_SET8CON2.
 */
#define GTM_MSCSET8CON2                (GTM_INOUTSEL_MSC_SET8CON2)

/** \\brief  9FF50, MSC Set 8 Control 3 Register */
#define GTM_INOUTSEL_MSC_SET8CON3      /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_MSC_SET8CON3 *)0xF019FF50u)

/** Alias (User Manual Name) for GTM_INOUTSEL_MSC_SET8CON3.
 * To use register names with standard convension, please use GTM_INOUTSEL_MSC_SET8CON3.
 */
#define GTM_MSCSET8CON3                (GTM_INOUTSEL_MSC_SET8CON3)

/** Alias (User Manual Name) for GTM_INOUTSEL_MSC_SET8CON3.
 * To use register names with standard convension, please use GTM_INOUTSEL_MSC_SET8CON3.
 */
#define GTM_MSCSET8CON3                (GTM_INOUTSEL_MSC_SET8CON3)

/** \\brief  9FF54, MSC Set 9Control 0 Register */
#define GTM_INOUTSEL_MSC_SET9CON0      /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_MSC_SET9CON0 *)0xF019FF54u)

