Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** Alias (User Manual Name) for GTM_INOUTSEL_MSC_SET9CON0.
 * To use register names with standard convension, please use GTM_INOUTSEL_MSC_SET9CON0.
 */
#define GTM_MSCSET9CON0                (GTM_INOUTSEL_MSC_SET9CON0)

/** Alias (User Manual Name) for GTM_INOUTSEL_MSC_SET9CON0.
 * To use register names with standard convension, please use GTM_INOUTSEL_MSC_SET9CON0.
 */
#define GTM_MSCSET9CON0                (GTM_INOUTSEL_MSC_SET9CON0)

/** \\brief  9FF58, MSC Set 9 Control 1 Register */
#define GTM_INOUTSEL_MSC_SET9CON1      /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_MSC_SET9CON1 *)0xF019FF58u)

/** Alias (User Manual Name) for GTM_INOUTSEL_MSC_SET9CON1.
 * To use register names with standard convension, please use GTM_INOUTSEL_MSC_SET9CON1.
 */
#define GTM_MSCSET9CON1                (GTM_INOUTSEL_MSC_SET9CON1)

/** Alias (User Manual Name) for GTM_INOUTSEL_MSC_SET9CON1.
 * To use register names with standard convension, please use GTM_INOUTSEL_MSC_SET9CON1.
 */
#define GTM_MSCSET9CON1                (GTM_INOUTSEL_MSC_SET9CON1)

/** \\brief  9FF5C, MSC Set 9 Control 2 Register */
#define GTM_INOUTSEL_MSC_SET9CON2      /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_MSC_SET9CON2 *)0xF019FF5Cu)

/** Alias (User Manual Name) for GTM_INOUTSEL_MSC_SET9CON2.
 * To use register names with standard convension, please use GTM_INOUTSEL_MSC_SET9CON2.
 */
#define GTM_MSCSET9CON2                (GTM_INOUTSEL_MSC_SET9CON2)

/** Alias (User Manual Name) for GTM_INOUTSEL_MSC_SET9CON2.
 * To use register names with standard convension, please use GTM_INOUTSEL_MSC_SET9CON2.
 */
#define GTM_MSCSET9CON2                (GTM_INOUTSEL_MSC_SET9CON2)

/** \\brief  9FF60, MSC Set 9 Control 3 Register */
#define GTM_INOUTSEL_MSC_SET9CON3      /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_MSC_SET9CON3 *)0xF019FF60u)

/** Alias (User Manual Name) for GTM_INOUTSEL_MSC_SET9CON3.
 * To use register names with standard convension, please use GTM_INOUTSEL_MSC_SET9CON3.
 */
#define GTM_MSCSET9CON3                (GTM_INOUTSEL_MSC_SET9CON3)

/** Alias (User Manual Name) for GTM_INOUTSEL_MSC_SET9CON3.
 * To use register names with standard convension, please use GTM_INOUTSEL_MSC_SET9CON3.
 */
#define GTM_MSCSET9CON3                (GTM_INOUTSEL_MSC_SET9CON3)

/** \\brief  9FE30, OCDS Control and Status */
#define GTM_INOUTSEL_OCS               /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_OCS *)0xF019FE30u)

/** Alias (User Manual Name) for GTM_INOUTSEL_OCS.
 * To use register names with standard convension, please use GTM_INOUTSEL_OCS.
 */
#define GTM_OCS                        (GTM_INOUTSEL_OCS)

/** Alias (User Manual Name) for GTM_INOUTSEL_OCS.
 * To use register names with standard convension, please use GTM_INOUTSEL_OCS.
 */
#define GTM_OCS                        (GTM_INOUTSEL_OCS)

/** \\brief  9FE2C, OCDS Debug Access Register */
#define GTM_INOUTSEL_ODA               /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_ODA *)0xF019FE2Cu)

/** Alias (User Manual Name) for GTM_INOUTSEL_ODA.
 * To use register names with standard convension, please use GTM_INOUTSEL_ODA.
 */
#define GTM_ODA                        (GTM_INOUTSEL_ODA)

/** Alias (User Manual Name) for GTM_INOUTSEL_ODA.
 * To use register names with standard convension, please use GTM_INOUTSEL_ODA.
 */
#define GTM_ODA                        (GTM_INOUTSEL_ODA)

/** \\brief  9FE14, OCDS TBU0 Trigger Register */
#define GTM_INOUTSEL_OTBU0T            /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_OTBU0T *)0xF019FE14u)

/** Alias (User Manual Name) for GTM_INOUTSEL_OTBU0T.
 * To use register names with standard convension, please use GTM_INOUTSEL_OTBU0T.
 */
#define GTM_OTBU0T                     (GTM_INOUTSEL_OTBU0T)

/** Alias (User Manual Name) for GTM_INOUTSEL_OTBU0T.
 * To use register names with standard convension, please use GTM_INOUTSEL_OTBU0T.
 */
#define GTM_OTBU0T                     (GTM_INOUTSEL_OTBU0T)

/** \\brief  9FE18, OCDS TBU1 Trigger Register */
#define GTM_INOUTSEL_OTBU1T            /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_OTBU1T *)0xF019FE18u)

/** Alias (User Manual Name) for GTM_INOUTSEL_OTBU1T.
 * To use register names with standard convension, please use GTM_INOUTSEL_OTBU1T.
 */
#define GTM_OTBU1T                     (GTM_INOUTSEL_OTBU1T)

/** Alias (User Manual Name) for GTM_INOUTSEL_OTBU1T.
 * To use register names with standard convension, please use GTM_INOUTSEL_OTBU1T.
 */
#define GTM_OTBU1T                     (GTM_INOUTSEL_OTBU1T)

/** \\brief  9FE1C, OCDS TBU2 Trigger Register */
#define GTM_INOUTSEL_OTBU2T            /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_OTBU2T *)0xF019FE1Cu)

/** Alias (User Manual Name) for GTM_INOUTSEL_OTBU2T.
 * To use register names with standard convension, please use GTM_INOUTSEL_OTBU2T.
 */
#define GTM_OTBU2T                     (GTM_INOUTSEL_OTBU2T)

/** Alias (User Manual Name) for GTM_INOUTSEL_OTBU2T.
 * To use register names with standard convension, please use GTM_INOUTSEL_OTBU2T.
 */
#define GTM_OTBU2T                     (GTM_INOUTSEL_OTBU2T)

/** \\brief  9FE24, OCDS Trigger Set Control 0 Register */
#define GTM_INOUTSEL_OTSC0             /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_OTSC0 *)0xF019FE24u)

/** Alias (User Manual Name) for GTM_INOUTSEL_OTSC0.
 * To use register names with standard convension, please use GTM_INOUTSEL_OTSC0.
 */
#define GTM_OTSC0                      (GTM_INOUTSEL_OTSC0)

/** Alias (User Manual Name) for GTM_INOUTSEL_OTSC0.
 * To use register names with standard convension, please use GTM_INOUTSEL_OTSC0.
 */
#define GTM_OTSC0                      (GTM_INOUTSEL_OTSC0)

/** \\brief  9FE28, OCDS Trigger Set Control 1 Register */
#define GTM_INOUTSEL_OTSC1             /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_OTSC1 *)0xF019FE28u)

/** Alias (User Manual Name) for GTM_INOUTSEL_OTSC1.
 * To use register names with standard convension, please use GTM_INOUTSEL_OTSC1.
 */
#define GTM_OTSC1                      (GTM_INOUTSEL_OTSC1)

/** Alias (User Manual Name) for GTM_INOUTSEL_OTSC1.
 * To use register names with standard convension, please use GTM_INOUTSEL_OTSC1.
 */
#define GTM_OTSC1                      (GTM_INOUTSEL_OTSC1)

