Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  9FE20, OCDS Trigger Set Select Register */
#define GTM_INOUTSEL_OTSS              /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_OTSS *)0xF019FE20u)

/** Alias (User Manual Name) for GTM_INOUTSEL_OTSS.
 * To use register names with standard convension, please use GTM_INOUTSEL_OTSS.
 */
#define GTM_OTSS                       (GTM_INOUTSEL_OTSS)

/** Alias (User Manual Name) for GTM_INOUTSEL_OTSS.
 * To use register names with standard convension, please use GTM_INOUTSEL_OTSS.
 */
#define GTM_OTSS                       (GTM_INOUTSEL_OTSS)

/** \\brief  9FF94, PSI5 Output Select 0 Register */
#define GTM_INOUTSEL_PSI5OUTSEL        /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_PSI5OUTSEL *)0xF019FF94u)

/** Alias (User Manual Name) for GTM_INOUTSEL_PSI5OUTSEL.
 * To use register names with standard convension, please use GTM_INOUTSEL_PSI5OUTSEL.
 */
#define GTM_PSI5OUTSEL                 (GTM_INOUTSEL_PSI5OUTSEL)

/** Alias (User Manual Name) for GTM_INOUTSEL_PSI5OUTSEL.
 * To use register names with standard convension, please use GTM_INOUTSEL_PSI5OUTSEL.
 */
#define GTM_PSI5OUTSEL                 (GTM_INOUTSEL_PSI5OUTSEL)

/** \\brief  9FF98, PSI5-S Output Select Register */
#define GTM_INOUTSEL_PSI5S_OUTSEL      /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_PSI5S_OUTSEL *)0xF019FF98u)

/** Alias (User Manual Name) for GTM_INOUTSEL_PSI5S_OUTSEL.
 * To use register names with standard convension, please use GTM_INOUTSEL_PSI5S_OUTSEL.
 */
#define GTM_PSI5SOUTSEL                (GTM_INOUTSEL_PSI5S_OUTSEL)

/** Alias (User Manual Name) for GTM_INOUTSEL_PSI5S_OUTSEL.
 * To use register names with standard convension, please use GTM_INOUTSEL_PSI5S_OUTSEL.
 */
#define GTM_PSI5SOUTSEL                (GTM_INOUTSEL_PSI5S_OUTSEL)

/** \\brief  9FE3C, Kernel Reset Register 0 */
#define GTM_INOUTSEL_RESET1            /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_RESET1 *)0xF019FE3Cu)

/** Alias (User Manual Name) for GTM_INOUTSEL_RESET1.
 * To use register names with standard convension, please use GTM_INOUTSEL_RESET1.
 */
#define GTM_RESET1                     (GTM_INOUTSEL_RESET1)

/** Alias (User Manual Name) for GTM_INOUTSEL_RESET1.
 * To use register names with standard convension, please use GTM_INOUTSEL_RESET1.
 */
#define GTM_RESET1                     (GTM_INOUTSEL_RESET1)

/** \\brief  9FE38, Kernel Reset Register 1 */
#define GTM_INOUTSEL_RESET2            /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_RESET2 *)0xF019FE38u)

/** Alias (User Manual Name) for GTM_INOUTSEL_RESET2.
 * To use register names with standard convension, please use GTM_INOUTSEL_RESET2.
 */
#define GTM_RESET2                     (GTM_INOUTSEL_RESET2)

/** Alias (User Manual Name) for GTM_INOUTSEL_RESET2.
 * To use register names with standard convension, please use GTM_INOUTSEL_RESET2.
 */
#define GTM_RESET2                     (GTM_INOUTSEL_RESET2)

/** \\brief  9FE34, Kernel Reset Status Clear Register */
#define GTM_INOUTSEL_RESET_CLR         /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_RESET_CLR *)0xF019FE34u)

/** Alias (User Manual Name) for GTM_INOUTSEL_RESET_CLR.
 * To use register names with standard convension, please use GTM_INOUTSEL_RESET_CLR.
 */
#define GTM_RESET_CLR                  (GTM_INOUTSEL_RESET_CLR)

/** Alias (User Manual Name) for GTM_INOUTSEL_RESET_CLR.
 * To use register names with standard convension, please use GTM_INOUTSEL_RESET_CLR.
 */
#define GTM_RESET_CLR                  (GTM_INOUTSEL_RESET_CLR)

/** \\brief  9FD30, Timer Output Select Register */
#define GTM_INOUTSEL_T_OUTSEL0         /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_T_OUTSEL *)0xF019FD30u)

/** Alias (User Manual Name) for GTM_INOUTSEL_T_OUTSEL0.
 * To use register names with standard convension, please use GTM_INOUTSEL_T_OUTSEL0.
 */
#define GTM_TOUTSEL0                   (GTM_INOUTSEL_T_OUTSEL0)

/** Alias (User Manual Name) for GTM_INOUTSEL_T_OUTSEL0.
 * To use register names with standard convension, please use GTM_INOUTSEL_T_OUTSEL0.
 */
#define GTM_TOUTSEL0                   (GTM_INOUTSEL_T_OUTSEL0)

/** \\brief  9FD34, Timer Output Select Register */
#define GTM_INOUTSEL_T_OUTSEL1         /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_T_OUTSEL *)0xF019FD34u)

/** Alias (User Manual Name) for GTM_INOUTSEL_T_OUTSEL1.
 * To use register names with standard convension, please use GTM_INOUTSEL_T_OUTSEL1.
 */
#define GTM_TOUTSEL1                   (GTM_INOUTSEL_T_OUTSEL1)

/** Alias (User Manual Name) for GTM_INOUTSEL_T_OUTSEL1.
 * To use register names with standard convension, please use GTM_INOUTSEL_T_OUTSEL1.
 */
#define GTM_TOUTSEL1                   (GTM_INOUTSEL_T_OUTSEL1)

/** \\brief  9FD58, Timer Output Select Register */
#define GTM_INOUTSEL_T_OUTSEL10        /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_T_OUTSEL *)0xF019FD58u)

/** Alias (User Manual Name) for GTM_INOUTSEL_T_OUTSEL10.
 * To use register names with standard convension, please use GTM_INOUTSEL_T_OUTSEL10.
 */
#define GTM_TOUTSEL10                  (GTM_INOUTSEL_T_OUTSEL10)

/** Alias (User Manual Name) for GTM_INOUTSEL_T_OUTSEL10.
 * To use register names with standard convension, please use GTM_INOUTSEL_T_OUTSEL10.
 */
#define GTM_TOUTSEL10                  (GTM_INOUTSEL_T_OUTSEL10)

/** \\brief  9FD5C, Timer Output Select Register */
#define GTM_INOUTSEL_T_OUTSEL11        /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_T_OUTSEL *)0xF019FD5Cu)

/** Alias (User Manual Name) for GTM_INOUTSEL_T_OUTSEL11.
 * To use register names with standard convension, please use GTM_INOUTSEL_T_OUTSEL11.
 */
#define GTM_TOUTSEL11                  (GTM_INOUTSEL_T_OUTSEL11)

/** Alias (User Manual Name) for GTM_INOUTSEL_T_OUTSEL11.
 * To use register names with standard convension, please use GTM_INOUTSEL_T_OUTSEL11.
 */
#define GTM_TOUTSEL11                  (GTM_INOUTSEL_T_OUTSEL11)

/** \\brief  9FD60, Timer Output Select Register */
#define GTM_INOUTSEL_T_OUTSEL12        /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_T_OUTSEL *)0xF019FD60u)

