Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** Alias (User Manual Name) for GTM_INOUTSEL_T_OUTSEL12.
 * To use register names with standard convension, please use GTM_INOUTSEL_T_OUTSEL12.
 */
#define GTM_TOUTSEL12                  (GTM_INOUTSEL_T_OUTSEL12)

/** Alias (User Manual Name) for GTM_INOUTSEL_T_OUTSEL12.
 * To use register names with standard convension, please use GTM_INOUTSEL_T_OUTSEL12.
 */
#define GTM_TOUTSEL12                  (GTM_INOUTSEL_T_OUTSEL12)

/** \\brief  9FD64, Timer Output Select Register */
#define GTM_INOUTSEL_T_OUTSEL13        /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_T_OUTSEL *)0xF019FD64u)

/** Alias (User Manual Name) for GTM_INOUTSEL_T_OUTSEL13.
 * To use register names with standard convension, please use GTM_INOUTSEL_T_OUTSEL13.
 */
#define GTM_TOUTSEL13                  (GTM_INOUTSEL_T_OUTSEL13)

/** Alias (User Manual Name) for GTM_INOUTSEL_T_OUTSEL13.
 * To use register names with standard convension, please use GTM_INOUTSEL_T_OUTSEL13.
 */
#define GTM_TOUTSEL13                  (GTM_INOUTSEL_T_OUTSEL13)

/** \\brief  9FD68, Timer Output Select Register */
#define GTM_INOUTSEL_T_OUTSEL14        /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_T_OUTSEL *)0xF019FD68u)

/** Alias (User Manual Name) for GTM_INOUTSEL_T_OUTSEL14.
 * To use register names with standard convension, please use GTM_INOUTSEL_T_OUTSEL14.
 */
#define GTM_TOUTSEL14                  (GTM_INOUTSEL_T_OUTSEL14)

/** Alias (User Manual Name) for GTM_INOUTSEL_T_OUTSEL14.
 * To use register names with standard convension, please use GTM_INOUTSEL_T_OUTSEL14.
 */
#define GTM_TOUTSEL14                  (GTM_INOUTSEL_T_OUTSEL14)

/** \\brief  9FD6C, Timer Output Select Register */
#define GTM_INOUTSEL_T_OUTSEL15        /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_T_OUTSEL *)0xF019FD6Cu)

/** Alias (User Manual Name) for GTM_INOUTSEL_T_OUTSEL15.
 * To use register names with standard convension, please use GTM_INOUTSEL_T_OUTSEL15.
 */
#define GTM_TOUTSEL15                  (GTM_INOUTSEL_T_OUTSEL15)

/** Alias (User Manual Name) for GTM_INOUTSEL_T_OUTSEL15.
 * To use register names with standard convension, please use GTM_INOUTSEL_T_OUTSEL15.
 */
#define GTM_TOUTSEL15                  (GTM_INOUTSEL_T_OUTSEL15)

/** \\brief  9FD70, Timer Output Select Register */
#define GTM_INOUTSEL_T_OUTSEL16        /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_T_OUTSEL *)0xF019FD70u)

/** Alias (User Manual Name) for GTM_INOUTSEL_T_OUTSEL16.
 * To use register names with standard convension, please use GTM_INOUTSEL_T_OUTSEL16.
 */
#define GTM_TOUTSEL16                  (GTM_INOUTSEL_T_OUTSEL16)

/** Alias (User Manual Name) for GTM_INOUTSEL_T_OUTSEL16.
 * To use register names with standard convension, please use GTM_INOUTSEL_T_OUTSEL16.
 */
#define GTM_TOUTSEL16                  (GTM_INOUTSEL_T_OUTSEL16)

/** \\brief  9FD74, Timer Output Select Register */
#define GTM_INOUTSEL_T_OUTSEL17        /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_T_OUTSEL *)0xF019FD74u)

/** Alias (User Manual Name) for GTM_INOUTSEL_T_OUTSEL17.
 * To use register names with standard convension, please use GTM_INOUTSEL_T_OUTSEL17.
 */
#define GTM_TOUTSEL17                  (GTM_INOUTSEL_T_OUTSEL17)

/** Alias (User Manual Name) for GTM_INOUTSEL_T_OUTSEL17.
 * To use register names with standard convension, please use GTM_INOUTSEL_T_OUTSEL17.
 */
#define GTM_TOUTSEL17                  (GTM_INOUTSEL_T_OUTSEL17)

/** \\brief  9FD78, Timer Output Select Register */
#define GTM_INOUTSEL_T_OUTSEL18        /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_T_OUTSEL *)0xF019FD78u)

/** Alias (User Manual Name) for GTM_INOUTSEL_T_OUTSEL18.
 * To use register names with standard convension, please use GTM_INOUTSEL_T_OUTSEL18.
 */
#define GTM_TOUTSEL18                  (GTM_INOUTSEL_T_OUTSEL18)

/** Alias (User Manual Name) for GTM_INOUTSEL_T_OUTSEL18.
 * To use register names with standard convension, please use GTM_INOUTSEL_T_OUTSEL18.
 */
#define GTM_TOUTSEL18                  (GTM_INOUTSEL_T_OUTSEL18)

/** \\brief  9FD7C, Timer Output Select Register */
#define GTM_INOUTSEL_T_OUTSEL19        /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_T_OUTSEL *)0xF019FD7Cu)

/** Alias (User Manual Name) for GTM_INOUTSEL_T_OUTSEL19.
 * To use register names with standard convension, please use GTM_INOUTSEL_T_OUTSEL19.
 */
#define GTM_TOUTSEL19                  (GTM_INOUTSEL_T_OUTSEL19)

/** Alias (User Manual Name) for GTM_INOUTSEL_T_OUTSEL19.
 * To use register names with standard convension, please use GTM_INOUTSEL_T_OUTSEL19.
 */
#define GTM_TOUTSEL19                  (GTM_INOUTSEL_T_OUTSEL19)

/** \\brief  9FD38, Timer Output Select Register */
#define GTM_INOUTSEL_T_OUTSEL2         /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_T_OUTSEL *)0xF019FD38u)

/** Alias (User Manual Name) for GTM_INOUTSEL_T_OUTSEL2.
 * To use register names with standard convension, please use GTM_INOUTSEL_T_OUTSEL2.
 */
#define GTM_TOUTSEL2                   (GTM_INOUTSEL_T_OUTSEL2)

/** Alias (User Manual Name) for GTM_INOUTSEL_T_OUTSEL2.
 * To use register names with standard convension, please use GTM_INOUTSEL_T_OUTSEL2.
 */
#define GTM_TOUTSEL2                   (GTM_INOUTSEL_T_OUTSEL2)

/** \\brief  9FD80, Timer Output Select Register */
#define GTM_INOUTSEL_T_OUTSEL20        /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_T_OUTSEL *)0xF019FD80u)

/** Alias (User Manual Name) for GTM_INOUTSEL_T_OUTSEL20.
 * To use register names with standard convension, please use GTM_INOUTSEL_T_OUTSEL20.
 */
#define GTM_TOUTSEL20                  (GTM_INOUTSEL_T_OUTSEL20)

/** Alias (User Manual Name) for GTM_INOUTSEL_T_OUTSEL20.
 * To use register names with standard convension, please use GTM_INOUTSEL_T_OUTSEL20.
 */
#define GTM_TOUTSEL20                  (GTM_INOUTSEL_T_OUTSEL20)

/** \\brief  9FD84, Timer Output Select Register */
#define GTM_INOUTSEL_T_OUTSEL21        /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_T_OUTSEL *)0xF019FD84u)

/** Alias (User Manual Name) for GTM_INOUTSEL_T_OUTSEL21.
 * To use register names with standard convension, please use GTM_INOUTSEL_T_OUTSEL21.
 */
#define GTM_TOUTSEL21                  (GTM_INOUTSEL_T_OUTSEL21)

/** Alias (User Manual Name) for GTM_INOUTSEL_T_OUTSEL21.
 * To use register names with standard convension, please use GTM_INOUTSEL_T_OUTSEL21.
 */
#define GTM_TOUTSEL21                  (GTM_INOUTSEL_T_OUTSEL21)

/** \\brief  9FD88, Timer Output Select Register */
#define GTM_INOUTSEL_T_OUTSEL22        /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_T_OUTSEL *)0xF019FD88u)

/** Alias (User Manual Name) for GTM_INOUTSEL_T_OUTSEL22.
 * To use register names with standard convension, please use GTM_INOUTSEL_T_OUTSEL22.
 */
#define GTM_TOUTSEL22                  (GTM_INOUTSEL_T_OUTSEL22)

/** Alias (User Manual Name) for GTM_INOUTSEL_T_OUTSEL22.
 * To use register names with standard convension, please use GTM_INOUTSEL_T_OUTSEL22.
 */
#define GTM_TOUTSEL22                  (GTM_INOUTSEL_T_OUTSEL22)

