Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  9FD8C, Timer Output Select Register */
#define GTM_INOUTSEL_T_OUTSEL23        /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_T_OUTSEL *)0xF019FD8Cu)

/** Alias (User Manual Name) for GTM_INOUTSEL_T_OUTSEL23.
 * To use register names with standard convension, please use GTM_INOUTSEL_T_OUTSEL23.
 */
#define GTM_TOUTSEL23                  (GTM_INOUTSEL_T_OUTSEL23)

/** Alias (User Manual Name) for GTM_INOUTSEL_T_OUTSEL23.
 * To use register names with standard convension, please use GTM_INOUTSEL_T_OUTSEL23.
 */
#define GTM_TOUTSEL23                  (GTM_INOUTSEL_T_OUTSEL23)

/** \\brief  9FD90, Timer Output Select Register */
#define GTM_INOUTSEL_T_OUTSEL24        /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_T_OUTSEL *)0xF019FD90u)

/** Alias (User Manual Name) for GTM_INOUTSEL_T_OUTSEL24.
 * To use register names with standard convension, please use GTM_INOUTSEL_T_OUTSEL24.
 */
#define GTM_TOUTSEL24                  (GTM_INOUTSEL_T_OUTSEL24)

/** Alias (User Manual Name) for GTM_INOUTSEL_T_OUTSEL24.
 * To use register names with standard convension, please use GTM_INOUTSEL_T_OUTSEL24.
 */
#define GTM_TOUTSEL24                  (GTM_INOUTSEL_T_OUTSEL24)

/** \\brief  9FD94, Timer Output Select Register */
#define GTM_INOUTSEL_T_OUTSEL25        /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_T_OUTSEL *)0xF019FD94u)

/** Alias (User Manual Name) for GTM_INOUTSEL_T_OUTSEL25.
 * To use register names with standard convension, please use GTM_INOUTSEL_T_OUTSEL25.
 */
#define GTM_TOUTSEL25                  (GTM_INOUTSEL_T_OUTSEL25)

/** Alias (User Manual Name) for GTM_INOUTSEL_T_OUTSEL25.
 * To use register names with standard convension, please use GTM_INOUTSEL_T_OUTSEL25.
 */
#define GTM_TOUTSEL25                  (GTM_INOUTSEL_T_OUTSEL25)

/** \\brief  9FD98, Timer Output Select Register */
#define GTM_INOUTSEL_T_OUTSEL26        /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_T_OUTSEL *)0xF019FD98u)

/** Alias (User Manual Name) for GTM_INOUTSEL_T_OUTSEL26.
 * To use register names with standard convension, please use GTM_INOUTSEL_T_OUTSEL26.
 */
#define GTM_TOUTSEL26                  (GTM_INOUTSEL_T_OUTSEL26)

/** Alias (User Manual Name) for GTM_INOUTSEL_T_OUTSEL26.
 * To use register names with standard convension, please use GTM_INOUTSEL_T_OUTSEL26.
 */
#define GTM_TOUTSEL26                  (GTM_INOUTSEL_T_OUTSEL26)

/** \\brief  9FD9C, Timer Output Select Register */
#define GTM_INOUTSEL_T_OUTSEL27        /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_T_OUTSEL *)0xF019FD9Cu)

/** Alias (User Manual Name) for GTM_INOUTSEL_T_OUTSEL27.
 * To use register names with standard convension, please use GTM_INOUTSEL_T_OUTSEL27.
 */
#define GTM_TOUTSEL27                  (GTM_INOUTSEL_T_OUTSEL27)

/** Alias (User Manual Name) for GTM_INOUTSEL_T_OUTSEL27.
 * To use register names with standard convension, please use GTM_INOUTSEL_T_OUTSEL27.
 */
#define GTM_TOUTSEL27                  (GTM_INOUTSEL_T_OUTSEL27)

/** \\brief  9FDA0, Timer Output Select Register */
#define GTM_INOUTSEL_T_OUTSEL28        /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_T_OUTSEL *)0xF019FDA0u)

/** Alias (User Manual Name) for GTM_INOUTSEL_T_OUTSEL28.
 * To use register names with standard convension, please use GTM_INOUTSEL_T_OUTSEL28.
 */
#define GTM_TOUTSEL28                  (GTM_INOUTSEL_T_OUTSEL28)

/** Alias (User Manual Name) for GTM_INOUTSEL_T_OUTSEL28.
 * To use register names with standard convension, please use GTM_INOUTSEL_T_OUTSEL28.
 */
#define GTM_TOUTSEL28                  (GTM_INOUTSEL_T_OUTSEL28)

/** \\brief  9FDA4, Timer Output Select Register */
#define GTM_INOUTSEL_T_OUTSEL29        /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_T_OUTSEL *)0xF019FDA4u)

/** Alias (User Manual Name) for GTM_INOUTSEL_T_OUTSEL29.
 * To use register names with standard convension, please use GTM_INOUTSEL_T_OUTSEL29.
 */
#define GTM_TOUTSEL29                  (GTM_INOUTSEL_T_OUTSEL29)

/** Alias (User Manual Name) for GTM_INOUTSEL_T_OUTSEL29.
 * To use register names with standard convension, please use GTM_INOUTSEL_T_OUTSEL29.
 */
#define GTM_TOUTSEL29                  (GTM_INOUTSEL_T_OUTSEL29)

/** \\brief  9FD3C, Timer Output Select Register */
#define GTM_INOUTSEL_T_OUTSEL3         /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_T_OUTSEL *)0xF019FD3Cu)

/** Alias (User Manual Name) for GTM_INOUTSEL_T_OUTSEL3.
 * To use register names with standard convension, please use GTM_INOUTSEL_T_OUTSEL3.
 */
#define GTM_TOUTSEL3                   (GTM_INOUTSEL_T_OUTSEL3)

/** Alias (User Manual Name) for GTM_INOUTSEL_T_OUTSEL3.
 * To use register names with standard convension, please use GTM_INOUTSEL_T_OUTSEL3.
 */
#define GTM_TOUTSEL3                   (GTM_INOUTSEL_T_OUTSEL3)

/** \\brief  9FDA8, Timer Output Select Register */
#define GTM_INOUTSEL_T_OUTSEL30        /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_T_OUTSEL *)0xF019FDA8u)

/** Alias (User Manual Name) for GTM_INOUTSEL_T_OUTSEL30.
 * To use register names with standard convension, please use GTM_INOUTSEL_T_OUTSEL30.
 */
#define GTM_TOUTSEL30                  (GTM_INOUTSEL_T_OUTSEL30)

/** Alias (User Manual Name) for GTM_INOUTSEL_T_OUTSEL30.
 * To use register names with standard convension, please use GTM_INOUTSEL_T_OUTSEL30.
 */
#define GTM_TOUTSEL30                  (GTM_INOUTSEL_T_OUTSEL30)

/** \\brief  9FDAC, Timer Output Select Register */
#define GTM_INOUTSEL_T_OUTSEL31        /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_T_OUTSEL *)0xF019FDACu)

/** Alias (User Manual Name) for GTM_INOUTSEL_T_OUTSEL31.
 * To use register names with standard convension, please use GTM_INOUTSEL_T_OUTSEL31.
 */
#define GTM_TOUTSEL31                  (GTM_INOUTSEL_T_OUTSEL31)

/** Alias (User Manual Name) for GTM_INOUTSEL_T_OUTSEL31.
 * To use register names with standard convension, please use GTM_INOUTSEL_T_OUTSEL31.
 */
#define GTM_TOUTSEL31                  (GTM_INOUTSEL_T_OUTSEL31)

/** \\brief  9FDB0, Timer Output Select Register */
#define GTM_INOUTSEL_T_OUTSEL32        /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_T_OUTSEL *)0xF019FDB0u)

/** Alias (User Manual Name) for GTM_INOUTSEL_T_OUTSEL32.
 * To use register names with standard convension, please use GTM_INOUTSEL_T_OUTSEL32.
 */
#define GTM_TOUTSEL32                  (GTM_INOUTSEL_T_OUTSEL32)

/** Alias (User Manual Name) for GTM_INOUTSEL_T_OUTSEL32.
 * To use register names with standard convension, please use GTM_INOUTSEL_T_OUTSEL32.
 */
#define GTM_TOUTSEL32                  (GTM_INOUTSEL_T_OUTSEL32)

/** \\brief  9FDB4, Timer Output Select Register */
#define GTM_INOUTSEL_T_OUTSEL33        /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_T_OUTSEL *)0xF019FDB4u)

/** Alias (User Manual Name) for GTM_INOUTSEL_T_OUTSEL33.
 * To use register names with standard convension, please use GTM_INOUTSEL_T_OUTSEL33.
 */
#define GTM_TOUTSEL33                  (GTM_INOUTSEL_T_OUTSEL33)

/** Alias (User Manual Name) for GTM_INOUTSEL_T_OUTSEL33.
 * To use register names with standard convension, please use GTM_INOUTSEL_T_OUTSEL33.
 */
#define GTM_TOUTSEL33                  (GTM_INOUTSEL_T_OUTSEL33)

