Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  9FD40, Timer Output Select Register */
#define GTM_INOUTSEL_T_OUTSEL4         /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_T_OUTSEL *)0xF019FD40u)

/** Alias (User Manual Name) for GTM_INOUTSEL_T_OUTSEL4.
 * To use register names with standard convension, please use GTM_INOUTSEL_T_OUTSEL4.
 */
#define GTM_TOUTSEL4                   (GTM_INOUTSEL_T_OUTSEL4)

/** Alias (User Manual Name) for GTM_INOUTSEL_T_OUTSEL4.
 * To use register names with standard convension, please use GTM_INOUTSEL_T_OUTSEL4.
 */
#define GTM_TOUTSEL4                   (GTM_INOUTSEL_T_OUTSEL4)

/** \\brief  9FD44, Timer Output Select Register */
#define GTM_INOUTSEL_T_OUTSEL5         /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_T_OUTSEL *)0xF019FD44u)

/** Alias (User Manual Name) for GTM_INOUTSEL_T_OUTSEL5.
 * To use register names with standard convension, please use GTM_INOUTSEL_T_OUTSEL5.
 */
#define GTM_TOUTSEL5                   (GTM_INOUTSEL_T_OUTSEL5)

/** Alias (User Manual Name) for GTM_INOUTSEL_T_OUTSEL5.
 * To use register names with standard convension, please use GTM_INOUTSEL_T_OUTSEL5.
 */
#define GTM_TOUTSEL5                   (GTM_INOUTSEL_T_OUTSEL5)

/** \\brief  9FD48, Timer Output Select Register */
#define GTM_INOUTSEL_T_OUTSEL6         /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_T_OUTSEL *)0xF019FD48u)

/** Alias (User Manual Name) for GTM_INOUTSEL_T_OUTSEL6.
 * To use register names with standard convension, please use GTM_INOUTSEL_T_OUTSEL6.
 */
#define GTM_TOUTSEL6                   (GTM_INOUTSEL_T_OUTSEL6)

/** Alias (User Manual Name) for GTM_INOUTSEL_T_OUTSEL6.
 * To use register names with standard convension, please use GTM_INOUTSEL_T_OUTSEL6.
 */
#define GTM_TOUTSEL6                   (GTM_INOUTSEL_T_OUTSEL6)

/** \\brief  9FD4C, Timer Output Select Register */
#define GTM_INOUTSEL_T_OUTSEL7         /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_T_OUTSEL *)0xF019FD4Cu)

/** Alias (User Manual Name) for GTM_INOUTSEL_T_OUTSEL7.
 * To use register names with standard convension, please use GTM_INOUTSEL_T_OUTSEL7.
 */
#define GTM_TOUTSEL7                   (GTM_INOUTSEL_T_OUTSEL7)

/** Alias (User Manual Name) for GTM_INOUTSEL_T_OUTSEL7.
 * To use register names with standard convension, please use GTM_INOUTSEL_T_OUTSEL7.
 */
#define GTM_TOUTSEL7                   (GTM_INOUTSEL_T_OUTSEL7)

/** \\brief  9FD50, Timer Output Select Register */
#define GTM_INOUTSEL_T_OUTSEL8         /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_T_OUTSEL *)0xF019FD50u)

/** Alias (User Manual Name) for GTM_INOUTSEL_T_OUTSEL8.
 * To use register names with standard convension, please use GTM_INOUTSEL_T_OUTSEL8.
 */
#define GTM_TOUTSEL8                   (GTM_INOUTSEL_T_OUTSEL8)

/** Alias (User Manual Name) for GTM_INOUTSEL_T_OUTSEL8.
 * To use register names with standard convension, please use GTM_INOUTSEL_T_OUTSEL8.
 */
#define GTM_TOUTSEL8                   (GTM_INOUTSEL_T_OUTSEL8)

/** \\brief  9FD54, Timer Output Select Register */
#define GTM_INOUTSEL_T_OUTSEL9         /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_T_OUTSEL *)0xF019FD54u)

/** Alias (User Manual Name) for GTM_INOUTSEL_T_OUTSEL9.
 * To use register names with standard convension, please use GTM_INOUTSEL_T_OUTSEL9.
 */
#define GTM_TOUTSEL9                   (GTM_INOUTSEL_T_OUTSEL9)

/** Alias (User Manual Name) for GTM_INOUTSEL_T_OUTSEL9.
 * To use register names with standard convension, please use GTM_INOUTSEL_T_OUTSEL9.
 */
#define GTM_TOUTSEL9                   (GTM_INOUTSEL_T_OUTSEL9)

/** \\brief  9FD10, TIM Input Select Register */
#define GTM_INOUTSEL_TIM0_INSEL        /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_TIM_INSEL *)0xF019FD10u)

/** Alias (User Manual Name) for GTM_INOUTSEL_TIM0_INSEL.
 * To use register names with standard convension, please use GTM_INOUTSEL_TIM0_INSEL.
 */
#define GTM_TIM0INSEL                  (GTM_INOUTSEL_TIM0_INSEL)

/** Alias (User Manual Name) for GTM_INOUTSEL_TIM0_INSEL.
 * To use register names with standard convension, please use GTM_INOUTSEL_TIM0_INSEL.
 */
#define GTM_TIM0INSEL                  (GTM_INOUTSEL_TIM0_INSEL)

/** \\brief  9FD14, TIM Input Select Register */
#define GTM_INOUTSEL_TIM1_INSEL        /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_TIM_INSEL *)0xF019FD14u)

/** Alias (User Manual Name) for GTM_INOUTSEL_TIM1_INSEL.
 * To use register names with standard convension, please use GTM_INOUTSEL_TIM1_INSEL.
 */
#define GTM_TIM1INSEL                  (GTM_INOUTSEL_TIM1_INSEL)

/** Alias (User Manual Name) for GTM_INOUTSEL_TIM1_INSEL.
 * To use register names with standard convension, please use GTM_INOUTSEL_TIM1_INSEL.
 */
#define GTM_TIM1INSEL                  (GTM_INOUTSEL_TIM1_INSEL)

/** \\brief  9FD18, TIM Input Select Register */
#define GTM_INOUTSEL_TIM2_INSEL        /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_TIM_INSEL *)0xF019FD18u)

/** Alias (User Manual Name) for GTM_INOUTSEL_TIM2_INSEL.
 * To use register names with standard convension, please use GTM_INOUTSEL_TIM2_INSEL.
 */
#define GTM_TIM2INSEL                  (GTM_INOUTSEL_TIM2_INSEL)

/** Alias (User Manual Name) for GTM_INOUTSEL_TIM2_INSEL.
 * To use register names with standard convension, please use GTM_INOUTSEL_TIM2_INSEL.
 */
#define GTM_TIM2INSEL                  (GTM_INOUTSEL_TIM2_INSEL)

/** \\brief  9FD1C, TIM Input Select Register */
#define GTM_INOUTSEL_TIM3_INSEL        /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_TIM_INSEL *)0xF019FD1Cu)

/** Alias (User Manual Name) for GTM_INOUTSEL_TIM3_INSEL.
 * To use register names with standard convension, please use GTM_INOUTSEL_TIM3_INSEL.
 */
#define GTM_TIM3INSEL                  (GTM_INOUTSEL_TIM3_INSEL)

/** Alias (User Manual Name) for GTM_INOUTSEL_TIM3_INSEL.
 * To use register names with standard convension, please use GTM_INOUTSEL_TIM3_INSEL.
 */
#define GTM_TIM3INSEL                  (GTM_INOUTSEL_TIM3_INSEL)

/** \\brief  9FD20, TIM Input Select Register */
#define GTM_INOUTSEL_TIM4_INSEL        /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_TIM_INSEL *)0xF019FD20u)

/** Alias (User Manual Name) for GTM_INOUTSEL_TIM4_INSEL.
 * To use register names with standard convension, please use GTM_INOUTSEL_TIM4_INSEL.
 */
#define GTM_TIM4INSEL                  (GTM_INOUTSEL_TIM4_INSEL)

/** Alias (User Manual Name) for GTM_INOUTSEL_TIM4_INSEL.
 * To use register names with standard convension, please use GTM_INOUTSEL_TIM4_INSEL.
 */
#define GTM_TIM4INSEL                  (GTM_INOUTSEL_TIM4_INSEL)

/** \\brief  9FD24, TIM Input Select Register */
#define GTM_INOUTSEL_TIM5_INSEL        /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_TIM_INSEL *)0xF019FD24u)

/** Alias (User Manual Name) for GTM_INOUTSEL_TIM5_INSEL.
 * To use register names with standard convension, please use GTM_INOUTSEL_TIM5_INSEL.
 */
#define GTM_TIM5INSEL                  (GTM_INOUTSEL_TIM5_INSEL)

/** Alias (User Manual Name) for GTM_INOUTSEL_TIM5_INSEL.
 * To use register names with standard convension, please use GTM_INOUTSEL_TIM5_INSEL.
 */
#define GTM_TIM5INSEL                  (GTM_INOUTSEL_TIM5_INSEL)

/** \\brief  9FD28, TIM Input Select Register */
#define GTM_INOUTSEL_TIM6_INSEL        /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_TIM_INSEL *)0xF019FD28u)

/** Alias (User Manual Name) for GTM_INOUTSEL_TIM6_INSEL.
 * To use register names with standard convension, please use GTM_INOUTSEL_TIM6_INSEL.
 */
#define GTM_TIM6INSEL                  (GTM_INOUTSEL_TIM6_INSEL)

/** Alias (User Manual Name) for GTM_INOUTSEL_TIM6_INSEL.
 * To use register names with standard convension, please use GTM_INOUTSEL_TIM6_INSEL.
 */
#define GTM_TIM6INSEL                  (GTM_INOUTSEL_TIM6_INSEL)

/** \\brief  9FD2C, TIM Input Select Register */
#define GTM_INOUTSEL_TIM7_INSEL        /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_TIM_INSEL *)0xF019FD2Cu)

