Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** Alias (User Manual Name) for GTM_INOUTSEL_TIM7_INSEL.
 * To use register names with standard convension, please use GTM_INOUTSEL_TIM7_INSEL.
 */
#define GTM_TIM7INSEL                  (GTM_INOUTSEL_TIM7_INSEL)

/** Alias (User Manual Name) for GTM_INOUTSEL_TIM7_INSEL.
 * To use register names with standard convension, please use GTM_INOUTSEL_TIM7_INSEL.
 */
#define GTM_TIM7INSEL                  (GTM_INOUTSEL_TIM7_INSEL)

/** \\brief  9FE4C, Trigger Output Register 0 */
#define GTM_INOUTSEL_TRIG_OUT0         /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_TRIG_OUT0 *)0xF019FE4Cu)

/** Alias (User Manual Name) for GTM_INOUTSEL_TRIG_OUT0.
 * To use register names with standard convension, please use GTM_INOUTSEL_TRIG_OUT0.
 */
#define GTM_TRIGOUT0                   (GTM_INOUTSEL_TRIG_OUT0)

/** Alias (User Manual Name) for GTM_INOUTSEL_TRIG_OUT0.
 * To use register names with standard convension, please use GTM_INOUTSEL_TRIG_OUT0.
 */
#define GTM_TRIGOUT0                   (GTM_INOUTSEL_TRIG_OUT0)

/** \\brief  9FE50, Trigger Output Register 1 */
#define GTM_INOUTSEL_TRIG_OUT1         /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_TRIG_OUT1 *)0xF019FE50u)

/** Alias (User Manual Name) for GTM_INOUTSEL_TRIG_OUT1.
 * To use register names with standard convension, please use GTM_INOUTSEL_TRIG_OUT1.
 */
#define GTM_TRIGOUT1                   (GTM_INOUTSEL_TRIG_OUT1)

/** Alias (User Manual Name) for GTM_INOUTSEL_TRIG_OUT1.
 * To use register names with standard convension, please use GTM_INOUTSEL_TRIG_OUT1.
 */
#define GTM_TRIGOUT1                   (GTM_INOUTSEL_TRIG_OUT1)

/** \\brief  9FE54, Trigger Output Register 2 */
#define GTM_INOUTSEL_TRIG_OUT2         /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_TRIG_OUT2 *)0xF019FE54u)

/** Alias (User Manual Name) for GTM_INOUTSEL_TRIG_OUT2.
 * To use register names with standard convension, please use GTM_INOUTSEL_TRIG_OUT2.
 */
#define GTM_TRIGOUT2                   (GTM_INOUTSEL_TRIG_OUT2)

/** Alias (User Manual Name) for GTM_INOUTSEL_TRIG_OUT2.
 * To use register names with standard convension, please use GTM_INOUTSEL_TRIG_OUT2.
 */
#define GTM_TRIGOUT2                   (GTM_INOUTSEL_TRIG_OUT2)

/** \\brief  9FE58, Trigger Output Register 3 */
#define GTM_INOUTSEL_TRIG_OUT3         /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_TRIG_OUT3 *)0xF019FE58u)

/** Alias (User Manual Name) for GTM_INOUTSEL_TRIG_OUT3.
 * To use register names with standard convension, please use GTM_INOUTSEL_TRIG_OUT3.
 */
#define GTM_TRIGOUT3                   (GTM_INOUTSEL_TRIG_OUT3)

/** Alias (User Manual Name) for GTM_INOUTSEL_TRIG_OUT3.
 * To use register names with standard convension, please use GTM_INOUTSEL_TRIG_OUT3.
 */
#define GTM_TRIGOUT3                   (GTM_INOUTSEL_TRIG_OUT3)

/** \\brief  9FE5C, Trigger Output Register 4 */
#define GTM_INOUTSEL_TRIG_OUT4         /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_TRIG_OUT4 *)0xF019FE5Cu)

/** Alias (User Manual Name) for GTM_INOUTSEL_TRIG_OUT4.
 * To use register names with standard convension, please use GTM_INOUTSEL_TRIG_OUT4.
 */
#define GTM_TRIGOUT4                   (GTM_INOUTSEL_TRIG_OUT4)

/** Alias (User Manual Name) for GTM_INOUTSEL_TRIG_OUT4.
 * To use register names with standard convension, please use GTM_INOUTSEL_TRIG_OUT4.
 */
#define GTM_TRIGOUT4                   (GTM_INOUTSEL_TRIG_OUT4)

/** \\brief  9FE60, Trigger Output Register 5 */
#define GTM_INOUTSEL_TRIG_OUT5         /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_TRIG_OUT5 *)0xF019FE60u)

/** Alias (User Manual Name) for GTM_INOUTSEL_TRIG_OUT5.
 * To use register names with standard convension, please use GTM_INOUTSEL_TRIG_OUT5.
 */
#define GTM_TRIGOUT5                   (GTM_INOUTSEL_TRIG_OUT5)

/** Alias (User Manual Name) for GTM_INOUTSEL_TRIG_OUT5.
 * To use register names with standard convension, please use GTM_INOUTSEL_TRIG_OUT5.
 */
#define GTM_TRIGOUT5                   (GTM_INOUTSEL_TRIG_OUT5)

/** \\brief  9FE64, Trigger Output Register 6 */
#define GTM_INOUTSEL_TRIG_OUT6         /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_TRIG_OUT6 *)0xF019FE64u)

/** Alias (User Manual Name) for GTM_INOUTSEL_TRIG_OUT6.
 * To use register names with standard convension, please use GTM_INOUTSEL_TRIG_OUT6.
 */
#define GTM_TRIGOUT6                   (GTM_INOUTSEL_TRIG_OUT6)

/** Alias (User Manual Name) for GTM_INOUTSEL_TRIG_OUT6.
 * To use register names with standard convension, please use GTM_INOUTSEL_TRIG_OUT6.
 */
#define GTM_TRIGOUT6                   (GTM_INOUTSEL_TRIG_OUT6)

/** \\brief  9FE68, Trigger Output Register 7 */
#define GTM_INOUTSEL_TRIG_OUT7         /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_TRIG_OUT7 *)0xF019FE68u)

/** Alias (User Manual Name) for GTM_INOUTSEL_TRIG_OUT7.
 * To use register names with standard convension, please use GTM_INOUTSEL_TRIG_OUT7.
 */
#define GTM_TRIGOUT7                   (GTM_INOUTSEL_TRIG_OUT7)

/** Alias (User Manual Name) for GTM_INOUTSEL_TRIG_OUT7.
 * To use register names with standard convension, please use GTM_INOUTSEL_TRIG_OUT7.
 */
#define GTM_TRIGOUT7                   (GTM_INOUTSEL_TRIG_OUT7)

/** \\brief  9FE6C, Trigger Output Register 8 */
#define GTM_INOUTSEL_TRIG_OUT8         /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_TRIG_OUT8 *)0xF019FE6Cu)

/** Alias (User Manual Name) for GTM_INOUTSEL_TRIG_OUT8.
 * To use register names with standard convension, please use GTM_INOUTSEL_TRIG_OUT8.
 */
#define GTM_TRIGOUT8                   (GTM_INOUTSEL_TRIG_OUT8)

/** Alias (User Manual Name) for GTM_INOUTSEL_TRIG_OUT8.
 * To use register names with standard convension, please use GTM_INOUTSEL_TRIG_OUT8.
 */
#define GTM_TRIGOUT8                   (GTM_INOUTSEL_TRIG_OUT8)

/** \\brief  9FE70, Trigger Output Register 9 */
#define GTM_INOUTSEL_TRIG_OUT9         /*lint --e(923)*/ (*(volatile Ifx_GTM_INOUTSEL_TRIG_OUT9 *)0xF019FE70u)

/** Alias (User Manual Name) for GTM_INOUTSEL_TRIG_OUT9.
 * To use register names with standard convension, please use GTM_INOUTSEL_TRIG_OUT9.
 */
#define GTM_TRIGOUT9                   (GTM_INOUTSEL_TRIG_OUT9)

