Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** Alias (User Manual Name) for GTM_INOUTSEL_TRIG_OUT9.
 * To use register names with standard convension, please use GTM_INOUTSEL_TRIG_OUT9.
 */
#define GTM_TRIGOUT9                   (GTM_INOUTSEL_TRIG_OUT9)

/** \\brief  14, GTM Interrupt enable register */
#define GTM_IRQ_EN                     /*lint --e(923)*/ (*(volatile Ifx_GTM_IRQ_EN *)0xF0100014u)

/** \\brief  18, GTM Software interrupt generation register */
#define GTM_IRQ_FORCINT                /*lint --e(923)*/ (*(volatile Ifx_GTM_IRQ_FORCINT *)0xF0100018u)

/** \\brief  1C, GTM top level interrupts mode selection */
#define GTM_IRQ_MODE                   /*lint --e(923)*/ (*(volatile Ifx_GTM_IRQ_MODE *)0xF010001Cu)

/** \\brief  10, GTM Interrupt notification register */
#define GTM_IRQ_NOTIFY                 /*lint --e(923)*/ (*(volatile Ifx_GTM_IRQ_NOTIFY *)0xF0100010u)

/** \\brief  9FF9C, LCDCDC Output Select Register */
#define GTM_LCDCDCOUTSEL               /*lint --e(923)*/ (*(volatile Ifx_GTM_LCDCDCOUTSEL *)0xF019FF9Cu)

/** \\brief  F00, MAP Control register */
#define GTM_MAP_CTRL                   /*lint --e(923)*/ (*(volatile Ifx_GTM_MAP_CTRL *)0xF0100F00u)

/** \\brief  F40, MCFG Memory layout configuration. */
#define GTM_MCFG_CTRL                  /*lint --e(923)*/ (*(volatile Ifx_GTM_MCFG_CTRL *)0xF0100F40u)

/** \\brief  F006C, MCS cancel ARU transfer instruction */
#define GTM_MCS0_CAT                   /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CAT *)0xF01F006Cu)

/** \\brief  F0024, MCS channel 0 ARU control Bit register */
#define GTM_MCS0_CH0_ACB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_ACB *)0xF01F0024u)

/** \\brief  F0028, MCS clear trigger control register */
#define GTM_MCS0_CH0_CTRG              /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH0_CTRG *)0xF01F0028u)

/** Alias (User Manual Name) for GTM_MCS0_CH0_CTRG.
 * To use register names with standard convension, please use GTM_MCS0_CH0_CTRG.
 */
#define GTM_MCS0_CTRG                  (GTM_MCS0_CH0_CTRG)

/** Alias (User Manual Name) for GTM_MCS0_CH0_CTRG.
 * To use register names with standard convension, please use GTM_MCS0_CH0_CTRG.
 */
#define GTM_MCS0_CTRG                  (GTM_MCS0_CH0_CTRG)

/** \\brief  F0020, MCS channel 0 control register */
#define GTM_MCS0_CH0_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL *)0xF01F0020u)

/** \\brief  F0054, MCS channel 0 error interrupt enable register */
#define GTM_MCS0_CH0_EIRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN *)0xF01F0054u)

/** \\brief  F0048, MCS channel 0 interrupt enable register */
#define GTM_MCS0_CH0_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN *)0xF01F0048u)

/** \\brief  F004C, MCS channel 0 force interrupt register */
#define GTM_MCS0_CH0_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT *)0xF01F004Cu)

/** \\brief  F0050, MCS channel 0 IRQ mode configuration register */
#define GTM_MCS0_CH0_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE *)0xF01F0050u)

/** \\brief  F0044, MCS channel 0 interrupt notification register */
#define GTM_MCS0_CH0_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY *)0xF01F0044u)

/** \\brief  F003C, MCS channel 0 memory high byte register */
#define GTM_MCS0_CH0_MHB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_MHB *)0xF01F003Cu)

/** \\brief  F0040, MCS channel 0 program counter register */
#define GTM_MCS0_CH0_PC                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_PC *)0xF01F0040u)

/** \\brief  F0000, MCS channel 0 general purpose register 0 */
#define GTM_MCS0_CH0_R0                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R0 *)0xF01F0000u)

/** \\brief  F0004, MCS channel 0 general purpose register 1 */
#define GTM_MCS0_CH0_R1                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R1 *)0xF01F0004u)

/** \\brief  F0008, MCS channel 0 general purpose register 2 */
#define GTM_MCS0_CH0_R2                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R2 *)0xF01F0008u)

/** \\brief  F000C, MCS channel 0 general purpose register 3 */
#define GTM_MCS0_CH0_R3                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R3 *)0xF01F000Cu)

/** \\brief  F0010, MCS channel 0 general purpose register 4 */
#define GTM_MCS0_CH0_R4                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R4 *)0xF01F0010u)

/** \\brief  F0014, MCS channel 0 general purpose register 5 */
#define GTM_MCS0_CH0_R5                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R5 *)0xF01F0014u)

/** \\brief  F0018, MCS channel 0 general purpose register 6 */
#define GTM_MCS0_CH0_R6                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R6 *)0xF01F0018u)

/** \\brief  F001C, MCS channel 0 general purpose register 7 */
#define GTM_MCS0_CH0_R7                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R7 *)0xF01F001Cu)

/** \\brief  F002C, MCS set trigger control register */
#define GTM_MCS0_CH0_STRG              /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH0_STRG *)0xF01F002Cu)

/** Alias (User Manual Name) for GTM_MCS0_CH0_STRG.
 * To use register names with standard convension, please use GTM_MCS0_CH0_STRG.
 */
#define GTM_MCS0_STRG                  (GTM_MCS0_CH0_STRG)

/** Alias (User Manual Name) for GTM_MCS0_CH0_STRG.
 * To use register names with standard convension, please use GTM_MCS0_CH0_STRG.
 */
#define GTM_MCS0_STRG                  (GTM_MCS0_CH0_STRG)

/** \\brief  F00A4, MCS channel 1 ARU control Bit register */
#define GTM_MCS0_CH1_ACB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_ACB *)0xF01F00A4u)

/** \\brief  F00A0, MCS channel 1 control register */
#define GTM_MCS0_CH1_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL *)0xF01F00A0u)

/** \\brief  F00D4, MCS channel 1 error interrupt enable register */
#define GTM_MCS0_CH1_EIRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN *)0xF01F00D4u)

/** \\brief  F00C8, MCS channel 1 interrupt enable register */
#define GTM_MCS0_CH1_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN *)0xF01F00C8u)

