Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  F00CC, MCS channel 1 force interrupt register */
#define GTM_MCS0_CH1_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT *)0xF01F00CCu)

/** \\brief  F00D0, MCS channel 1 IRQ mode configuration register */
#define GTM_MCS0_CH1_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE *)0xF01F00D0u)

/** \\brief  F00C4, MCS channel 1 interrupt notification register */
#define GTM_MCS0_CH1_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY *)0xF01F00C4u)

/** \\brief  F00BC, MCS channel 1 memory high byte register */
#define GTM_MCS0_CH1_MHB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_MHB *)0xF01F00BCu)

/** \\brief  F00C0, MCS channel 1 program counter register */
#define GTM_MCS0_CH1_PC                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_PC *)0xF01F00C0u)

/** \\brief  F0080, MCS channel 1 general purpose register 0 */
#define GTM_MCS0_CH1_R0                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R0 *)0xF01F0080u)

/** \\brief  F0084, MCS channel 1 general purpose register 1 */
#define GTM_MCS0_CH1_R1                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R1 *)0xF01F0084u)

/** \\brief  F0088, MCS channel 1 general purpose register 2 */
#define GTM_MCS0_CH1_R2                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R2 *)0xF01F0088u)

/** \\brief  F008C, MCS channel 1 general purpose register 3 */
#define GTM_MCS0_CH1_R3                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R3 *)0xF01F008Cu)

/** \\brief  F0090, MCS channel 1 general purpose register 4 */
#define GTM_MCS0_CH1_R4                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R4 *)0xF01F0090u)

/** \\brief  F0094, MCS channel 1 general purpose register 5 */
#define GTM_MCS0_CH1_R5                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R5 *)0xF01F0094u)

/** \\brief  F0098, MCS channel 1 general purpose register 6 */
#define GTM_MCS0_CH1_R6                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R6 *)0xF01F0098u)

/** \\brief  F009C, MCS channel 1 general purpose register 7 */
#define GTM_MCS0_CH1_R7                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R7 *)0xF01F009Cu)

/** \\brief  F0124, MCS channel 1 ARU control Bit register */
#define GTM_MCS0_CH2_ACB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_ACB *)0xF01F0124u)

/** \\brief  F0120, MCS channel 1 control register */
#define GTM_MCS0_CH2_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL *)0xF01F0120u)

/** \\brief  F0154, MCS channel 1 error interrupt enable register */
#define GTM_MCS0_CH2_EIRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN *)0xF01F0154u)

/** \\brief  F0148, MCS channel 1 interrupt enable register */
#define GTM_MCS0_CH2_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN *)0xF01F0148u)

/** \\brief  F014C, MCS channel 1 force interrupt register */
#define GTM_MCS0_CH2_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT *)0xF01F014Cu)

/** \\brief  F0150, MCS channel 1 IRQ mode configuration register */
#define GTM_MCS0_CH2_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE *)0xF01F0150u)

/** \\brief  F0144, MCS channel 1 interrupt notification register */
#define GTM_MCS0_CH2_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY *)0xF01F0144u)

/** \\brief  F013C, MCS channel 1 memory high byte register */
#define GTM_MCS0_CH2_MHB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_MHB *)0xF01F013Cu)

/** \\brief  F0140, MCS channel 1 program counter register */
#define GTM_MCS0_CH2_PC                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_PC *)0xF01F0140u)

/** \\brief  F0100, MCS channel 1 general purpose register 0 */
#define GTM_MCS0_CH2_R0                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R0 *)0xF01F0100u)

/** \\brief  F0104, MCS channel 1 general purpose register 1 */
#define GTM_MCS0_CH2_R1                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R1 *)0xF01F0104u)

/** \\brief  F0108, MCS channel 1 general purpose register 2 */
#define GTM_MCS0_CH2_R2                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R2 *)0xF01F0108u)

/** \\brief  F010C, MCS channel 1 general purpose register 3 */
#define GTM_MCS0_CH2_R3                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R3 *)0xF01F010Cu)

/** \\brief  F0110, MCS channel 1 general purpose register 4 */
#define GTM_MCS0_CH2_R4                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R4 *)0xF01F0110u)

/** \\brief  F0114, MCS channel 1 general purpose register 5 */
#define GTM_MCS0_CH2_R5                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R5 *)0xF01F0114u)

/** \\brief  F0118, MCS channel 1 general purpose register 6 */
#define GTM_MCS0_CH2_R6                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R6 *)0xF01F0118u)

/** \\brief  F011C, MCS channel 1 general purpose register 7 */
#define GTM_MCS0_CH2_R7                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R7 *)0xF01F011Cu)

/** \\brief  F01A4, MCS channel 1 ARU control Bit register */
#define GTM_MCS0_CH3_ACB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_ACB *)0xF01F01A4u)

/** \\brief  F01A0, MCS channel 1 control register */
#define GTM_MCS0_CH3_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL *)0xF01F01A0u)

/** \\brief  F01D4, MCS channel 1 error interrupt enable register */
#define GTM_MCS0_CH3_EIRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN *)0xF01F01D4u)

/** \\brief  F01C8, MCS channel 1 interrupt enable register */
#define GTM_MCS0_CH3_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN *)0xF01F01C8u)

/** \\brief  F01CC, MCS channel 1 force interrupt register */
#define GTM_MCS0_CH3_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT *)0xF01F01CCu)

/** \\brief  F01D0, MCS channel 1 IRQ mode configuration register */
#define GTM_MCS0_CH3_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE *)0xF01F01D0u)

