Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  F01C4, MCS channel 1 interrupt notification register */
#define GTM_MCS0_CH3_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY *)0xF01F01C4u)

/** \\brief  F01BC, MCS channel 1 memory high byte register */
#define GTM_MCS0_CH3_MHB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_MHB *)0xF01F01BCu)

/** \\brief  F01C0, MCS channel 1 program counter register */
#define GTM_MCS0_CH3_PC                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_PC *)0xF01F01C0u)

/** \\brief  F0180, MCS channel 1 general purpose register 0 */
#define GTM_MCS0_CH3_R0                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R0 *)0xF01F0180u)

/** \\brief  F0184, MCS channel 1 general purpose register 1 */
#define GTM_MCS0_CH3_R1                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R1 *)0xF01F0184u)

/** \\brief  F0188, MCS channel 1 general purpose register 2 */
#define GTM_MCS0_CH3_R2                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R2 *)0xF01F0188u)

/** \\brief  F018C, MCS channel 1 general purpose register 3 */
#define GTM_MCS0_CH3_R3                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R3 *)0xF01F018Cu)

/** \\brief  F0190, MCS channel 1 general purpose register 4 */
#define GTM_MCS0_CH3_R4                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R4 *)0xF01F0190u)

/** \\brief  F0194, MCS channel 1 general purpose register 5 */
#define GTM_MCS0_CH3_R5                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R5 *)0xF01F0194u)

/** \\brief  F0198, MCS channel 1 general purpose register 6 */
#define GTM_MCS0_CH3_R6                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R6 *)0xF01F0198u)

/** \\brief  F019C, MCS channel 1 general purpose register 7 */
#define GTM_MCS0_CH3_R7                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R7 *)0xF01F019Cu)

/** \\brief  F0224, MCS channel 1 ARU control Bit register */
#define GTM_MCS0_CH4_ACB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_ACB *)0xF01F0224u)

/** \\brief  F0220, MCS channel 1 control register */
#define GTM_MCS0_CH4_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL *)0xF01F0220u)

/** \\brief  F0254, MCS channel 1 error interrupt enable register */
#define GTM_MCS0_CH4_EIRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN *)0xF01F0254u)

/** \\brief  F0248, MCS channel 1 interrupt enable register */
#define GTM_MCS0_CH4_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN *)0xF01F0248u)

/** \\brief  F024C, MCS channel 1 force interrupt register */
#define GTM_MCS0_CH4_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT *)0xF01F024Cu)

/** \\brief  F0250, MCS channel 1 IRQ mode configuration register */
#define GTM_MCS0_CH4_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE *)0xF01F0250u)

/** \\brief  F0244, MCS channel 1 interrupt notification register */
#define GTM_MCS0_CH4_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY *)0xF01F0244u)

/** \\brief  F023C, MCS channel 1 memory high byte register */
#define GTM_MCS0_CH4_MHB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_MHB *)0xF01F023Cu)

/** \\brief  F0240, MCS channel 1 program counter register */
#define GTM_MCS0_CH4_PC                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_PC *)0xF01F0240u)

/** \\brief  F0200, MCS channel 1 general purpose register 0 */
#define GTM_MCS0_CH4_R0                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R0 *)0xF01F0200u)

/** \\brief  F0204, MCS channel 1 general purpose register 1 */
#define GTM_MCS0_CH4_R1                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R1 *)0xF01F0204u)

/** \\brief  F0208, MCS channel 1 general purpose register 2 */
#define GTM_MCS0_CH4_R2                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R2 *)0xF01F0208u)

/** \\brief  F020C, MCS channel 1 general purpose register 3 */
#define GTM_MCS0_CH4_R3                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R3 *)0xF01F020Cu)

/** \\brief  F0210, MCS channel 1 general purpose register 4 */
#define GTM_MCS0_CH4_R4                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R4 *)0xF01F0210u)

/** \\brief  F0214, MCS channel 1 general purpose register 5 */
#define GTM_MCS0_CH4_R5                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R5 *)0xF01F0214u)

/** \\brief  F0218, MCS channel 1 general purpose register 6 */
#define GTM_MCS0_CH4_R6                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R6 *)0xF01F0218u)

/** \\brief  F021C, MCS channel 1 general purpose register 7 */
#define GTM_MCS0_CH4_R7                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R7 *)0xF01F021Cu)

/** \\brief  F02A4, MCS channel 1 ARU control Bit register */
#define GTM_MCS0_CH5_ACB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_ACB *)0xF01F02A4u)

/** \\brief  F02A0, MCS channel 1 control register */
#define GTM_MCS0_CH5_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL *)0xF01F02A0u)

/** \\brief  F02D4, MCS channel 1 error interrupt enable register */
#define GTM_MCS0_CH5_EIRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN *)0xF01F02D4u)

/** \\brief  F02C8, MCS channel 1 interrupt enable register */
#define GTM_MCS0_CH5_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN *)0xF01F02C8u)

/** \\brief  F02CC, MCS channel 1 force interrupt register */
#define GTM_MCS0_CH5_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT *)0xF01F02CCu)

/** \\brief  F02D0, MCS channel 1 IRQ mode configuration register */
#define GTM_MCS0_CH5_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE *)0xF01F02D0u)

/** \\brief  F02C4, MCS channel 1 interrupt notification register */
#define GTM_MCS0_CH5_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY *)0xF01F02C4u)

/** \\brief  F02BC, MCS channel 1 memory high byte register */
#define GTM_MCS0_CH5_MHB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_MHB *)0xF01F02BCu)

/** \\brief  F02C0, MCS channel 1 program counter register */
#define GTM_MCS0_CH5_PC                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_PC *)0xF01F02C0u)

/** \\brief  F0280, MCS channel 1 general purpose register 0 */
#define GTM_MCS0_CH5_R0                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R0 *)0xF01F0280u)

/** \\brief  F0284, MCS channel 1 general purpose register 1 */
#define GTM_MCS0_CH5_R1                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R1 *)0xF01F0284u)

/** \\brief  F0288, MCS channel 1 general purpose register 2 */
#define GTM_MCS0_CH5_R2                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R2 *)0xF01F0288u)

/** \\brief  F028C, MCS channel 1 general purpose register 3 */
#define GTM_MCS0_CH5_R3                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R3 *)0xF01F028Cu)

/** \\brief  F0290, MCS channel 1 general purpose register 4 */
#define GTM_MCS0_CH5_R4                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R4 *)0xF01F0290u)

/** \\brief  F0294, MCS channel 1 general purpose register 5 */
#define GTM_MCS0_CH5_R5                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R5 *)0xF01F0294u)

