Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  F0298, MCS channel 1 general purpose register 6 */
#define GTM_MCS0_CH5_R6                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R6 *)0xF01F0298u)

/** \\brief  F029C, MCS channel 1 general purpose register 7 */
#define GTM_MCS0_CH5_R7                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R7 *)0xF01F029Cu)

/** \\brief  F0324, MCS channel 1 ARU control Bit register */
#define GTM_MCS0_CH6_ACB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_ACB *)0xF01F0324u)

/** \\brief  F0320, MCS channel 1 control register */
#define GTM_MCS0_CH6_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL *)0xF01F0320u)

/** \\brief  F0354, MCS channel 1 error interrupt enable register */
#define GTM_MCS0_CH6_EIRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN *)0xF01F0354u)

/** \\brief  F0348, MCS channel 1 interrupt enable register */
#define GTM_MCS0_CH6_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN *)0xF01F0348u)

/** \\brief  F034C, MCS channel 1 force interrupt register */
#define GTM_MCS0_CH6_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT *)0xF01F034Cu)

/** \\brief  F0350, MCS channel 1 IRQ mode configuration register */
#define GTM_MCS0_CH6_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE *)0xF01F0350u)

/** \\brief  F0344, MCS channel 1 interrupt notification register */
#define GTM_MCS0_CH6_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY *)0xF01F0344u)

/** \\brief  F033C, MCS channel 1 memory high byte register */
#define GTM_MCS0_CH6_MHB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_MHB *)0xF01F033Cu)

/** \\brief  F0340, MCS channel 1 program counter register */
#define GTM_MCS0_CH6_PC                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_PC *)0xF01F0340u)

/** \\brief  F0300, MCS channel 1 general purpose register 0 */
#define GTM_MCS0_CH6_R0                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R0 *)0xF01F0300u)

/** \\brief  F0304, MCS channel 1 general purpose register 1 */
#define GTM_MCS0_CH6_R1                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R1 *)0xF01F0304u)

/** \\brief  F0308, MCS channel 1 general purpose register 2 */
#define GTM_MCS0_CH6_R2                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R2 *)0xF01F0308u)

/** \\brief  F030C, MCS channel 1 general purpose register 3 */
#define GTM_MCS0_CH6_R3                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R3 *)0xF01F030Cu)

/** \\brief  F0310, MCS channel 1 general purpose register 4 */
#define GTM_MCS0_CH6_R4                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R4 *)0xF01F0310u)

/** \\brief  F0314, MCS channel 1 general purpose register 5 */
#define GTM_MCS0_CH6_R5                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R5 *)0xF01F0314u)

/** \\brief  F0318, MCS channel 1 general purpose register 6 */
#define GTM_MCS0_CH6_R6                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R6 *)0xF01F0318u)

/** \\brief  F031C, MCS channel 1 general purpose register 7 */
#define GTM_MCS0_CH6_R7                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R7 *)0xF01F031Cu)

/** \\brief  F03A4, MCS channel 1 ARU control Bit register */
#define GTM_MCS0_CH7_ACB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_ACB *)0xF01F03A4u)

/** \\brief  F03A0, MCS channel 1 control register */
#define GTM_MCS0_CH7_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL *)0xF01F03A0u)

/** \\brief  F03D4, MCS channel 1 error interrupt enable register */
#define GTM_MCS0_CH7_EIRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN *)0xF01F03D4u)

/** \\brief  F03C8, MCS channel 1 interrupt enable register */
#define GTM_MCS0_CH7_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN *)0xF01F03C8u)

/** \\brief  F03CC, MCS channel 1 force interrupt register */
#define GTM_MCS0_CH7_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT *)0xF01F03CCu)

/** \\brief  F03D0, MCS channel 1 IRQ mode configuration register */
#define GTM_MCS0_CH7_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE *)0xF01F03D0u)

/** \\brief  F03C4, MCS channel 1 interrupt notification register */
#define GTM_MCS0_CH7_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY *)0xF01F03C4u)

/** \\brief  F03BC, MCS channel 1 memory high byte register */
#define GTM_MCS0_CH7_MHB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_MHB *)0xF01F03BCu)

/** \\brief  F03C0, MCS channel 1 program counter register */
#define GTM_MCS0_CH7_PC                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_PC *)0xF01F03C0u)

/** \\brief  F0380, MCS channel 1 general purpose register 0 */
#define GTM_MCS0_CH7_R0                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R0 *)0xF01F0380u)

/** \\brief  F0384, MCS channel 1 general purpose register 1 */
#define GTM_MCS0_CH7_R1                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R1 *)0xF01F0384u)

/** \\brief  F0388, MCS channel 1 general purpose register 2 */
#define GTM_MCS0_CH7_R2                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R2 *)0xF01F0388u)

/** \\brief  F038C, MCS channel 1 general purpose register 3 */
#define GTM_MCS0_CH7_R3                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R3 *)0xF01F038Cu)

/** \\brief  F0390, MCS channel 1 general purpose register 4 */
#define GTM_MCS0_CH7_R4                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R4 *)0xF01F0390u)

/** \\brief  F0394, MCS channel 1 general purpose register 5 */
#define GTM_MCS0_CH7_R5                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R5 *)0xF01F0394u)

/** \\brief  F0398, MCS channel 1 general purpose register 6 */
#define GTM_MCS0_CH7_R6                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R6 *)0xF01F0398u)

/** \\brief  F039C, MCS channel 1 general purpose register 7 */
#define GTM_MCS0_CH7_R7                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R7 *)0xF01F039Cu)

/** \\brief  F0064, MCS control and status register */
#define GTM_MCS0_CTRL_STAT             /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CTRL_STAT *)0xF01F0064u)

/** \\brief  F0070, MCS cancel WURM instruction */
#define GTM_MCS0_CWT                   /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CWT *)0xF01F0070u)

/** \\brief  F007C, MCS error register */
#define GTM_MCS0_ERR                   /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_ERR *)0xF01F007Cu)

/** \\brief  F0060, MCS write protection register */
#define GTM_MCS0_REG_PROT              /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_REG_PROT *)0xF01F0060u)

