Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  F0068, MCS reset register */
#define GTM_MCS0_RESET                 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_RESET *)0xF01F0068u)

/** \\brief  F106C, MCS cancel ARU transfer instruction */
#define GTM_MCS1_CAT                   /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CAT *)0xF01F106Cu)

/** \\brief  F1024, MCS channel 0 ARU control Bit register */
#define GTM_MCS1_CH0_ACB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_ACB *)0xF01F1024u)

/** \\brief  F1028, MCS clear trigger control register */
#define GTM_MCS1_CH0_CTRG              /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH0_CTRG *)0xF01F1028u)

/** Alias (User Manual Name) for GTM_MCS1_CH0_CTRG.
 * To use register names with standard convension, please use GTM_MCS1_CH0_CTRG.
 */
#define GTM_MCS1_CTRG                  (GTM_MCS1_CH0_CTRG)

/** Alias (User Manual Name) for GTM_MCS1_CH0_CTRG.
 * To use register names with standard convension, please use GTM_MCS1_CH0_CTRG.
 */
#define GTM_MCS1_CTRG                  (GTM_MCS1_CH0_CTRG)

/** \\brief  F1020, MCS channel 0 control register */
#define GTM_MCS1_CH0_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL *)0xF01F1020u)

/** \\brief  F1054, MCS channel 0 error interrupt enable register */
#define GTM_MCS1_CH0_EIRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN *)0xF01F1054u)

/** \\brief  F1048, MCS channel 0 interrupt enable register */
#define GTM_MCS1_CH0_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN *)0xF01F1048u)

/** \\brief  F104C, MCS channel 0 force interrupt register */
#define GTM_MCS1_CH0_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT *)0xF01F104Cu)

/** \\brief  F1050, MCS channel 0 IRQ mode configuration register */
#define GTM_MCS1_CH0_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE *)0xF01F1050u)

/** \\brief  F1044, MCS channel 0 interrupt notification register */
#define GTM_MCS1_CH0_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY *)0xF01F1044u)

/** \\brief  F103C, MCS channel 0 memory high byte register */
#define GTM_MCS1_CH0_MHB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_MHB *)0xF01F103Cu)

/** \\brief  F1040, MCS channel 0 program counter register */
#define GTM_MCS1_CH0_PC                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_PC *)0xF01F1040u)

/** \\brief  F1000, MCS channel 0 general purpose register 0 */
#define GTM_MCS1_CH0_R0                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R0 *)0xF01F1000u)

/** \\brief  F1004, MCS channel 0 general purpose register 1 */
#define GTM_MCS1_CH0_R1                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R1 *)0xF01F1004u)

/** \\brief  F1008, MCS channel 0 general purpose register 2 */
#define GTM_MCS1_CH0_R2                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R2 *)0xF01F1008u)

/** \\brief  F100C, MCS channel 0 general purpose register 3 */
#define GTM_MCS1_CH0_R3                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R3 *)0xF01F100Cu)

/** \\brief  F1010, MCS channel 0 general purpose register 4 */
#define GTM_MCS1_CH0_R4                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R4 *)0xF01F1010u)

/** \\brief  F1014, MCS channel 0 general purpose register 5 */
#define GTM_MCS1_CH0_R5                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R5 *)0xF01F1014u)

/** \\brief  F1018, MCS channel 0 general purpose register 6 */
#define GTM_MCS1_CH0_R6                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R6 *)0xF01F1018u)

/** \\brief  F101C, MCS channel 0 general purpose register 7 */
#define GTM_MCS1_CH0_R7                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R7 *)0xF01F101Cu)

/** \\brief  F102C, MCS set trigger control register */
#define GTM_MCS1_CH0_STRG              /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH0_STRG *)0xF01F102Cu)

/** Alias (User Manual Name) for GTM_MCS1_CH0_STRG.
 * To use register names with standard convension, please use GTM_MCS1_CH0_STRG.
 */
#define GTM_MCS1_STRG                  (GTM_MCS1_CH0_STRG)

/** Alias (User Manual Name) for GTM_MCS1_CH0_STRG.
 * To use register names with standard convension, please use GTM_MCS1_CH0_STRG.
 */
#define GTM_MCS1_STRG                  (GTM_MCS1_CH0_STRG)

/** \\brief  F10A4, MCS channel 1 ARU control Bit register */
#define GTM_MCS1_CH1_ACB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_ACB *)0xF01F10A4u)

/** \\brief  F10A0, MCS channel 1 control register */
#define GTM_MCS1_CH1_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL *)0xF01F10A0u)

/** \\brief  F10D4, MCS channel 1 error interrupt enable register */
#define GTM_MCS1_CH1_EIRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN *)0xF01F10D4u)

/** \\brief  F10C8, MCS channel 1 interrupt enable register */
#define GTM_MCS1_CH1_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN *)0xF01F10C8u)

/** \\brief  F10CC, MCS channel 1 force interrupt register */
#define GTM_MCS1_CH1_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT *)0xF01F10CCu)

/** \\brief  F10D0, MCS channel 1 IRQ mode configuration register */
#define GTM_MCS1_CH1_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE *)0xF01F10D0u)

/** \\brief  F10C4, MCS channel 1 interrupt notification register */
#define GTM_MCS1_CH1_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY *)0xF01F10C4u)

/** \\brief  F10BC, MCS channel 1 memory high byte register */
#define GTM_MCS1_CH1_MHB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_MHB *)0xF01F10BCu)

/** \\brief  F10C0, MCS channel 1 program counter register */
#define GTM_MCS1_CH1_PC                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_PC *)0xF01F10C0u)

/** \\brief  F1080, MCS channel 1 general purpose register 0 */
#define GTM_MCS1_CH1_R0                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R0 *)0xF01F1080u)

/** \\brief  F1084, MCS channel 1 general purpose register 1 */
#define GTM_MCS1_CH1_R1                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R1 *)0xF01F1084u)

/** \\brief  F1088, MCS channel 1 general purpose register 2 */
#define GTM_MCS1_CH1_R2                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R2 *)0xF01F1088u)

/** \\brief  F108C, MCS channel 1 general purpose register 3 */
#define GTM_MCS1_CH1_R3                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R3 *)0xF01F108Cu)

/** \\brief  F1090, MCS channel 1 general purpose register 4 */
#define GTM_MCS1_CH1_R4                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R4 *)0xF01F1090u)

/** \\brief  F1094, MCS channel 1 general purpose register 5 */
#define GTM_MCS1_CH1_R5                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R5 *)0xF01F1094u)

/** \\brief  F1098, MCS channel 1 general purpose register 6 */
#define GTM_MCS1_CH1_R6                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R6 *)0xF01F1098u)

/** \\brief  F109C, MCS channel 1 general purpose register 7 */
#define GTM_MCS1_CH1_R7                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R7 *)0xF01F109Cu)

