Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  F1124, MCS channel 1 ARU control Bit register */
#define GTM_MCS1_CH2_ACB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_ACB *)0xF01F1124u)

/** \\brief  F1120, MCS channel 1 control register */
#define GTM_MCS1_CH2_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL *)0xF01F1120u)

/** \\brief  F1154, MCS channel 1 error interrupt enable register */
#define GTM_MCS1_CH2_EIRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN *)0xF01F1154u)

/** \\brief  F1148, MCS channel 1 interrupt enable register */
#define GTM_MCS1_CH2_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN *)0xF01F1148u)

/** \\brief  F114C, MCS channel 1 force interrupt register */
#define GTM_MCS1_CH2_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT *)0xF01F114Cu)

/** \\brief  F1150, MCS channel 1 IRQ mode configuration register */
#define GTM_MCS1_CH2_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE *)0xF01F1150u)

/** \\brief  F1144, MCS channel 1 interrupt notification register */
#define GTM_MCS1_CH2_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY *)0xF01F1144u)

/** \\brief  F113C, MCS channel 1 memory high byte register */
#define GTM_MCS1_CH2_MHB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_MHB *)0xF01F113Cu)

/** \\brief  F1140, MCS channel 1 program counter register */
#define GTM_MCS1_CH2_PC                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_PC *)0xF01F1140u)

/** \\brief  F1100, MCS channel 1 general purpose register 0 */
#define GTM_MCS1_CH2_R0                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R0 *)0xF01F1100u)

/** \\brief  F1104, MCS channel 1 general purpose register 1 */
#define GTM_MCS1_CH2_R1                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R1 *)0xF01F1104u)

/** \\brief  F1108, MCS channel 1 general purpose register 2 */
#define GTM_MCS1_CH2_R2                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R2 *)0xF01F1108u)

/** \\brief  F110C, MCS channel 1 general purpose register 3 */
#define GTM_MCS1_CH2_R3                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R3 *)0xF01F110Cu)

/** \\brief  F1110, MCS channel 1 general purpose register 4 */
#define GTM_MCS1_CH2_R4                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R4 *)0xF01F1110u)

/** \\brief  F1114, MCS channel 1 general purpose register 5 */
#define GTM_MCS1_CH2_R5                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R5 *)0xF01F1114u)

/** \\brief  F1118, MCS channel 1 general purpose register 6 */
#define GTM_MCS1_CH2_R6                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R6 *)0xF01F1118u)

/** \\brief  F111C, MCS channel 1 general purpose register 7 */
#define GTM_MCS1_CH2_R7                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R7 *)0xF01F111Cu)

/** \\brief  F11A4, MCS channel 1 ARU control Bit register */
#define GTM_MCS1_CH3_ACB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_ACB *)0xF01F11A4u)

/** \\brief  F11A0, MCS channel 1 control register */
#define GTM_MCS1_CH3_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL *)0xF01F11A0u)

/** \\brief  F11D4, MCS channel 1 error interrupt enable register */
#define GTM_MCS1_CH3_EIRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN *)0xF01F11D4u)

/** \\brief  F11C8, MCS channel 1 interrupt enable register */
#define GTM_MCS1_CH3_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN *)0xF01F11C8u)

/** \\brief  F11CC, MCS channel 1 force interrupt register */
#define GTM_MCS1_CH3_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT *)0xF01F11CCu)

/** \\brief  F11D0, MCS channel 1 IRQ mode configuration register */
#define GTM_MCS1_CH3_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE *)0xF01F11D0u)

/** \\brief  F11C4, MCS channel 1 interrupt notification register */
#define GTM_MCS1_CH3_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY *)0xF01F11C4u)

/** \\brief  F11BC, MCS channel 1 memory high byte register */
#define GTM_MCS1_CH3_MHB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_MHB *)0xF01F11BCu)

/** \\brief  F11C0, MCS channel 1 program counter register */
#define GTM_MCS1_CH3_PC                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_PC *)0xF01F11C0u)

/** \\brief  F1180, MCS channel 1 general purpose register 0 */
#define GTM_MCS1_CH3_R0                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R0 *)0xF01F1180u)

/** \\brief  F1184, MCS channel 1 general purpose register 1 */
#define GTM_MCS1_CH3_R1                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R1 *)0xF01F1184u)

/** \\brief  F1188, MCS channel 1 general purpose register 2 */
#define GTM_MCS1_CH3_R2                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R2 *)0xF01F1188u)

/** \\brief  F118C, MCS channel 1 general purpose register 3 */
#define GTM_MCS1_CH3_R3                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R3 *)0xF01F118Cu)

/** \\brief  F1190, MCS channel 1 general purpose register 4 */
#define GTM_MCS1_CH3_R4                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R4 *)0xF01F1190u)

/** \\brief  F1194, MCS channel 1 general purpose register 5 */
#define GTM_MCS1_CH3_R5                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R5 *)0xF01F1194u)

/** \\brief  F1198, MCS channel 1 general purpose register 6 */
#define GTM_MCS1_CH3_R6                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R6 *)0xF01F1198u)

/** \\brief  F119C, MCS channel 1 general purpose register 7 */
#define GTM_MCS1_CH3_R7                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R7 *)0xF01F119Cu)

/** \\brief  F1224, MCS channel 1 ARU control Bit register */
#define GTM_MCS1_CH4_ACB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_ACB *)0xF01F1224u)

/** \\brief  F1220, MCS channel 1 control register */
#define GTM_MCS1_CH4_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL *)0xF01F1220u)

/** \\brief  F1254, MCS channel 1 error interrupt enable register */
#define GTM_MCS1_CH4_EIRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN *)0xF01F1254u)

