Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  F1248, MCS channel 1 interrupt enable register */
#define GTM_MCS1_CH4_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN *)0xF01F1248u)

/** \\brief  F124C, MCS channel 1 force interrupt register */
#define GTM_MCS1_CH4_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT *)0xF01F124Cu)

/** \\brief  F1250, MCS channel 1 IRQ mode configuration register */
#define GTM_MCS1_CH4_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE *)0xF01F1250u)

/** \\brief  F1244, MCS channel 1 interrupt notification register */
#define GTM_MCS1_CH4_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY *)0xF01F1244u)

/** \\brief  F123C, MCS channel 1 memory high byte register */
#define GTM_MCS1_CH4_MHB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_MHB *)0xF01F123Cu)

/** \\brief  F1240, MCS channel 1 program counter register */
#define GTM_MCS1_CH4_PC                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_PC *)0xF01F1240u)

/** \\brief  F1200, MCS channel 1 general purpose register 0 */
#define GTM_MCS1_CH4_R0                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R0 *)0xF01F1200u)

/** \\brief  F1204, MCS channel 1 general purpose register 1 */
#define GTM_MCS1_CH4_R1                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R1 *)0xF01F1204u)

/** \\brief  F1208, MCS channel 1 general purpose register 2 */
#define GTM_MCS1_CH4_R2                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R2 *)0xF01F1208u)

/** \\brief  F120C, MCS channel 1 general purpose register 3 */
#define GTM_MCS1_CH4_R3                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R3 *)0xF01F120Cu)

/** \\brief  F1210, MCS channel 1 general purpose register 4 */
#define GTM_MCS1_CH4_R4                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R4 *)0xF01F1210u)

/** \\brief  F1214, MCS channel 1 general purpose register 5 */
#define GTM_MCS1_CH4_R5                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R5 *)0xF01F1214u)

/** \\brief  F1218, MCS channel 1 general purpose register 6 */
#define GTM_MCS1_CH4_R6                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R6 *)0xF01F1218u)

/** \\brief  F121C, MCS channel 1 general purpose register 7 */
#define GTM_MCS1_CH4_R7                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R7 *)0xF01F121Cu)

/** \\brief  F12A4, MCS channel 1 ARU control Bit register */
#define GTM_MCS1_CH5_ACB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_ACB *)0xF01F12A4u)

/** \\brief  F12A0, MCS channel 1 control register */
#define GTM_MCS1_CH5_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL *)0xF01F12A0u)

/** \\brief  F12D4, MCS channel 1 error interrupt enable register */
#define GTM_MCS1_CH5_EIRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN *)0xF01F12D4u)

/** \\brief  F12C8, MCS channel 1 interrupt enable register */
#define GTM_MCS1_CH5_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN *)0xF01F12C8u)

/** \\brief  F12CC, MCS channel 1 force interrupt register */
#define GTM_MCS1_CH5_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT *)0xF01F12CCu)

/** \\brief  F12D0, MCS channel 1 IRQ mode configuration register */
#define GTM_MCS1_CH5_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE *)0xF01F12D0u)

/** \\brief  F12C4, MCS channel 1 interrupt notification register */
#define GTM_MCS1_CH5_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY *)0xF01F12C4u)

/** \\brief  F12BC, MCS channel 1 memory high byte register */
#define GTM_MCS1_CH5_MHB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_MHB *)0xF01F12BCu)

/** \\brief  F12C0, MCS channel 1 program counter register */
#define GTM_MCS1_CH5_PC                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_PC *)0xF01F12C0u)

/** \\brief  F1280, MCS channel 1 general purpose register 0 */
#define GTM_MCS1_CH5_R0                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R0 *)0xF01F1280u)

/** \\brief  F1284, MCS channel 1 general purpose register 1 */
#define GTM_MCS1_CH5_R1                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R1 *)0xF01F1284u)

/** \\brief  F1288, MCS channel 1 general purpose register 2 */
#define GTM_MCS1_CH5_R2                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R2 *)0xF01F1288u)

/** \\brief  F128C, MCS channel 1 general purpose register 3 */
#define GTM_MCS1_CH5_R3                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R3 *)0xF01F128Cu)

/** \\brief  F1290, MCS channel 1 general purpose register 4 */
#define GTM_MCS1_CH5_R4                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R4 *)0xF01F1290u)

/** \\brief  F1294, MCS channel 1 general purpose register 5 */
#define GTM_MCS1_CH5_R5                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R5 *)0xF01F1294u)

/** \\brief  F1298, MCS channel 1 general purpose register 6 */
#define GTM_MCS1_CH5_R6                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R6 *)0xF01F1298u)

/** \\brief  F129C, MCS channel 1 general purpose register 7 */
#define GTM_MCS1_CH5_R7                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R7 *)0xF01F129Cu)

/** \\brief  F1324, MCS channel 1 ARU control Bit register */
#define GTM_MCS1_CH6_ACB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_ACB *)0xF01F1324u)

/** \\brief  F1320, MCS channel 1 control register */
#define GTM_MCS1_CH6_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL *)0xF01F1320u)

/** \\brief  F1354, MCS channel 1 error interrupt enable register */
#define GTM_MCS1_CH6_EIRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN *)0xF01F1354u)

/** \\brief  F1348, MCS channel 1 interrupt enable register */
#define GTM_MCS1_CH6_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN *)0xF01F1348u)

/** \\brief  F134C, MCS channel 1 force interrupt register */
#define GTM_MCS1_CH6_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT *)0xF01F134Cu)

/** \\brief  F1350, MCS channel 1 IRQ mode configuration register */
#define GTM_MCS1_CH6_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE *)0xF01F1350u)

/** \\brief  F1344, MCS channel 1 interrupt notification register */
#define GTM_MCS1_CH6_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY *)0xF01F1344u)

/** \\brief  F133C, MCS channel 1 memory high byte register */
#define GTM_MCS1_CH6_MHB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_MHB *)0xF01F133Cu)

