Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  F1340, MCS channel 1 program counter register */
#define GTM_MCS1_CH6_PC                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_PC *)0xF01F1340u)

/** \\brief  F1300, MCS channel 1 general purpose register 0 */
#define GTM_MCS1_CH6_R0                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R0 *)0xF01F1300u)

/** \\brief  F1304, MCS channel 1 general purpose register 1 */
#define GTM_MCS1_CH6_R1                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R1 *)0xF01F1304u)

/** \\brief  F1308, MCS channel 1 general purpose register 2 */
#define GTM_MCS1_CH6_R2                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R2 *)0xF01F1308u)

/** \\brief  F130C, MCS channel 1 general purpose register 3 */
#define GTM_MCS1_CH6_R3                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R3 *)0xF01F130Cu)

/** \\brief  F1310, MCS channel 1 general purpose register 4 */
#define GTM_MCS1_CH6_R4                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R4 *)0xF01F1310u)

/** \\brief  F1314, MCS channel 1 general purpose register 5 */
#define GTM_MCS1_CH6_R5                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R5 *)0xF01F1314u)

/** \\brief  F1318, MCS channel 1 general purpose register 6 */
#define GTM_MCS1_CH6_R6                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R6 *)0xF01F1318u)

/** \\brief  F131C, MCS channel 1 general purpose register 7 */
#define GTM_MCS1_CH6_R7                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R7 *)0xF01F131Cu)

/** \\brief  F13A4, MCS channel 1 ARU control Bit register */
#define GTM_MCS1_CH7_ACB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_ACB *)0xF01F13A4u)

/** \\brief  F13A0, MCS channel 1 control register */
#define GTM_MCS1_CH7_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL *)0xF01F13A0u)

/** \\brief  F13D4, MCS channel 1 error interrupt enable register */
#define GTM_MCS1_CH7_EIRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN *)0xF01F13D4u)

/** \\brief  F13C8, MCS channel 1 interrupt enable register */
#define GTM_MCS1_CH7_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN *)0xF01F13C8u)

/** \\brief  F13CC, MCS channel 1 force interrupt register */
#define GTM_MCS1_CH7_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT *)0xF01F13CCu)

/** \\brief  F13D0, MCS channel 1 IRQ mode configuration register */
#define GTM_MCS1_CH7_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE *)0xF01F13D0u)

/** \\brief  F13C4, MCS channel 1 interrupt notification register */
#define GTM_MCS1_CH7_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY *)0xF01F13C4u)

/** \\brief  F13BC, MCS channel 1 memory high byte register */
#define GTM_MCS1_CH7_MHB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_MHB *)0xF01F13BCu)

/** \\brief  F13C0, MCS channel 1 program counter register */
#define GTM_MCS1_CH7_PC                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_PC *)0xF01F13C0u)

/** \\brief  F1380, MCS channel 1 general purpose register 0 */
#define GTM_MCS1_CH7_R0                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R0 *)0xF01F1380u)

/** \\brief  F1384, MCS channel 1 general purpose register 1 */
#define GTM_MCS1_CH7_R1                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R1 *)0xF01F1384u)

/** \\brief  F1388, MCS channel 1 general purpose register 2 */
#define GTM_MCS1_CH7_R2                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R2 *)0xF01F1388u)

/** \\brief  F138C, MCS channel 1 general purpose register 3 */
#define GTM_MCS1_CH7_R3                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R3 *)0xF01F138Cu)

/** \\brief  F1390, MCS channel 1 general purpose register 4 */
#define GTM_MCS1_CH7_R4                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R4 *)0xF01F1390u)

/** \\brief  F1394, MCS channel 1 general purpose register 5 */
#define GTM_MCS1_CH7_R5                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R5 *)0xF01F1394u)

/** \\brief  F1398, MCS channel 1 general purpose register 6 */
#define GTM_MCS1_CH7_R6                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R6 *)0xF01F1398u)

/** \\brief  F139C, MCS channel 1 general purpose register 7 */
#define GTM_MCS1_CH7_R7                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R7 *)0xF01F139Cu)

/** \\brief  F1064, MCS control and status register */
#define GTM_MCS1_CTRL_STAT             /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CTRL_STAT *)0xF01F1064u)

/** \\brief  F1070, MCS cancel WURM instruction */
#define GTM_MCS1_CWT                   /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CWT *)0xF01F1070u)

/** \\brief  F107C, MCS error register */
#define GTM_MCS1_ERR                   /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_ERR *)0xF01F107Cu)

/** \\brief  F1060, MCS write protection register */
#define GTM_MCS1_REG_PROT              /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_REG_PROT *)0xF01F1060u)

/** \\brief  F1068, MCS reset register */
#define GTM_MCS1_RESET                 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_RESET *)0xF01F1068u)

/** \\brief  F206C, MCS cancel ARU transfer instruction */
#define GTM_MCS2_CAT                   /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CAT *)0xF01F206Cu)

/** \\brief  F2024, MCS channel 0 ARU control Bit register */
#define GTM_MCS2_CH0_ACB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_ACB *)0xF01F2024u)

/** \\brief  F2028, MCS clear trigger control register */
#define GTM_MCS2_CH0_CTRG              /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH0_CTRG *)0xF01F2028u)

/** Alias (User Manual Name) for GTM_MCS2_CH0_CTRG.
 * To use register names with standard convension, please use GTM_MCS2_CH0_CTRG.
 */
#define GTM_MCS2_CTRG                  (GTM_MCS2_CH0_CTRG)

/** Alias (User Manual Name) for GTM_MCS2_CH0_CTRG.
 * To use register names with standard convension, please use GTM_MCS2_CH0_CTRG.
 */
#define GTM_MCS2_CTRG                  (GTM_MCS2_CH0_CTRG)

/** \\brief  F2020, MCS channel 0 control register */
#define GTM_MCS2_CH0_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL *)0xF01F2020u)

/** \\brief  F2054, MCS channel 0 error interrupt enable register */
#define GTM_MCS2_CH0_EIRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN *)0xF01F2054u)

/** \\brief  F2048, MCS channel 0 interrupt enable register */
#define GTM_MCS2_CH0_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN *)0xF01F2048u)

/** \\brief  F204C, MCS channel 0 force interrupt register */
#define GTM_MCS2_CH0_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT *)0xF01F204Cu)

/** \\brief  F2050, MCS channel 0 IRQ mode configuration register */
#define GTM_MCS2_CH0_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE *)0xF01F2050u)

/** \\brief  F2044, MCS channel 0 interrupt notification register */
#define GTM_MCS2_CH0_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY *)0xF01F2044u)

/** \\brief  F203C, MCS channel 0 memory high byte register */
#define GTM_MCS2_CH0_MHB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_MHB *)0xF01F203Cu)

/** \\brief  F2040, MCS channel 0 program counter register */
#define GTM_MCS2_CH0_PC                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_PC *)0xF01F2040u)

/** \\brief  F2000, MCS channel 0 general purpose register 0 */
#define GTM_MCS2_CH0_R0                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R0 *)0xF01F2000u)

/** \\brief  F2004, MCS channel 0 general purpose register 1 */
#define GTM_MCS2_CH0_R1                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R1 *)0xF01F2004u)

/** \\brief  F2008, MCS channel 0 general purpose register 2 */
#define GTM_MCS2_CH0_R2                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R2 *)0xF01F2008u)

/** \\brief  F200C, MCS channel 0 general purpose register 3 */
#define GTM_MCS2_CH0_R3                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R3 *)0xF01F200Cu)

/** \\brief  F2010, MCS channel 0 general purpose register 4 */
#define GTM_MCS2_CH0_R4                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R4 *)0xF01F2010u)

/** \\brief  F2014, MCS channel 0 general purpose register 5 */
#define GTM_MCS2_CH0_R5                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R5 *)0xF01F2014u)

