Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  F2018, MCS channel 0 general purpose register 6 */
#define GTM_MCS2_CH0_R6                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R6 *)0xF01F2018u)

/** \\brief  F201C, MCS channel 0 general purpose register 7 */
#define GTM_MCS2_CH0_R7                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R7 *)0xF01F201Cu)

/** \\brief  F202C, MCS set trigger control register */
#define GTM_MCS2_CH0_STRG              /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH0_STRG *)0xF01F202Cu)

/** Alias (User Manual Name) for GTM_MCS2_CH0_STRG.
 * To use register names with standard convension, please use GTM_MCS2_CH0_STRG.
 */
#define GTM_MCS2_STRG                  (GTM_MCS2_CH0_STRG)

/** Alias (User Manual Name) for GTM_MCS2_CH0_STRG.
 * To use register names with standard convension, please use GTM_MCS2_CH0_STRG.
 */
#define GTM_MCS2_STRG                  (GTM_MCS2_CH0_STRG)

/** \\brief  F20A4, MCS channel 1 ARU control Bit register */
#define GTM_MCS2_CH1_ACB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_ACB *)0xF01F20A4u)

/** \\brief  F20A0, MCS channel 1 control register */
#define GTM_MCS2_CH1_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL *)0xF01F20A0u)

/** \\brief  F20D4, MCS channel 1 error interrupt enable register */
#define GTM_MCS2_CH1_EIRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN *)0xF01F20D4u)

/** \\brief  F20C8, MCS channel 1 interrupt enable register */
#define GTM_MCS2_CH1_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN *)0xF01F20C8u)

/** \\brief  F20CC, MCS channel 1 force interrupt register */
#define GTM_MCS2_CH1_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT *)0xF01F20CCu)

/** \\brief  F20D0, MCS channel 1 IRQ mode configuration register */
#define GTM_MCS2_CH1_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE *)0xF01F20D0u)

/** \\brief  F20C4, MCS channel 1 interrupt notification register */
#define GTM_MCS2_CH1_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY *)0xF01F20C4u)

/** \\brief  F20BC, MCS channel 1 memory high byte register */
#define GTM_MCS2_CH1_MHB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_MHB *)0xF01F20BCu)

/** \\brief  F20C0, MCS channel 1 program counter register */
#define GTM_MCS2_CH1_PC                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_PC *)0xF01F20C0u)

/** \\brief  F2080, MCS channel 1 general purpose register 0 */
#define GTM_MCS2_CH1_R0                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R0 *)0xF01F2080u)

/** \\brief  F2084, MCS channel 1 general purpose register 1 */
#define GTM_MCS2_CH1_R1                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R1 *)0xF01F2084u)

/** \\brief  F2088, MCS channel 1 general purpose register 2 */
#define GTM_MCS2_CH1_R2                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R2 *)0xF01F2088u)

/** \\brief  F208C, MCS channel 1 general purpose register 3 */
#define GTM_MCS2_CH1_R3                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R3 *)0xF01F208Cu)

/** \\brief  F2090, MCS channel 1 general purpose register 4 */
#define GTM_MCS2_CH1_R4                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R4 *)0xF01F2090u)

/** \\brief  F2094, MCS channel 1 general purpose register 5 */
#define GTM_MCS2_CH1_R5                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R5 *)0xF01F2094u)

/** \\brief  F2098, MCS channel 1 general purpose register 6 */
#define GTM_MCS2_CH1_R6                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R6 *)0xF01F2098u)

/** \\brief  F209C, MCS channel 1 general purpose register 7 */
#define GTM_MCS2_CH1_R7                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R7 *)0xF01F209Cu)

/** \\brief  F2124, MCS channel 1 ARU control Bit register */
#define GTM_MCS2_CH2_ACB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_ACB *)0xF01F2124u)

/** \\brief  F2120, MCS channel 1 control register */
#define GTM_MCS2_CH2_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL *)0xF01F2120u)

/** \\brief  F2154, MCS channel 1 error interrupt enable register */
#define GTM_MCS2_CH2_EIRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN *)0xF01F2154u)

/** \\brief  F2148, MCS channel 1 interrupt enable register */
#define GTM_MCS2_CH2_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN *)0xF01F2148u)

/** \\brief  F214C, MCS channel 1 force interrupt register */
#define GTM_MCS2_CH2_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT *)0xF01F214Cu)

/** \\brief  F2150, MCS channel 1 IRQ mode configuration register */
#define GTM_MCS2_CH2_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE *)0xF01F2150u)

/** \\brief  F2144, MCS channel 1 interrupt notification register */
#define GTM_MCS2_CH2_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY *)0xF01F2144u)

/** \\brief  F213C, MCS channel 1 memory high byte register */
#define GTM_MCS2_CH2_MHB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_MHB *)0xF01F213Cu)

/** \\brief  F2140, MCS channel 1 program counter register */
#define GTM_MCS2_CH2_PC                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_PC *)0xF01F2140u)

/** \\brief  F2100, MCS channel 1 general purpose register 0 */
#define GTM_MCS2_CH2_R0                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R0 *)0xF01F2100u)

/** \\brief  F2104, MCS channel 1 general purpose register 1 */
#define GTM_MCS2_CH2_R1                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R1 *)0xF01F2104u)

/** \\brief  F2108, MCS channel 1 general purpose register 2 */
#define GTM_MCS2_CH2_R2                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R2 *)0xF01F2108u)

/** \\brief  F210C, MCS channel 1 general purpose register 3 */
#define GTM_MCS2_CH2_R3                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R3 *)0xF01F210Cu)

/** \\brief  F2110, MCS channel 1 general purpose register 4 */
#define GTM_MCS2_CH2_R4                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R4 *)0xF01F2110u)

