Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  F2114, MCS channel 1 general purpose register 5 */
#define GTM_MCS2_CH2_R5                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R5 *)0xF01F2114u)

/** \\brief  F2118, MCS channel 1 general purpose register 6 */
#define GTM_MCS2_CH2_R6                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R6 *)0xF01F2118u)

/** \\brief  F211C, MCS channel 1 general purpose register 7 */
#define GTM_MCS2_CH2_R7                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R7 *)0xF01F211Cu)

/** \\brief  F21A4, MCS channel 1 ARU control Bit register */
#define GTM_MCS2_CH3_ACB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_ACB *)0xF01F21A4u)

/** \\brief  F21A0, MCS channel 1 control register */
#define GTM_MCS2_CH3_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL *)0xF01F21A0u)

/** \\brief  F21D4, MCS channel 1 error interrupt enable register */
#define GTM_MCS2_CH3_EIRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN *)0xF01F21D4u)

/** \\brief  F21C8, MCS channel 1 interrupt enable register */
#define GTM_MCS2_CH3_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN *)0xF01F21C8u)

/** \\brief  F21CC, MCS channel 1 force interrupt register */
#define GTM_MCS2_CH3_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT *)0xF01F21CCu)

/** \\brief  F21D0, MCS channel 1 IRQ mode configuration register */
#define GTM_MCS2_CH3_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE *)0xF01F21D0u)

/** \\brief  F21C4, MCS channel 1 interrupt notification register */
#define GTM_MCS2_CH3_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY *)0xF01F21C4u)

/** \\brief  F21BC, MCS channel 1 memory high byte register */
#define GTM_MCS2_CH3_MHB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_MHB *)0xF01F21BCu)

/** \\brief  F21C0, MCS channel 1 program counter register */
#define GTM_MCS2_CH3_PC                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_PC *)0xF01F21C0u)

/** \\brief  F2180, MCS channel 1 general purpose register 0 */
#define GTM_MCS2_CH3_R0                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R0 *)0xF01F2180u)

/** \\brief  F2184, MCS channel 1 general purpose register 1 */
#define GTM_MCS2_CH3_R1                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R1 *)0xF01F2184u)

/** \\brief  F2188, MCS channel 1 general purpose register 2 */
#define GTM_MCS2_CH3_R2                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R2 *)0xF01F2188u)

/** \\brief  F218C, MCS channel 1 general purpose register 3 */
#define GTM_MCS2_CH3_R3                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R3 *)0xF01F218Cu)

/** \\brief  F2190, MCS channel 1 general purpose register 4 */
#define GTM_MCS2_CH3_R4                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R4 *)0xF01F2190u)

/** \\brief  F2194, MCS channel 1 general purpose register 5 */
#define GTM_MCS2_CH3_R5                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R5 *)0xF01F2194u)

/** \\brief  F2198, MCS channel 1 general purpose register 6 */
#define GTM_MCS2_CH3_R6                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R6 *)0xF01F2198u)

/** \\brief  F219C, MCS channel 1 general purpose register 7 */
#define GTM_MCS2_CH3_R7                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R7 *)0xF01F219Cu)

/** \\brief  F2224, MCS channel 1 ARU control Bit register */
#define GTM_MCS2_CH4_ACB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_ACB *)0xF01F2224u)

/** \\brief  F2220, MCS channel 1 control register */
#define GTM_MCS2_CH4_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL *)0xF01F2220u)

/** \\brief  F2254, MCS channel 1 error interrupt enable register */
#define GTM_MCS2_CH4_EIRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN *)0xF01F2254u)

/** \\brief  F2248, MCS channel 1 interrupt enable register */
#define GTM_MCS2_CH4_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN *)0xF01F2248u)

/** \\brief  F224C, MCS channel 1 force interrupt register */
#define GTM_MCS2_CH4_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT *)0xF01F224Cu)

/** \\brief  F2250, MCS channel 1 IRQ mode configuration register */
#define GTM_MCS2_CH4_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE *)0xF01F2250u)

/** \\brief  F2244, MCS channel 1 interrupt notification register */
#define GTM_MCS2_CH4_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY *)0xF01F2244u)

/** \\brief  F223C, MCS channel 1 memory high byte register */
#define GTM_MCS2_CH4_MHB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_MHB *)0xF01F223Cu)

/** \\brief  F2240, MCS channel 1 program counter register */
#define GTM_MCS2_CH4_PC                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_PC *)0xF01F2240u)

/** \\brief  F2200, MCS channel 1 general purpose register 0 */
#define GTM_MCS2_CH4_R0                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R0 *)0xF01F2200u)

/** \\brief  F2204, MCS channel 1 general purpose register 1 */
#define GTM_MCS2_CH4_R1                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R1 *)0xF01F2204u)

/** \\brief  F2208, MCS channel 1 general purpose register 2 */
#define GTM_MCS2_CH4_R2                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R2 *)0xF01F2208u)

/** \\brief  F220C, MCS channel 1 general purpose register 3 */
#define GTM_MCS2_CH4_R3                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R3 *)0xF01F220Cu)

/** \\brief  F2210, MCS channel 1 general purpose register 4 */
#define GTM_MCS2_CH4_R4                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R4 *)0xF01F2210u)

/** \\brief  F2214, MCS channel 1 general purpose register 5 */
#define GTM_MCS2_CH4_R5                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R5 *)0xF01F2214u)

/** \\brief  F2218, MCS channel 1 general purpose register 6 */
#define GTM_MCS2_CH4_R6                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R6 *)0xF01F2218u)

/** \\brief  F221C, MCS channel 1 general purpose register 7 */
#define GTM_MCS2_CH4_R7                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R7 *)0xF01F221Cu)

/** \\brief  F22A4, MCS channel 1 ARU control Bit register */
#define GTM_MCS2_CH5_ACB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_ACB *)0xF01F22A4u)

