Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  F22A0, MCS channel 1 control register */
#define GTM_MCS2_CH5_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL *)0xF01F22A0u)

/** \\brief  F22D4, MCS channel 1 error interrupt enable register */
#define GTM_MCS2_CH5_EIRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN *)0xF01F22D4u)

/** \\brief  F22C8, MCS channel 1 interrupt enable register */
#define GTM_MCS2_CH5_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN *)0xF01F22C8u)

/** \\brief  F22CC, MCS channel 1 force interrupt register */
#define GTM_MCS2_CH5_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT *)0xF01F22CCu)

/** \\brief  F22D0, MCS channel 1 IRQ mode configuration register */
#define GTM_MCS2_CH5_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE *)0xF01F22D0u)

/** \\brief  F22C4, MCS channel 1 interrupt notification register */
#define GTM_MCS2_CH5_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY *)0xF01F22C4u)

/** \\brief  F22BC, MCS channel 1 memory high byte register */
#define GTM_MCS2_CH5_MHB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_MHB *)0xF01F22BCu)

/** \\brief  F22C0, MCS channel 1 program counter register */
#define GTM_MCS2_CH5_PC                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_PC *)0xF01F22C0u)

/** \\brief  F2280, MCS channel 1 general purpose register 0 */
#define GTM_MCS2_CH5_R0                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R0 *)0xF01F2280u)

/** \\brief  F2284, MCS channel 1 general purpose register 1 */
#define GTM_MCS2_CH5_R1                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R1 *)0xF01F2284u)

/** \\brief  F2288, MCS channel 1 general purpose register 2 */
#define GTM_MCS2_CH5_R2                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R2 *)0xF01F2288u)

/** \\brief  F228C, MCS channel 1 general purpose register 3 */
#define GTM_MCS2_CH5_R3                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R3 *)0xF01F228Cu)

/** \\brief  F2290, MCS channel 1 general purpose register 4 */
#define GTM_MCS2_CH5_R4                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R4 *)0xF01F2290u)

/** \\brief  F2294, MCS channel 1 general purpose register 5 */
#define GTM_MCS2_CH5_R5                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R5 *)0xF01F2294u)

/** \\brief  F2298, MCS channel 1 general purpose register 6 */
#define GTM_MCS2_CH5_R6                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R6 *)0xF01F2298u)

/** \\brief  F229C, MCS channel 1 general purpose register 7 */
#define GTM_MCS2_CH5_R7                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R7 *)0xF01F229Cu)

/** \\brief  F2324, MCS channel 1 ARU control Bit register */
#define GTM_MCS2_CH6_ACB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_ACB *)0xF01F2324u)

/** \\brief  F2320, MCS channel 1 control register */
#define GTM_MCS2_CH6_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL *)0xF01F2320u)

/** \\brief  F2354, MCS channel 1 error interrupt enable register */
#define GTM_MCS2_CH6_EIRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN *)0xF01F2354u)

/** \\brief  F2348, MCS channel 1 interrupt enable register */
#define GTM_MCS2_CH6_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN *)0xF01F2348u)

/** \\brief  F234C, MCS channel 1 force interrupt register */
#define GTM_MCS2_CH6_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT *)0xF01F234Cu)

/** \\brief  F2350, MCS channel 1 IRQ mode configuration register */
#define GTM_MCS2_CH6_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE *)0xF01F2350u)

/** \\brief  F2344, MCS channel 1 interrupt notification register */
#define GTM_MCS2_CH6_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY *)0xF01F2344u)

/** \\brief  F233C, MCS channel 1 memory high byte register */
#define GTM_MCS2_CH6_MHB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_MHB *)0xF01F233Cu)

/** \\brief  F2340, MCS channel 1 program counter register */
#define GTM_MCS2_CH6_PC                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_PC *)0xF01F2340u)

/** \\brief  F2300, MCS channel 1 general purpose register 0 */
#define GTM_MCS2_CH6_R0                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R0 *)0xF01F2300u)

/** \\brief  F2304, MCS channel 1 general purpose register 1 */
#define GTM_MCS2_CH6_R1                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R1 *)0xF01F2304u)

/** \\brief  F2308, MCS channel 1 general purpose register 2 */
#define GTM_MCS2_CH6_R2                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R2 *)0xF01F2308u)

/** \\brief  F230C, MCS channel 1 general purpose register 3 */
#define GTM_MCS2_CH6_R3                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R3 *)0xF01F230Cu)

/** \\brief  F2310, MCS channel 1 general purpose register 4 */
#define GTM_MCS2_CH6_R4                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R4 *)0xF01F2310u)

/** \\brief  F2314, MCS channel 1 general purpose register 5 */
#define GTM_MCS2_CH6_R5                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R5 *)0xF01F2314u)

/** \\brief  F2318, MCS channel 1 general purpose register 6 */
#define GTM_MCS2_CH6_R6                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R6 *)0xF01F2318u)

/** \\brief  F231C, MCS channel 1 general purpose register 7 */
#define GTM_MCS2_CH6_R7                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R7 *)0xF01F231Cu)

/** \\brief  F23A4, MCS channel 1 ARU control Bit register */
#define GTM_MCS2_CH7_ACB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_ACB *)0xF01F23A4u)

/** \\brief  F23A0, MCS channel 1 control register */
#define GTM_MCS2_CH7_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL *)0xF01F23A0u)

/** \\brief  F23D4, MCS channel 1 error interrupt enable register */
#define GTM_MCS2_CH7_EIRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN *)0xF01F23D4u)

/** \\brief  F23C8, MCS channel 1 interrupt enable register */
#define GTM_MCS2_CH7_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN *)0xF01F23C8u)

/** \\brief  F23CC, MCS channel 1 force interrupt register */
#define GTM_MCS2_CH7_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT *)0xF01F23CCu)

/** \\brief  F23D0, MCS channel 1 IRQ mode configuration register */
#define GTM_MCS2_CH7_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE *)0xF01F23D0u)

/** \\brief  F23C4, MCS channel 1 interrupt notification register */
#define GTM_MCS2_CH7_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY *)0xF01F23C4u)

