Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  F23BC, MCS channel 1 memory high byte register */
#define GTM_MCS2_CH7_MHB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_MHB *)0xF01F23BCu)

/** \\brief  F23C0, MCS channel 1 program counter register */
#define GTM_MCS2_CH7_PC                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_PC *)0xF01F23C0u)

/** \\brief  F2380, MCS channel 1 general purpose register 0 */
#define GTM_MCS2_CH7_R0                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R0 *)0xF01F2380u)

/** \\brief  F2384, MCS channel 1 general purpose register 1 */
#define GTM_MCS2_CH7_R1                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R1 *)0xF01F2384u)

/** \\brief  F2388, MCS channel 1 general purpose register 2 */
#define GTM_MCS2_CH7_R2                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R2 *)0xF01F2388u)

/** \\brief  F238C, MCS channel 1 general purpose register 3 */
#define GTM_MCS2_CH7_R3                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R3 *)0xF01F238Cu)

/** \\brief  F2390, MCS channel 1 general purpose register 4 */
#define GTM_MCS2_CH7_R4                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R4 *)0xF01F2390u)

/** \\brief  F2394, MCS channel 1 general purpose register 5 */
#define GTM_MCS2_CH7_R5                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R5 *)0xF01F2394u)

/** \\brief  F2398, MCS channel 1 general purpose register 6 */
#define GTM_MCS2_CH7_R6                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R6 *)0xF01F2398u)

/** \\brief  F239C, MCS channel 1 general purpose register 7 */
#define GTM_MCS2_CH7_R7                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R7 *)0xF01F239Cu)

/** \\brief  F2064, MCS control and status register */
#define GTM_MCS2_CTRL_STAT             /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CTRL_STAT *)0xF01F2064u)

/** \\brief  F2070, MCS cancel WURM instruction */
#define GTM_MCS2_CWT                   /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CWT *)0xF01F2070u)

/** \\brief  F207C, MCS error register */
#define GTM_MCS2_ERR                   /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_ERR *)0xF01F207Cu)

/** \\brief  F2060, MCS write protection register */
#define GTM_MCS2_REG_PROT              /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_REG_PROT *)0xF01F2060u)

/** \\brief  F2068, MCS reset register */
#define GTM_MCS2_RESET                 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_RESET *)0xF01F2068u)

/** \\brief  7800, MCS to DPLL Data Exchange Buffer 0 */
#define GTM_MCS2DPLL_DEB0              /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS2DPLL_DEB *)0xF0107800u)

/** \\brief  7804, MCS to DPLL Data Exchange Buffer 0 */
#define GTM_MCS2DPLL_DEB1              /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS2DPLL_DEB *)0xF0107804u)

/** \\brief  7828, MCS to DPLL Data Exchange Buffer 0 */
#define GTM_MCS2DPLL_DEB10             /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS2DPLL_DEB *)0xF0107828u)

/** \\brief  782C, MCS to DPLL Data Exchange Buffer 0 */
#define GTM_MCS2DPLL_DEB11             /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS2DPLL_DEB *)0xF010782Cu)

/** \\brief  7830, MCS to DPLL Data Exchange Buffer 0 */
#define GTM_MCS2DPLL_DEB12             /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS2DPLL_DEB *)0xF0107830u)

/** \\brief  7834, MCS to DPLL Data Exchange Buffer 0 */
#define GTM_MCS2DPLL_DEB13             /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS2DPLL_DEB *)0xF0107834u)

/** \\brief  7838, MCS to DPLL Data Exchange Buffer 0 */
#define GTM_MCS2DPLL_DEB14             /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS2DPLL_DEB *)0xF0107838u)

/** \\brief  783C, MCS to DPLL Data Exchange Buffer 0 */
#define GTM_MCS2DPLL_DEB15             /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS2DPLL_DEB *)0xF010783Cu)

/** \\brief  7808, MCS to DPLL Data Exchange Buffer 0 */
#define GTM_MCS2DPLL_DEB2              /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS2DPLL_DEB *)0xF0107808u)

/** \\brief  780C, MCS to DPLL Data Exchange Buffer 0 */
#define GTM_MCS2DPLL_DEB3              /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS2DPLL_DEB *)0xF010780Cu)

/** \\brief  7810, MCS to DPLL Data Exchange Buffer 0 */
#define GTM_MCS2DPLL_DEB4              /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS2DPLL_DEB *)0xF0107810u)

/** \\brief  7814, MCS to DPLL Data Exchange Buffer 0 */
#define GTM_MCS2DPLL_DEB5              /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS2DPLL_DEB *)0xF0107814u)

/** \\brief  7818, MCS to DPLL Data Exchange Buffer 0 */
#define GTM_MCS2DPLL_DEB6              /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS2DPLL_DEB *)0xF0107818u)

/** \\brief  781C, MCS to DPLL Data Exchange Buffer 0 */
#define GTM_MCS2DPLL_DEB7              /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS2DPLL_DEB *)0xF010781Cu)

/** \\brief  7820, MCS to DPLL Data Exchange Buffer 0 */
#define GTM_MCS2DPLL_DEB8              /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS2DPLL_DEB *)0xF0107820u)

/** \\brief  7824, MCS to DPLL Data Exchange Buffer 0 */
#define GTM_MCS2DPLL_DEB9              /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS2DPLL_DEB *)0xF0107824u)

/** \\brief  F306C, MCS cancel ARU transfer instruction */
#define GTM_MCS3_CAT                   /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CAT *)0xF01F306Cu)

/** \\brief  F3024, MCS channel 0 ARU control Bit register */
#define GTM_MCS3_CH0_ACB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_ACB *)0xF01F3024u)

/** \\brief  F3028, MCS clear trigger control register */
#define GTM_MCS3_CH0_CTRG              /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH0_CTRG *)0xF01F3028u)

/** Alias (User Manual Name) for GTM_MCS3_CH0_CTRG.
 * To use register names with standard convension, please use GTM_MCS3_CH0_CTRG.
 */
#define GTM_MCS3_CTRG                  (GTM_MCS3_CH0_CTRG)

/** Alias (User Manual Name) for GTM_MCS3_CH0_CTRG.
 * To use register names with standard convension, please use GTM_MCS3_CH0_CTRG.
 */
#define GTM_MCS3_CTRG                  (GTM_MCS3_CH0_CTRG)

/** \\brief  F3020, MCS channel 0 control register */
#define GTM_MCS3_CH0_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL *)0xF01F3020u)

