Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  F3054, MCS channel 0 error interrupt enable register */
#define GTM_MCS3_CH0_EIRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN *)0xF01F3054u)

/** \\brief  F3048, MCS channel 0 interrupt enable register */
#define GTM_MCS3_CH0_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN *)0xF01F3048u)

/** \\brief  F304C, MCS channel 0 force interrupt register */
#define GTM_MCS3_CH0_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT *)0xF01F304Cu)

/** \\brief  F3050, MCS channel 0 IRQ mode configuration register */
#define GTM_MCS3_CH0_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE *)0xF01F3050u)

/** \\brief  F3044, MCS channel 0 interrupt notification register */
#define GTM_MCS3_CH0_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY *)0xF01F3044u)

/** \\brief  F303C, MCS channel 0 memory high byte register */
#define GTM_MCS3_CH0_MHB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_MHB *)0xF01F303Cu)

/** \\brief  F3040, MCS channel 0 program counter register */
#define GTM_MCS3_CH0_PC                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_PC *)0xF01F3040u)

/** \\brief  F3000, MCS channel 0 general purpose register 0 */
#define GTM_MCS3_CH0_R0                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R0 *)0xF01F3000u)

/** \\brief  F3004, MCS channel 0 general purpose register 1 */
#define GTM_MCS3_CH0_R1                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R1 *)0xF01F3004u)

/** \\brief  F3008, MCS channel 0 general purpose register 2 */
#define GTM_MCS3_CH0_R2                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R2 *)0xF01F3008u)

/** \\brief  F300C, MCS channel 0 general purpose register 3 */
#define GTM_MCS3_CH0_R3                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R3 *)0xF01F300Cu)

/** \\brief  F3010, MCS channel 0 general purpose register 4 */
#define GTM_MCS3_CH0_R4                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R4 *)0xF01F3010u)

/** \\brief  F3014, MCS channel 0 general purpose register 5 */
#define GTM_MCS3_CH0_R5                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R5 *)0xF01F3014u)

/** \\brief  F3018, MCS channel 0 general purpose register 6 */
#define GTM_MCS3_CH0_R6                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R6 *)0xF01F3018u)

/** \\brief  F301C, MCS channel 0 general purpose register 7 */
#define GTM_MCS3_CH0_R7                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R7 *)0xF01F301Cu)

/** \\brief  F302C, MCS set trigger control register */
#define GTM_MCS3_CH0_STRG              /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH0_STRG *)0xF01F302Cu)

/** Alias (User Manual Name) for GTM_MCS3_CH0_STRG.
 * To use register names with standard convension, please use GTM_MCS3_CH0_STRG.
 */
#define GTM_MCS3_STRG                  (GTM_MCS3_CH0_STRG)

/** Alias (User Manual Name) for GTM_MCS3_CH0_STRG.
 * To use register names with standard convension, please use GTM_MCS3_CH0_STRG.
 */
#define GTM_MCS3_STRG                  (GTM_MCS3_CH0_STRG)

/** \\brief  F30A4, MCS channel 1 ARU control Bit register */
#define GTM_MCS3_CH1_ACB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_ACB *)0xF01F30A4u)

/** \\brief  F30A0, MCS channel 1 control register */
#define GTM_MCS3_CH1_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL *)0xF01F30A0u)

/** \\brief  F30D4, MCS channel 1 error interrupt enable register */
#define GTM_MCS3_CH1_EIRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN *)0xF01F30D4u)

/** \\brief  F30C8, MCS channel 1 interrupt enable register */
#define GTM_MCS3_CH1_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN *)0xF01F30C8u)

/** \\brief  F30CC, MCS channel 1 force interrupt register */
#define GTM_MCS3_CH1_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT *)0xF01F30CCu)

/** \\brief  F30D0, MCS channel 1 IRQ mode configuration register */
#define GTM_MCS3_CH1_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE *)0xF01F30D0u)

/** \\brief  F30C4, MCS channel 1 interrupt notification register */
#define GTM_MCS3_CH1_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY *)0xF01F30C4u)

/** \\brief  F30BC, MCS channel 1 memory high byte register */
#define GTM_MCS3_CH1_MHB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_MHB *)0xF01F30BCu)

/** \\brief  F30C0, MCS channel 1 program counter register */
#define GTM_MCS3_CH1_PC                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_PC *)0xF01F30C0u)

/** \\brief  F3080, MCS channel 1 general purpose register 0 */
#define GTM_MCS3_CH1_R0                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R0 *)0xF01F3080u)

/** \\brief  F3084, MCS channel 1 general purpose register 1 */
#define GTM_MCS3_CH1_R1                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R1 *)0xF01F3084u)

/** \\brief  F3088, MCS channel 1 general purpose register 2 */
#define GTM_MCS3_CH1_R2                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R2 *)0xF01F3088u)

/** \\brief  F308C, MCS channel 1 general purpose register 3 */
#define GTM_MCS3_CH1_R3                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R3 *)0xF01F308Cu)

/** \\brief  F3090, MCS channel 1 general purpose register 4 */
#define GTM_MCS3_CH1_R4                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R4 *)0xF01F3090u)

/** \\brief  F3094, MCS channel 1 general purpose register 5 */
#define GTM_MCS3_CH1_R5                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R5 *)0xF01F3094u)

/** \\brief  F3098, MCS channel 1 general purpose register 6 */
#define GTM_MCS3_CH1_R6                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R6 *)0xF01F3098u)

/** \\brief  F309C, MCS channel 1 general purpose register 7 */
#define GTM_MCS3_CH1_R7                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R7 *)0xF01F309Cu)

/** \\brief  F3124, MCS channel 1 ARU control Bit register */
#define GTM_MCS3_CH2_ACB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_ACB *)0xF01F3124u)

