Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  F3120, MCS channel 1 control register */
#define GTM_MCS3_CH2_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL *)0xF01F3120u)

/** \\brief  F3154, MCS channel 1 error interrupt enable register */
#define GTM_MCS3_CH2_EIRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN *)0xF01F3154u)

/** \\brief  F3148, MCS channel 1 interrupt enable register */
#define GTM_MCS3_CH2_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN *)0xF01F3148u)

/** \\brief  F314C, MCS channel 1 force interrupt register */
#define GTM_MCS3_CH2_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT *)0xF01F314Cu)

/** \\brief  F3150, MCS channel 1 IRQ mode configuration register */
#define GTM_MCS3_CH2_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE *)0xF01F3150u)

/** \\brief  F3144, MCS channel 1 interrupt notification register */
#define GTM_MCS3_CH2_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY *)0xF01F3144u)

/** \\brief  F313C, MCS channel 1 memory high byte register */
#define GTM_MCS3_CH2_MHB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_MHB *)0xF01F313Cu)

/** \\brief  F3140, MCS channel 1 program counter register */
#define GTM_MCS3_CH2_PC                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_PC *)0xF01F3140u)

/** \\brief  F3100, MCS channel 1 general purpose register 0 */
#define GTM_MCS3_CH2_R0                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R0 *)0xF01F3100u)

/** \\brief  F3104, MCS channel 1 general purpose register 1 */
#define GTM_MCS3_CH2_R1                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R1 *)0xF01F3104u)

/** \\brief  F3108, MCS channel 1 general purpose register 2 */
#define GTM_MCS3_CH2_R2                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R2 *)0xF01F3108u)

/** \\brief  F310C, MCS channel 1 general purpose register 3 */
#define GTM_MCS3_CH2_R3                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R3 *)0xF01F310Cu)

/** \\brief  F3110, MCS channel 1 general purpose register 4 */
#define GTM_MCS3_CH2_R4                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R4 *)0xF01F3110u)

/** \\brief  F3114, MCS channel 1 general purpose register 5 */
#define GTM_MCS3_CH2_R5                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R5 *)0xF01F3114u)

/** \\brief  F3118, MCS channel 1 general purpose register 6 */
#define GTM_MCS3_CH2_R6                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R6 *)0xF01F3118u)

/** \\brief  F311C, MCS channel 1 general purpose register 7 */
#define GTM_MCS3_CH2_R7                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R7 *)0xF01F311Cu)

/** \\brief  F31A4, MCS channel 1 ARU control Bit register */
#define GTM_MCS3_CH3_ACB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_ACB *)0xF01F31A4u)

/** \\brief  F31A0, MCS channel 1 control register */
#define GTM_MCS3_CH3_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL *)0xF01F31A0u)

/** \\brief  F31D4, MCS channel 1 error interrupt enable register */
#define GTM_MCS3_CH3_EIRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN *)0xF01F31D4u)

/** \\brief  F31C8, MCS channel 1 interrupt enable register */
#define GTM_MCS3_CH3_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN *)0xF01F31C8u)

/** \\brief  F31CC, MCS channel 1 force interrupt register */
#define GTM_MCS3_CH3_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT *)0xF01F31CCu)

/** \\brief  F31D0, MCS channel 1 IRQ mode configuration register */
#define GTM_MCS3_CH3_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE *)0xF01F31D0u)

/** \\brief  F31C4, MCS channel 1 interrupt notification register */
#define GTM_MCS3_CH3_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY *)0xF01F31C4u)

/** \\brief  F31BC, MCS channel 1 memory high byte register */
#define GTM_MCS3_CH3_MHB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_MHB *)0xF01F31BCu)

/** \\brief  F31C0, MCS channel 1 program counter register */
#define GTM_MCS3_CH3_PC                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_PC *)0xF01F31C0u)

/** \\brief  F3180, MCS channel 1 general purpose register 0 */
#define GTM_MCS3_CH3_R0                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R0 *)0xF01F3180u)

/** \\brief  F3184, MCS channel 1 general purpose register 1 */
#define GTM_MCS3_CH3_R1                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R1 *)0xF01F3184u)

/** \\brief  F3188, MCS channel 1 general purpose register 2 */
#define GTM_MCS3_CH3_R2                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R2 *)0xF01F3188u)

/** \\brief  F318C, MCS channel 1 general purpose register 3 */
#define GTM_MCS3_CH3_R3                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R3 *)0xF01F318Cu)

/** \\brief  F3190, MCS channel 1 general purpose register 4 */
#define GTM_MCS3_CH3_R4                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R4 *)0xF01F3190u)

/** \\brief  F3194, MCS channel 1 general purpose register 5 */
#define GTM_MCS3_CH3_R5                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R5 *)0xF01F3194u)

/** \\brief  F3198, MCS channel 1 general purpose register 6 */
#define GTM_MCS3_CH3_R6                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R6 *)0xF01F3198u)

/** \\brief  F319C, MCS channel 1 general purpose register 7 */
#define GTM_MCS3_CH3_R7                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R7 *)0xF01F319Cu)

/** \\brief  F3224, MCS channel 1 ARU control Bit register */
#define GTM_MCS3_CH4_ACB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_ACB *)0xF01F3224u)

/** \\brief  F3220, MCS channel 1 control register */
#define GTM_MCS3_CH4_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL *)0xF01F3220u)

/** \\brief  F3254, MCS channel 1 error interrupt enable register */
#define GTM_MCS3_CH4_EIRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN *)0xF01F3254u)

