Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  F3248, MCS channel 1 interrupt enable register */
#define GTM_MCS3_CH4_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN *)0xF01F3248u)

/** \\brief  F324C, MCS channel 1 force interrupt register */
#define GTM_MCS3_CH4_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT *)0xF01F324Cu)

/** \\brief  F3250, MCS channel 1 IRQ mode configuration register */
#define GTM_MCS3_CH4_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE *)0xF01F3250u)

/** \\brief  F3244, MCS channel 1 interrupt notification register */
#define GTM_MCS3_CH4_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY *)0xF01F3244u)

/** \\brief  F323C, MCS channel 1 memory high byte register */
#define GTM_MCS3_CH4_MHB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_MHB *)0xF01F323Cu)

/** \\brief  F3240, MCS channel 1 program counter register */
#define GTM_MCS3_CH4_PC                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_PC *)0xF01F3240u)

/** \\brief  F3200, MCS channel 1 general purpose register 0 */
#define GTM_MCS3_CH4_R0                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R0 *)0xF01F3200u)

/** \\brief  F3204, MCS channel 1 general purpose register 1 */
#define GTM_MCS3_CH4_R1                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R1 *)0xF01F3204u)

/** \\brief  F3208, MCS channel 1 general purpose register 2 */
#define GTM_MCS3_CH4_R2                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R2 *)0xF01F3208u)

/** \\brief  F320C, MCS channel 1 general purpose register 3 */
#define GTM_MCS3_CH4_R3                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R3 *)0xF01F320Cu)

/** \\brief  F3210, MCS channel 1 general purpose register 4 */
#define GTM_MCS3_CH4_R4                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R4 *)0xF01F3210u)

/** \\brief  F3214, MCS channel 1 general purpose register 5 */
#define GTM_MCS3_CH4_R5                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R5 *)0xF01F3214u)

/** \\brief  F3218, MCS channel 1 general purpose register 6 */
#define GTM_MCS3_CH4_R6                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R6 *)0xF01F3218u)

/** \\brief  F321C, MCS channel 1 general purpose register 7 */
#define GTM_MCS3_CH4_R7                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R7 *)0xF01F321Cu)

/** \\brief  F32A4, MCS channel 1 ARU control Bit register */
#define GTM_MCS3_CH5_ACB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_ACB *)0xF01F32A4u)

/** \\brief  F32A0, MCS channel 1 control register */
#define GTM_MCS3_CH5_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL *)0xF01F32A0u)

/** \\brief  F32D4, MCS channel 1 error interrupt enable register */
#define GTM_MCS3_CH5_EIRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN *)0xF01F32D4u)

/** \\brief  F32C8, MCS channel 1 interrupt enable register */
#define GTM_MCS3_CH5_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN *)0xF01F32C8u)

/** \\brief  F32CC, MCS channel 1 force interrupt register */
#define GTM_MCS3_CH5_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT *)0xF01F32CCu)

/** \\brief  F32D0, MCS channel 1 IRQ mode configuration register */
#define GTM_MCS3_CH5_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE *)0xF01F32D0u)

/** \\brief  F32C4, MCS channel 1 interrupt notification register */
#define GTM_MCS3_CH5_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY *)0xF01F32C4u)

/** \\brief  F32BC, MCS channel 1 memory high byte register */
#define GTM_MCS3_CH5_MHB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_MHB *)0xF01F32BCu)

/** \\brief  F32C0, MCS channel 1 program counter register */
#define GTM_MCS3_CH5_PC                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_PC *)0xF01F32C0u)

/** \\brief  F3280, MCS channel 1 general purpose register 0 */
#define GTM_MCS3_CH5_R0                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R0 *)0xF01F3280u)

/** \\brief  F3284, MCS channel 1 general purpose register 1 */
#define GTM_MCS3_CH5_R1                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R1 *)0xF01F3284u)

/** \\brief  F3288, MCS channel 1 general purpose register 2 */
#define GTM_MCS3_CH5_R2                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R2 *)0xF01F3288u)

/** \\brief  F328C, MCS channel 1 general purpose register 3 */
#define GTM_MCS3_CH5_R3                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R3 *)0xF01F328Cu)

/** \\brief  F3290, MCS channel 1 general purpose register 4 */
#define GTM_MCS3_CH5_R4                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R4 *)0xF01F3290u)

/** \\brief  F3294, MCS channel 1 general purpose register 5 */
#define GTM_MCS3_CH5_R5                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R5 *)0xF01F3294u)

/** \\brief  F3298, MCS channel 1 general purpose register 6 */
#define GTM_MCS3_CH5_R6                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R6 *)0xF01F3298u)

/** \\brief  F329C, MCS channel 1 general purpose register 7 */
#define GTM_MCS3_CH5_R7                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R7 *)0xF01F329Cu)

/** \\brief  F3324, MCS channel 1 ARU control Bit register */
#define GTM_MCS3_CH6_ACB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_ACB *)0xF01F3324u)

/** \\brief  F3320, MCS channel 1 control register */
#define GTM_MCS3_CH6_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL *)0xF01F3320u)

/** \\brief  F3354, MCS channel 1 error interrupt enable register */
#define GTM_MCS3_CH6_EIRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN *)0xF01F3354u)

/** \\brief  F3348, MCS channel 1 interrupt enable register */
#define GTM_MCS3_CH6_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN *)0xF01F3348u)

/** \\brief  F334C, MCS channel 1 force interrupt register */
#define GTM_MCS3_CH6_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT *)0xF01F334Cu)

/** \\brief  F3350, MCS channel 1 IRQ mode configuration register */
#define GTM_MCS3_CH6_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE *)0xF01F3350u)

/** \\brief  F3344, MCS channel 1 interrupt notification register */
#define GTM_MCS3_CH6_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY *)0xF01F3344u)

/** \\brief  F333C, MCS channel 1 memory high byte register */
#define GTM_MCS3_CH6_MHB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_MHB *)0xF01F333Cu)

/** \\brief  F3340, MCS channel 1 program counter register */
#define GTM_MCS3_CH6_PC                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_PC *)0xF01F3340u)

/** \\brief  F3300, MCS channel 1 general purpose register 0 */
#define GTM_MCS3_CH6_R0                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R0 *)0xF01F3300u)

/** \\brief  F3304, MCS channel 1 general purpose register 1 */
#define GTM_MCS3_CH6_R1                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R1 *)0xF01F3304u)

