Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  F3308, MCS channel 1 general purpose register 2 */
#define GTM_MCS3_CH6_R2                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R2 *)0xF01F3308u)

/** \\brief  F330C, MCS channel 1 general purpose register 3 */
#define GTM_MCS3_CH6_R3                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R3 *)0xF01F330Cu)

/** \\brief  F3310, MCS channel 1 general purpose register 4 */
#define GTM_MCS3_CH6_R4                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R4 *)0xF01F3310u)

/** \\brief  F3314, MCS channel 1 general purpose register 5 */
#define GTM_MCS3_CH6_R5                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R5 *)0xF01F3314u)

/** \\brief  F3318, MCS channel 1 general purpose register 6 */
#define GTM_MCS3_CH6_R6                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R6 *)0xF01F3318u)

/** \\brief  F331C, MCS channel 1 general purpose register 7 */
#define GTM_MCS3_CH6_R7                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R7 *)0xF01F331Cu)

/** \\brief  F33A4, MCS channel 1 ARU control Bit register */
#define GTM_MCS3_CH7_ACB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_ACB *)0xF01F33A4u)

/** \\brief  F33A0, MCS channel 1 control register */
#define GTM_MCS3_CH7_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL *)0xF01F33A0u)

/** \\brief  F33D4, MCS channel 1 error interrupt enable register */
#define GTM_MCS3_CH7_EIRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN *)0xF01F33D4u)

/** \\brief  F33C8, MCS channel 1 interrupt enable register */
#define GTM_MCS3_CH7_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN *)0xF01F33C8u)

/** \\brief  F33CC, MCS channel 1 force interrupt register */
#define GTM_MCS3_CH7_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT *)0xF01F33CCu)

/** \\brief  F33D0, MCS channel 1 IRQ mode configuration register */
#define GTM_MCS3_CH7_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE *)0xF01F33D0u)

/** \\brief  F33C4, MCS channel 1 interrupt notification register */
#define GTM_MCS3_CH7_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY *)0xF01F33C4u)

/** \\brief  F33BC, MCS channel 1 memory high byte register */
#define GTM_MCS3_CH7_MHB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_MHB *)0xF01F33BCu)

/** \\brief  F33C0, MCS channel 1 program counter register */
#define GTM_MCS3_CH7_PC                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_PC *)0xF01F33C0u)

/** \\brief  F3380, MCS channel 1 general purpose register 0 */
#define GTM_MCS3_CH7_R0                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R0 *)0xF01F3380u)

/** \\brief  F3384, MCS channel 1 general purpose register 1 */
#define GTM_MCS3_CH7_R1                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R1 *)0xF01F3384u)

/** \\brief  F3388, MCS channel 1 general purpose register 2 */
#define GTM_MCS3_CH7_R2                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R2 *)0xF01F3388u)

/** \\brief  F338C, MCS channel 1 general purpose register 3 */
#define GTM_MCS3_CH7_R3                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R3 *)0xF01F338Cu)

/** \\brief  F3390, MCS channel 1 general purpose register 4 */
#define GTM_MCS3_CH7_R4                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R4 *)0xF01F3390u)

/** \\brief  F3394, MCS channel 1 general purpose register 5 */
#define GTM_MCS3_CH7_R5                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R5 *)0xF01F3394u)

/** \\brief  F3398, MCS channel 1 general purpose register 6 */
#define GTM_MCS3_CH7_R6                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R6 *)0xF01F3398u)

/** \\brief  F339C, MCS channel 1 general purpose register 7 */
#define GTM_MCS3_CH7_R7                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R7 *)0xF01F339Cu)

/** \\brief  F3064, MCS control and status register */
#define GTM_MCS3_CTRL_STAT             /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CTRL_STAT *)0xF01F3064u)

/** \\brief  F3070, MCS cancel WURM instruction */
#define GTM_MCS3_CWT                   /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CWT *)0xF01F3070u)

/** \\brief  F307C, MCS error register */
#define GTM_MCS3_ERR                   /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_ERR *)0xF01F307Cu)

/** \\brief  F3060, MCS write protection register */
#define GTM_MCS3_REG_PROT              /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_REG_PROT *)0xF01F3060u)

/** \\brief  F3068, MCS reset register */
#define GTM_MCS3_RESET                 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_RESET *)0xF01F3068u)

/** \\brief  F406C, MCS cancel ARU transfer instruction */
#define GTM_MCS4_CAT                   /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CAT *)0xF01F406Cu)

/** \\brief  F4024, MCS channel 0 ARU control Bit register */
#define GTM_MCS4_CH0_ACB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_ACB *)0xF01F4024u)

/** \\brief  F4028, MCS clear trigger control register */
#define GTM_MCS4_CH0_CTRG              /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH0_CTRG *)0xF01F4028u)

/** Alias (User Manual Name) for GTM_MCS4_CH0_CTRG.
 * To use register names with standard convension, please use GTM_MCS4_CH0_CTRG.
 */
#define GTM_MCS4_CTRG                  (GTM_MCS4_CH0_CTRG)

/** Alias (User Manual Name) for GTM_MCS4_CH0_CTRG.
 * To use register names with standard convension, please use GTM_MCS4_CH0_CTRG.
 */
#define GTM_MCS4_CTRG                  (GTM_MCS4_CH0_CTRG)

/** \\brief  F4020, MCS channel 0 control register */
#define GTM_MCS4_CH0_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL *)0xF01F4020u)

/** \\brief  F4054, MCS channel 0 error interrupt enable register */
#define GTM_MCS4_CH0_EIRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN *)0xF01F4054u)

/** \\brief  F4048, MCS channel 0 interrupt enable register */
#define GTM_MCS4_CH0_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN *)0xF01F4048u)

/** \\brief  F404C, MCS channel 0 force interrupt register */
#define GTM_MCS4_CH0_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT *)0xF01F404Cu)

/** \\brief  F4050, MCS channel 0 IRQ mode configuration register */
#define GTM_MCS4_CH0_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE *)0xF01F4050u)

/** \\brief  F4044, MCS channel 0 interrupt notification register */
#define GTM_MCS4_CH0_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY *)0xF01F4044u)

/** \\brief  F403C, MCS channel 0 memory high byte register */
#define GTM_MCS4_CH0_MHB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_MHB *)0xF01F403Cu)

/** \\brief  F4040, MCS channel 0 program counter register */
#define GTM_MCS4_CH0_PC                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_PC *)0xF01F4040u)

/** \\brief  F4000, MCS channel 0 general purpose register 0 */
#define GTM_MCS4_CH0_R0                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R0 *)0xF01F4000u)

/** \\brief  F4004, MCS channel 0 general purpose register 1 */
#define GTM_MCS4_CH0_R1                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R1 *)0xF01F4004u)

/** \\brief  F4008, MCS channel 0 general purpose register 2 */
#define GTM_MCS4_CH0_R2                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R2 *)0xF01F4008u)

/** \\brief  F400C, MCS channel 0 general purpose register 3 */
#define GTM_MCS4_CH0_R3                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R3 *)0xF01F400Cu)

/** \\brief  F4010, MCS channel 0 general purpose register 4 */
#define GTM_MCS4_CH0_R4                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R4 *)0xF01F4010u)

/** \\brief  F4014, MCS channel 0 general purpose register 5 */
#define GTM_MCS4_CH0_R5                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R5 *)0xF01F4014u)

