Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  F4018, MCS channel 0 general purpose register 6 */
#define GTM_MCS4_CH0_R6                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R6 *)0xF01F4018u)

/** \\brief  F401C, MCS channel 0 general purpose register 7 */
#define GTM_MCS4_CH0_R7                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R7 *)0xF01F401Cu)

/** \\brief  F402C, MCS set trigger control register */
#define GTM_MCS4_CH0_STRG              /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH0_STRG *)0xF01F402Cu)

/** Alias (User Manual Name) for GTM_MCS4_CH0_STRG.
 * To use register names with standard convension, please use GTM_MCS4_CH0_STRG.
 */
#define GTM_MCS4_STRG                  (GTM_MCS4_CH0_STRG)

/** Alias (User Manual Name) for GTM_MCS4_CH0_STRG.
 * To use register names with standard convension, please use GTM_MCS4_CH0_STRG.
 */
#define GTM_MCS4_STRG                  (GTM_MCS4_CH0_STRG)

/** \\brief  F40A4, MCS channel 1 ARU control Bit register */
#define GTM_MCS4_CH1_ACB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_ACB *)0xF01F40A4u)

/** \\brief  F40A0, MCS channel 1 control register */
#define GTM_MCS4_CH1_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL *)0xF01F40A0u)

/** \\brief  F40D4, MCS channel 1 error interrupt enable register */
#define GTM_MCS4_CH1_EIRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN *)0xF01F40D4u)

/** \\brief  F40C8, MCS channel 1 interrupt enable register */
#define GTM_MCS4_CH1_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN *)0xF01F40C8u)

/** \\brief  F40CC, MCS channel 1 force interrupt register */
#define GTM_MCS4_CH1_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT *)0xF01F40CCu)

/** \\brief  F40D0, MCS channel 1 IRQ mode configuration register */
#define GTM_MCS4_CH1_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE *)0xF01F40D0u)

/** \\brief  F40C4, MCS channel 1 interrupt notification register */
#define GTM_MCS4_CH1_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY *)0xF01F40C4u)

/** \\brief  F40BC, MCS channel 1 memory high byte register */
#define GTM_MCS4_CH1_MHB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_MHB *)0xF01F40BCu)

/** \\brief  F40C0, MCS channel 1 program counter register */
#define GTM_MCS4_CH1_PC                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_PC *)0xF01F40C0u)

/** \\brief  F4080, MCS channel 1 general purpose register 0 */
#define GTM_MCS4_CH1_R0                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R0 *)0xF01F4080u)

/** \\brief  F4084, MCS channel 1 general purpose register 1 */
#define GTM_MCS4_CH1_R1                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R1 *)0xF01F4084u)

/** \\brief  F4088, MCS channel 1 general purpose register 2 */
#define GTM_MCS4_CH1_R2                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R2 *)0xF01F4088u)

/** \\brief  F408C, MCS channel 1 general purpose register 3 */
#define GTM_MCS4_CH1_R3                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R3 *)0xF01F408Cu)

/** \\brief  F4090, MCS channel 1 general purpose register 4 */
#define GTM_MCS4_CH1_R4                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R4 *)0xF01F4090u)

/** \\brief  F4094, MCS channel 1 general purpose register 5 */
#define GTM_MCS4_CH1_R5                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R5 *)0xF01F4094u)

/** \\brief  F4098, MCS channel 1 general purpose register 6 */
#define GTM_MCS4_CH1_R6                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R6 *)0xF01F4098u)

/** \\brief  F409C, MCS channel 1 general purpose register 7 */
#define GTM_MCS4_CH1_R7                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R7 *)0xF01F409Cu)

/** \\brief  F4124, MCS channel 1 ARU control Bit register */
#define GTM_MCS4_CH2_ACB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_ACB *)0xF01F4124u)

/** \\brief  F4120, MCS channel 1 control register */
#define GTM_MCS4_CH2_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL *)0xF01F4120u)

/** \\brief  F4154, MCS channel 1 error interrupt enable register */
#define GTM_MCS4_CH2_EIRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN *)0xF01F4154u)

/** \\brief  F4148, MCS channel 1 interrupt enable register */
#define GTM_MCS4_CH2_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN *)0xF01F4148u)

/** \\brief  F414C, MCS channel 1 force interrupt register */
#define GTM_MCS4_CH2_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT *)0xF01F414Cu)

/** \\brief  F4150, MCS channel 1 IRQ mode configuration register */
#define GTM_MCS4_CH2_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE *)0xF01F4150u)

/** \\brief  F4144, MCS channel 1 interrupt notification register */
#define GTM_MCS4_CH2_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY *)0xF01F4144u)

/** \\brief  F413C, MCS channel 1 memory high byte register */
#define GTM_MCS4_CH2_MHB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_MHB *)0xF01F413Cu)

/** \\brief  F4140, MCS channel 1 program counter register */
#define GTM_MCS4_CH2_PC                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_PC *)0xF01F4140u)

/** \\brief  F4100, MCS channel 1 general purpose register 0 */
#define GTM_MCS4_CH2_R0                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R0 *)0xF01F4100u)

/** \\brief  F4104, MCS channel 1 general purpose register 1 */
#define GTM_MCS4_CH2_R1                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R1 *)0xF01F4104u)

/** \\brief  F4108, MCS channel 1 general purpose register 2 */
#define GTM_MCS4_CH2_R2                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R2 *)0xF01F4108u)

/** \\brief  F410C, MCS channel 1 general purpose register 3 */
#define GTM_MCS4_CH2_R3                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R3 *)0xF01F410Cu)

/** \\brief  F4110, MCS channel 1 general purpose register 4 */
#define GTM_MCS4_CH2_R4                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R4 *)0xF01F4110u)

