Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  F4114, MCS channel 1 general purpose register 5 */
#define GTM_MCS4_CH2_R5                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R5 *)0xF01F4114u)

/** \\brief  F4118, MCS channel 1 general purpose register 6 */
#define GTM_MCS4_CH2_R6                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R6 *)0xF01F4118u)

/** \\brief  F411C, MCS channel 1 general purpose register 7 */
#define GTM_MCS4_CH2_R7                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R7 *)0xF01F411Cu)

/** \\brief  F41A4, MCS channel 1 ARU control Bit register */
#define GTM_MCS4_CH3_ACB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_ACB *)0xF01F41A4u)

/** \\brief  F41A0, MCS channel 1 control register */
#define GTM_MCS4_CH3_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL *)0xF01F41A0u)

/** \\brief  F41D4, MCS channel 1 error interrupt enable register */
#define GTM_MCS4_CH3_EIRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN *)0xF01F41D4u)

/** \\brief  F41C8, MCS channel 1 interrupt enable register */
#define GTM_MCS4_CH3_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN *)0xF01F41C8u)

/** \\brief  F41CC, MCS channel 1 force interrupt register */
#define GTM_MCS4_CH3_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT *)0xF01F41CCu)

/** \\brief  F41D0, MCS channel 1 IRQ mode configuration register */
#define GTM_MCS4_CH3_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE *)0xF01F41D0u)

/** \\brief  F41C4, MCS channel 1 interrupt notification register */
#define GTM_MCS4_CH3_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY *)0xF01F41C4u)

/** \\brief  F41BC, MCS channel 1 memory high byte register */
#define GTM_MCS4_CH3_MHB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_MHB *)0xF01F41BCu)

/** \\brief  F41C0, MCS channel 1 program counter register */
#define GTM_MCS4_CH3_PC                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_PC *)0xF01F41C0u)

/** \\brief  F4180, MCS channel 1 general purpose register 0 */
#define GTM_MCS4_CH3_R0                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R0 *)0xF01F4180u)

/** \\brief  F4184, MCS channel 1 general purpose register 1 */
#define GTM_MCS4_CH3_R1                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R1 *)0xF01F4184u)

/** \\brief  F4188, MCS channel 1 general purpose register 2 */
#define GTM_MCS4_CH3_R2                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R2 *)0xF01F4188u)

/** \\brief  F418C, MCS channel 1 general purpose register 3 */
#define GTM_MCS4_CH3_R3                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R3 *)0xF01F418Cu)

/** \\brief  F4190, MCS channel 1 general purpose register 4 */
#define GTM_MCS4_CH3_R4                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R4 *)0xF01F4190u)

/** \\brief  F4194, MCS channel 1 general purpose register 5 */
#define GTM_MCS4_CH3_R5                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R5 *)0xF01F4194u)

/** \\brief  F4198, MCS channel 1 general purpose register 6 */
#define GTM_MCS4_CH3_R6                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R6 *)0xF01F4198u)

/** \\brief  F419C, MCS channel 1 general purpose register 7 */
#define GTM_MCS4_CH3_R7                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R7 *)0xF01F419Cu)

/** \\brief  F4224, MCS channel 1 ARU control Bit register */
#define GTM_MCS4_CH4_ACB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_ACB *)0xF01F4224u)

/** \\brief  F4220, MCS channel 1 control register */
#define GTM_MCS4_CH4_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL *)0xF01F4220u)

/** \\brief  F4254, MCS channel 1 error interrupt enable register */
#define GTM_MCS4_CH4_EIRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN *)0xF01F4254u)

/** \\brief  F4248, MCS channel 1 interrupt enable register */
#define GTM_MCS4_CH4_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN *)0xF01F4248u)

/** \\brief  F424C, MCS channel 1 force interrupt register */
#define GTM_MCS4_CH4_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT *)0xF01F424Cu)

/** \\brief  F4250, MCS channel 1 IRQ mode configuration register */
#define GTM_MCS4_CH4_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE *)0xF01F4250u)

/** \\brief  F4244, MCS channel 1 interrupt notification register */
#define GTM_MCS4_CH4_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY *)0xF01F4244u)

/** \\brief  F423C, MCS channel 1 memory high byte register */
#define GTM_MCS4_CH4_MHB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_MHB *)0xF01F423Cu)

/** \\brief  F4240, MCS channel 1 program counter register */
#define GTM_MCS4_CH4_PC                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_PC *)0xF01F4240u)

/** \\brief  F4200, MCS channel 1 general purpose register 0 */
#define GTM_MCS4_CH4_R0                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R0 *)0xF01F4200u)

/** \\brief  F4204, MCS channel 1 general purpose register 1 */
#define GTM_MCS4_CH4_R1                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R1 *)0xF01F4204u)

/** \\brief  F4208, MCS channel 1 general purpose register 2 */
#define GTM_MCS4_CH4_R2                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R2 *)0xF01F4208u)

/** \\brief  F420C, MCS channel 1 general purpose register 3 */
#define GTM_MCS4_CH4_R3                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R3 *)0xF01F420Cu)

/** \\brief  F4210, MCS channel 1 general purpose register 4 */
#define GTM_MCS4_CH4_R4                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R4 *)0xF01F4210u)

/** \\brief  F4214, MCS channel 1 general purpose register 5 */
#define GTM_MCS4_CH4_R5                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R5 *)0xF01F4214u)

/** \\brief  F4218, MCS channel 1 general purpose register 6 */
#define GTM_MCS4_CH4_R6                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R6 *)0xF01F4218u)

/** \\brief  F421C, MCS channel 1 general purpose register 7 */
#define GTM_MCS4_CH4_R7                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R7 *)0xF01F421Cu)

/** \\brief  F42A4, MCS channel 1 ARU control Bit register */
#define GTM_MCS4_CH5_ACB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_ACB *)0xF01F42A4u)

/** \\brief  F42A0, MCS channel 1 control register */
#define GTM_MCS4_CH5_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL *)0xF01F42A0u)

/** \\brief  F42D4, MCS channel 1 error interrupt enable register */
#define GTM_MCS4_CH5_EIRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN *)0xF01F42D4u)

/** \\brief  F42C8, MCS channel 1 interrupt enable register */
#define GTM_MCS4_CH5_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN *)0xF01F42C8u)

/** \\brief  F42CC, MCS channel 1 force interrupt register */
#define GTM_MCS4_CH5_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT *)0xF01F42CCu)

