Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  F42D0, MCS channel 1 IRQ mode configuration register */
#define GTM_MCS4_CH5_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE *)0xF01F42D0u)

/** \\brief  F42C4, MCS channel 1 interrupt notification register */
#define GTM_MCS4_CH5_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY *)0xF01F42C4u)

/** \\brief  F42BC, MCS channel 1 memory high byte register */
#define GTM_MCS4_CH5_MHB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_MHB *)0xF01F42BCu)

/** \\brief  F42C0, MCS channel 1 program counter register */
#define GTM_MCS4_CH5_PC                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_PC *)0xF01F42C0u)

/** \\brief  F4280, MCS channel 1 general purpose register 0 */
#define GTM_MCS4_CH5_R0                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R0 *)0xF01F4280u)

/** \\brief  F4284, MCS channel 1 general purpose register 1 */
#define GTM_MCS4_CH5_R1                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R1 *)0xF01F4284u)

/** \\brief  F4288, MCS channel 1 general purpose register 2 */
#define GTM_MCS4_CH5_R2                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R2 *)0xF01F4288u)

/** \\brief  F428C, MCS channel 1 general purpose register 3 */
#define GTM_MCS4_CH5_R3                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R3 *)0xF01F428Cu)

/** \\brief  F4290, MCS channel 1 general purpose register 4 */
#define GTM_MCS4_CH5_R4                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R4 *)0xF01F4290u)

/** \\brief  F4294, MCS channel 1 general purpose register 5 */
#define GTM_MCS4_CH5_R5                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R5 *)0xF01F4294u)

/** \\brief  F4298, MCS channel 1 general purpose register 6 */
#define GTM_MCS4_CH5_R6                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R6 *)0xF01F4298u)

/** \\brief  F429C, MCS channel 1 general purpose register 7 */
#define GTM_MCS4_CH5_R7                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R7 *)0xF01F429Cu)

/** \\brief  F4324, MCS channel 1 ARU control Bit register */
#define GTM_MCS4_CH6_ACB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_ACB *)0xF01F4324u)

/** \\brief  F4320, MCS channel 1 control register */
#define GTM_MCS4_CH6_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL *)0xF01F4320u)

/** \\brief  F4354, MCS channel 1 error interrupt enable register */
#define GTM_MCS4_CH6_EIRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN *)0xF01F4354u)

/** \\brief  F4348, MCS channel 1 interrupt enable register */
#define GTM_MCS4_CH6_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN *)0xF01F4348u)

/** \\brief  F434C, MCS channel 1 force interrupt register */
#define GTM_MCS4_CH6_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT *)0xF01F434Cu)

/** \\brief  F4350, MCS channel 1 IRQ mode configuration register */
#define GTM_MCS4_CH6_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE *)0xF01F4350u)

/** \\brief  F4344, MCS channel 1 interrupt notification register */
#define GTM_MCS4_CH6_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY *)0xF01F4344u)

/** \\brief  F433C, MCS channel 1 memory high byte register */
#define GTM_MCS4_CH6_MHB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_MHB *)0xF01F433Cu)

/** \\brief  F4340, MCS channel 1 program counter register */
#define GTM_MCS4_CH6_PC                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_PC *)0xF01F4340u)

/** \\brief  F4300, MCS channel 1 general purpose register 0 */
#define GTM_MCS4_CH6_R0                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R0 *)0xF01F4300u)

/** \\brief  F4304, MCS channel 1 general purpose register 1 */
#define GTM_MCS4_CH6_R1                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R1 *)0xF01F4304u)

/** \\brief  F4308, MCS channel 1 general purpose register 2 */
#define GTM_MCS4_CH6_R2                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R2 *)0xF01F4308u)

/** \\brief  F430C, MCS channel 1 general purpose register 3 */
#define GTM_MCS4_CH6_R3                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R3 *)0xF01F430Cu)

/** \\brief  F4310, MCS channel 1 general purpose register 4 */
#define GTM_MCS4_CH6_R4                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R4 *)0xF01F4310u)

/** \\brief  F4314, MCS channel 1 general purpose register 5 */
#define GTM_MCS4_CH6_R5                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R5 *)0xF01F4314u)

/** \\brief  F4318, MCS channel 1 general purpose register 6 */
#define GTM_MCS4_CH6_R6                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R6 *)0xF01F4318u)

/** \\brief  F431C, MCS channel 1 general purpose register 7 */
#define GTM_MCS4_CH6_R7                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R7 *)0xF01F431Cu)

/** \\brief  F43A4, MCS channel 1 ARU control Bit register */
#define GTM_MCS4_CH7_ACB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_ACB *)0xF01F43A4u)

/** \\brief  F43A0, MCS channel 1 control register */
#define GTM_MCS4_CH7_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL *)0xF01F43A0u)

/** \\brief  F43D4, MCS channel 1 error interrupt enable register */
#define GTM_MCS4_CH7_EIRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN *)0xF01F43D4u)

/** \\brief  F43C8, MCS channel 1 interrupt enable register */
#define GTM_MCS4_CH7_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN *)0xF01F43C8u)

/** \\brief  F43CC, MCS channel 1 force interrupt register */
#define GTM_MCS4_CH7_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT *)0xF01F43CCu)

/** \\brief  F43D0, MCS channel 1 IRQ mode configuration register */
#define GTM_MCS4_CH7_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE *)0xF01F43D0u)

/** \\brief  F43C4, MCS channel 1 interrupt notification register */
#define GTM_MCS4_CH7_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY *)0xF01F43C4u)

