Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  F43BC, MCS channel 1 memory high byte register */
#define GTM_MCS4_CH7_MHB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_MHB *)0xF01F43BCu)

/** \\brief  F43C0, MCS channel 1 program counter register */
#define GTM_MCS4_CH7_PC                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_PC *)0xF01F43C0u)

/** \\brief  F4380, MCS channel 1 general purpose register 0 */
#define GTM_MCS4_CH7_R0                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R0 *)0xF01F4380u)

/** \\brief  F4384, MCS channel 1 general purpose register 1 */
#define GTM_MCS4_CH7_R1                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R1 *)0xF01F4384u)

/** \\brief  F4388, MCS channel 1 general purpose register 2 */
#define GTM_MCS4_CH7_R2                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R2 *)0xF01F4388u)

/** \\brief  F438C, MCS channel 1 general purpose register 3 */
#define GTM_MCS4_CH7_R3                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R3 *)0xF01F438Cu)

/** \\brief  F4390, MCS channel 1 general purpose register 4 */
#define GTM_MCS4_CH7_R4                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R4 *)0xF01F4390u)

/** \\brief  F4394, MCS channel 1 general purpose register 5 */
#define GTM_MCS4_CH7_R5                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R5 *)0xF01F4394u)

/** \\brief  F4398, MCS channel 1 general purpose register 6 */
#define GTM_MCS4_CH7_R6                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R6 *)0xF01F4398u)

/** \\brief  F439C, MCS channel 1 general purpose register 7 */
#define GTM_MCS4_CH7_R7                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R7 *)0xF01F439Cu)

/** \\brief  F4064, MCS control and status register */
#define GTM_MCS4_CTRL_STAT             /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CTRL_STAT *)0xF01F4064u)

/** \\brief  F4070, MCS cancel WURM instruction */
#define GTM_MCS4_CWT                   /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CWT *)0xF01F4070u)

/** \\brief  F407C, MCS error register */
#define GTM_MCS4_ERR                   /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_ERR *)0xF01F407Cu)

/** \\brief  F4060, MCS write protection register */
#define GTM_MCS4_REG_PROT              /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_REG_PROT *)0xF01F4060u)

/** \\brief  F4068, MCS reset register */
#define GTM_MCS4_RESET                 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_RESET *)0xF01F4068u)

/** \\brief  F506C, MCS cancel ARU transfer instruction */
#define GTM_MCS5_CAT                   /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CAT *)0xF01F506Cu)

/** \\brief  F5024, MCS channel 0 ARU control Bit register */
#define GTM_MCS5_CH0_ACB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_ACB *)0xF01F5024u)

/** \\brief  F5028, MCS clear trigger control register */
#define GTM_MCS5_CH0_CTRG              /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH0_CTRG *)0xF01F5028u)

/** Alias (User Manual Name) for GTM_MCS5_CH0_CTRG.
 * To use register names with standard convension, please use GTM_MCS5_CH0_CTRG.
 */
#define GTM_MCS5_CTRG                  (GTM_MCS5_CH0_CTRG)

/** Alias (User Manual Name) for GTM_MCS5_CH0_CTRG.
 * To use register names with standard convension, please use GTM_MCS5_CH0_CTRG.
 */
#define GTM_MCS5_CTRG                  (GTM_MCS5_CH0_CTRG)

/** \\brief  F5020, MCS channel 0 control register */
#define GTM_MCS5_CH0_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL *)0xF01F5020u)

/** \\brief  F5054, MCS channel 0 error interrupt enable register */
#define GTM_MCS5_CH0_EIRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN *)0xF01F5054u)

/** \\brief  F5048, MCS channel 0 interrupt enable register */
#define GTM_MCS5_CH0_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN *)0xF01F5048u)

/** \\brief  F504C, MCS channel 0 force interrupt register */
#define GTM_MCS5_CH0_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT *)0xF01F504Cu)

/** \\brief  F5050, MCS channel 0 IRQ mode configuration register */
#define GTM_MCS5_CH0_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE *)0xF01F5050u)

/** \\brief  F5044, MCS channel 0 interrupt notification register */
#define GTM_MCS5_CH0_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY *)0xF01F5044u)

/** \\brief  F503C, MCS channel 0 memory high byte register */
#define GTM_MCS5_CH0_MHB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_MHB *)0xF01F503Cu)

/** \\brief  F5040, MCS channel 0 program counter register */
#define GTM_MCS5_CH0_PC                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_PC *)0xF01F5040u)

/** \\brief  F5000, MCS channel 0 general purpose register 0 */
#define GTM_MCS5_CH0_R0                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R0 *)0xF01F5000u)

/** \\brief  F5004, MCS channel 0 general purpose register 1 */
#define GTM_MCS5_CH0_R1                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R1 *)0xF01F5004u)

/** \\brief  F5008, MCS channel 0 general purpose register 2 */
#define GTM_MCS5_CH0_R2                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R2 *)0xF01F5008u)

/** \\brief  F500C, MCS channel 0 general purpose register 3 */
#define GTM_MCS5_CH0_R3                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R3 *)0xF01F500Cu)

/** \\brief  F5010, MCS channel 0 general purpose register 4 */
#define GTM_MCS5_CH0_R4                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R4 *)0xF01F5010u)

/** \\brief  F5014, MCS channel 0 general purpose register 5 */
#define GTM_MCS5_CH0_R5                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R5 *)0xF01F5014u)

/** \\brief  F5018, MCS channel 0 general purpose register 6 */
#define GTM_MCS5_CH0_R6                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R6 *)0xF01F5018u)

/** \\brief  F501C, MCS channel 0 general purpose register 7 */
#define GTM_MCS5_CH0_R7                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R7 *)0xF01F501Cu)

