Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  F502C, MCS set trigger control register */
#define GTM_MCS5_CH0_STRG              /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH0_STRG *)0xF01F502Cu)

/** Alias (User Manual Name) for GTM_MCS5_CH0_STRG.
 * To use register names with standard convension, please use GTM_MCS5_CH0_STRG.
 */
#define GTM_MCS5_STRG                  (GTM_MCS5_CH0_STRG)

/** Alias (User Manual Name) for GTM_MCS5_CH0_STRG.
 * To use register names with standard convension, please use GTM_MCS5_CH0_STRG.
 */
#define GTM_MCS5_STRG                  (GTM_MCS5_CH0_STRG)

/** \\brief  F50A4, MCS channel 1 ARU control Bit register */
#define GTM_MCS5_CH1_ACB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_ACB *)0xF01F50A4u)

/** \\brief  F50A0, MCS channel 1 control register */
#define GTM_MCS5_CH1_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL *)0xF01F50A0u)

/** \\brief  F50D4, MCS channel 1 error interrupt enable register */
#define GTM_MCS5_CH1_EIRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN *)0xF01F50D4u)

/** \\brief  F50C8, MCS channel 1 interrupt enable register */
#define GTM_MCS5_CH1_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN *)0xF01F50C8u)

/** \\brief  F50CC, MCS channel 1 force interrupt register */
#define GTM_MCS5_CH1_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT *)0xF01F50CCu)

/** \\brief  F50D0, MCS channel 1 IRQ mode configuration register */
#define GTM_MCS5_CH1_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE *)0xF01F50D0u)

/** \\brief  F50C4, MCS channel 1 interrupt notification register */
#define GTM_MCS5_CH1_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY *)0xF01F50C4u)

/** \\brief  F50BC, MCS channel 1 memory high byte register */
#define GTM_MCS5_CH1_MHB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_MHB *)0xF01F50BCu)

/** \\brief  F50C0, MCS channel 1 program counter register */
#define GTM_MCS5_CH1_PC                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_PC *)0xF01F50C0u)

/** \\brief  F5080, MCS channel 1 general purpose register 0 */
#define GTM_MCS5_CH1_R0                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R0 *)0xF01F5080u)

/** \\brief  F5084, MCS channel 1 general purpose register 1 */
#define GTM_MCS5_CH1_R1                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R1 *)0xF01F5084u)

/** \\brief  F5088, MCS channel 1 general purpose register 2 */
#define GTM_MCS5_CH1_R2                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R2 *)0xF01F5088u)

/** \\brief  F508C, MCS channel 1 general purpose register 3 */
#define GTM_MCS5_CH1_R3                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R3 *)0xF01F508Cu)

/** \\brief  F5090, MCS channel 1 general purpose register 4 */
#define GTM_MCS5_CH1_R4                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R4 *)0xF01F5090u)

/** \\brief  F5094, MCS channel 1 general purpose register 5 */
#define GTM_MCS5_CH1_R5                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R5 *)0xF01F5094u)

/** \\brief  F5098, MCS channel 1 general purpose register 6 */
#define GTM_MCS5_CH1_R6                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R6 *)0xF01F5098u)

/** \\brief  F509C, MCS channel 1 general purpose register 7 */
#define GTM_MCS5_CH1_R7                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R7 *)0xF01F509Cu)

/** \\brief  F5124, MCS channel 1 ARU control Bit register */
#define GTM_MCS5_CH2_ACB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_ACB *)0xF01F5124u)

/** \\brief  F5120, MCS channel 1 control register */
#define GTM_MCS5_CH2_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL *)0xF01F5120u)

/** \\brief  F5154, MCS channel 1 error interrupt enable register */
#define GTM_MCS5_CH2_EIRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN *)0xF01F5154u)

/** \\brief  F5148, MCS channel 1 interrupt enable register */
#define GTM_MCS5_CH2_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN *)0xF01F5148u)

/** \\brief  F514C, MCS channel 1 force interrupt register */
#define GTM_MCS5_CH2_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT *)0xF01F514Cu)

/** \\brief  F5150, MCS channel 1 IRQ mode configuration register */
#define GTM_MCS5_CH2_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE *)0xF01F5150u)

/** \\brief  F5144, MCS channel 1 interrupt notification register */
#define GTM_MCS5_CH2_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY *)0xF01F5144u)

/** \\brief  F513C, MCS channel 1 memory high byte register */
#define GTM_MCS5_CH2_MHB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_MHB *)0xF01F513Cu)

/** \\brief  F5140, MCS channel 1 program counter register */
#define GTM_MCS5_CH2_PC                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_PC *)0xF01F5140u)

/** \\brief  F5100, MCS channel 1 general purpose register 0 */
#define GTM_MCS5_CH2_R0                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R0 *)0xF01F5100u)

/** \\brief  F5104, MCS channel 1 general purpose register 1 */
#define GTM_MCS5_CH2_R1                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R1 *)0xF01F5104u)

/** \\brief  F5108, MCS channel 1 general purpose register 2 */
#define GTM_MCS5_CH2_R2                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R2 *)0xF01F5108u)

/** \\brief  F510C, MCS channel 1 general purpose register 3 */
#define GTM_MCS5_CH2_R3                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R3 *)0xF01F510Cu)

/** \\brief  F5110, MCS channel 1 general purpose register 4 */
#define GTM_MCS5_CH2_R4                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R4 *)0xF01F5110u)

/** \\brief  F5114, MCS channel 1 general purpose register 5 */
#define GTM_MCS5_CH2_R5                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R5 *)0xF01F5114u)

/** \\brief  F5118, MCS channel 1 general purpose register 6 */
#define GTM_MCS5_CH2_R6                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R6 *)0xF01F5118u)

/** \\brief  F511C, MCS channel 1 general purpose register 7 */
#define GTM_MCS5_CH2_R7                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R7 *)0xF01F511Cu)

/** \\brief  F51A4, MCS channel 1 ARU control Bit register */
#define GTM_MCS5_CH3_ACB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_ACB *)0xF01F51A4u)

/** \\brief  F51A0, MCS channel 1 control register */
#define GTM_MCS5_CH3_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL *)0xF01F51A0u)

/** \\brief  F51D4, MCS channel 1 error interrupt enable register */
#define GTM_MCS5_CH3_EIRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN *)0xF01F51D4u)

/** \\brief  F51C8, MCS channel 1 interrupt enable register */
#define GTM_MCS5_CH3_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN *)0xF01F51C8u)

/** \\brief  F51CC, MCS channel 1 force interrupt register */
#define GTM_MCS5_CH3_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT *)0xF01F51CCu)

/** \\brief  F51D0, MCS channel 1 IRQ mode configuration register */
#define GTM_MCS5_CH3_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE *)0xF01F51D0u)

/** \\brief  F51C4, MCS channel 1 interrupt notification register */
#define GTM_MCS5_CH3_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY *)0xF01F51C4u)

/** \\brief  F51BC, MCS channel 1 memory high byte register */
#define GTM_MCS5_CH3_MHB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_MHB *)0xF01F51BCu)

/** \\brief  F51C0, MCS channel 1 program counter register */
#define GTM_MCS5_CH3_PC                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_PC *)0xF01F51C0u)

/** \\brief  F5180, MCS channel 1 general purpose register 0 */
#define GTM_MCS5_CH3_R0                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R0 *)0xF01F5180u)

/** \\brief  F5184, MCS channel 1 general purpose register 1 */
#define GTM_MCS5_CH3_R1                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R1 *)0xF01F5184u)

/** \\brief  F5188, MCS channel 1 general purpose register 2 */
#define GTM_MCS5_CH3_R2                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R2 *)0xF01F5188u)

/** \\brief  F518C, MCS channel 1 general purpose register 3 */
#define GTM_MCS5_CH3_R3                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R3 *)0xF01F518Cu)

/** \\brief  F5190, MCS channel 1 general purpose register 4 */
#define GTM_MCS5_CH3_R4                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R4 *)0xF01F5190u)

/** \\brief  F5194, MCS channel 1 general purpose register 5 */
#define GTM_MCS5_CH3_R5                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R5 *)0xF01F5194u)

