Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  F5198, MCS channel 1 general purpose register 6 */
#define GTM_MCS5_CH3_R6                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R6 *)0xF01F5198u)

/** \\brief  F519C, MCS channel 1 general purpose register 7 */
#define GTM_MCS5_CH3_R7                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R7 *)0xF01F519Cu)

/** \\brief  F5224, MCS channel 1 ARU control Bit register */
#define GTM_MCS5_CH4_ACB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_ACB *)0xF01F5224u)

/** \\brief  F5220, MCS channel 1 control register */
#define GTM_MCS5_CH4_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL *)0xF01F5220u)

/** \\brief  F5254, MCS channel 1 error interrupt enable register */
#define GTM_MCS5_CH4_EIRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN *)0xF01F5254u)

/** \\brief  F5248, MCS channel 1 interrupt enable register */
#define GTM_MCS5_CH4_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN *)0xF01F5248u)

/** \\brief  F524C, MCS channel 1 force interrupt register */
#define GTM_MCS5_CH4_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT *)0xF01F524Cu)

/** \\brief  F5250, MCS channel 1 IRQ mode configuration register */
#define GTM_MCS5_CH4_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE *)0xF01F5250u)

/** \\brief  F5244, MCS channel 1 interrupt notification register */
#define GTM_MCS5_CH4_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY *)0xF01F5244u)

/** \\brief  F523C, MCS channel 1 memory high byte register */
#define GTM_MCS5_CH4_MHB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_MHB *)0xF01F523Cu)

/** \\brief  F5240, MCS channel 1 program counter register */
#define GTM_MCS5_CH4_PC                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_PC *)0xF01F5240u)

/** \\brief  F5200, MCS channel 1 general purpose register 0 */
#define GTM_MCS5_CH4_R0                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R0 *)0xF01F5200u)

/** \\brief  F5204, MCS channel 1 general purpose register 1 */
#define GTM_MCS5_CH4_R1                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R1 *)0xF01F5204u)

/** \\brief  F5208, MCS channel 1 general purpose register 2 */
#define GTM_MCS5_CH4_R2                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R2 *)0xF01F5208u)

/** \\brief  F520C, MCS channel 1 general purpose register 3 */
#define GTM_MCS5_CH4_R3                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R3 *)0xF01F520Cu)

/** \\brief  F5210, MCS channel 1 general purpose register 4 */
#define GTM_MCS5_CH4_R4                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R4 *)0xF01F5210u)

/** \\brief  F5214, MCS channel 1 general purpose register 5 */
#define GTM_MCS5_CH4_R5                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R5 *)0xF01F5214u)

/** \\brief  F5218, MCS channel 1 general purpose register 6 */
#define GTM_MCS5_CH4_R6                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R6 *)0xF01F5218u)

/** \\brief  F521C, MCS channel 1 general purpose register 7 */
#define GTM_MCS5_CH4_R7                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R7 *)0xF01F521Cu)

/** \\brief  F52A4, MCS channel 1 ARU control Bit register */
#define GTM_MCS5_CH5_ACB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_ACB *)0xF01F52A4u)

/** \\brief  F52A0, MCS channel 1 control register */
#define GTM_MCS5_CH5_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL *)0xF01F52A0u)

/** \\brief  F52D4, MCS channel 1 error interrupt enable register */
#define GTM_MCS5_CH5_EIRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN *)0xF01F52D4u)

/** \\brief  F52C8, MCS channel 1 interrupt enable register */
#define GTM_MCS5_CH5_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN *)0xF01F52C8u)

/** \\brief  F52CC, MCS channel 1 force interrupt register */
#define GTM_MCS5_CH5_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT *)0xF01F52CCu)

/** \\brief  F52D0, MCS channel 1 IRQ mode configuration register */
#define GTM_MCS5_CH5_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE *)0xF01F52D0u)

/** \\brief  F52C4, MCS channel 1 interrupt notification register */
#define GTM_MCS5_CH5_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY *)0xF01F52C4u)

/** \\brief  F52BC, MCS channel 1 memory high byte register */
#define GTM_MCS5_CH5_MHB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_MHB *)0xF01F52BCu)

/** \\brief  F52C0, MCS channel 1 program counter register */
#define GTM_MCS5_CH5_PC                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_PC *)0xF01F52C0u)

/** \\brief  F5280, MCS channel 1 general purpose register 0 */
#define GTM_MCS5_CH5_R0                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R0 *)0xF01F5280u)

/** \\brief  F5284, MCS channel 1 general purpose register 1 */
#define GTM_MCS5_CH5_R1                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R1 *)0xF01F5284u)

/** \\brief  F5288, MCS channel 1 general purpose register 2 */
#define GTM_MCS5_CH5_R2                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R2 *)0xF01F5288u)

/** \\brief  F528C, MCS channel 1 general purpose register 3 */
#define GTM_MCS5_CH5_R3                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R3 *)0xF01F528Cu)

/** \\brief  F5290, MCS channel 1 general purpose register 4 */
#define GTM_MCS5_CH5_R4                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R4 *)0xF01F5290u)

/** \\brief  F5294, MCS channel 1 general purpose register 5 */
#define GTM_MCS5_CH5_R5                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R5 *)0xF01F5294u)

/** \\brief  F5298, MCS channel 1 general purpose register 6 */
#define GTM_MCS5_CH5_R6                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R6 *)0xF01F5298u)

/** \\brief  F529C, MCS channel 1 general purpose register 7 */
#define GTM_MCS5_CH5_R7                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R7 *)0xF01F529Cu)

/** \\brief  F5324, MCS channel 1 ARU control Bit register */
#define GTM_MCS5_CH6_ACB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_ACB *)0xF01F5324u)

/** \\brief  F5320, MCS channel 1 control register */
#define GTM_MCS5_CH6_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL *)0xF01F5320u)

/** \\brief  F5354, MCS channel 1 error interrupt enable register */
#define GTM_MCS5_CH6_EIRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN *)0xF01F5354u)

/** \\brief  F5348, MCS channel 1 interrupt enable register */
#define GTM_MCS5_CH6_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN *)0xF01F5348u)

/** \\brief  F534C, MCS channel 1 force interrupt register */
#define GTM_MCS5_CH6_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT *)0xF01F534Cu)

/** \\brief  F5350, MCS channel 1 IRQ mode configuration register */
#define GTM_MCS5_CH6_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE *)0xF01F5350u)

/** \\brief  F5344, MCS channel 1 interrupt notification register */
#define GTM_MCS5_CH6_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY *)0xF01F5344u)

/** \\brief  F533C, MCS channel 1 memory high byte register */
#define GTM_MCS5_CH6_MHB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_MHB *)0xF01F533Cu)

/** \\brief  F5340, MCS channel 1 program counter register */
#define GTM_MCS5_CH6_PC                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_PC *)0xF01F5340u)

/** \\brief  F5300, MCS channel 1 general purpose register 0 */
#define GTM_MCS5_CH6_R0                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R0 *)0xF01F5300u)

/** \\brief  F5304, MCS channel 1 general purpose register 1 */
#define GTM_MCS5_CH6_R1                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R1 *)0xF01F5304u)

