Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  F5308, MCS channel 1 general purpose register 2 */
#define GTM_MCS5_CH6_R2                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R2 *)0xF01F5308u)

/** \\brief  F530C, MCS channel 1 general purpose register 3 */
#define GTM_MCS5_CH6_R3                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R3 *)0xF01F530Cu)

/** \\brief  F5310, MCS channel 1 general purpose register 4 */
#define GTM_MCS5_CH6_R4                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R4 *)0xF01F5310u)

/** \\brief  F5314, MCS channel 1 general purpose register 5 */
#define GTM_MCS5_CH6_R5                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R5 *)0xF01F5314u)

/** \\brief  F5318, MCS channel 1 general purpose register 6 */
#define GTM_MCS5_CH6_R6                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R6 *)0xF01F5318u)

/** \\brief  F531C, MCS channel 1 general purpose register 7 */
#define GTM_MCS5_CH6_R7                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R7 *)0xF01F531Cu)

/** \\brief  F53A4, MCS channel 1 ARU control Bit register */
#define GTM_MCS5_CH7_ACB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_ACB *)0xF01F53A4u)

/** \\brief  F53A0, MCS channel 1 control register */
#define GTM_MCS5_CH7_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL *)0xF01F53A0u)

/** \\brief  F53D4, MCS channel 1 error interrupt enable register */
#define GTM_MCS5_CH7_EIRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN *)0xF01F53D4u)

/** \\brief  F53C8, MCS channel 1 interrupt enable register */
#define GTM_MCS5_CH7_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN *)0xF01F53C8u)

/** \\brief  F53CC, MCS channel 1 force interrupt register */
#define GTM_MCS5_CH7_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT *)0xF01F53CCu)

/** \\brief  F53D0, MCS channel 1 IRQ mode configuration register */
#define GTM_MCS5_CH7_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE *)0xF01F53D0u)

/** \\brief  F53C4, MCS channel 1 interrupt notification register */
#define GTM_MCS5_CH7_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY *)0xF01F53C4u)

/** \\brief  F53BC, MCS channel 1 memory high byte register */
#define GTM_MCS5_CH7_MHB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_MHB *)0xF01F53BCu)

/** \\brief  F53C0, MCS channel 1 program counter register */
#define GTM_MCS5_CH7_PC                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_PC *)0xF01F53C0u)

/** \\brief  F5380, MCS channel 1 general purpose register 0 */
#define GTM_MCS5_CH7_R0                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R0 *)0xF01F5380u)

/** \\brief  F5384, MCS channel 1 general purpose register 1 */
#define GTM_MCS5_CH7_R1                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R1 *)0xF01F5384u)

/** \\brief  F5388, MCS channel 1 general purpose register 2 */
#define GTM_MCS5_CH7_R2                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R2 *)0xF01F5388u)

/** \\brief  F538C, MCS channel 1 general purpose register 3 */
#define GTM_MCS5_CH7_R3                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R3 *)0xF01F538Cu)

/** \\brief  F5390, MCS channel 1 general purpose register 4 */
#define GTM_MCS5_CH7_R4                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R4 *)0xF01F5390u)

/** \\brief  F5394, MCS channel 1 general purpose register 5 */
#define GTM_MCS5_CH7_R5                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R5 *)0xF01F5394u)

/** \\brief  F5398, MCS channel 1 general purpose register 6 */
#define GTM_MCS5_CH7_R6                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R6 *)0xF01F5398u)

/** \\brief  F539C, MCS channel 1 general purpose register 7 */
#define GTM_MCS5_CH7_R7                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R7 *)0xF01F539Cu)

/** \\brief  F5064, MCS control and status register */
#define GTM_MCS5_CTRL_STAT             /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CTRL_STAT *)0xF01F5064u)

/** \\brief  F5070, MCS cancel WURM instruction */
#define GTM_MCS5_CWT                   /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CWT *)0xF01F5070u)

/** \\brief  F507C, MCS error register */
#define GTM_MCS5_ERR                   /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_ERR *)0xF01F507Cu)

/** \\brief  F5060, MCS write protection register */
#define GTM_MCS5_REG_PROT              /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_REG_PROT *)0xF01F5060u)

/** \\brief  F5068, MCS reset register */
#define GTM_MCS5_RESET                 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_RESET *)0xF01F5068u)

/** \\brief  F606C, MCS cancel ARU transfer instruction */
#define GTM_MCS6_CAT                   /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CAT *)0xF01F606Cu)

/** \\brief  F6024, MCS channel 0 ARU control Bit register */
#define GTM_MCS6_CH0_ACB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_ACB *)0xF01F6024u)

/** \\brief  F6028, MCS clear trigger control register */
#define GTM_MCS6_CH0_CTRG              /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH0_CTRG *)0xF01F6028u)

/** Alias (User Manual Name) for GTM_MCS6_CH0_CTRG.
 * To use register names with standard convension, please use GTM_MCS6_CH0_CTRG.
 */
#define GTM_MCS6_CTRG                  (GTM_MCS6_CH0_CTRG)

/** Alias (User Manual Name) for GTM_MCS6_CH0_CTRG.
 * To use register names with standard convension, please use GTM_MCS6_CH0_CTRG.
 */
#define GTM_MCS6_CTRG                  (GTM_MCS6_CH0_CTRG)

/** \\brief  F6020, MCS channel 0 control register */
#define GTM_MCS6_CH0_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL *)0xF01F6020u)

/** \\brief  F6054, MCS channel 0 error interrupt enable register */
#define GTM_MCS6_CH0_EIRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN *)0xF01F6054u)

/** \\brief  F6048, MCS channel 0 interrupt enable register */
#define GTM_MCS6_CH0_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN *)0xF01F6048u)

/** \\brief  F604C, MCS channel 0 force interrupt register */
#define GTM_MCS6_CH0_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT *)0xF01F604Cu)

/** \\brief  F6050, MCS channel 0 IRQ mode configuration register */
#define GTM_MCS6_CH0_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE *)0xF01F6050u)

/** \\brief  F6044, MCS channel 0 interrupt notification register */
#define GTM_MCS6_CH0_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY *)0xF01F6044u)

/** \\brief  F603C, MCS channel 0 memory high byte register */
#define GTM_MCS6_CH0_MHB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_MHB *)0xF01F603Cu)

/** \\brief  F6040, MCS channel 0 program counter register */
#define GTM_MCS6_CH0_PC                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_PC *)0xF01F6040u)

