Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  F6000, MCS channel 0 general purpose register 0 */
#define GTM_MCS6_CH0_R0                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R0 *)0xF01F6000u)

/** \\brief  F6004, MCS channel 0 general purpose register 1 */
#define GTM_MCS6_CH0_R1                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R1 *)0xF01F6004u)

/** \\brief  F6008, MCS channel 0 general purpose register 2 */
#define GTM_MCS6_CH0_R2                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R2 *)0xF01F6008u)

/** \\brief  F600C, MCS channel 0 general purpose register 3 */
#define GTM_MCS6_CH0_R3                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R3 *)0xF01F600Cu)

/** \\brief  F6010, MCS channel 0 general purpose register 4 */
#define GTM_MCS6_CH0_R4                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R4 *)0xF01F6010u)

/** \\brief  F6014, MCS channel 0 general purpose register 5 */
#define GTM_MCS6_CH0_R5                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R5 *)0xF01F6014u)

/** \\brief  F6018, MCS channel 0 general purpose register 6 */
#define GTM_MCS6_CH0_R6                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R6 *)0xF01F6018u)

/** \\brief  F601C, MCS channel 0 general purpose register 7 */
#define GTM_MCS6_CH0_R7                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R7 *)0xF01F601Cu)

/** \\brief  F602C, MCS set trigger control register */
#define GTM_MCS6_CH0_STRG              /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH0_STRG *)0xF01F602Cu)

/** Alias (User Manual Name) for GTM_MCS6_CH0_STRG.
 * To use register names with standard convension, please use GTM_MCS6_CH0_STRG.
 */
#define GTM_MCS6_STRG                  (GTM_MCS6_CH0_STRG)

/** Alias (User Manual Name) for GTM_MCS6_CH0_STRG.
 * To use register names with standard convension, please use GTM_MCS6_CH0_STRG.
 */
#define GTM_MCS6_STRG                  (GTM_MCS6_CH0_STRG)

/** \\brief  F60A4, MCS channel 1 ARU control Bit register */
#define GTM_MCS6_CH1_ACB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_ACB *)0xF01F60A4u)

/** \\brief  F60A0, MCS channel 1 control register */
#define GTM_MCS6_CH1_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL *)0xF01F60A0u)

/** \\brief  F60D4, MCS channel 1 error interrupt enable register */
#define GTM_MCS6_CH1_EIRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN *)0xF01F60D4u)

/** \\brief  F60C8, MCS channel 1 interrupt enable register */
#define GTM_MCS6_CH1_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN *)0xF01F60C8u)

/** \\brief  F60CC, MCS channel 1 force interrupt register */
#define GTM_MCS6_CH1_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT *)0xF01F60CCu)

/** \\brief  F60D0, MCS channel 1 IRQ mode configuration register */
#define GTM_MCS6_CH1_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE *)0xF01F60D0u)

/** \\brief  F60C4, MCS channel 1 interrupt notification register */
#define GTM_MCS6_CH1_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY *)0xF01F60C4u)

/** \\brief  F60BC, MCS channel 1 memory high byte register */
#define GTM_MCS6_CH1_MHB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_MHB *)0xF01F60BCu)

/** \\brief  F60C0, MCS channel 1 program counter register */
#define GTM_MCS6_CH1_PC                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_PC *)0xF01F60C0u)

/** \\brief  F6080, MCS channel 1 general purpose register 0 */
#define GTM_MCS6_CH1_R0                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R0 *)0xF01F6080u)

/** \\brief  F6084, MCS channel 1 general purpose register 1 */
#define GTM_MCS6_CH1_R1                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R1 *)0xF01F6084u)

/** \\brief  F6088, MCS channel 1 general purpose register 2 */
#define GTM_MCS6_CH1_R2                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R2 *)0xF01F6088u)

/** \\brief  F608C, MCS channel 1 general purpose register 3 */
#define GTM_MCS6_CH1_R3                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R3 *)0xF01F608Cu)

/** \\brief  F6090, MCS channel 1 general purpose register 4 */
#define GTM_MCS6_CH1_R4                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R4 *)0xF01F6090u)

/** \\brief  F6094, MCS channel 1 general purpose register 5 */
#define GTM_MCS6_CH1_R5                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R5 *)0xF01F6094u)

/** \\brief  F6098, MCS channel 1 general purpose register 6 */
#define GTM_MCS6_CH1_R6                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R6 *)0xF01F6098u)

/** \\brief  F609C, MCS channel 1 general purpose register 7 */
#define GTM_MCS6_CH1_R7                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R7 *)0xF01F609Cu)

/** \\brief  F6124, MCS channel 1 ARU control Bit register */
#define GTM_MCS6_CH2_ACB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_ACB *)0xF01F6124u)

/** \\brief  F6120, MCS channel 1 control register */
#define GTM_MCS6_CH2_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL *)0xF01F6120u)

/** \\brief  F6154, MCS channel 1 error interrupt enable register */
#define GTM_MCS6_CH2_EIRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN *)0xF01F6154u)

/** \\brief  F6148, MCS channel 1 interrupt enable register */
#define GTM_MCS6_CH2_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN *)0xF01F6148u)

/** \\brief  F614C, MCS channel 1 force interrupt register */
#define GTM_MCS6_CH2_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT *)0xF01F614Cu)

/** \\brief  F6150, MCS channel 1 IRQ mode configuration register */
#define GTM_MCS6_CH2_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE *)0xF01F6150u)

/** \\brief  F6144, MCS channel 1 interrupt notification register */
#define GTM_MCS6_CH2_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY *)0xF01F6144u)

/** \\brief  F613C, MCS channel 1 memory high byte register */
#define GTM_MCS6_CH2_MHB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_MHB *)0xF01F613Cu)

