Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  F6140, MCS channel 1 program counter register */
#define GTM_MCS6_CH2_PC                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_PC *)0xF01F6140u)

/** \\brief  F6100, MCS channel 1 general purpose register 0 */
#define GTM_MCS6_CH2_R0                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R0 *)0xF01F6100u)

/** \\brief  F6104, MCS channel 1 general purpose register 1 */
#define GTM_MCS6_CH2_R1                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R1 *)0xF01F6104u)

/** \\brief  F6108, MCS channel 1 general purpose register 2 */
#define GTM_MCS6_CH2_R2                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R2 *)0xF01F6108u)

/** \\brief  F610C, MCS channel 1 general purpose register 3 */
#define GTM_MCS6_CH2_R3                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R3 *)0xF01F610Cu)

/** \\brief  F6110, MCS channel 1 general purpose register 4 */
#define GTM_MCS6_CH2_R4                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R4 *)0xF01F6110u)

/** \\brief  F6114, MCS channel 1 general purpose register 5 */
#define GTM_MCS6_CH2_R5                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R5 *)0xF01F6114u)

/** \\brief  F6118, MCS channel 1 general purpose register 6 */
#define GTM_MCS6_CH2_R6                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R6 *)0xF01F6118u)

/** \\brief  F611C, MCS channel 1 general purpose register 7 */
#define GTM_MCS6_CH2_R7                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R7 *)0xF01F611Cu)

/** \\brief  F61A4, MCS channel 1 ARU control Bit register */
#define GTM_MCS6_CH3_ACB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_ACB *)0xF01F61A4u)

/** \\brief  F61A0, MCS channel 1 control register */
#define GTM_MCS6_CH3_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL *)0xF01F61A0u)

/** \\brief  F61D4, MCS channel 1 error interrupt enable register */
#define GTM_MCS6_CH3_EIRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN *)0xF01F61D4u)

/** \\brief  F61C8, MCS channel 1 interrupt enable register */
#define GTM_MCS6_CH3_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN *)0xF01F61C8u)

/** \\brief  F61CC, MCS channel 1 force interrupt register */
#define GTM_MCS6_CH3_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT *)0xF01F61CCu)

/** \\brief  F61D0, MCS channel 1 IRQ mode configuration register */
#define GTM_MCS6_CH3_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE *)0xF01F61D0u)

/** \\brief  F61C4, MCS channel 1 interrupt notification register */
#define GTM_MCS6_CH3_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY *)0xF01F61C4u)

/** \\brief  F61BC, MCS channel 1 memory high byte register */
#define GTM_MCS6_CH3_MHB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_MHB *)0xF01F61BCu)

/** \\brief  F61C0, MCS channel 1 program counter register */
#define GTM_MCS6_CH3_PC                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_PC *)0xF01F61C0u)

/** \\brief  F6180, MCS channel 1 general purpose register 0 */
#define GTM_MCS6_CH3_R0                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R0 *)0xF01F6180u)

/** \\brief  F6184, MCS channel 1 general purpose register 1 */
#define GTM_MCS6_CH3_R1                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R1 *)0xF01F6184u)

/** \\brief  F6188, MCS channel 1 general purpose register 2 */
#define GTM_MCS6_CH3_R2                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R2 *)0xF01F6188u)

/** \\brief  F618C, MCS channel 1 general purpose register 3 */
#define GTM_MCS6_CH3_R3                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R3 *)0xF01F618Cu)

/** \\brief  F6190, MCS channel 1 general purpose register 4 */
#define GTM_MCS6_CH3_R4                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R4 *)0xF01F6190u)

/** \\brief  F6194, MCS channel 1 general purpose register 5 */
#define GTM_MCS6_CH3_R5                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R5 *)0xF01F6194u)

/** \\brief  F6198, MCS channel 1 general purpose register 6 */
#define GTM_MCS6_CH3_R6                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R6 *)0xF01F6198u)

/** \\brief  F619C, MCS channel 1 general purpose register 7 */
#define GTM_MCS6_CH3_R7                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R7 *)0xF01F619Cu)

/** \\brief  F6224, MCS channel 1 ARU control Bit register */
#define GTM_MCS6_CH4_ACB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_ACB *)0xF01F6224u)

/** \\brief  F6220, MCS channel 1 control register */
#define GTM_MCS6_CH4_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL *)0xF01F6220u)

/** \\brief  F6254, MCS channel 1 error interrupt enable register */
#define GTM_MCS6_CH4_EIRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN *)0xF01F6254u)

/** \\brief  F6248, MCS channel 1 interrupt enable register */
#define GTM_MCS6_CH4_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN *)0xF01F6248u)

/** \\brief  F624C, MCS channel 1 force interrupt register */
#define GTM_MCS6_CH4_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT *)0xF01F624Cu)

/** \\brief  F6250, MCS channel 1 IRQ mode configuration register */
#define GTM_MCS6_CH4_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE *)0xF01F6250u)

/** \\brief  F6244, MCS channel 1 interrupt notification register */
#define GTM_MCS6_CH4_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY *)0xF01F6244u)

/** \\brief  F623C, MCS channel 1 memory high byte register */
#define GTM_MCS6_CH4_MHB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_MHB *)0xF01F623Cu)

/** \\brief  F6240, MCS channel 1 program counter register */
#define GTM_MCS6_CH4_PC                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_PC *)0xF01F6240u)

/** \\brief  F6200, MCS channel 1 general purpose register 0 */
#define GTM_MCS6_CH4_R0                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R0 *)0xF01F6200u)

/** \\brief  F6204, MCS channel 1 general purpose register 1 */
#define GTM_MCS6_CH4_R1                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R1 *)0xF01F6204u)

