Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  F6208, MCS channel 1 general purpose register 2 */
#define GTM_MCS6_CH4_R2                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R2 *)0xF01F6208u)

/** \\brief  F620C, MCS channel 1 general purpose register 3 */
#define GTM_MCS6_CH4_R3                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R3 *)0xF01F620Cu)

/** \\brief  F6210, MCS channel 1 general purpose register 4 */
#define GTM_MCS6_CH4_R4                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R4 *)0xF01F6210u)

/** \\brief  F6214, MCS channel 1 general purpose register 5 */
#define GTM_MCS6_CH4_R5                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R5 *)0xF01F6214u)

/** \\brief  F6218, MCS channel 1 general purpose register 6 */
#define GTM_MCS6_CH4_R6                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R6 *)0xF01F6218u)

/** \\brief  F621C, MCS channel 1 general purpose register 7 */
#define GTM_MCS6_CH4_R7                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R7 *)0xF01F621Cu)

/** \\brief  F62A4, MCS channel 1 ARU control Bit register */
#define GTM_MCS6_CH5_ACB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_ACB *)0xF01F62A4u)

/** \\brief  F62A0, MCS channel 1 control register */
#define GTM_MCS6_CH5_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL *)0xF01F62A0u)

/** \\brief  F62D4, MCS channel 1 error interrupt enable register */
#define GTM_MCS6_CH5_EIRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN *)0xF01F62D4u)

/** \\brief  F62C8, MCS channel 1 interrupt enable register */
#define GTM_MCS6_CH5_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN *)0xF01F62C8u)

/** \\brief  F62CC, MCS channel 1 force interrupt register */
#define GTM_MCS6_CH5_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT *)0xF01F62CCu)

/** \\brief  F62D0, MCS channel 1 IRQ mode configuration register */
#define GTM_MCS6_CH5_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE *)0xF01F62D0u)

/** \\brief  F62C4, MCS channel 1 interrupt notification register */
#define GTM_MCS6_CH5_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY *)0xF01F62C4u)

/** \\brief  F62BC, MCS channel 1 memory high byte register */
#define GTM_MCS6_CH5_MHB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_MHB *)0xF01F62BCu)

/** \\brief  F62C0, MCS channel 1 program counter register */
#define GTM_MCS6_CH5_PC                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_PC *)0xF01F62C0u)

/** \\brief  F6280, MCS channel 1 general purpose register 0 */
#define GTM_MCS6_CH5_R0                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R0 *)0xF01F6280u)

/** \\brief  F6284, MCS channel 1 general purpose register 1 */
#define GTM_MCS6_CH5_R1                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R1 *)0xF01F6284u)

/** \\brief  F6288, MCS channel 1 general purpose register 2 */
#define GTM_MCS6_CH5_R2                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R2 *)0xF01F6288u)

/** \\brief  F628C, MCS channel 1 general purpose register 3 */
#define GTM_MCS6_CH5_R3                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R3 *)0xF01F628Cu)

/** \\brief  F6290, MCS channel 1 general purpose register 4 */
#define GTM_MCS6_CH5_R4                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R4 *)0xF01F6290u)

/** \\brief  F6294, MCS channel 1 general purpose register 5 */
#define GTM_MCS6_CH5_R5                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R5 *)0xF01F6294u)

/** \\brief  F6298, MCS channel 1 general purpose register 6 */
#define GTM_MCS6_CH5_R6                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R6 *)0xF01F6298u)

/** \\brief  F629C, MCS channel 1 general purpose register 7 */
#define GTM_MCS6_CH5_R7                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R7 *)0xF01F629Cu)

/** \\brief  F6324, MCS channel 1 ARU control Bit register */
#define GTM_MCS6_CH6_ACB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_ACB *)0xF01F6324u)

/** \\brief  F6320, MCS channel 1 control register */
#define GTM_MCS6_CH6_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL *)0xF01F6320u)

/** \\brief  F6354, MCS channel 1 error interrupt enable register */
#define GTM_MCS6_CH6_EIRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN *)0xF01F6354u)

/** \\brief  F6348, MCS channel 1 interrupt enable register */
#define GTM_MCS6_CH6_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN *)0xF01F6348u)

/** \\brief  F634C, MCS channel 1 force interrupt register */
#define GTM_MCS6_CH6_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT *)0xF01F634Cu)

/** \\brief  F6350, MCS channel 1 IRQ mode configuration register */
#define GTM_MCS6_CH6_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE *)0xF01F6350u)

/** \\brief  F6344, MCS channel 1 interrupt notification register */
#define GTM_MCS6_CH6_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY *)0xF01F6344u)

/** \\brief  F633C, MCS channel 1 memory high byte register */
#define GTM_MCS6_CH6_MHB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_MHB *)0xF01F633Cu)

/** \\brief  F6340, MCS channel 1 program counter register */
#define GTM_MCS6_CH6_PC                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_PC *)0xF01F6340u)

/** \\brief  F6300, MCS channel 1 general purpose register 0 */
#define GTM_MCS6_CH6_R0                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R0 *)0xF01F6300u)

/** \\brief  F6304, MCS channel 1 general purpose register 1 */
#define GTM_MCS6_CH6_R1                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R1 *)0xF01F6304u)

/** \\brief  F6308, MCS channel 1 general purpose register 2 */
#define GTM_MCS6_CH6_R2                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R2 *)0xF01F6308u)

/** \\brief  F630C, MCS channel 1 general purpose register 3 */
#define GTM_MCS6_CH6_R3                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R3 *)0xF01F630Cu)

/** \\brief  F6310, MCS channel 1 general purpose register 4 */
#define GTM_MCS6_CH6_R4                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R4 *)0xF01F6310u)

/** \\brief  F6314, MCS channel 1 general purpose register 5 */
#define GTM_MCS6_CH6_R5                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R5 *)0xF01F6314u)

/** \\brief  F6318, MCS channel 1 general purpose register 6 */
#define GTM_MCS6_CH6_R6                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R6 *)0xF01F6318u)

/** \\brief  F631C, MCS channel 1 general purpose register 7 */
#define GTM_MCS6_CH6_R7                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R7 *)0xF01F631Cu)

/** \\brief  F63A4, MCS channel 1 ARU control Bit register */
#define GTM_MCS6_CH7_ACB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_ACB *)0xF01F63A4u)

/** \\brief  F63A0, MCS channel 1 control register */
#define GTM_MCS6_CH7_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL *)0xF01F63A0u)

/** \\brief  F63D4, MCS channel 1 error interrupt enable register */
#define GTM_MCS6_CH7_EIRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN *)0xF01F63D4u)

/** \\brief  F63C8, MCS channel 1 interrupt enable register */
#define GTM_MCS6_CH7_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN *)0xF01F63C8u)

/** \\brief  F63CC, MCS channel 1 force interrupt register */
#define GTM_MCS6_CH7_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT *)0xF01F63CCu)

/** \\brief  F63D0, MCS channel 1 IRQ mode configuration register */
#define GTM_MCS6_CH7_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE *)0xF01F63D0u)

/** \\brief  F63C4, MCS channel 1 interrupt notification register */
#define GTM_MCS6_CH7_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY *)0xF01F63C4u)

