Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  F63BC, MCS channel 1 memory high byte register */
#define GTM_MCS6_CH7_MHB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_MHB *)0xF01F63BCu)

/** \\brief  F63C0, MCS channel 1 program counter register */
#define GTM_MCS6_CH7_PC                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_PC *)0xF01F63C0u)

/** \\brief  F6380, MCS channel 1 general purpose register 0 */
#define GTM_MCS6_CH7_R0                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R0 *)0xF01F6380u)

/** \\brief  F6384, MCS channel 1 general purpose register 1 */
#define GTM_MCS6_CH7_R1                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R1 *)0xF01F6384u)

/** \\brief  F6388, MCS channel 1 general purpose register 2 */
#define GTM_MCS6_CH7_R2                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R2 *)0xF01F6388u)

/** \\brief  F638C, MCS channel 1 general purpose register 3 */
#define GTM_MCS6_CH7_R3                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R3 *)0xF01F638Cu)

/** \\brief  F6390, MCS channel 1 general purpose register 4 */
#define GTM_MCS6_CH7_R4                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R4 *)0xF01F6390u)

/** \\brief  F6394, MCS channel 1 general purpose register 5 */
#define GTM_MCS6_CH7_R5                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R5 *)0xF01F6394u)

/** \\brief  F6398, MCS channel 1 general purpose register 6 */
#define GTM_MCS6_CH7_R6                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R6 *)0xF01F6398u)

/** \\brief  F639C, MCS channel 1 general purpose register 7 */
#define GTM_MCS6_CH7_R7                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R7 *)0xF01F639Cu)

/** \\brief  F6064, MCS control and status register */
#define GTM_MCS6_CTRL_STAT             /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CTRL_STAT *)0xF01F6064u)

/** \\brief  F6070, MCS cancel WURM instruction */
#define GTM_MCS6_CWT                   /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CWT *)0xF01F6070u)

/** \\brief  F607C, MCS error register */
#define GTM_MCS6_ERR                   /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_ERR *)0xF01F607Cu)

/** \\brief  F6060, MCS write protection register */
#define GTM_MCS6_REG_PROT              /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_REG_PROT *)0xF01F6060u)

/** \\brief  F6068, MCS reset register */
#define GTM_MCS6_RESET                 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_RESET *)0xF01F6068u)

/** \\brief  F706C, MCS cancel ARU transfer instruction */
#define GTM_MCS7_CAT                   /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CAT *)0xF01F706Cu)

/** \\brief  F7024, MCS channel 0 ARU control Bit register */
#define GTM_MCS7_CH0_ACB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_ACB *)0xF01F7024u)

/** \\brief  F7028, MCS clear trigger control register */
#define GTM_MCS7_CH0_CTRG              /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH0_CTRG *)0xF01F7028u)

/** Alias (User Manual Name) for GTM_MCS7_CH0_CTRG.
 * To use register names with standard convension, please use GTM_MCS7_CH0_CTRG.
 */
#define GTM_MCS7_CTRG                  (GTM_MCS7_CH0_CTRG)

/** Alias (User Manual Name) for GTM_MCS7_CH0_CTRG.
 * To use register names with standard convension, please use GTM_MCS7_CH0_CTRG.
 */
#define GTM_MCS7_CTRG                  (GTM_MCS7_CH0_CTRG)

/** \\brief  F7020, MCS channel 0 control register */
#define GTM_MCS7_CH0_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL *)0xF01F7020u)

/** \\brief  F7054, MCS channel 0 error interrupt enable register */
#define GTM_MCS7_CH0_EIRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN *)0xF01F7054u)

/** \\brief  F7048, MCS channel 0 interrupt enable register */
#define GTM_MCS7_CH0_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN *)0xF01F7048u)

/** \\brief  F704C, MCS channel 0 force interrupt register */
#define GTM_MCS7_CH0_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT *)0xF01F704Cu)

/** \\brief  F7050, MCS channel 0 IRQ mode configuration register */
#define GTM_MCS7_CH0_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE *)0xF01F7050u)

/** \\brief  F7044, MCS channel 0 interrupt notification register */
#define GTM_MCS7_CH0_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY *)0xF01F7044u)

/** \\brief  F703C, MCS channel 0 memory high byte register */
#define GTM_MCS7_CH0_MHB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_MHB *)0xF01F703Cu)

/** \\brief  F7040, MCS channel 0 program counter register */
#define GTM_MCS7_CH0_PC                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_PC *)0xF01F7040u)

/** \\brief  F7000, MCS channel 0 general purpose register 0 */
#define GTM_MCS7_CH0_R0                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R0 *)0xF01F7000u)

/** \\brief  F7004, MCS channel 0 general purpose register 1 */
#define GTM_MCS7_CH0_R1                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R1 *)0xF01F7004u)

/** \\brief  F7008, MCS channel 0 general purpose register 2 */
#define GTM_MCS7_CH0_R2                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R2 *)0xF01F7008u)

/** \\brief  F700C, MCS channel 0 general purpose register 3 */
#define GTM_MCS7_CH0_R3                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R3 *)0xF01F700Cu)

/** \\brief  F7010, MCS channel 0 general purpose register 4 */
#define GTM_MCS7_CH0_R4                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R4 *)0xF01F7010u)

/** \\brief  F7014, MCS channel 0 general purpose register 5 */
#define GTM_MCS7_CH0_R5                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R5 *)0xF01F7014u)

/** \\brief  F7018, MCS channel 0 general purpose register 6 */
#define GTM_MCS7_CH0_R6                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R6 *)0xF01F7018u)

/** \\brief  F701C, MCS channel 0 general purpose register 7 */
#define GTM_MCS7_CH0_R7                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R7 *)0xF01F701Cu)

/** \\brief  F702C, MCS set trigger control register */
#define GTM_MCS7_CH0_STRG              /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH0_STRG *)0xF01F702Cu)

