Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** Alias (User Manual Name) for GTM_MCS7_CH0_STRG.
 * To use register names with standard convension, please use GTM_MCS7_CH0_STRG.
 */
#define GTM_MCS7_STRG                  (GTM_MCS7_CH0_STRG)

/** Alias (User Manual Name) for GTM_MCS7_CH0_STRG.
 * To use register names with standard convension, please use GTM_MCS7_CH0_STRG.
 */
#define GTM_MCS7_STRG                  (GTM_MCS7_CH0_STRG)

/** \\brief  F70A4, MCS channel 1 ARU control Bit register */
#define GTM_MCS7_CH1_ACB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_ACB *)0xF01F70A4u)

/** \\brief  F70A0, MCS channel 1 control register */
#define GTM_MCS7_CH1_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL *)0xF01F70A0u)

/** \\brief  F70D4, MCS channel 1 error interrupt enable register */
#define GTM_MCS7_CH1_EIRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN *)0xF01F70D4u)

/** \\brief  F70C8, MCS channel 1 interrupt enable register */
#define GTM_MCS7_CH1_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN *)0xF01F70C8u)

/** \\brief  F70CC, MCS channel 1 force interrupt register */
#define GTM_MCS7_CH1_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT *)0xF01F70CCu)

/** \\brief  F70D0, MCS channel 1 IRQ mode configuration register */
#define GTM_MCS7_CH1_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE *)0xF01F70D0u)

/** \\brief  F70C4, MCS channel 1 interrupt notification register */
#define GTM_MCS7_CH1_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY *)0xF01F70C4u)

/** \\brief  F70BC, MCS channel 1 memory high byte register */
#define GTM_MCS7_CH1_MHB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_MHB *)0xF01F70BCu)

/** \\brief  F70C0, MCS channel 1 program counter register */
#define GTM_MCS7_CH1_PC                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_PC *)0xF01F70C0u)

/** \\brief  F7080, MCS channel 1 general purpose register 0 */
#define GTM_MCS7_CH1_R0                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R0 *)0xF01F7080u)

/** \\brief  F7084, MCS channel 1 general purpose register 1 */
#define GTM_MCS7_CH1_R1                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R1 *)0xF01F7084u)

/** \\brief  F7088, MCS channel 1 general purpose register 2 */
#define GTM_MCS7_CH1_R2                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R2 *)0xF01F7088u)

/** \\brief  F708C, MCS channel 1 general purpose register 3 */
#define GTM_MCS7_CH1_R3                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R3 *)0xF01F708Cu)

/** \\brief  F7090, MCS channel 1 general purpose register 4 */
#define GTM_MCS7_CH1_R4                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R4 *)0xF01F7090u)

/** \\brief  F7094, MCS channel 1 general purpose register 5 */
#define GTM_MCS7_CH1_R5                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R5 *)0xF01F7094u)

/** \\brief  F7098, MCS channel 1 general purpose register 6 */
#define GTM_MCS7_CH1_R6                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R6 *)0xF01F7098u)

/** \\brief  F709C, MCS channel 1 general purpose register 7 */
#define GTM_MCS7_CH1_R7                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R7 *)0xF01F709Cu)

/** \\brief  F7124, MCS channel 1 ARU control Bit register */
#define GTM_MCS7_CH2_ACB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_ACB *)0xF01F7124u)

/** \\brief  F7120, MCS channel 1 control register */
#define GTM_MCS7_CH2_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL *)0xF01F7120u)

/** \\brief  F7154, MCS channel 1 error interrupt enable register */
#define GTM_MCS7_CH2_EIRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN *)0xF01F7154u)

/** \\brief  F7148, MCS channel 1 interrupt enable register */
#define GTM_MCS7_CH2_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN *)0xF01F7148u)

/** \\brief  F714C, MCS channel 1 force interrupt register */
#define GTM_MCS7_CH2_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT *)0xF01F714Cu)

/** \\brief  F7150, MCS channel 1 IRQ mode configuration register */
#define GTM_MCS7_CH2_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE *)0xF01F7150u)

/** \\brief  F7144, MCS channel 1 interrupt notification register */
#define GTM_MCS7_CH2_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY *)0xF01F7144u)

/** \\brief  F713C, MCS channel 1 memory high byte register */
#define GTM_MCS7_CH2_MHB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_MHB *)0xF01F713Cu)

/** \\brief  F7140, MCS channel 1 program counter register */
#define GTM_MCS7_CH2_PC                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_PC *)0xF01F7140u)

/** \\brief  F7100, MCS channel 1 general purpose register 0 */
#define GTM_MCS7_CH2_R0                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R0 *)0xF01F7100u)

/** \\brief  F7104, MCS channel 1 general purpose register 1 */
#define GTM_MCS7_CH2_R1                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R1 *)0xF01F7104u)

/** \\brief  F7108, MCS channel 1 general purpose register 2 */
#define GTM_MCS7_CH2_R2                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R2 *)0xF01F7108u)

/** \\brief  F710C, MCS channel 1 general purpose register 3 */
#define GTM_MCS7_CH2_R3                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R3 *)0xF01F710Cu)

/** \\brief  F7110, MCS channel 1 general purpose register 4 */
#define GTM_MCS7_CH2_R4                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R4 *)0xF01F7110u)

/** \\brief  F7114, MCS channel 1 general purpose register 5 */
#define GTM_MCS7_CH2_R5                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R5 *)0xF01F7114u)

/** \\brief  F7118, MCS channel 1 general purpose register 6 */
#define GTM_MCS7_CH2_R6                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R6 *)0xF01F7118u)

/** \\brief  F711C, MCS channel 1 general purpose register 7 */
#define GTM_MCS7_CH2_R7                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R7 *)0xF01F711Cu)

