Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  F71A4, MCS channel 1 ARU control Bit register */
#define GTM_MCS7_CH3_ACB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_ACB *)0xF01F71A4u)

/** \\brief  F71A0, MCS channel 1 control register */
#define GTM_MCS7_CH3_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL *)0xF01F71A0u)

/** \\brief  F71D4, MCS channel 1 error interrupt enable register */
#define GTM_MCS7_CH3_EIRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN *)0xF01F71D4u)

/** \\brief  F71C8, MCS channel 1 interrupt enable register */
#define GTM_MCS7_CH3_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN *)0xF01F71C8u)

/** \\brief  F71CC, MCS channel 1 force interrupt register */
#define GTM_MCS7_CH3_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT *)0xF01F71CCu)

/** \\brief  F71D0, MCS channel 1 IRQ mode configuration register */
#define GTM_MCS7_CH3_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE *)0xF01F71D0u)

/** \\brief  F71C4, MCS channel 1 interrupt notification register */
#define GTM_MCS7_CH3_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY *)0xF01F71C4u)

/** \\brief  F71BC, MCS channel 1 memory high byte register */
#define GTM_MCS7_CH3_MHB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_MHB *)0xF01F71BCu)

/** \\brief  F71C0, MCS channel 1 program counter register */
#define GTM_MCS7_CH3_PC                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_PC *)0xF01F71C0u)

/** \\brief  F7180, MCS channel 1 general purpose register 0 */
#define GTM_MCS7_CH3_R0                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R0 *)0xF01F7180u)

/** \\brief  F7184, MCS channel 1 general purpose register 1 */
#define GTM_MCS7_CH3_R1                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R1 *)0xF01F7184u)

/** \\brief  F7188, MCS channel 1 general purpose register 2 */
#define GTM_MCS7_CH3_R2                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R2 *)0xF01F7188u)

/** \\brief  F718C, MCS channel 1 general purpose register 3 */
#define GTM_MCS7_CH3_R3                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R3 *)0xF01F718Cu)

/** \\brief  F7190, MCS channel 1 general purpose register 4 */
#define GTM_MCS7_CH3_R4                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R4 *)0xF01F7190u)

/** \\brief  F7194, MCS channel 1 general purpose register 5 */
#define GTM_MCS7_CH3_R5                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R5 *)0xF01F7194u)

/** \\brief  F7198, MCS channel 1 general purpose register 6 */
#define GTM_MCS7_CH3_R6                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R6 *)0xF01F7198u)

/** \\brief  F719C, MCS channel 1 general purpose register 7 */
#define GTM_MCS7_CH3_R7                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R7 *)0xF01F719Cu)

/** \\brief  F7224, MCS channel 1 ARU control Bit register */
#define GTM_MCS7_CH4_ACB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_ACB *)0xF01F7224u)

/** \\brief  F7220, MCS channel 1 control register */
#define GTM_MCS7_CH4_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL *)0xF01F7220u)

/** \\brief  F7254, MCS channel 1 error interrupt enable register */
#define GTM_MCS7_CH4_EIRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN *)0xF01F7254u)

/** \\brief  F7248, MCS channel 1 interrupt enable register */
#define GTM_MCS7_CH4_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN *)0xF01F7248u)

/** \\brief  F724C, MCS channel 1 force interrupt register */
#define GTM_MCS7_CH4_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT *)0xF01F724Cu)

/** \\brief  F7250, MCS channel 1 IRQ mode configuration register */
#define GTM_MCS7_CH4_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE *)0xF01F7250u)

/** \\brief  F7244, MCS channel 1 interrupt notification register */
#define GTM_MCS7_CH4_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY *)0xF01F7244u)

/** \\brief  F723C, MCS channel 1 memory high byte register */
#define GTM_MCS7_CH4_MHB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_MHB *)0xF01F723Cu)

/** \\brief  F7240, MCS channel 1 program counter register */
#define GTM_MCS7_CH4_PC                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_PC *)0xF01F7240u)

/** \\brief  F7200, MCS channel 1 general purpose register 0 */
#define GTM_MCS7_CH4_R0                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R0 *)0xF01F7200u)

/** \\brief  F7204, MCS channel 1 general purpose register 1 */
#define GTM_MCS7_CH4_R1                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R1 *)0xF01F7204u)

/** \\brief  F7208, MCS channel 1 general purpose register 2 */
#define GTM_MCS7_CH4_R2                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R2 *)0xF01F7208u)

/** \\brief  F720C, MCS channel 1 general purpose register 3 */
#define GTM_MCS7_CH4_R3                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R3 *)0xF01F720Cu)

/** \\brief  F7210, MCS channel 1 general purpose register 4 */
#define GTM_MCS7_CH4_R4                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R4 *)0xF01F7210u)

/** \\brief  F7214, MCS channel 1 general purpose register 5 */
#define GTM_MCS7_CH4_R5                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R5 *)0xF01F7214u)

/** \\brief  F7218, MCS channel 1 general purpose register 6 */
#define GTM_MCS7_CH4_R6                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R6 *)0xF01F7218u)

/** \\brief  F721C, MCS channel 1 general purpose register 7 */
#define GTM_MCS7_CH4_R7                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R7 *)0xF01F721Cu)

/** \\brief  F72A4, MCS channel 1 ARU control Bit register */
#define GTM_MCS7_CH5_ACB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_ACB *)0xF01F72A4u)

/** \\brief  F72A0, MCS channel 1 control register */
#define GTM_MCS7_CH5_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL *)0xF01F72A0u)

/** \\brief  F72D4, MCS channel 1 error interrupt enable register */
#define GTM_MCS7_CH5_EIRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN *)0xF01F72D4u)

/** \\brief  F72C8, MCS channel 1 interrupt enable register */
#define GTM_MCS7_CH5_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN *)0xF01F72C8u)

