Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  F72CC, MCS channel 1 force interrupt register */
#define GTM_MCS7_CH5_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT *)0xF01F72CCu)

/** \\brief  F72D0, MCS channel 1 IRQ mode configuration register */
#define GTM_MCS7_CH5_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE *)0xF01F72D0u)

/** \\brief  F72C4, MCS channel 1 interrupt notification register */
#define GTM_MCS7_CH5_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY *)0xF01F72C4u)

/** \\brief  F72BC, MCS channel 1 memory high byte register */
#define GTM_MCS7_CH5_MHB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_MHB *)0xF01F72BCu)

/** \\brief  F72C0, MCS channel 1 program counter register */
#define GTM_MCS7_CH5_PC                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_PC *)0xF01F72C0u)

/** \\brief  F7280, MCS channel 1 general purpose register 0 */
#define GTM_MCS7_CH5_R0                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R0 *)0xF01F7280u)

/** \\brief  F7284, MCS channel 1 general purpose register 1 */
#define GTM_MCS7_CH5_R1                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R1 *)0xF01F7284u)

/** \\brief  F7288, MCS channel 1 general purpose register 2 */
#define GTM_MCS7_CH5_R2                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R2 *)0xF01F7288u)

/** \\brief  F728C, MCS channel 1 general purpose register 3 */
#define GTM_MCS7_CH5_R3                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R3 *)0xF01F728Cu)

/** \\brief  F7290, MCS channel 1 general purpose register 4 */
#define GTM_MCS7_CH5_R4                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R4 *)0xF01F7290u)

/** \\brief  F7294, MCS channel 1 general purpose register 5 */
#define GTM_MCS7_CH5_R5                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R5 *)0xF01F7294u)

/** \\brief  F7298, MCS channel 1 general purpose register 6 */
#define GTM_MCS7_CH5_R6                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R6 *)0xF01F7298u)

/** \\brief  F729C, MCS channel 1 general purpose register 7 */
#define GTM_MCS7_CH5_R7                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R7 *)0xF01F729Cu)

/** \\brief  F7324, MCS channel 1 ARU control Bit register */
#define GTM_MCS7_CH6_ACB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_ACB *)0xF01F7324u)

/** \\brief  F7320, MCS channel 1 control register */
#define GTM_MCS7_CH6_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL *)0xF01F7320u)

/** \\brief  F7354, MCS channel 1 error interrupt enable register */
#define GTM_MCS7_CH6_EIRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN *)0xF01F7354u)

/** \\brief  F7348, MCS channel 1 interrupt enable register */
#define GTM_MCS7_CH6_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN *)0xF01F7348u)

/** \\brief  F734C, MCS channel 1 force interrupt register */
#define GTM_MCS7_CH6_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT *)0xF01F734Cu)

/** \\brief  F7350, MCS channel 1 IRQ mode configuration register */
#define GTM_MCS7_CH6_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE *)0xF01F7350u)

/** \\brief  F7344, MCS channel 1 interrupt notification register */
#define GTM_MCS7_CH6_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY *)0xF01F7344u)

/** \\brief  F733C, MCS channel 1 memory high byte register */
#define GTM_MCS7_CH6_MHB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_MHB *)0xF01F733Cu)

/** \\brief  F7340, MCS channel 1 program counter register */
#define GTM_MCS7_CH6_PC                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_PC *)0xF01F7340u)

/** \\brief  F7300, MCS channel 1 general purpose register 0 */
#define GTM_MCS7_CH6_R0                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R0 *)0xF01F7300u)

/** \\brief  F7304, MCS channel 1 general purpose register 1 */
#define GTM_MCS7_CH6_R1                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R1 *)0xF01F7304u)

/** \\brief  F7308, MCS channel 1 general purpose register 2 */
#define GTM_MCS7_CH6_R2                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R2 *)0xF01F7308u)

/** \\brief  F730C, MCS channel 1 general purpose register 3 */
#define GTM_MCS7_CH6_R3                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R3 *)0xF01F730Cu)

/** \\brief  F7310, MCS channel 1 general purpose register 4 */
#define GTM_MCS7_CH6_R4                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R4 *)0xF01F7310u)

/** \\brief  F7314, MCS channel 1 general purpose register 5 */
#define GTM_MCS7_CH6_R5                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R5 *)0xF01F7314u)

/** \\brief  F7318, MCS channel 1 general purpose register 6 */
#define GTM_MCS7_CH6_R6                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R6 *)0xF01F7318u)

/** \\brief  F731C, MCS channel 1 general purpose register 7 */
#define GTM_MCS7_CH6_R7                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R7 *)0xF01F731Cu)

/** \\brief  F73A4, MCS channel 1 ARU control Bit register */
#define GTM_MCS7_CH7_ACB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_ACB *)0xF01F73A4u)

/** \\brief  F73A0, MCS channel 1 control register */
#define GTM_MCS7_CH7_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL *)0xF01F73A0u)

/** \\brief  F73D4, MCS channel 1 error interrupt enable register */
#define GTM_MCS7_CH7_EIRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN *)0xF01F73D4u)

/** \\brief  F73C8, MCS channel 1 interrupt enable register */
#define GTM_MCS7_CH7_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN *)0xF01F73C8u)

/** \\brief  F73CC, MCS channel 1 force interrupt register */
#define GTM_MCS7_CH7_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT *)0xF01F73CCu)

/** \\brief  F73D0, MCS channel 1 IRQ mode configuration register */
#define GTM_MCS7_CH7_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE *)0xF01F73D0u)

