Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  F73C4, MCS channel 1 interrupt notification register */
#define GTM_MCS7_CH7_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY *)0xF01F73C4u)

/** \\brief  F73BC, MCS channel 1 memory high byte register */
#define GTM_MCS7_CH7_MHB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_MHB *)0xF01F73BCu)

/** \\brief  F73C0, MCS channel 1 program counter register */
#define GTM_MCS7_CH7_PC                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_PC *)0xF01F73C0u)

/** \\brief  F7380, MCS channel 1 general purpose register 0 */
#define GTM_MCS7_CH7_R0                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R0 *)0xF01F7380u)

/** \\brief  F7384, MCS channel 1 general purpose register 1 */
#define GTM_MCS7_CH7_R1                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R1 *)0xF01F7384u)

/** \\brief  F7388, MCS channel 1 general purpose register 2 */
#define GTM_MCS7_CH7_R2                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R2 *)0xF01F7388u)

/** \\brief  F738C, MCS channel 1 general purpose register 3 */
#define GTM_MCS7_CH7_R3                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R3 *)0xF01F738Cu)

/** \\brief  F7390, MCS channel 1 general purpose register 4 */
#define GTM_MCS7_CH7_R4                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R4 *)0xF01F7390u)

/** \\brief  F7394, MCS channel 1 general purpose register 5 */
#define GTM_MCS7_CH7_R5                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R5 *)0xF01F7394u)

/** \\brief  F7398, MCS channel 1 general purpose register 6 */
#define GTM_MCS7_CH7_R6                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R6 *)0xF01F7398u)

/** \\brief  F739C, MCS channel 1 general purpose register 7 */
#define GTM_MCS7_CH7_R7                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R7 *)0xF01F739Cu)

/** \\brief  F7064, MCS control and status register */
#define GTM_MCS7_CTRL_STAT             /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CTRL_STAT *)0xF01F7064u)

/** \\brief  F7070, MCS cancel WURM instruction */
#define GTM_MCS7_CWT                   /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CWT *)0xF01F7070u)

/** \\brief  F707C, MCS error register */
#define GTM_MCS7_ERR                   /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_ERR *)0xF01F707Cu)

/** \\brief  F7060, MCS write protection register */
#define GTM_MCS7_REG_PROT              /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_REG_PROT *)0xF01F7060u)

/** \\brief  F7068, MCS reset register */
#define GTM_MCS7_RESET                 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_RESET *)0xF01F7068u)

/** \\brief  F806C, MCS cancel ARU transfer instruction */
#define GTM_MCS8_CAT                   /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CAT *)0xF01F806Cu)

/** \\brief  F8024, MCS channel 0 ARU control Bit register */
#define GTM_MCS8_CH0_ACB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_ACB *)0xF01F8024u)

/** \\brief  F8028, MCS clear trigger control register */
#define GTM_MCS8_CH0_CTRG              /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH0_CTRG *)0xF01F8028u)

/** Alias (User Manual Name) for GTM_MCS8_CH0_CTRG.
 * To use register names with standard convension, please use GTM_MCS8_CH0_CTRG.
 */
#define GTM_MCS8_CTRG                  (GTM_MCS8_CH0_CTRG)

/** Alias (User Manual Name) for GTM_MCS8_CH0_CTRG.
 * To use register names with standard convension, please use GTM_MCS8_CH0_CTRG.
 */
#define GTM_MCS8_CTRG                  (GTM_MCS8_CH0_CTRG)

/** \\brief  F8020, MCS channel 0 control register */
#define GTM_MCS8_CH0_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL *)0xF01F8020u)

/** \\brief  F8054, MCS channel 0 error interrupt enable register */
#define GTM_MCS8_CH0_EIRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN *)0xF01F8054u)

/** \\brief  F8048, MCS channel 0 interrupt enable register */
#define GTM_MCS8_CH0_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN *)0xF01F8048u)

/** \\brief  F804C, MCS channel 0 force interrupt register */
#define GTM_MCS8_CH0_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT *)0xF01F804Cu)

/** \\brief  F8050, MCS channel 0 IRQ mode configuration register */
#define GTM_MCS8_CH0_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE *)0xF01F8050u)

/** \\brief  F8044, MCS channel 0 interrupt notification register */
#define GTM_MCS8_CH0_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY *)0xF01F8044u)

/** \\brief  F803C, MCS channel 0 memory high byte register */
#define GTM_MCS8_CH0_MHB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_MHB *)0xF01F803Cu)

/** \\brief  F8040, MCS channel 0 program counter register */
#define GTM_MCS8_CH0_PC                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_PC *)0xF01F8040u)

/** \\brief  F8000, MCS channel 0 general purpose register 0 */
#define GTM_MCS8_CH0_R0                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R0 *)0xF01F8000u)

/** \\brief  F8004, MCS channel 0 general purpose register 1 */
#define GTM_MCS8_CH0_R1                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R1 *)0xF01F8004u)

/** \\brief  F8008, MCS channel 0 general purpose register 2 */
#define GTM_MCS8_CH0_R2                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R2 *)0xF01F8008u)

/** \\brief  F800C, MCS channel 0 general purpose register 3 */
#define GTM_MCS8_CH0_R3                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R3 *)0xF01F800Cu)

/** \\brief  F8010, MCS channel 0 general purpose register 4 */
#define GTM_MCS8_CH0_R4                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R4 *)0xF01F8010u)

/** \\brief  F8014, MCS channel 0 general purpose register 5 */
#define GTM_MCS8_CH0_R5                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R5 *)0xF01F8014u)

/** \\brief  F8018, MCS channel 0 general purpose register 6 */
#define GTM_MCS8_CH0_R6                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R6 *)0xF01F8018u)

/** \\brief  F801C, MCS channel 0 general purpose register 7 */
#define GTM_MCS8_CH0_R7                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R7 *)0xF01F801Cu)

/** \\brief  F802C, MCS set trigger control register */
#define GTM_MCS8_CH0_STRG              /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH0_STRG *)0xF01F802Cu)

/** Alias (User Manual Name) for GTM_MCS8_CH0_STRG.
 * To use register names with standard convension, please use GTM_MCS8_CH0_STRG.
 */
#define GTM_MCS8_STRG                  (GTM_MCS8_CH0_STRG)

/** Alias (User Manual Name) for GTM_MCS8_CH0_STRG.
 * To use register names with standard convension, please use GTM_MCS8_CH0_STRG.
 */
#define GTM_MCS8_STRG                  (GTM_MCS8_CH0_STRG)

/** \\brief  F80A4, MCS channel 1 ARU control Bit register */
#define GTM_MCS8_CH1_ACB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_ACB *)0xF01F80A4u)

