Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  F80A0, MCS channel 1 control register */
#define GTM_MCS8_CH1_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL *)0xF01F80A0u)

/** \\brief  F80D4, MCS channel 1 error interrupt enable register */
#define GTM_MCS8_CH1_EIRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN *)0xF01F80D4u)

/** \\brief  F80C8, MCS channel 1 interrupt enable register */
#define GTM_MCS8_CH1_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN *)0xF01F80C8u)

/** \\brief  F80CC, MCS channel 1 force interrupt register */
#define GTM_MCS8_CH1_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT *)0xF01F80CCu)

/** \\brief  F80D0, MCS channel 1 IRQ mode configuration register */
#define GTM_MCS8_CH1_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE *)0xF01F80D0u)

/** \\brief  F80C4, MCS channel 1 interrupt notification register */
#define GTM_MCS8_CH1_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY *)0xF01F80C4u)

/** \\brief  F80BC, MCS channel 1 memory high byte register */
#define GTM_MCS8_CH1_MHB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_MHB *)0xF01F80BCu)

/** \\brief  F80C0, MCS channel 1 program counter register */
#define GTM_MCS8_CH1_PC                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_PC *)0xF01F80C0u)

/** \\brief  F8080, MCS channel 1 general purpose register 0 */
#define GTM_MCS8_CH1_R0                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R0 *)0xF01F8080u)

/** \\brief  F8084, MCS channel 1 general purpose register 1 */
#define GTM_MCS8_CH1_R1                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R1 *)0xF01F8084u)

/** \\brief  F8088, MCS channel 1 general purpose register 2 */
#define GTM_MCS8_CH1_R2                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R2 *)0xF01F8088u)

/** \\brief  F808C, MCS channel 1 general purpose register 3 */
#define GTM_MCS8_CH1_R3                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R3 *)0xF01F808Cu)

/** \\brief  F8090, MCS channel 1 general purpose register 4 */
#define GTM_MCS8_CH1_R4                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R4 *)0xF01F8090u)

/** \\brief  F8094, MCS channel 1 general purpose register 5 */
#define GTM_MCS8_CH1_R5                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R5 *)0xF01F8094u)

/** \\brief  F8098, MCS channel 1 general purpose register 6 */
#define GTM_MCS8_CH1_R6                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R6 *)0xF01F8098u)

/** \\brief  F809C, MCS channel 1 general purpose register 7 */
#define GTM_MCS8_CH1_R7                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R7 *)0xF01F809Cu)

/** \\brief  F8124, MCS channel 1 ARU control Bit register */
#define GTM_MCS8_CH2_ACB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_ACB *)0xF01F8124u)

/** \\brief  F8120, MCS channel 1 control register */
#define GTM_MCS8_CH2_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL *)0xF01F8120u)

/** \\brief  F8154, MCS channel 1 error interrupt enable register */
#define GTM_MCS8_CH2_EIRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN *)0xF01F8154u)

/** \\brief  F8148, MCS channel 1 interrupt enable register */
#define GTM_MCS8_CH2_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN *)0xF01F8148u)

/** \\brief  F814C, MCS channel 1 force interrupt register */
#define GTM_MCS8_CH2_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT *)0xF01F814Cu)

/** \\brief  F8150, MCS channel 1 IRQ mode configuration register */
#define GTM_MCS8_CH2_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE *)0xF01F8150u)

/** \\brief  F8144, MCS channel 1 interrupt notification register */
#define GTM_MCS8_CH2_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY *)0xF01F8144u)

/** \\brief  F813C, MCS channel 1 memory high byte register */
#define GTM_MCS8_CH2_MHB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_MHB *)0xF01F813Cu)

/** \\brief  F8140, MCS channel 1 program counter register */
#define GTM_MCS8_CH2_PC                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_PC *)0xF01F8140u)

/** \\brief  F8100, MCS channel 1 general purpose register 0 */
#define GTM_MCS8_CH2_R0                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R0 *)0xF01F8100u)

/** \\brief  F8104, MCS channel 1 general purpose register 1 */
#define GTM_MCS8_CH2_R1                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R1 *)0xF01F8104u)

/** \\brief  F8108, MCS channel 1 general purpose register 2 */
#define GTM_MCS8_CH2_R2                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R2 *)0xF01F8108u)

/** \\brief  F810C, MCS channel 1 general purpose register 3 */
#define GTM_MCS8_CH2_R3                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R3 *)0xF01F810Cu)

/** \\brief  F8110, MCS channel 1 general purpose register 4 */
#define GTM_MCS8_CH2_R4                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R4 *)0xF01F8110u)

/** \\brief  F8114, MCS channel 1 general purpose register 5 */
#define GTM_MCS8_CH2_R5                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R5 *)0xF01F8114u)

/** \\brief  F8118, MCS channel 1 general purpose register 6 */
#define GTM_MCS8_CH2_R6                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R6 *)0xF01F8118u)

/** \\brief  F811C, MCS channel 1 general purpose register 7 */
#define GTM_MCS8_CH2_R7                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R7 *)0xF01F811Cu)

/** \\brief  F81A4, MCS channel 1 ARU control Bit register */
#define GTM_MCS8_CH3_ACB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_ACB *)0xF01F81A4u)

/** \\brief  F81A0, MCS channel 1 control register */
#define GTM_MCS8_CH3_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL *)0xF01F81A0u)

/** \\brief  F81D4, MCS channel 1 error interrupt enable register */
#define GTM_MCS8_CH3_EIRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN *)0xF01F81D4u)

