Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  F81C8, MCS channel 1 interrupt enable register */
#define GTM_MCS8_CH3_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN *)0xF01F81C8u)

/** \\brief  F81CC, MCS channel 1 force interrupt register */
#define GTM_MCS8_CH3_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT *)0xF01F81CCu)

/** \\brief  F81D0, MCS channel 1 IRQ mode configuration register */
#define GTM_MCS8_CH3_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE *)0xF01F81D0u)

/** \\brief  F81C4, MCS channel 1 interrupt notification register */
#define GTM_MCS8_CH3_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY *)0xF01F81C4u)

/** \\brief  F81BC, MCS channel 1 memory high byte register */
#define GTM_MCS8_CH3_MHB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_MHB *)0xF01F81BCu)

/** \\brief  F81C0, MCS channel 1 program counter register */
#define GTM_MCS8_CH3_PC                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_PC *)0xF01F81C0u)

/** \\brief  F8180, MCS channel 1 general purpose register 0 */
#define GTM_MCS8_CH3_R0                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R0 *)0xF01F8180u)

/** \\brief  F8184, MCS channel 1 general purpose register 1 */
#define GTM_MCS8_CH3_R1                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R1 *)0xF01F8184u)

/** \\brief  F8188, MCS channel 1 general purpose register 2 */
#define GTM_MCS8_CH3_R2                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R2 *)0xF01F8188u)

/** \\brief  F818C, MCS channel 1 general purpose register 3 */
#define GTM_MCS8_CH3_R3                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R3 *)0xF01F818Cu)

/** \\brief  F8190, MCS channel 1 general purpose register 4 */
#define GTM_MCS8_CH3_R4                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R4 *)0xF01F8190u)

/** \\brief  F8194, MCS channel 1 general purpose register 5 */
#define GTM_MCS8_CH3_R5                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R5 *)0xF01F8194u)

/** \\brief  F8198, MCS channel 1 general purpose register 6 */
#define GTM_MCS8_CH3_R6                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R6 *)0xF01F8198u)

/** \\brief  F819C, MCS channel 1 general purpose register 7 */
#define GTM_MCS8_CH3_R7                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R7 *)0xF01F819Cu)

/** \\brief  F8224, MCS channel 1 ARU control Bit register */
#define GTM_MCS8_CH4_ACB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_ACB *)0xF01F8224u)

/** \\brief  F8220, MCS channel 1 control register */
#define GTM_MCS8_CH4_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL *)0xF01F8220u)

/** \\brief  F8254, MCS channel 1 error interrupt enable register */
#define GTM_MCS8_CH4_EIRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN *)0xF01F8254u)

/** \\brief  F8248, MCS channel 1 interrupt enable register */
#define GTM_MCS8_CH4_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN *)0xF01F8248u)

/** \\brief  F824C, MCS channel 1 force interrupt register */
#define GTM_MCS8_CH4_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT *)0xF01F824Cu)

/** \\brief  F8250, MCS channel 1 IRQ mode configuration register */
#define GTM_MCS8_CH4_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE *)0xF01F8250u)

/** \\brief  F8244, MCS channel 1 interrupt notification register */
#define GTM_MCS8_CH4_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY *)0xF01F8244u)

/** \\brief  F823C, MCS channel 1 memory high byte register */
#define GTM_MCS8_CH4_MHB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_MHB *)0xF01F823Cu)

/** \\brief  F8240, MCS channel 1 program counter register */
#define GTM_MCS8_CH4_PC                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_PC *)0xF01F8240u)

/** \\brief  F8200, MCS channel 1 general purpose register 0 */
#define GTM_MCS8_CH4_R0                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R0 *)0xF01F8200u)

/** \\brief  F8204, MCS channel 1 general purpose register 1 */
#define GTM_MCS8_CH4_R1                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R1 *)0xF01F8204u)

/** \\brief  F8208, MCS channel 1 general purpose register 2 */
#define GTM_MCS8_CH4_R2                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R2 *)0xF01F8208u)

/** \\brief  F820C, MCS channel 1 general purpose register 3 */
#define GTM_MCS8_CH4_R3                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R3 *)0xF01F820Cu)

/** \\brief  F8210, MCS channel 1 general purpose register 4 */
#define GTM_MCS8_CH4_R4                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R4 *)0xF01F8210u)

/** \\brief  F8214, MCS channel 1 general purpose register 5 */
#define GTM_MCS8_CH4_R5                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R5 *)0xF01F8214u)

/** \\brief  F8218, MCS channel 1 general purpose register 6 */
#define GTM_MCS8_CH4_R6                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R6 *)0xF01F8218u)

/** \\brief  F821C, MCS channel 1 general purpose register 7 */
#define GTM_MCS8_CH4_R7                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R7 *)0xF01F821Cu)

/** \\brief  F82A4, MCS channel 1 ARU control Bit register */
#define GTM_MCS8_CH5_ACB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_ACB *)0xF01F82A4u)

/** \\brief  F82A0, MCS channel 1 control register */
#define GTM_MCS8_CH5_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL *)0xF01F82A0u)

/** \\brief  F82D4, MCS channel 1 error interrupt enable register */
#define GTM_MCS8_CH5_EIRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN *)0xF01F82D4u)

/** \\brief  F82C8, MCS channel 1 interrupt enable register */
#define GTM_MCS8_CH5_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN *)0xF01F82C8u)

/** \\brief  F82CC, MCS channel 1 force interrupt register */
#define GTM_MCS8_CH5_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT *)0xF01F82CCu)

