Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  F82D0, MCS channel 1 IRQ mode configuration register */
#define GTM_MCS8_CH5_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE *)0xF01F82D0u)

/** \\brief  F82C4, MCS channel 1 interrupt notification register */
#define GTM_MCS8_CH5_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY *)0xF01F82C4u)

/** \\brief  F82BC, MCS channel 1 memory high byte register */
#define GTM_MCS8_CH5_MHB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_MHB *)0xF01F82BCu)

/** \\brief  F82C0, MCS channel 1 program counter register */
#define GTM_MCS8_CH5_PC                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_PC *)0xF01F82C0u)

/** \\brief  F8280, MCS channel 1 general purpose register 0 */
#define GTM_MCS8_CH5_R0                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R0 *)0xF01F8280u)

/** \\brief  F8284, MCS channel 1 general purpose register 1 */
#define GTM_MCS8_CH5_R1                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R1 *)0xF01F8284u)

/** \\brief  F8288, MCS channel 1 general purpose register 2 */
#define GTM_MCS8_CH5_R2                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R2 *)0xF01F8288u)

/** \\brief  F828C, MCS channel 1 general purpose register 3 */
#define GTM_MCS8_CH5_R3                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R3 *)0xF01F828Cu)

/** \\brief  F8290, MCS channel 1 general purpose register 4 */
#define GTM_MCS8_CH5_R4                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R4 *)0xF01F8290u)

/** \\brief  F8294, MCS channel 1 general purpose register 5 */
#define GTM_MCS8_CH5_R5                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R5 *)0xF01F8294u)

/** \\brief  F8298, MCS channel 1 general purpose register 6 */
#define GTM_MCS8_CH5_R6                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R6 *)0xF01F8298u)

/** \\brief  F829C, MCS channel 1 general purpose register 7 */
#define GTM_MCS8_CH5_R7                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R7 *)0xF01F829Cu)

/** \\brief  F8324, MCS channel 1 ARU control Bit register */
#define GTM_MCS8_CH6_ACB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_ACB *)0xF01F8324u)

/** \\brief  F8320, MCS channel 1 control register */
#define GTM_MCS8_CH6_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL *)0xF01F8320u)

/** \\brief  F8354, MCS channel 1 error interrupt enable register */
#define GTM_MCS8_CH6_EIRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN *)0xF01F8354u)

/** \\brief  F8348, MCS channel 1 interrupt enable register */
#define GTM_MCS8_CH6_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN *)0xF01F8348u)

/** \\brief  F834C, MCS channel 1 force interrupt register */
#define GTM_MCS8_CH6_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT *)0xF01F834Cu)

/** \\brief  F8350, MCS channel 1 IRQ mode configuration register */
#define GTM_MCS8_CH6_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE *)0xF01F8350u)

/** \\brief  F8344, MCS channel 1 interrupt notification register */
#define GTM_MCS8_CH6_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY *)0xF01F8344u)

/** \\brief  F833C, MCS channel 1 memory high byte register */
#define GTM_MCS8_CH6_MHB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_MHB *)0xF01F833Cu)

/** \\brief  F8340, MCS channel 1 program counter register */
#define GTM_MCS8_CH6_PC                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_PC *)0xF01F8340u)

/** \\brief  F8300, MCS channel 1 general purpose register 0 */
#define GTM_MCS8_CH6_R0                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R0 *)0xF01F8300u)

/** \\brief  F8304, MCS channel 1 general purpose register 1 */
#define GTM_MCS8_CH6_R1                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R1 *)0xF01F8304u)

/** \\brief  F8308, MCS channel 1 general purpose register 2 */
#define GTM_MCS8_CH6_R2                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R2 *)0xF01F8308u)

/** \\brief  F830C, MCS channel 1 general purpose register 3 */
#define GTM_MCS8_CH6_R3                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R3 *)0xF01F830Cu)

/** \\brief  F8310, MCS channel 1 general purpose register 4 */
#define GTM_MCS8_CH6_R4                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R4 *)0xF01F8310u)

/** \\brief  F8314, MCS channel 1 general purpose register 5 */
#define GTM_MCS8_CH6_R5                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R5 *)0xF01F8314u)

/** \\brief  F8318, MCS channel 1 general purpose register 6 */
#define GTM_MCS8_CH6_R6                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R6 *)0xF01F8318u)

/** \\brief  F831C, MCS channel 1 general purpose register 7 */
#define GTM_MCS8_CH6_R7                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R7 *)0xF01F831Cu)

/** \\brief  F83A4, MCS channel 1 ARU control Bit register */
#define GTM_MCS8_CH7_ACB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_ACB *)0xF01F83A4u)

/** \\brief  F83A0, MCS channel 1 control register */
#define GTM_MCS8_CH7_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL *)0xF01F83A0u)

/** \\brief  F83D4, MCS channel 1 error interrupt enable register */
#define GTM_MCS8_CH7_EIRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN *)0xF01F83D4u)

/** \\brief  F83C8, MCS channel 1 interrupt enable register */
#define GTM_MCS8_CH7_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN *)0xF01F83C8u)

/** \\brief  F83CC, MCS channel 1 force interrupt register */
#define GTM_MCS8_CH7_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT *)0xF01F83CCu)

/** \\brief  F83D0, MCS channel 1 IRQ mode configuration register */
#define GTM_MCS8_CH7_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE *)0xF01F83D0u)

/** \\brief  F83C4, MCS channel 1 interrupt notification register */
#define GTM_MCS8_CH7_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY *)0xF01F83C4u)

/** \\brief  F83BC, MCS channel 1 memory high byte register */
#define GTM_MCS8_CH7_MHB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_MHB *)0xF01F83BCu)

/** \\brief  F83C0, MCS channel 1 program counter register */
#define GTM_MCS8_CH7_PC                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_PC *)0xF01F83C0u)

/** \\brief  F8380, MCS channel 1 general purpose register 0 */
#define GTM_MCS8_CH7_R0                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R0 *)0xF01F8380u)

/** \\brief  F8384, MCS channel 1 general purpose register 1 */
#define GTM_MCS8_CH7_R1                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R1 *)0xF01F8384u)

