Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  F8388, MCS channel 1 general purpose register 2 */
#define GTM_MCS8_CH7_R2                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R2 *)0xF01F8388u)

/** \\brief  F838C, MCS channel 1 general purpose register 3 */
#define GTM_MCS8_CH7_R3                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R3 *)0xF01F838Cu)

/** \\brief  F8390, MCS channel 1 general purpose register 4 */
#define GTM_MCS8_CH7_R4                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R4 *)0xF01F8390u)

/** \\brief  F8394, MCS channel 1 general purpose register 5 */
#define GTM_MCS8_CH7_R5                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R5 *)0xF01F8394u)

/** \\brief  F8398, MCS channel 1 general purpose register 6 */
#define GTM_MCS8_CH7_R6                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R6 *)0xF01F8398u)

/** \\brief  F839C, MCS channel 1 general purpose register 7 */
#define GTM_MCS8_CH7_R7                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R7 *)0xF01F839Cu)

/** \\brief  F8064, MCS control and status register */
#define GTM_MCS8_CTRL_STAT             /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CTRL_STAT *)0xF01F8064u)

/** \\brief  F8070, MCS cancel WURM instruction */
#define GTM_MCS8_CWT                   /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CWT *)0xF01F8070u)

/** \\brief  F807C, MCS error register */
#define GTM_MCS8_ERR                   /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_ERR *)0xF01F807Cu)

/** \\brief  F8060, MCS write protection register */
#define GTM_MCS8_REG_PROT              /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_REG_PROT *)0xF01F8060u)

/** \\brief  F8068, MCS reset register */
#define GTM_MCS8_RESET                 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_RESET *)0xF01F8068u)

/** \\brief  F906C, MCS cancel ARU transfer instruction */
#define GTM_MCS9_CAT                   /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CAT *)0xF01F906Cu)

/** \\brief  F9024, MCS channel 0 ARU control Bit register */
#define GTM_MCS9_CH0_ACB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_ACB *)0xF01F9024u)

/** \\brief  F9028, MCS clear trigger control register */
#define GTM_MCS9_CH0_CTRG              /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH0_CTRG *)0xF01F9028u)

/** Alias (User Manual Name) for GTM_MCS9_CH0_CTRG.
 * To use register names with standard convension, please use GTM_MCS9_CH0_CTRG.
 */
#define GTM_MCS9_CTRG                  (GTM_MCS9_CH0_CTRG)

/** Alias (User Manual Name) for GTM_MCS9_CH0_CTRG.
 * To use register names with standard convension, please use GTM_MCS9_CH0_CTRG.
 */
#define GTM_MCS9_CTRG                  (GTM_MCS9_CH0_CTRG)

/** \\brief  F9020, MCS channel 0 control register */
#define GTM_MCS9_CH0_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL *)0xF01F9020u)

/** \\brief  F9054, MCS channel 0 error interrupt enable register */
#define GTM_MCS9_CH0_EIRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN *)0xF01F9054u)

/** \\brief  F9048, MCS channel 0 interrupt enable register */
#define GTM_MCS9_CH0_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN *)0xF01F9048u)

/** \\brief  F904C, MCS channel 0 force interrupt register */
#define GTM_MCS9_CH0_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT *)0xF01F904Cu)

/** \\brief  F9050, MCS channel 0 IRQ mode configuration register */
#define GTM_MCS9_CH0_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE *)0xF01F9050u)

/** \\brief  F9044, MCS channel 0 interrupt notification register */
#define GTM_MCS9_CH0_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY *)0xF01F9044u)

/** \\brief  F903C, MCS channel 0 memory high byte register */
#define GTM_MCS9_CH0_MHB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_MHB *)0xF01F903Cu)

/** \\brief  F9040, MCS channel 0 program counter register */
#define GTM_MCS9_CH0_PC                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_PC *)0xF01F9040u)

/** \\brief  F9000, MCS channel 0 general purpose register 0 */
#define GTM_MCS9_CH0_R0                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R0 *)0xF01F9000u)

/** \\brief  F9004, MCS channel 0 general purpose register 1 */
#define GTM_MCS9_CH0_R1                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R1 *)0xF01F9004u)

/** \\brief  F9008, MCS channel 0 general purpose register 2 */
#define GTM_MCS9_CH0_R2                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R2 *)0xF01F9008u)

/** \\brief  F900C, MCS channel 0 general purpose register 3 */
#define GTM_MCS9_CH0_R3                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R3 *)0xF01F900Cu)

/** \\brief  F9010, MCS channel 0 general purpose register 4 */
#define GTM_MCS9_CH0_R4                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R4 *)0xF01F9010u)

/** \\brief  F9014, MCS channel 0 general purpose register 5 */
#define GTM_MCS9_CH0_R5                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R5 *)0xF01F9014u)

/** \\brief  F9018, MCS channel 0 general purpose register 6 */
#define GTM_MCS9_CH0_R6                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R6 *)0xF01F9018u)

/** \\brief  F901C, MCS channel 0 general purpose register 7 */
#define GTM_MCS9_CH0_R7                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R7 *)0xF01F901Cu)

/** \\brief  F902C, MCS set trigger control register */
#define GTM_MCS9_CH0_STRG              /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH0_STRG *)0xF01F902Cu)

/** Alias (User Manual Name) for GTM_MCS9_CH0_STRG.
 * To use register names with standard convension, please use GTM_MCS9_CH0_STRG.
 */
#define GTM_MCS9_STRG                  (GTM_MCS9_CH0_STRG)

/** Alias (User Manual Name) for GTM_MCS9_CH0_STRG.
 * To use register names with standard convension, please use GTM_MCS9_CH0_STRG.
 */
#define GTM_MCS9_STRG                  (GTM_MCS9_CH0_STRG)

/** \\brief  F90A4, MCS channel 1 ARU control Bit register */
#define GTM_MCS9_CH1_ACB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_ACB *)0xF01F90A4u)

/** \\brief  F90A0, MCS channel 1 control register */
#define GTM_MCS9_CH1_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL *)0xF01F90A0u)

/** \\brief  F90D4, MCS channel 1 error interrupt enable register */
#define GTM_MCS9_CH1_EIRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN *)0xF01F90D4u)

/** \\brief  F90C8, MCS channel 1 interrupt enable register */
#define GTM_MCS9_CH1_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN *)0xF01F90C8u)

/** \\brief  F90CC, MCS channel 1 force interrupt register */
#define GTM_MCS9_CH1_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT *)0xF01F90CCu)

