Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  F90D0, MCS channel 1 IRQ mode configuration register */
#define GTM_MCS9_CH1_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE *)0xF01F90D0u)

/** \\brief  F90C4, MCS channel 1 interrupt notification register */
#define GTM_MCS9_CH1_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY *)0xF01F90C4u)

/** \\brief  F90BC, MCS channel 1 memory high byte register */
#define GTM_MCS9_CH1_MHB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_MHB *)0xF01F90BCu)

/** \\brief  F90C0, MCS channel 1 program counter register */
#define GTM_MCS9_CH1_PC                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_PC *)0xF01F90C0u)

/** \\brief  F9080, MCS channel 1 general purpose register 0 */
#define GTM_MCS9_CH1_R0                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R0 *)0xF01F9080u)

/** \\brief  F9084, MCS channel 1 general purpose register 1 */
#define GTM_MCS9_CH1_R1                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R1 *)0xF01F9084u)

/** \\brief  F9088, MCS channel 1 general purpose register 2 */
#define GTM_MCS9_CH1_R2                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R2 *)0xF01F9088u)

/** \\brief  F908C, MCS channel 1 general purpose register 3 */
#define GTM_MCS9_CH1_R3                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R3 *)0xF01F908Cu)

/** \\brief  F9090, MCS channel 1 general purpose register 4 */
#define GTM_MCS9_CH1_R4                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R4 *)0xF01F9090u)

/** \\brief  F9094, MCS channel 1 general purpose register 5 */
#define GTM_MCS9_CH1_R5                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R5 *)0xF01F9094u)

/** \\brief  F9098, MCS channel 1 general purpose register 6 */
#define GTM_MCS9_CH1_R6                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R6 *)0xF01F9098u)

/** \\brief  F909C, MCS channel 1 general purpose register 7 */
#define GTM_MCS9_CH1_R7                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R7 *)0xF01F909Cu)

/** \\brief  F9124, MCS channel 1 ARU control Bit register */
#define GTM_MCS9_CH2_ACB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_ACB *)0xF01F9124u)

/** \\brief  F9120, MCS channel 1 control register */
#define GTM_MCS9_CH2_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL *)0xF01F9120u)

/** \\brief  F9154, MCS channel 1 error interrupt enable register */
#define GTM_MCS9_CH2_EIRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN *)0xF01F9154u)

/** \\brief  F9148, MCS channel 1 interrupt enable register */
#define GTM_MCS9_CH2_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN *)0xF01F9148u)

/** \\brief  F914C, MCS channel 1 force interrupt register */
#define GTM_MCS9_CH2_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT *)0xF01F914Cu)

/** \\brief  F9150, MCS channel 1 IRQ mode configuration register */
#define GTM_MCS9_CH2_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE *)0xF01F9150u)

/** \\brief  F9144, MCS channel 1 interrupt notification register */
#define GTM_MCS9_CH2_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY *)0xF01F9144u)

/** \\brief  F913C, MCS channel 1 memory high byte register */
#define GTM_MCS9_CH2_MHB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_MHB *)0xF01F913Cu)

/** \\brief  F9140, MCS channel 1 program counter register */
#define GTM_MCS9_CH2_PC                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_PC *)0xF01F9140u)

/** \\brief  F9100, MCS channel 1 general purpose register 0 */
#define GTM_MCS9_CH2_R0                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R0 *)0xF01F9100u)

/** \\brief  F9104, MCS channel 1 general purpose register 1 */
#define GTM_MCS9_CH2_R1                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R1 *)0xF01F9104u)

/** \\brief  F9108, MCS channel 1 general purpose register 2 */
#define GTM_MCS9_CH2_R2                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R2 *)0xF01F9108u)

/** \\brief  F910C, MCS channel 1 general purpose register 3 */
#define GTM_MCS9_CH2_R3                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R3 *)0xF01F910Cu)

/** \\brief  F9110, MCS channel 1 general purpose register 4 */
#define GTM_MCS9_CH2_R4                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R4 *)0xF01F9110u)

/** \\brief  F9114, MCS channel 1 general purpose register 5 */
#define GTM_MCS9_CH2_R5                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R5 *)0xF01F9114u)

/** \\brief  F9118, MCS channel 1 general purpose register 6 */
#define GTM_MCS9_CH2_R6                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R6 *)0xF01F9118u)

/** \\brief  F911C, MCS channel 1 general purpose register 7 */
#define GTM_MCS9_CH2_R7                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R7 *)0xF01F911Cu)

/** \\brief  F91A4, MCS channel 1 ARU control Bit register */
#define GTM_MCS9_CH3_ACB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_ACB *)0xF01F91A4u)

/** \\brief  F91A0, MCS channel 1 control register */
#define GTM_MCS9_CH3_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL *)0xF01F91A0u)

/** \\brief  F91D4, MCS channel 1 error interrupt enable register */
#define GTM_MCS9_CH3_EIRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN *)0xF01F91D4u)

/** \\brief  F91C8, MCS channel 1 interrupt enable register */
#define GTM_MCS9_CH3_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN *)0xF01F91C8u)

/** \\brief  F91CC, MCS channel 1 force interrupt register */
#define GTM_MCS9_CH3_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT *)0xF01F91CCu)

/** \\brief  F91D0, MCS channel 1 IRQ mode configuration register */
#define GTM_MCS9_CH3_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE *)0xF01F91D0u)

/** \\brief  F91C4, MCS channel 1 interrupt notification register */
#define GTM_MCS9_CH3_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY *)0xF01F91C4u)

/** \\brief  F91BC, MCS channel 1 memory high byte register */
#define GTM_MCS9_CH3_MHB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_MHB *)0xF01F91BCu)

