Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  F91C0, MCS channel 1 program counter register */
#define GTM_MCS9_CH3_PC                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_PC *)0xF01F91C0u)

/** \\brief  F9180, MCS channel 1 general purpose register 0 */
#define GTM_MCS9_CH3_R0                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R0 *)0xF01F9180u)

/** \\brief  F9184, MCS channel 1 general purpose register 1 */
#define GTM_MCS9_CH3_R1                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R1 *)0xF01F9184u)

/** \\brief  F9188, MCS channel 1 general purpose register 2 */
#define GTM_MCS9_CH3_R2                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R2 *)0xF01F9188u)

/** \\brief  F918C, MCS channel 1 general purpose register 3 */
#define GTM_MCS9_CH3_R3                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R3 *)0xF01F918Cu)

/** \\brief  F9190, MCS channel 1 general purpose register 4 */
#define GTM_MCS9_CH3_R4                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R4 *)0xF01F9190u)

/** \\brief  F9194, MCS channel 1 general purpose register 5 */
#define GTM_MCS9_CH3_R5                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R5 *)0xF01F9194u)

/** \\brief  F9198, MCS channel 1 general purpose register 6 */
#define GTM_MCS9_CH3_R6                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R6 *)0xF01F9198u)

/** \\brief  F919C, MCS channel 1 general purpose register 7 */
#define GTM_MCS9_CH3_R7                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R7 *)0xF01F919Cu)

/** \\brief  F9224, MCS channel 1 ARU control Bit register */
#define GTM_MCS9_CH4_ACB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_ACB *)0xF01F9224u)

/** \\brief  F9220, MCS channel 1 control register */
#define GTM_MCS9_CH4_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL *)0xF01F9220u)

/** \\brief  F9254, MCS channel 1 error interrupt enable register */
#define GTM_MCS9_CH4_EIRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN *)0xF01F9254u)

/** \\brief  F9248, MCS channel 1 interrupt enable register */
#define GTM_MCS9_CH4_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN *)0xF01F9248u)

/** \\brief  F924C, MCS channel 1 force interrupt register */
#define GTM_MCS9_CH4_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT *)0xF01F924Cu)

/** \\brief  F9250, MCS channel 1 IRQ mode configuration register */
#define GTM_MCS9_CH4_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE *)0xF01F9250u)

/** \\brief  F9244, MCS channel 1 interrupt notification register */
#define GTM_MCS9_CH4_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY *)0xF01F9244u)

/** \\brief  F923C, MCS channel 1 memory high byte register */
#define GTM_MCS9_CH4_MHB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_MHB *)0xF01F923Cu)

/** \\brief  F9240, MCS channel 1 program counter register */
#define GTM_MCS9_CH4_PC                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_PC *)0xF01F9240u)

/** \\brief  F9200, MCS channel 1 general purpose register 0 */
#define GTM_MCS9_CH4_R0                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R0 *)0xF01F9200u)

/** \\brief  F9204, MCS channel 1 general purpose register 1 */
#define GTM_MCS9_CH4_R1                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R1 *)0xF01F9204u)

/** \\brief  F9208, MCS channel 1 general purpose register 2 */
#define GTM_MCS9_CH4_R2                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R2 *)0xF01F9208u)

/** \\brief  F920C, MCS channel 1 general purpose register 3 */
#define GTM_MCS9_CH4_R3                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R3 *)0xF01F920Cu)

/** \\brief  F9210, MCS channel 1 general purpose register 4 */
#define GTM_MCS9_CH4_R4                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R4 *)0xF01F9210u)

/** \\brief  F9214, MCS channel 1 general purpose register 5 */
#define GTM_MCS9_CH4_R5                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R5 *)0xF01F9214u)

/** \\brief  F9218, MCS channel 1 general purpose register 6 */
#define GTM_MCS9_CH4_R6                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R6 *)0xF01F9218u)

/** \\brief  F921C, MCS channel 1 general purpose register 7 */
#define GTM_MCS9_CH4_R7                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R7 *)0xF01F921Cu)

/** \\brief  F92A4, MCS channel 1 ARU control Bit register */
#define GTM_MCS9_CH5_ACB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_ACB *)0xF01F92A4u)

/** \\brief  F92A0, MCS channel 1 control register */
#define GTM_MCS9_CH5_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL *)0xF01F92A0u)

/** \\brief  F92D4, MCS channel 1 error interrupt enable register */
#define GTM_MCS9_CH5_EIRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN *)0xF01F92D4u)

/** \\brief  F92C8, MCS channel 1 interrupt enable register */
#define GTM_MCS9_CH5_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN *)0xF01F92C8u)

/** \\brief  F92CC, MCS channel 1 force interrupt register */
#define GTM_MCS9_CH5_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT *)0xF01F92CCu)

/** \\brief  F92D0, MCS channel 1 IRQ mode configuration register */
#define GTM_MCS9_CH5_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE *)0xF01F92D0u)

/** \\brief  F92C4, MCS channel 1 interrupt notification register */
#define GTM_MCS9_CH5_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY *)0xF01F92C4u)

/** \\brief  F92BC, MCS channel 1 memory high byte register */
#define GTM_MCS9_CH5_MHB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_MHB *)0xF01F92BCu)

/** \\brief  F92C0, MCS channel 1 program counter register */
#define GTM_MCS9_CH5_PC                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_PC *)0xF01F92C0u)

/** \\brief  F9280, MCS channel 1 general purpose register 0 */
#define GTM_MCS9_CH5_R0                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R0 *)0xF01F9280u)

/** \\brief  F9284, MCS channel 1 general purpose register 1 */
#define GTM_MCS9_CH5_R1                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R1 *)0xF01F9284u)

/** \\brief  F9288, MCS channel 1 general purpose register 2 */
#define GTM_MCS9_CH5_R2                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R2 *)0xF01F9288u)

/** \\brief  F928C, MCS channel 1 general purpose register 3 */
#define GTM_MCS9_CH5_R3                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R3 *)0xF01F928Cu)

