Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  F9290, MCS channel 1 general purpose register 4 */
#define GTM_MCS9_CH5_R4                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R4 *)0xF01F9290u)

/** \\brief  F9294, MCS channel 1 general purpose register 5 */
#define GTM_MCS9_CH5_R5                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R5 *)0xF01F9294u)

/** \\brief  F9298, MCS channel 1 general purpose register 6 */
#define GTM_MCS9_CH5_R6                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R6 *)0xF01F9298u)

/** \\brief  F929C, MCS channel 1 general purpose register 7 */
#define GTM_MCS9_CH5_R7                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R7 *)0xF01F929Cu)

/** \\brief  F9324, MCS channel 1 ARU control Bit register */
#define GTM_MCS9_CH6_ACB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_ACB *)0xF01F9324u)

/** \\brief  F9320, MCS channel 1 control register */
#define GTM_MCS9_CH6_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL *)0xF01F9320u)

/** \\brief  F9354, MCS channel 1 error interrupt enable register */
#define GTM_MCS9_CH6_EIRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN *)0xF01F9354u)

/** \\brief  F9348, MCS channel 1 interrupt enable register */
#define GTM_MCS9_CH6_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN *)0xF01F9348u)

/** \\brief  F934C, MCS channel 1 force interrupt register */
#define GTM_MCS9_CH6_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT *)0xF01F934Cu)

/** \\brief  F9350, MCS channel 1 IRQ mode configuration register */
#define GTM_MCS9_CH6_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE *)0xF01F9350u)

/** \\brief  F9344, MCS channel 1 interrupt notification register */
#define GTM_MCS9_CH6_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY *)0xF01F9344u)

/** \\brief  F933C, MCS channel 1 memory high byte register */
#define GTM_MCS9_CH6_MHB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_MHB *)0xF01F933Cu)

/** \\brief  F9340, MCS channel 1 program counter register */
#define GTM_MCS9_CH6_PC                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_PC *)0xF01F9340u)

/** \\brief  F9300, MCS channel 1 general purpose register 0 */
#define GTM_MCS9_CH6_R0                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R0 *)0xF01F9300u)

/** \\brief  F9304, MCS channel 1 general purpose register 1 */
#define GTM_MCS9_CH6_R1                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R1 *)0xF01F9304u)

/** \\brief  F9308, MCS channel 1 general purpose register 2 */
#define GTM_MCS9_CH6_R2                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R2 *)0xF01F9308u)

/** \\brief  F930C, MCS channel 1 general purpose register 3 */
#define GTM_MCS9_CH6_R3                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R3 *)0xF01F930Cu)

/** \\brief  F9310, MCS channel 1 general purpose register 4 */
#define GTM_MCS9_CH6_R4                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R4 *)0xF01F9310u)

/** \\brief  F9314, MCS channel 1 general purpose register 5 */
#define GTM_MCS9_CH6_R5                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R5 *)0xF01F9314u)

/** \\brief  F9318, MCS channel 1 general purpose register 6 */
#define GTM_MCS9_CH6_R6                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R6 *)0xF01F9318u)

/** \\brief  F931C, MCS channel 1 general purpose register 7 */
#define GTM_MCS9_CH6_R7                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R7 *)0xF01F931Cu)

/** \\brief  F93A4, MCS channel 1 ARU control Bit register */
#define GTM_MCS9_CH7_ACB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_ACB *)0xF01F93A4u)

/** \\brief  F93A0, MCS channel 1 control register */
#define GTM_MCS9_CH7_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL *)0xF01F93A0u)

/** \\brief  F93D4, MCS channel 1 error interrupt enable register */
#define GTM_MCS9_CH7_EIRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN *)0xF01F93D4u)

/** \\brief  F93C8, MCS channel 1 interrupt enable register */
#define GTM_MCS9_CH7_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN *)0xF01F93C8u)

/** \\brief  F93CC, MCS channel 1 force interrupt register */
#define GTM_MCS9_CH7_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT *)0xF01F93CCu)

/** \\brief  F93D0, MCS channel 1 IRQ mode configuration register */
#define GTM_MCS9_CH7_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE *)0xF01F93D0u)

/** \\brief  F93C4, MCS channel 1 interrupt notification register */
#define GTM_MCS9_CH7_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY *)0xF01F93C4u)

/** \\brief  F93BC, MCS channel 1 memory high byte register */
#define GTM_MCS9_CH7_MHB               /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_MHB *)0xF01F93BCu)

/** \\brief  F93C0, MCS channel 1 program counter register */
#define GTM_MCS9_CH7_PC                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_PC *)0xF01F93C0u)

/** \\brief  F9380, MCS channel 1 general purpose register 0 */
#define GTM_MCS9_CH7_R0                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R0 *)0xF01F9380u)

/** \\brief  F9384, MCS channel 1 general purpose register 1 */
#define GTM_MCS9_CH7_R1                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R1 *)0xF01F9384u)

/** \\brief  F9388, MCS channel 1 general purpose register 2 */
#define GTM_MCS9_CH7_R2                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R2 *)0xF01F9388u)

/** \\brief  F938C, MCS channel 1 general purpose register 3 */
#define GTM_MCS9_CH7_R3                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R3 *)0xF01F938Cu)

/** \\brief  F9390, MCS channel 1 general purpose register 4 */
#define GTM_MCS9_CH7_R4                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R4 *)0xF01F9390u)

/** \\brief  F9394, MCS channel 1 general purpose register 5 */
#define GTM_MCS9_CH7_R5                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R5 *)0xF01F9394u)

/** \\brief  F9398, MCS channel 1 general purpose register 6 */
#define GTM_MCS9_CH7_R6                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R6 *)0xF01F9398u)

/** \\brief  F939C, MCS channel 1 general purpose register 7 */
#define GTM_MCS9_CH7_R7                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R7 *)0xF01F939Cu)

/** \\brief  F9064, MCS control and status register */
#define GTM_MCS9_CTRL_STAT             /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CTRL_STAT *)0xF01F9064u)

