Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  F9070, MCS cancel WURM instruction */
#define GTM_MCS9_CWT                   /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CWT *)0xF01F9070u)

/** \\brief  F907C, MCS error register */
#define GTM_MCS9_ERR                   /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_ERR *)0xF01F907Cu)

/** \\brief  F9060, MCS write protection register */
#define GTM_MCS9_REG_PROT              /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_REG_PROT *)0xF01F9060u)

/** \\brief  F9068, MCS reset register */
#define GTM_MCS9_RESET                 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_RESET *)0xF01F9068u)

/** \\brief  3C, GTM MCS master port disable register */
#define GTM_MCS_AEM_DIS                /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_AEM_DIS *)0xF010003Cu)

/** \\brief  184, Monitor activity register 0 */
#define GTM_MON_ACTIVITY_0             /*lint --e(923)*/ (*(volatile Ifx_GTM_MON_ACTIVITY_0 *)0xF0100184u)

/** \\brief  188, Monitor activity register 1 */
#define GTM_MON_ACTIVITY_1             /*lint --e(923)*/ (*(volatile Ifx_GTM_MON_ACTIVITY_1 *)0xF0100188u)

/** \\brief  18C, Monitor activity register for MCS 0 */
#define GTM_MON_ACTIVITY_MCS0          /*lint --e(923)*/ (*(volatile Ifx_GTM_MON_ACTIVITY_MCS0 *)0xF010018Cu)

/** \\brief  190, Monitor activity register for MCS 1 */
#define GTM_MON_ACTIVITY_MCS1          /*lint --e(923)*/ (*(volatile Ifx_GTM_MON_ACTIVITY_MCS1 *)0xF0100190u)

/** \\brief  194, Monitor activity register for MCS 2 */
#define GTM_MON_ACTIVITY_MCS2          /*lint --e(923)*/ (*(volatile Ifx_GTM_MON_ACTIVITY_MCS2 *)0xF0100194u)

/** \\brief  198, Monitor activity register for MCS 3 */
#define GTM_MON_ACTIVITY_MCS3          /*lint --e(923)*/ (*(volatile Ifx_GTM_MON_ACTIVITY_MCS3 *)0xF0100198u)

/** \\brief  19C, Monitor activity register for MCS 4 */
#define GTM_MON_ACTIVITY_MCS4          /*lint --e(923)*/ (*(volatile Ifx_GTM_MON_ACTIVITY_MCS4 *)0xF010019Cu)

/** \\brief  1A0, Monitor activity register for MCS 5 */
#define GTM_MON_ACTIVITY_MCS5          /*lint --e(923)*/ (*(volatile Ifx_GTM_MON_ACTIVITY_MCS5 *)0xF01001A0u)

/** \\brief  1A4, Monitor activity register for MCS 6 */
#define GTM_MON_ACTIVITY_MCS6          /*lint --e(923)*/ (*(volatile Ifx_GTM_MON_ACTIVITY_MCS6 *)0xF01001A4u)

/** \\brief  1A8, Monitor activity register for MCS 7 */
#define GTM_MON_ACTIVITY_MCS7          /*lint --e(923)*/ (*(volatile Ifx_GTM_MON_ACTIVITY_MCS7 *)0xF01001A8u)

/** \\brief  1AC, Monitor activity register for MCS 8 */
#define GTM_MON_ACTIVITY_MCS8          /*lint --e(923)*/ (*(volatile Ifx_GTM_MON_ACTIVITY_MCS8 *)0xF01001ACu)

/** \\brief  1B0, Monitor activity register for MCS 9 */
#define GTM_MON_ACTIVITY_MCS9          /*lint --e(923)*/ (*(volatile Ifx_GTM_MON_ACTIVITY_MCS9 *)0xF01001B0u)

/** \\brief  180, Monitor status register */
#define GTM_MON_STATUS                 /*lint --e(923)*/ (*(volatile Ifx_GTM_MON_STATUS *)0xF0100180u)

/** \\brief  9FFA8, OCDS TBU3 Trigger Register */
#define GTM_OTBU3T                     /*lint --e(923)*/ (*(volatile Ifx_GTM_OTBU3T *)0xF019FFA8u)

/** \\brief  0, GTM Version control register */
#define GTM_REV                        /*lint --e(923)*/ (*(volatile Ifx_GTM_REV *)0xF0100000u)

/** \\brief  4, GTM Global reset register */
#define GTM_RST                        /*lint --e(923)*/ (*(volatile Ifx_GTM_RST *)0xF0100004u)

/** \\brief  84C, SPE Command register */
#define GTM_SPE0_CMD                   /*lint --e(923)*/ (*(volatile Ifx_GTM_SPE_CMD *)0xF010084Cu)

/** \\brief  800, SPE Control status register */
#define GTM_SPE0_CTRL_STAT             /*lint --e(923)*/ (*(volatile Ifx_GTM_SPE_CTRL_STAT *)0xF0100800u)

/** \\brief  848, SPE Control status register 2 */
#define GTM_SPE0_CTRL_STAT2            /*lint --e(923)*/ (*(volatile Ifx_GTM_SPE_CTRL_STAT2 *)0xF0100848u)

/** \\brief  83C, SPE Error interrupt enable register. */
#define GTM_SPE0_EIRQ_EN               /*lint --e(923)*/ (*(volatile Ifx_GTM_SPE_EIRQ_EN *)0xF010083Cu)

/** \\brief  830, SPE Interrupt enable register. */
#define GTM_SPE0_IRQ_EN                /*lint --e(923)*/ (*(volatile Ifx_GTM_SPE_IRQ_EN *)0xF0100830u)

/** \\brief  834, SPE Interrupt generation by software. */
#define GTM_SPE0_IRQ_FORCINT           /*lint --e(923)*/ (*(volatile Ifx_GTM_SPE_IRQ_FORCINT *)0xF0100834u)

/** \\brief  838, SPE Interrupt mode configuration register */
#define GTM_SPE0_IRQ_MODE              /*lint --e(923)*/ (*(volatile Ifx_GTM_SPE_IRQ_MODE *)0xF0100838u)

/** \\brief  82C, SPE Interrupt notification register. */
#define GTM_SPE0_IRQ_NOTIFY            /*lint --e(923)*/ (*(volatile Ifx_GTM_SPE_IRQ_NOTIFY *)0xF010082Cu)

/** \\brief  828, SPE output control register */
#define GTM_SPE0_OUT_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_SPE_OUT_CTRL *)0xF0100828u)

/** \\brief  808, SPE Output definition register */
#define GTM_SPE0_OUT_PAT0              /*lint --e(923)*/ (*(volatile Ifx_GTM_SPE_OUT_PAT *)0xF0100808u)

/** \\brief  80C, SPE Output definition register */
#define GTM_SPE0_OUT_PAT1              /*lint --e(923)*/ (*(volatile Ifx_GTM_SPE_OUT_PAT *)0xF010080Cu)

/** \\brief  810, SPE Output definition register */
#define GTM_SPE0_OUT_PAT2              /*lint --e(923)*/ (*(volatile Ifx_GTM_SPE_OUT_PAT *)0xF0100810u)

/** \\brief  814, SPE Output definition register */
#define GTM_SPE0_OUT_PAT3              /*lint --e(923)*/ (*(volatile Ifx_GTM_SPE_OUT_PAT *)0xF0100814u)

/** \\brief  818, SPE Output definition register */
#define GTM_SPE0_OUT_PAT4              /*lint --e(923)*/ (*(volatile Ifx_GTM_SPE_OUT_PAT *)0xF0100818u)

/** \\brief  81C, SPE Output definition register */
#define GTM_SPE0_OUT_PAT5              /*lint --e(923)*/ (*(volatile Ifx_GTM_SPE_OUT_PAT *)0xF010081Cu)

/** \\brief  820, SPE Output definition register */
#define GTM_SPE0_OUT_PAT6              /*lint --e(923)*/ (*(volatile Ifx_GTM_SPE_OUT_PAT *)0xF0100820u)

/** \\brief  824, SPE Output definition register */
#define GTM_SPE0_OUT_PAT7              /*lint --e(923)*/ (*(volatile Ifx_GTM_SPE_OUT_PAT *)0xF0100824u)

/** \\brief  804, SPE Input pattern definition register. */
#define GTM_SPE0_PAT                   /*lint --e(923)*/ (*(volatile Ifx_GTM_SPE_PAT *)0xF0100804u)

