Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  844, SPE Revolution counter compare value */
#define GTM_SPE0_REV_CMP               /*lint --e(923)*/ (*(volatile Ifx_GTM_SPE_REV_CMP *)0xF0100844u)

/** \\brief  840, SPE input revolution counter */
#define GTM_SPE0_REV_CNT               /*lint --e(923)*/ (*(volatile Ifx_GTM_SPE_REV_CNT *)0xF0100840u)

/** \\brief  8CC, SPE Command register */
#define GTM_SPE1_CMD                   /*lint --e(923)*/ (*(volatile Ifx_GTM_SPE_CMD *)0xF01008CCu)

/** \\brief  880, SPE Control status register */
#define GTM_SPE1_CTRL_STAT             /*lint --e(923)*/ (*(volatile Ifx_GTM_SPE_CTRL_STAT *)0xF0100880u)

/** \\brief  8C8, SPE Control status register 2 */
#define GTM_SPE1_CTRL_STAT2            /*lint --e(923)*/ (*(volatile Ifx_GTM_SPE_CTRL_STAT2 *)0xF01008C8u)

/** \\brief  8BC, SPE Error interrupt enable register. */
#define GTM_SPE1_EIRQ_EN               /*lint --e(923)*/ (*(volatile Ifx_GTM_SPE_EIRQ_EN *)0xF01008BCu)

/** \\brief  8B0, SPE Interrupt enable register. */
#define GTM_SPE1_IRQ_EN                /*lint --e(923)*/ (*(volatile Ifx_GTM_SPE_IRQ_EN *)0xF01008B0u)

/** \\brief  8B4, SPE Interrupt generation by software. */
#define GTM_SPE1_IRQ_FORCINT           /*lint --e(923)*/ (*(volatile Ifx_GTM_SPE_IRQ_FORCINT *)0xF01008B4u)

/** \\brief  8B8, SPE Interrupt mode configuration register */
#define GTM_SPE1_IRQ_MODE              /*lint --e(923)*/ (*(volatile Ifx_GTM_SPE_IRQ_MODE *)0xF01008B8u)

/** \\brief  8AC, SPE Interrupt notification register. */
#define GTM_SPE1_IRQ_NOTIFY            /*lint --e(923)*/ (*(volatile Ifx_GTM_SPE_IRQ_NOTIFY *)0xF01008ACu)

/** \\brief  8A8, SPE output control register */
#define GTM_SPE1_OUT_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_SPE_OUT_CTRL *)0xF01008A8u)

/** \\brief  888, SPE Output definition register */
#define GTM_SPE1_OUT_PAT0              /*lint --e(923)*/ (*(volatile Ifx_GTM_SPE_OUT_PAT *)0xF0100888u)

/** \\brief  88C, SPE Output definition register */
#define GTM_SPE1_OUT_PAT1              /*lint --e(923)*/ (*(volatile Ifx_GTM_SPE_OUT_PAT *)0xF010088Cu)

/** \\brief  890, SPE Output definition register */
#define GTM_SPE1_OUT_PAT2              /*lint --e(923)*/ (*(volatile Ifx_GTM_SPE_OUT_PAT *)0xF0100890u)

/** \\brief  894, SPE Output definition register */
#define GTM_SPE1_OUT_PAT3              /*lint --e(923)*/ (*(volatile Ifx_GTM_SPE_OUT_PAT *)0xF0100894u)

/** \\brief  898, SPE Output definition register */
#define GTM_SPE1_OUT_PAT4              /*lint --e(923)*/ (*(volatile Ifx_GTM_SPE_OUT_PAT *)0xF0100898u)

/** \\brief  89C, SPE Output definition register */
#define GTM_SPE1_OUT_PAT5              /*lint --e(923)*/ (*(volatile Ifx_GTM_SPE_OUT_PAT *)0xF010089Cu)

/** \\brief  8A0, SPE Output definition register */
#define GTM_SPE1_OUT_PAT6              /*lint --e(923)*/ (*(volatile Ifx_GTM_SPE_OUT_PAT *)0xF01008A0u)

/** \\brief  8A4, SPE Output definition register */
#define GTM_SPE1_OUT_PAT7              /*lint --e(923)*/ (*(volatile Ifx_GTM_SPE_OUT_PAT *)0xF01008A4u)

/** \\brief  884, SPE Input pattern definition register. */
#define GTM_SPE1_PAT                   /*lint --e(923)*/ (*(volatile Ifx_GTM_SPE_PAT *)0xF0100884u)

/** \\brief  8C4, SPE Revolution counter compare value */
#define GTM_SPE1_REV_CMP               /*lint --e(923)*/ (*(volatile Ifx_GTM_SPE_REV_CMP *)0xF01008C4u)

/** \\brief  8C0, SPE input revolution counter */
#define GTM_SPE1_REV_CNT               /*lint --e(923)*/ (*(volatile Ifx_GTM_SPE_REV_CNT *)0xF01008C0u)

/** \\brief  94C, SPE Command register */
#define GTM_SPE2_CMD                   /*lint --e(923)*/ (*(volatile Ifx_GTM_SPE_CMD *)0xF010094Cu)

/** \\brief  900, SPE Control status register */
#define GTM_SPE2_CTRL_STAT             /*lint --e(923)*/ (*(volatile Ifx_GTM_SPE_CTRL_STAT *)0xF0100900u)

/** \\brief  948, SPE Control status register 2 */
#define GTM_SPE2_CTRL_STAT2            /*lint --e(923)*/ (*(volatile Ifx_GTM_SPE_CTRL_STAT2 *)0xF0100948u)

/** \\brief  93C, SPE Error interrupt enable register. */
#define GTM_SPE2_EIRQ_EN               /*lint --e(923)*/ (*(volatile Ifx_GTM_SPE_EIRQ_EN *)0xF010093Cu)

/** \\brief  930, SPE Interrupt enable register. */
#define GTM_SPE2_IRQ_EN                /*lint --e(923)*/ (*(volatile Ifx_GTM_SPE_IRQ_EN *)0xF0100930u)

/** \\brief  934, SPE Interrupt generation by software. */
#define GTM_SPE2_IRQ_FORCINT           /*lint --e(923)*/ (*(volatile Ifx_GTM_SPE_IRQ_FORCINT *)0xF0100934u)

/** \\brief  938, SPE Interrupt mode configuration register */
#define GTM_SPE2_IRQ_MODE              /*lint --e(923)*/ (*(volatile Ifx_GTM_SPE_IRQ_MODE *)0xF0100938u)

/** \\brief  92C, SPE Interrupt notification register. */
#define GTM_SPE2_IRQ_NOTIFY            /*lint --e(923)*/ (*(volatile Ifx_GTM_SPE_IRQ_NOTIFY *)0xF010092Cu)

/** \\brief  928, SPE output control register */
#define GTM_SPE2_OUT_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_SPE_OUT_CTRL *)0xF0100928u)

/** \\brief  908, SPE Output definition register */
#define GTM_SPE2_OUT_PAT0              /*lint --e(923)*/ (*(volatile Ifx_GTM_SPE_OUT_PAT *)0xF0100908u)

/** \\brief  90C, SPE Output definition register */
#define GTM_SPE2_OUT_PAT1              /*lint --e(923)*/ (*(volatile Ifx_GTM_SPE_OUT_PAT *)0xF010090Cu)

/** \\brief  910, SPE Output definition register */
#define GTM_SPE2_OUT_PAT2              /*lint --e(923)*/ (*(volatile Ifx_GTM_SPE_OUT_PAT *)0xF0100910u)

/** \\brief  914, SPE Output definition register */
#define GTM_SPE2_OUT_PAT3              /*lint --e(923)*/ (*(volatile Ifx_GTM_SPE_OUT_PAT *)0xF0100914u)

/** \\brief  918, SPE Output definition register */
#define GTM_SPE2_OUT_PAT4              /*lint --e(923)*/ (*(volatile Ifx_GTM_SPE_OUT_PAT *)0xF0100918u)

/** \\brief  91C, SPE Output definition register */
#define GTM_SPE2_OUT_PAT5              /*lint --e(923)*/ (*(volatile Ifx_GTM_SPE_OUT_PAT *)0xF010091Cu)

/** \\brief  920, SPE Output definition register */
#define GTM_SPE2_OUT_PAT6              /*lint --e(923)*/ (*(volatile Ifx_GTM_SPE_OUT_PAT *)0xF0100920u)

/** \\brief  924, SPE Output definition register */
#define GTM_SPE2_OUT_PAT7              /*lint --e(923)*/ (*(volatile Ifx_GTM_SPE_OUT_PAT *)0xF0100924u)

/** \\brief  904, SPE Input pattern definition register. */
#define GTM_SPE2_PAT                   /*lint --e(923)*/ (*(volatile Ifx_GTM_SPE_PAT *)0xF0100904u)

/** \\brief  944, SPE Revolution counter compare value */
#define GTM_SPE2_REV_CMP               /*lint --e(923)*/ (*(volatile Ifx_GTM_SPE_REV_CMP *)0xF0100944u)

