Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  940, SPE input revolution counter */
#define GTM_SPE2_REV_CNT               /*lint --e(923)*/ (*(volatile Ifx_GTM_SPE_REV_CNT *)0xF0100940u)

/** \\brief  9CC, SPE Command register */
#define GTM_SPE3_CMD                   /*lint --e(923)*/ (*(volatile Ifx_GTM_SPE_CMD *)0xF01009CCu)

/** \\brief  980, SPE Control status register */
#define GTM_SPE3_CTRL_STAT             /*lint --e(923)*/ (*(volatile Ifx_GTM_SPE_CTRL_STAT *)0xF0100980u)

/** \\brief  9C8, SPE Control status register 2 */
#define GTM_SPE3_CTRL_STAT2            /*lint --e(923)*/ (*(volatile Ifx_GTM_SPE_CTRL_STAT2 *)0xF01009C8u)

/** \\brief  9BC, SPE Error interrupt enable register. */
#define GTM_SPE3_EIRQ_EN               /*lint --e(923)*/ (*(volatile Ifx_GTM_SPE_EIRQ_EN *)0xF01009BCu)

/** \\brief  9B0, SPE Interrupt enable register. */
#define GTM_SPE3_IRQ_EN                /*lint --e(923)*/ (*(volatile Ifx_GTM_SPE_IRQ_EN *)0xF01009B0u)

/** \\brief  9B4, SPE Interrupt generation by software. */
#define GTM_SPE3_IRQ_FORCINT           /*lint --e(923)*/ (*(volatile Ifx_GTM_SPE_IRQ_FORCINT *)0xF01009B4u)

/** \\brief  9B8, SPE Interrupt mode configuration register */
#define GTM_SPE3_IRQ_MODE              /*lint --e(923)*/ (*(volatile Ifx_GTM_SPE_IRQ_MODE *)0xF01009B8u)

/** \\brief  9AC, SPE Interrupt notification register. */
#define GTM_SPE3_IRQ_NOTIFY            /*lint --e(923)*/ (*(volatile Ifx_GTM_SPE_IRQ_NOTIFY *)0xF01009ACu)

/** \\brief  9A8, SPE output control register */
#define GTM_SPE3_OUT_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_SPE_OUT_CTRL *)0xF01009A8u)

/** \\brief  988, SPE Output definition register */
#define GTM_SPE3_OUT_PAT0              /*lint --e(923)*/ (*(volatile Ifx_GTM_SPE_OUT_PAT *)0xF0100988u)

/** \\brief  98C, SPE Output definition register */
#define GTM_SPE3_OUT_PAT1              /*lint --e(923)*/ (*(volatile Ifx_GTM_SPE_OUT_PAT *)0xF010098Cu)

/** \\brief  990, SPE Output definition register */
#define GTM_SPE3_OUT_PAT2              /*lint --e(923)*/ (*(volatile Ifx_GTM_SPE_OUT_PAT *)0xF0100990u)

/** \\brief  994, SPE Output definition register */
#define GTM_SPE3_OUT_PAT3              /*lint --e(923)*/ (*(volatile Ifx_GTM_SPE_OUT_PAT *)0xF0100994u)

/** \\brief  998, SPE Output definition register */
#define GTM_SPE3_OUT_PAT4              /*lint --e(923)*/ (*(volatile Ifx_GTM_SPE_OUT_PAT *)0xF0100998u)

/** \\brief  99C, SPE Output definition register */
#define GTM_SPE3_OUT_PAT5              /*lint --e(923)*/ (*(volatile Ifx_GTM_SPE_OUT_PAT *)0xF010099Cu)

/** \\brief  9A0, SPE Output definition register */
#define GTM_SPE3_OUT_PAT6              /*lint --e(923)*/ (*(volatile Ifx_GTM_SPE_OUT_PAT *)0xF01009A0u)

/** \\brief  9A4, SPE Output definition register */
#define GTM_SPE3_OUT_PAT7              /*lint --e(923)*/ (*(volatile Ifx_GTM_SPE_OUT_PAT *)0xF01009A4u)

/** \\brief  984, SPE Input pattern definition register. */
#define GTM_SPE3_PAT                   /*lint --e(923)*/ (*(volatile Ifx_GTM_SPE_PAT *)0xF0100984u)

/** \\brief  9C4, SPE Revolution counter compare value */
#define GTM_SPE3_REV_CMP               /*lint --e(923)*/ (*(volatile Ifx_GTM_SPE_REV_CMP *)0xF01009C4u)

/** \\brief  9C0, SPE input revolution counter */
#define GTM_SPE3_REV_CNT               /*lint --e(923)*/ (*(volatile Ifx_GTM_SPE_REV_CNT *)0xF01009C0u)

/** \\brief  A4C, SPE Command register */
#define GTM_SPE4_CMD                   /*lint --e(923)*/ (*(volatile Ifx_GTM_SPE_CMD *)0xF0100A4Cu)

/** \\brief  A00, SPE Control status register */
#define GTM_SPE4_CTRL_STAT             /*lint --e(923)*/ (*(volatile Ifx_GTM_SPE_CTRL_STAT *)0xF0100A00u)

/** \\brief  A48, SPE Control status register 2 */
#define GTM_SPE4_CTRL_STAT2            /*lint --e(923)*/ (*(volatile Ifx_GTM_SPE_CTRL_STAT2 *)0xF0100A48u)

/** \\brief  A3C, SPE Error interrupt enable register. */
#define GTM_SPE4_EIRQ_EN               /*lint --e(923)*/ (*(volatile Ifx_GTM_SPE_EIRQ_EN *)0xF0100A3Cu)

/** \\brief  A30, SPE Interrupt enable register. */
#define GTM_SPE4_IRQ_EN                /*lint --e(923)*/ (*(volatile Ifx_GTM_SPE_IRQ_EN *)0xF0100A30u)

/** \\brief  A34, SPE Interrupt generation by software. */
#define GTM_SPE4_IRQ_FORCINT           /*lint --e(923)*/ (*(volatile Ifx_GTM_SPE_IRQ_FORCINT *)0xF0100A34u)

/** \\brief  A38, SPE Interrupt mode configuration register */
#define GTM_SPE4_IRQ_MODE              /*lint --e(923)*/ (*(volatile Ifx_GTM_SPE_IRQ_MODE *)0xF0100A38u)

/** \\brief  A2C, SPE Interrupt notification register. */
#define GTM_SPE4_IRQ_NOTIFY            /*lint --e(923)*/ (*(volatile Ifx_GTM_SPE_IRQ_NOTIFY *)0xF0100A2Cu)

/** \\brief  A28, SPE output control register */
#define GTM_SPE4_OUT_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_SPE_OUT_CTRL *)0xF0100A28u)

/** \\brief  A08, SPE Output definition register */
#define GTM_SPE4_OUT_PAT0              /*lint --e(923)*/ (*(volatile Ifx_GTM_SPE_OUT_PAT *)0xF0100A08u)

/** \\brief  A0C, SPE Output definition register */
#define GTM_SPE4_OUT_PAT1              /*lint --e(923)*/ (*(volatile Ifx_GTM_SPE_OUT_PAT *)0xF0100A0Cu)

/** \\brief  A10, SPE Output definition register */
#define GTM_SPE4_OUT_PAT2              /*lint --e(923)*/ (*(volatile Ifx_GTM_SPE_OUT_PAT *)0xF0100A10u)

/** \\brief  A14, SPE Output definition register */
#define GTM_SPE4_OUT_PAT3              /*lint --e(923)*/ (*(volatile Ifx_GTM_SPE_OUT_PAT *)0xF0100A14u)

/** \\brief  A18, SPE Output definition register */
#define GTM_SPE4_OUT_PAT4              /*lint --e(923)*/ (*(volatile Ifx_GTM_SPE_OUT_PAT *)0xF0100A18u)

/** \\brief  A1C, SPE Output definition register */
#define GTM_SPE4_OUT_PAT5              /*lint --e(923)*/ (*(volatile Ifx_GTM_SPE_OUT_PAT *)0xF0100A1Cu)

/** \\brief  A20, SPE Output definition register */
#define GTM_SPE4_OUT_PAT6              /*lint --e(923)*/ (*(volatile Ifx_GTM_SPE_OUT_PAT *)0xF0100A20u)

/** \\brief  A24, SPE Output definition register */
#define GTM_SPE4_OUT_PAT7              /*lint --e(923)*/ (*(volatile Ifx_GTM_SPE_OUT_PAT *)0xF0100A24u)

/** \\brief  A04, SPE Input pattern definition register. */
#define GTM_SPE4_PAT                   /*lint --e(923)*/ (*(volatile Ifx_GTM_SPE_PAT *)0xF0100A04u)

/** \\brief  A44, SPE Revolution counter compare value */
#define GTM_SPE4_REV_CMP               /*lint --e(923)*/ (*(volatile Ifx_GTM_SPE_REV_CMP *)0xF0100A44u)

/** \\brief  A40, SPE input revolution counter */
#define GTM_SPE4_REV_CNT               /*lint --e(923)*/ (*(volatile Ifx_GTM_SPE_REV_CNT *)0xF0100A40u)

/** \\brief  ACC, SPE Command register */
#define GTM_SPE5_CMD                   /*lint --e(923)*/ (*(volatile Ifx_GTM_SPE_CMD *)0xF0100ACCu)

/** \\brief  A80, SPE Control status register */
#define GTM_SPE5_CTRL_STAT             /*lint --e(923)*/ (*(volatile Ifx_GTM_SPE_CTRL_STAT *)0xF0100A80u)

/** \\brief  AC8, SPE Control status register 2 */
#define GTM_SPE5_CTRL_STAT2            /*lint --e(923)*/ (*(volatile Ifx_GTM_SPE_CTRL_STAT2 *)0xF0100AC8u)

/** \\brief  ABC, SPE Error interrupt enable register. */
#define GTM_SPE5_EIRQ_EN               /*lint --e(923)*/ (*(volatile Ifx_GTM_SPE_EIRQ_EN *)0xF0100ABCu)

/** \\brief  AB0, SPE Interrupt enable register. */
#define GTM_SPE5_IRQ_EN                /*lint --e(923)*/ (*(volatile Ifx_GTM_SPE_IRQ_EN *)0xF0100AB0u)

/** \\brief  AB4, SPE Interrupt generation by software. */
#define GTM_SPE5_IRQ_FORCINT           /*lint --e(923)*/ (*(volatile Ifx_GTM_SPE_IRQ_FORCINT *)0xF0100AB4u)

/** \\brief  AB8, SPE Interrupt mode configuration register */
#define GTM_SPE5_IRQ_MODE              /*lint --e(923)*/ (*(volatile Ifx_GTM_SPE_IRQ_MODE *)0xF0100AB8u)

/** \\brief  AAC, SPE Interrupt notification register. */
#define GTM_SPE5_IRQ_NOTIFY            /*lint --e(923)*/ (*(volatile Ifx_GTM_SPE_IRQ_NOTIFY *)0xF0100AACu)

/** \\brief  AA8, SPE output control register */
#define GTM_SPE5_OUT_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_SPE_OUT_CTRL *)0xF0100AA8u)

