Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  A88, SPE Output definition register */
#define GTM_SPE5_OUT_PAT0              /*lint --e(923)*/ (*(volatile Ifx_GTM_SPE_OUT_PAT *)0xF0100A88u)

/** \\brief  A8C, SPE Output definition register */
#define GTM_SPE5_OUT_PAT1              /*lint --e(923)*/ (*(volatile Ifx_GTM_SPE_OUT_PAT *)0xF0100A8Cu)

/** \\brief  A90, SPE Output definition register */
#define GTM_SPE5_OUT_PAT2              /*lint --e(923)*/ (*(volatile Ifx_GTM_SPE_OUT_PAT *)0xF0100A90u)

/** \\brief  A94, SPE Output definition register */
#define GTM_SPE5_OUT_PAT3              /*lint --e(923)*/ (*(volatile Ifx_GTM_SPE_OUT_PAT *)0xF0100A94u)

/** \\brief  A98, SPE Output definition register */
#define GTM_SPE5_OUT_PAT4              /*lint --e(923)*/ (*(volatile Ifx_GTM_SPE_OUT_PAT *)0xF0100A98u)

/** \\brief  A9C, SPE Output definition register */
#define GTM_SPE5_OUT_PAT5              /*lint --e(923)*/ (*(volatile Ifx_GTM_SPE_OUT_PAT *)0xF0100A9Cu)

/** \\brief  AA0, SPE Output definition register */
#define GTM_SPE5_OUT_PAT6              /*lint --e(923)*/ (*(volatile Ifx_GTM_SPE_OUT_PAT *)0xF0100AA0u)

/** \\brief  AA4, SPE Output definition register */
#define GTM_SPE5_OUT_PAT7              /*lint --e(923)*/ (*(volatile Ifx_GTM_SPE_OUT_PAT *)0xF0100AA4u)

/** \\brief  A84, SPE Input pattern definition register. */
#define GTM_SPE5_PAT                   /*lint --e(923)*/ (*(volatile Ifx_GTM_SPE_PAT *)0xF0100A84u)

/** \\brief  AC4, SPE Revolution counter compare value */
#define GTM_SPE5_REV_CMP               /*lint --e(923)*/ (*(volatile Ifx_GTM_SPE_REV_CMP *)0xF0100AC4u)

/** \\brief  AC0, SPE input revolution counter */
#define GTM_SPE5_REV_CNT               /*lint --e(923)*/ (*(volatile Ifx_GTM_SPE_REV_CNT *)0xF0100AC0u)

/** \\brief  108, TBU channel 0 base */
#define GTM_TBU_CH0_BASE               /*lint --e(923)*/ (*(volatile Ifx_GTM_TBU_CH0_BASE *)0xF0100108u)

/** \\brief  104, TBU channel 0 control */
#define GTM_TBU_CH0_CTRL               /*lint --e(923)*/ (*(volatile Ifx_GTM_TBU_CH0_CTRL *)0xF0100104u)

/** \\brief  110, TBU Channel 1 Base Register */
#define GTM_TBU_CH1_BASE               /*lint --e(923)*/ (*(volatile Ifx_GTM_TBU_CH1_BASE *)0xF0100110u)

/** \\brief  10C, TBU channel 1 control */
#define GTM_TBU_CH1_CTRL               /*lint --e(923)*/ (*(volatile Ifx_GTM_TBU_CH1_CTRL *)0xF010010Cu)

/** \\brief  118, TBU Channel 2 Base Register */
#define GTM_TBU_CH2_BASE               /*lint --e(923)*/ (*(volatile Ifx_GTM_TBU_CH2_BASE *)0xF0100118u)

/** \\brief  114, TBU channel 2 control */
#define GTM_TBU_CH2_CTRL               /*lint --e(923)*/ (*(volatile Ifx_GTM_TBU_CH2_CTRL *)0xF0100114u)

/** \\brief  120, TBU channel 3 base */
#define GTM_TBU_CH3_BASE               /*lint --e(923)*/ (*(volatile Ifx_GTM_TBU_CH3_BASE *)0xF0100120u)

/** \\brief  128, TBU channel 3 base captured */
#define GTM_TBU_CH3_BASE_CAPTURE       /*lint --e(923)*/ (*(volatile Ifx_GTM_TBU_CH3_BASE_CAPTURE *)0xF0100128u)

/** \\brief  124, TBU channel 3 modulo value */
#define GTM_TBU_CH3_BASE_MARK          /*lint --e(923)*/ (*(volatile Ifx_GTM_TBU_CH3_BASE_MARK *)0xF0100124u)

/** \\brief  11C, TBU channel 3 control */
#define GTM_TBU_CH3_CTRL               /*lint --e(923)*/ (*(volatile Ifx_GTM_TBU_CH3_CTRL *)0xF010011Cu)

/** \\brief  100, TBU global channel enable */
#define GTM_TBU_CHEN                   /*lint --e(923)*/ (*(volatile Ifx_GTM_TBU_CHEN *)0xF0100100u)

/** \\brief  1008, TIM channel 0 SMU counter register */
#define GTM_TIM0_CH0_CNT               /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNT *)0xF0101008u)

/** \\brief  1010, TIM channel 0 SMU shadow counter register */
#define GTM_TIM0_CH0_CNTS              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNTS *)0xF0101010u)

/** \\brief  1024, TIM channel 0 control register */
#define GTM_TIM0_CH0_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CTRL *)0xF0101024u)

/** \\brief  100C, TIM channel 0 SMU edge counter register */
#define GTM_TIM0_CH0_ECNT              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECNT *)0xF010100Cu)

/** \\brief  1028, TIM channel 0 extended control register */
#define GTM_TIM0_CH0_ECTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECTRL *)0xF0101028u)

/** \\brief  103C, TIM channel 0 error interrupt enable register */
#define GTM_TIM0_CH0_EIRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_EIRQ_EN *)0xF010103Cu)

/** \\brief  1020, TIM channel 0 filter parameter 1 register */
#define GTM_TIM0_CH0_FLT_FE            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_FE *)0xF0101020u)

/** \\brief  101C, TIM channel 0 filter parameter 0 register */
#define GTM_TIM0_CH0_FLT_RE            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_RE *)0xF010101Cu)

/** \\brief  1000, TIM channel 0 general purpose 0 register */
#define GTM_TIM0_CH0_GPR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR0 *)0xF0101000u)

/** \\brief  1004, TIM channel 0 general purpose 1 register */
#define GTM_TIM0_CH0_GPR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR1 *)0xF0101004u)

/** \\brief  1030, TIM channel 0 interrupt enable register */
#define GTM_TIM0_CH0_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_EN *)0xF0101030u)

/** \\brief  1034, TIM channel 0 force interrupt register */
#define GTM_TIM0_CH0_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_FORCINT *)0xF0101034u)

/** \\brief  1038, TIM channel 0 interrupt mode configuration register */
#define GTM_TIM0_CH0_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_MODE *)0xF0101038u)

/** \\brief  102C, TIM channel 0 interrupt notification register */
#define GTM_TIM0_CH0_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_NOTIFY *)0xF010102Cu)

/** \\brief  1014, TIM channel 0 TDU counter register */
#define GTM_TIM0_CH0_TDUC              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUC *)0xF0101014u)

/** \\brief  1018, TIM channel 0 TDU control register */
#define GTM_TIM0_CH0_TDUV              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUV *)0xF0101018u)

/** \\brief  1088, TIM channel 0 SMU counter register */
#define GTM_TIM0_CH1_CNT               /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNT *)0xF0101088u)

/** \\brief  1090, TIM channel 0 SMU shadow counter register */
#define GTM_TIM0_CH1_CNTS              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNTS *)0xF0101090u)

/** \\brief  10A4, TIM channel 0 control register */
#define GTM_TIM0_CH1_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CTRL *)0xF01010A4u)

