Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  108C, TIM channel 0 SMU edge counter register */
#define GTM_TIM0_CH1_ECNT              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECNT *)0xF010108Cu)

/** \\brief  10A8, TIM channel 0 extended control register */
#define GTM_TIM0_CH1_ECTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECTRL *)0xF01010A8u)

/** \\brief  10BC, TIM channel 0 error interrupt enable register */
#define GTM_TIM0_CH1_EIRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_EIRQ_EN *)0xF01010BCu)

/** \\brief  10A0, TIM channel 0 filter parameter 1 register */
#define GTM_TIM0_CH1_FLT_FE            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_FE *)0xF01010A0u)

/** \\brief  109C, TIM channel 0 filter parameter 0 register */
#define GTM_TIM0_CH1_FLT_RE            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_RE *)0xF010109Cu)

/** \\brief  1080, TIM channel 0 general purpose 0 register */
#define GTM_TIM0_CH1_GPR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR0 *)0xF0101080u)

/** \\brief  1084, TIM channel 0 general purpose 1 register */
#define GTM_TIM0_CH1_GPR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR1 *)0xF0101084u)

/** \\brief  10B0, TIM channel 0 interrupt enable register */
#define GTM_TIM0_CH1_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_EN *)0xF01010B0u)

/** \\brief  10B4, TIM channel 0 force interrupt register */
#define GTM_TIM0_CH1_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_FORCINT *)0xF01010B4u)

/** \\brief  10B8, TIM channel 0 interrupt mode configuration register */
#define GTM_TIM0_CH1_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_MODE *)0xF01010B8u)

/** \\brief  10AC, TIM channel 0 interrupt notification register */
#define GTM_TIM0_CH1_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_NOTIFY *)0xF01010ACu)

/** \\brief  1094, TIM channel 0 TDU counter register */
#define GTM_TIM0_CH1_TDUC              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUC *)0xF0101094u)

/** \\brief  1098, TIM channel 0 TDU control register */
#define GTM_TIM0_CH1_TDUV              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUV *)0xF0101098u)

/** \\brief  1108, TIM channel 0 SMU counter register */
#define GTM_TIM0_CH2_CNT               /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNT *)0xF0101108u)

/** \\brief  1110, TIM channel 0 SMU shadow counter register */
#define GTM_TIM0_CH2_CNTS              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNTS *)0xF0101110u)

/** \\brief  1124, TIM channel 0 control register */
#define GTM_TIM0_CH2_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CTRL *)0xF0101124u)

/** \\brief  110C, TIM channel 0 SMU edge counter register */
#define GTM_TIM0_CH2_ECNT              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECNT *)0xF010110Cu)

/** \\brief  1128, TIM channel 0 extended control register */
#define GTM_TIM0_CH2_ECTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECTRL *)0xF0101128u)

/** \\brief  113C, TIM channel 0 error interrupt enable register */
#define GTM_TIM0_CH2_EIRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_EIRQ_EN *)0xF010113Cu)

/** \\brief  1120, TIM channel 0 filter parameter 1 register */
#define GTM_TIM0_CH2_FLT_FE            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_FE *)0xF0101120u)

/** \\brief  111C, TIM channel 0 filter parameter 0 register */
#define GTM_TIM0_CH2_FLT_RE            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_RE *)0xF010111Cu)

/** \\brief  1100, TIM channel 0 general purpose 0 register */
#define GTM_TIM0_CH2_GPR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR0 *)0xF0101100u)

/** \\brief  1104, TIM channel 0 general purpose 1 register */
#define GTM_TIM0_CH2_GPR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR1 *)0xF0101104u)

/** \\brief  1130, TIM channel 0 interrupt enable register */
#define GTM_TIM0_CH2_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_EN *)0xF0101130u)

/** \\brief  1134, TIM channel 0 force interrupt register */
#define GTM_TIM0_CH2_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_FORCINT *)0xF0101134u)

/** \\brief  1138, TIM channel 0 interrupt mode configuration register */
#define GTM_TIM0_CH2_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_MODE *)0xF0101138u)

/** \\brief  112C, TIM channel 0 interrupt notification register */
#define GTM_TIM0_CH2_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_NOTIFY *)0xF010112Cu)

/** \\brief  1114, TIM channel 0 TDU counter register */
#define GTM_TIM0_CH2_TDUC              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUC *)0xF0101114u)

/** \\brief  1118, TIM channel 0 TDU control register */
#define GTM_TIM0_CH2_TDUV              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUV *)0xF0101118u)

/** \\brief  1188, TIM channel 0 SMU counter register */
#define GTM_TIM0_CH3_CNT               /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNT *)0xF0101188u)

/** \\brief  1190, TIM channel 0 SMU shadow counter register */
#define GTM_TIM0_CH3_CNTS              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNTS *)0xF0101190u)

/** \\brief  11A4, TIM channel 0 control register */
#define GTM_TIM0_CH3_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CTRL *)0xF01011A4u)

/** \\brief  118C, TIM channel 0 SMU edge counter register */
#define GTM_TIM0_CH3_ECNT              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECNT *)0xF010118Cu)

/** \\brief  11A8, TIM channel 0 extended control register */
#define GTM_TIM0_CH3_ECTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECTRL *)0xF01011A8u)

/** \\brief  11BC, TIM channel 0 error interrupt enable register */
#define GTM_TIM0_CH3_EIRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_EIRQ_EN *)0xF01011BCu)

/** \\brief  11A0, TIM channel 0 filter parameter 1 register */
#define GTM_TIM0_CH3_FLT_FE            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_FE *)0xF01011A0u)

/** \\brief  119C, TIM channel 0 filter parameter 0 register */
#define GTM_TIM0_CH3_FLT_RE            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_RE *)0xF010119Cu)

