Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  1180, TIM channel 0 general purpose 0 register */
#define GTM_TIM0_CH3_GPR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR0 *)0xF0101180u)

/** \\brief  1184, TIM channel 0 general purpose 1 register */
#define GTM_TIM0_CH3_GPR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR1 *)0xF0101184u)

/** \\brief  11B0, TIM channel 0 interrupt enable register */
#define GTM_TIM0_CH3_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_EN *)0xF01011B0u)

/** \\brief  11B4, TIM channel 0 force interrupt register */
#define GTM_TIM0_CH3_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_FORCINT *)0xF01011B4u)

/** \\brief  11B8, TIM channel 0 interrupt mode configuration register */
#define GTM_TIM0_CH3_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_MODE *)0xF01011B8u)

/** \\brief  11AC, TIM channel 0 interrupt notification register */
#define GTM_TIM0_CH3_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_NOTIFY *)0xF01011ACu)

/** \\brief  1194, TIM channel 0 TDU counter register */
#define GTM_TIM0_CH3_TDUC              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUC *)0xF0101194u)

/** \\brief  1198, TIM channel 0 TDU control register */
#define GTM_TIM0_CH3_TDUV              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUV *)0xF0101198u)

/** \\brief  1208, TIM channel 0 SMU counter register */
#define GTM_TIM0_CH4_CNT               /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNT *)0xF0101208u)

/** \\brief  1210, TIM channel 0 SMU shadow counter register */
#define GTM_TIM0_CH4_CNTS              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNTS *)0xF0101210u)

/** \\brief  1224, TIM channel 0 control register */
#define GTM_TIM0_CH4_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CTRL *)0xF0101224u)

/** \\brief  120C, TIM channel 0 SMU edge counter register */
#define GTM_TIM0_CH4_ECNT              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECNT *)0xF010120Cu)

/** \\brief  1228, TIM channel 0 extended control register */
#define GTM_TIM0_CH4_ECTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECTRL *)0xF0101228u)

/** \\brief  123C, TIM channel 0 error interrupt enable register */
#define GTM_TIM0_CH4_EIRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_EIRQ_EN *)0xF010123Cu)

/** \\brief  1220, TIM channel 0 filter parameter 1 register */
#define GTM_TIM0_CH4_FLT_FE            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_FE *)0xF0101220u)

/** \\brief  121C, TIM channel 0 filter parameter 0 register */
#define GTM_TIM0_CH4_FLT_RE            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_RE *)0xF010121Cu)

/** \\brief  1200, TIM channel 0 general purpose 0 register */
#define GTM_TIM0_CH4_GPR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR0 *)0xF0101200u)

/** \\brief  1204, TIM channel 0 general purpose 1 register */
#define GTM_TIM0_CH4_GPR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR1 *)0xF0101204u)

/** \\brief  1230, TIM channel 0 interrupt enable register */
#define GTM_TIM0_CH4_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_EN *)0xF0101230u)

/** \\brief  1234, TIM channel 0 force interrupt register */
#define GTM_TIM0_CH4_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_FORCINT *)0xF0101234u)

/** \\brief  1238, TIM channel 0 interrupt mode configuration register */
#define GTM_TIM0_CH4_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_MODE *)0xF0101238u)

/** \\brief  122C, TIM channel 0 interrupt notification register */
#define GTM_TIM0_CH4_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_NOTIFY *)0xF010122Cu)

/** \\brief  1214, TIM channel 0 TDU counter register */
#define GTM_TIM0_CH4_TDUC              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUC *)0xF0101214u)

/** \\brief  1218, TIM channel 0 TDU control register */
#define GTM_TIM0_CH4_TDUV              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUV *)0xF0101218u)

/** \\brief  1288, TIM channel 0 SMU counter register */
#define GTM_TIM0_CH5_CNT               /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNT *)0xF0101288u)

/** \\brief  1290, TIM channel 0 SMU shadow counter register */
#define GTM_TIM0_CH5_CNTS              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNTS *)0xF0101290u)

/** \\brief  12A4, TIM channel 0 control register */
#define GTM_TIM0_CH5_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CTRL *)0xF01012A4u)

/** \\brief  128C, TIM channel 0 SMU edge counter register */
#define GTM_TIM0_CH5_ECNT              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECNT *)0xF010128Cu)

/** \\brief  12A8, TIM channel 0 extended control register */
#define GTM_TIM0_CH5_ECTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECTRL *)0xF01012A8u)

/** \\brief  12BC, TIM channel 0 error interrupt enable register */
#define GTM_TIM0_CH5_EIRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_EIRQ_EN *)0xF01012BCu)

/** \\brief  12A0, TIM channel 0 filter parameter 1 register */
#define GTM_TIM0_CH5_FLT_FE            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_FE *)0xF01012A0u)

/** \\brief  129C, TIM channel 0 filter parameter 0 register */
#define GTM_TIM0_CH5_FLT_RE            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_RE *)0xF010129Cu)

/** \\brief  1280, TIM channel 0 general purpose 0 register */
#define GTM_TIM0_CH5_GPR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR0 *)0xF0101280u)

/** \\brief  1284, TIM channel 0 general purpose 1 register */
#define GTM_TIM0_CH5_GPR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR1 *)0xF0101284u)

/** \\brief  12B0, TIM channel 0 interrupt enable register */
#define GTM_TIM0_CH5_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_EN *)0xF01012B0u)

/** \\brief  12B4, TIM channel 0 force interrupt register */
#define GTM_TIM0_CH5_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_FORCINT *)0xF01012B4u)

/** \\brief  12B8, TIM channel 0 interrupt mode configuration register */
#define GTM_TIM0_CH5_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_MODE *)0xF01012B8u)

/** \\brief  12AC, TIM channel 0 interrupt notification register */
#define GTM_TIM0_CH5_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_NOTIFY *)0xF01012ACu)

/** \\brief  1294, TIM channel 0 TDU counter register */
#define GTM_TIM0_CH5_TDUC              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUC *)0xF0101294u)

/** \\brief  1298, TIM channel 0 TDU control register */
#define GTM_TIM0_CH5_TDUV              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUV *)0xF0101298u)

