Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  1308, TIM channel 0 SMU counter register */
#define GTM_TIM0_CH6_CNT               /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNT *)0xF0101308u)

/** \\brief  1310, TIM channel 0 SMU shadow counter register */
#define GTM_TIM0_CH6_CNTS              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNTS *)0xF0101310u)

/** \\brief  1324, TIM channel 0 control register */
#define GTM_TIM0_CH6_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CTRL *)0xF0101324u)

/** \\brief  130C, TIM channel 0 SMU edge counter register */
#define GTM_TIM0_CH6_ECNT              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECNT *)0xF010130Cu)

/** \\brief  1328, TIM channel 0 extended control register */
#define GTM_TIM0_CH6_ECTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECTRL *)0xF0101328u)

/** \\brief  133C, TIM channel 0 error interrupt enable register */
#define GTM_TIM0_CH6_EIRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_EIRQ_EN *)0xF010133Cu)

/** \\brief  1320, TIM channel 0 filter parameter 1 register */
#define GTM_TIM0_CH6_FLT_FE            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_FE *)0xF0101320u)

/** \\brief  131C, TIM channel 0 filter parameter 0 register */
#define GTM_TIM0_CH6_FLT_RE            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_RE *)0xF010131Cu)

/** \\brief  1300, TIM channel 0 general purpose 0 register */
#define GTM_TIM0_CH6_GPR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR0 *)0xF0101300u)

/** \\brief  1304, TIM channel 0 general purpose 1 register */
#define GTM_TIM0_CH6_GPR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR1 *)0xF0101304u)

/** \\brief  1330, TIM channel 0 interrupt enable register */
#define GTM_TIM0_CH6_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_EN *)0xF0101330u)

/** \\brief  1334, TIM channel 0 force interrupt register */
#define GTM_TIM0_CH6_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_FORCINT *)0xF0101334u)

/** \\brief  1338, TIM channel 0 interrupt mode configuration register */
#define GTM_TIM0_CH6_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_MODE *)0xF0101338u)

/** \\brief  132C, TIM channel 0 interrupt notification register */
#define GTM_TIM0_CH6_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_NOTIFY *)0xF010132Cu)

/** \\brief  1314, TIM channel 0 TDU counter register */
#define GTM_TIM0_CH6_TDUC              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUC *)0xF0101314u)

/** \\brief  1318, TIM channel 0 TDU control register */
#define GTM_TIM0_CH6_TDUV              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUV *)0xF0101318u)

/** \\brief  1388, TIM channel 0 SMU counter register */
#define GTM_TIM0_CH7_CNT               /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNT *)0xF0101388u)

/** \\brief  1390, TIM channel 0 SMU shadow counter register */
#define GTM_TIM0_CH7_CNTS              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNTS *)0xF0101390u)

/** \\brief  13A4, TIM channel 0 control register */
#define GTM_TIM0_CH7_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CTRL *)0xF01013A4u)

/** \\brief  138C, TIM channel 0 SMU edge counter register */
#define GTM_TIM0_CH7_ECNT              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECNT *)0xF010138Cu)

/** \\brief  13A8, TIM channel 0 extended control register */
#define GTM_TIM0_CH7_ECTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECTRL *)0xF01013A8u)

/** \\brief  13BC, TIM channel 0 error interrupt enable register */
#define GTM_TIM0_CH7_EIRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_EIRQ_EN *)0xF01013BCu)

/** \\brief  13A0, TIM channel 0 filter parameter 1 register */
#define GTM_TIM0_CH7_FLT_FE            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_FE *)0xF01013A0u)

/** \\brief  139C, TIM channel 0 filter parameter 0 register */
#define GTM_TIM0_CH7_FLT_RE            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_RE *)0xF010139Cu)

/** \\brief  1380, TIM channel 0 general purpose 0 register */
#define GTM_TIM0_CH7_GPR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR0 *)0xF0101380u)

/** \\brief  1384, TIM channel 0 general purpose 1 register */
#define GTM_TIM0_CH7_GPR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR1 *)0xF0101384u)

/** \\brief  13B0, TIM channel 0 interrupt enable register */
#define GTM_TIM0_CH7_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_EN *)0xF01013B0u)

/** \\brief  13B4, TIM channel 0 force interrupt register */
#define GTM_TIM0_CH7_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_FORCINT *)0xF01013B4u)

/** \\brief  13B8, TIM channel 0 interrupt mode configuration register */
#define GTM_TIM0_CH7_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_MODE *)0xF01013B8u)

/** \\brief  13AC, TIM channel 0 interrupt notification register */
#define GTM_TIM0_CH7_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_NOTIFY *)0xF01013ACu)

/** \\brief  1394, TIM channel 0 TDU counter register */
#define GTM_TIM0_CH7_TDUC              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUC *)0xF0101394u)

/** \\brief  1398, TIM channel 0 TDU control register */
#define GTM_TIM0_CH7_TDUV              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUV *)0xF0101398u)

/** \\brief  1078, TIM channel x AUX IN source selection register */
#define GTM_TIM0_IN_SRC                /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_IN_SRC *)0xF0101078u)

/** \\brief  1074, TIM input value observation register */
#define GTM_TIM0_INP_VAL               /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_INP_VAL *)0xF0101074u)

/** \\brief  107C, TIM global software reset register */
#define GTM_TIM0_RST                   /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_RST *)0xF010107Cu)

/** \\brief  1808, TIM channel 0 SMU counter register */
#define GTM_TIM1_CH0_CNT               /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNT *)0xF0101808u)

/** \\brief  1810, TIM channel 0 SMU shadow counter register */
#define GTM_TIM1_CH0_CNTS              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNTS *)0xF0101810u)

/** \\brief  1824, TIM channel 0 control register */
#define GTM_TIM1_CH0_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CTRL *)0xF0101824u)

