Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  180C, TIM channel 0 SMU edge counter register */
#define GTM_TIM1_CH0_ECNT              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECNT *)0xF010180Cu)

/** \\brief  1828, TIM channel 0 extended control register */
#define GTM_TIM1_CH0_ECTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECTRL *)0xF0101828u)

/** \\brief  183C, TIM channel 0 error interrupt enable register */
#define GTM_TIM1_CH0_EIRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_EIRQ_EN *)0xF010183Cu)

/** \\brief  1820, TIM channel 0 filter parameter 1 register */
#define GTM_TIM1_CH0_FLT_FE            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_FE *)0xF0101820u)

/** \\brief  181C, TIM channel 0 filter parameter 0 register */
#define GTM_TIM1_CH0_FLT_RE            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_RE *)0xF010181Cu)

/** \\brief  1800, TIM channel 0 general purpose 0 register */
#define GTM_TIM1_CH0_GPR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR0 *)0xF0101800u)

/** \\brief  1804, TIM channel 0 general purpose 1 register */
#define GTM_TIM1_CH0_GPR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR1 *)0xF0101804u)

/** \\brief  1830, TIM channel 0 interrupt enable register */
#define GTM_TIM1_CH0_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_EN *)0xF0101830u)

/** \\brief  1834, TIM channel 0 force interrupt register */
#define GTM_TIM1_CH0_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_FORCINT *)0xF0101834u)

/** \\brief  1838, TIM channel 0 interrupt mode configuration register */
#define GTM_TIM1_CH0_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_MODE *)0xF0101838u)

/** \\brief  182C, TIM channel 0 interrupt notification register */
#define GTM_TIM1_CH0_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_NOTIFY *)0xF010182Cu)

/** \\brief  1814, TIM channel 0 TDU counter register */
#define GTM_TIM1_CH0_TDUC              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUC *)0xF0101814u)

/** \\brief  1818, TIM channel 0 TDU control register */
#define GTM_TIM1_CH0_TDUV              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUV *)0xF0101818u)

/** \\brief  1888, TIM channel 0 SMU counter register */
#define GTM_TIM1_CH1_CNT               /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNT *)0xF0101888u)

/** \\brief  1890, TIM channel 0 SMU shadow counter register */
#define GTM_TIM1_CH1_CNTS              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNTS *)0xF0101890u)

/** \\brief  18A4, TIM channel 0 control register */
#define GTM_TIM1_CH1_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CTRL *)0xF01018A4u)

/** \\brief  188C, TIM channel 0 SMU edge counter register */
#define GTM_TIM1_CH1_ECNT              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECNT *)0xF010188Cu)

/** \\brief  18A8, TIM channel 0 extended control register */
#define GTM_TIM1_CH1_ECTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECTRL *)0xF01018A8u)

/** \\brief  18BC, TIM channel 0 error interrupt enable register */
#define GTM_TIM1_CH1_EIRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_EIRQ_EN *)0xF01018BCu)

/** \\brief  18A0, TIM channel 0 filter parameter 1 register */
#define GTM_TIM1_CH1_FLT_FE            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_FE *)0xF01018A0u)

/** \\brief  189C, TIM channel 0 filter parameter 0 register */
#define GTM_TIM1_CH1_FLT_RE            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_RE *)0xF010189Cu)

/** \\brief  1880, TIM channel 0 general purpose 0 register */
#define GTM_TIM1_CH1_GPR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR0 *)0xF0101880u)

/** \\brief  1884, TIM channel 0 general purpose 1 register */
#define GTM_TIM1_CH1_GPR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR1 *)0xF0101884u)

/** \\brief  18B0, TIM channel 0 interrupt enable register */
#define GTM_TIM1_CH1_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_EN *)0xF01018B0u)

/** \\brief  18B4, TIM channel 0 force interrupt register */
#define GTM_TIM1_CH1_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_FORCINT *)0xF01018B4u)

/** \\brief  18B8, TIM channel 0 interrupt mode configuration register */
#define GTM_TIM1_CH1_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_MODE *)0xF01018B8u)

/** \\brief  18AC, TIM channel 0 interrupt notification register */
#define GTM_TIM1_CH1_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_NOTIFY *)0xF01018ACu)

/** \\brief  1894, TIM channel 0 TDU counter register */
#define GTM_TIM1_CH1_TDUC              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUC *)0xF0101894u)

/** \\brief  1898, TIM channel 0 TDU control register */
#define GTM_TIM1_CH1_TDUV              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUV *)0xF0101898u)

/** \\brief  1908, TIM channel 0 SMU counter register */
#define GTM_TIM1_CH2_CNT               /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNT *)0xF0101908u)

/** \\brief  1910, TIM channel 0 SMU shadow counter register */
#define GTM_TIM1_CH2_CNTS              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNTS *)0xF0101910u)

/** \\brief  1924, TIM channel 0 control register */
#define GTM_TIM1_CH2_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CTRL *)0xF0101924u)

/** \\brief  190C, TIM channel 0 SMU edge counter register */
#define GTM_TIM1_CH2_ECNT              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECNT *)0xF010190Cu)

/** \\brief  1928, TIM channel 0 extended control register */
#define GTM_TIM1_CH2_ECTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECTRL *)0xF0101928u)

/** \\brief  193C, TIM channel 0 error interrupt enable register */
#define GTM_TIM1_CH2_EIRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_EIRQ_EN *)0xF010193Cu)

/** \\brief  1920, TIM channel 0 filter parameter 1 register */
#define GTM_TIM1_CH2_FLT_FE            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_FE *)0xF0101920u)

/** \\brief  191C, TIM channel 0 filter parameter 0 register */
#define GTM_TIM1_CH2_FLT_RE            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_RE *)0xF010191Cu)

/** \\brief  1900, TIM channel 0 general purpose 0 register */
#define GTM_TIM1_CH2_GPR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR0 *)0xF0101900u)

/** \\brief  1904, TIM channel 0 general purpose 1 register */
#define GTM_TIM1_CH2_GPR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR1 *)0xF0101904u)

