Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  1930, TIM channel 0 interrupt enable register */
#define GTM_TIM1_CH2_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_EN *)0xF0101930u)

/** \\brief  1934, TIM channel 0 force interrupt register */
#define GTM_TIM1_CH2_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_FORCINT *)0xF0101934u)

/** \\brief  1938, TIM channel 0 interrupt mode configuration register */
#define GTM_TIM1_CH2_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_MODE *)0xF0101938u)

/** \\brief  192C, TIM channel 0 interrupt notification register */
#define GTM_TIM1_CH2_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_NOTIFY *)0xF010192Cu)

/** \\brief  1914, TIM channel 0 TDU counter register */
#define GTM_TIM1_CH2_TDUC              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUC *)0xF0101914u)

/** \\brief  1918, TIM channel 0 TDU control register */
#define GTM_TIM1_CH2_TDUV              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUV *)0xF0101918u)

/** \\brief  1988, TIM channel 0 SMU counter register */
#define GTM_TIM1_CH3_CNT               /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNT *)0xF0101988u)

/** \\brief  1990, TIM channel 0 SMU shadow counter register */
#define GTM_TIM1_CH3_CNTS              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNTS *)0xF0101990u)

/** \\brief  19A4, TIM channel 0 control register */
#define GTM_TIM1_CH3_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CTRL *)0xF01019A4u)

/** \\brief  198C, TIM channel 0 SMU edge counter register */
#define GTM_TIM1_CH3_ECNT              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECNT *)0xF010198Cu)

/** \\brief  19A8, TIM channel 0 extended control register */
#define GTM_TIM1_CH3_ECTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECTRL *)0xF01019A8u)

/** \\brief  19BC, TIM channel 0 error interrupt enable register */
#define GTM_TIM1_CH3_EIRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_EIRQ_EN *)0xF01019BCu)

/** \\brief  19A0, TIM channel 0 filter parameter 1 register */
#define GTM_TIM1_CH3_FLT_FE            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_FE *)0xF01019A0u)

/** \\brief  199C, TIM channel 0 filter parameter 0 register */
#define GTM_TIM1_CH3_FLT_RE            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_RE *)0xF010199Cu)

/** \\brief  1980, TIM channel 0 general purpose 0 register */
#define GTM_TIM1_CH3_GPR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR0 *)0xF0101980u)

/** \\brief  1984, TIM channel 0 general purpose 1 register */
#define GTM_TIM1_CH3_GPR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR1 *)0xF0101984u)

/** \\brief  19B0, TIM channel 0 interrupt enable register */
#define GTM_TIM1_CH3_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_EN *)0xF01019B0u)

/** \\brief  19B4, TIM channel 0 force interrupt register */
#define GTM_TIM1_CH3_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_FORCINT *)0xF01019B4u)

/** \\brief  19B8, TIM channel 0 interrupt mode configuration register */
#define GTM_TIM1_CH3_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_MODE *)0xF01019B8u)

/** \\brief  19AC, TIM channel 0 interrupt notification register */
#define GTM_TIM1_CH3_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_NOTIFY *)0xF01019ACu)

/** \\brief  1994, TIM channel 0 TDU counter register */
#define GTM_TIM1_CH3_TDUC              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUC *)0xF0101994u)

/** \\brief  1998, TIM channel 0 TDU control register */
#define GTM_TIM1_CH3_TDUV              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUV *)0xF0101998u)

/** \\brief  1A08, TIM channel 0 SMU counter register */
#define GTM_TIM1_CH4_CNT               /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNT *)0xF0101A08u)

/** \\brief  1A10, TIM channel 0 SMU shadow counter register */
#define GTM_TIM1_CH4_CNTS              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNTS *)0xF0101A10u)

/** \\brief  1A24, TIM channel 0 control register */
#define GTM_TIM1_CH4_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CTRL *)0xF0101A24u)

/** \\brief  1A0C, TIM channel 0 SMU edge counter register */
#define GTM_TIM1_CH4_ECNT              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECNT *)0xF0101A0Cu)

/** \\brief  1A28, TIM channel 0 extended control register */
#define GTM_TIM1_CH4_ECTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECTRL *)0xF0101A28u)

/** \\brief  1A3C, TIM channel 0 error interrupt enable register */
#define GTM_TIM1_CH4_EIRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_EIRQ_EN *)0xF0101A3Cu)

/** \\brief  1A20, TIM channel 0 filter parameter 1 register */
#define GTM_TIM1_CH4_FLT_FE            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_FE *)0xF0101A20u)

/** \\brief  1A1C, TIM channel 0 filter parameter 0 register */
#define GTM_TIM1_CH4_FLT_RE            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_RE *)0xF0101A1Cu)

/** \\brief  1A00, TIM channel 0 general purpose 0 register */
#define GTM_TIM1_CH4_GPR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR0 *)0xF0101A00u)

/** \\brief  1A04, TIM channel 0 general purpose 1 register */
#define GTM_TIM1_CH4_GPR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR1 *)0xF0101A04u)

/** \\brief  1A30, TIM channel 0 interrupt enable register */
#define GTM_TIM1_CH4_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_EN *)0xF0101A30u)

/** \\brief  1A34, TIM channel 0 force interrupt register */
#define GTM_TIM1_CH4_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_FORCINT *)0xF0101A34u)

/** \\brief  1A38, TIM channel 0 interrupt mode configuration register */
#define GTM_TIM1_CH4_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_MODE *)0xF0101A38u)

/** \\brief  1A2C, TIM channel 0 interrupt notification register */
#define GTM_TIM1_CH4_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_NOTIFY *)0xF0101A2Cu)

