Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  1A14, TIM channel 0 TDU counter register */
#define GTM_TIM1_CH4_TDUC              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUC *)0xF0101A14u)

/** \\brief  1A18, TIM channel 0 TDU control register */
#define GTM_TIM1_CH4_TDUV              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUV *)0xF0101A18u)

/** \\brief  1A88, TIM channel 0 SMU counter register */
#define GTM_TIM1_CH5_CNT               /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNT *)0xF0101A88u)

/** \\brief  1A90, TIM channel 0 SMU shadow counter register */
#define GTM_TIM1_CH5_CNTS              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNTS *)0xF0101A90u)

/** \\brief  1AA4, TIM channel 0 control register */
#define GTM_TIM1_CH5_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CTRL *)0xF0101AA4u)

/** \\brief  1A8C, TIM channel 0 SMU edge counter register */
#define GTM_TIM1_CH5_ECNT              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECNT *)0xF0101A8Cu)

/** \\brief  1AA8, TIM channel 0 extended control register */
#define GTM_TIM1_CH5_ECTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECTRL *)0xF0101AA8u)

/** \\brief  1ABC, TIM channel 0 error interrupt enable register */
#define GTM_TIM1_CH5_EIRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_EIRQ_EN *)0xF0101ABCu)

/** \\brief  1AA0, TIM channel 0 filter parameter 1 register */
#define GTM_TIM1_CH5_FLT_FE            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_FE *)0xF0101AA0u)

/** \\brief  1A9C, TIM channel 0 filter parameter 0 register */
#define GTM_TIM1_CH5_FLT_RE            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_RE *)0xF0101A9Cu)

/** \\brief  1A80, TIM channel 0 general purpose 0 register */
#define GTM_TIM1_CH5_GPR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR0 *)0xF0101A80u)

/** \\brief  1A84, TIM channel 0 general purpose 1 register */
#define GTM_TIM1_CH5_GPR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR1 *)0xF0101A84u)

/** \\brief  1AB0, TIM channel 0 interrupt enable register */
#define GTM_TIM1_CH5_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_EN *)0xF0101AB0u)

/** \\brief  1AB4, TIM channel 0 force interrupt register */
#define GTM_TIM1_CH5_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_FORCINT *)0xF0101AB4u)

/** \\brief  1AB8, TIM channel 0 interrupt mode configuration register */
#define GTM_TIM1_CH5_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_MODE *)0xF0101AB8u)

/** \\brief  1AAC, TIM channel 0 interrupt notification register */
#define GTM_TIM1_CH5_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_NOTIFY *)0xF0101AACu)

/** \\brief  1A94, TIM channel 0 TDU counter register */
#define GTM_TIM1_CH5_TDUC              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUC *)0xF0101A94u)

/** \\brief  1A98, TIM channel 0 TDU control register */
#define GTM_TIM1_CH5_TDUV              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUV *)0xF0101A98u)

/** \\brief  1B08, TIM channel 0 SMU counter register */
#define GTM_TIM1_CH6_CNT               /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNT *)0xF0101B08u)

/** \\brief  1B10, TIM channel 0 SMU shadow counter register */
#define GTM_TIM1_CH6_CNTS              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNTS *)0xF0101B10u)

/** \\brief  1B24, TIM channel 0 control register */
#define GTM_TIM1_CH6_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CTRL *)0xF0101B24u)

/** \\brief  1B0C, TIM channel 0 SMU edge counter register */
#define GTM_TIM1_CH6_ECNT              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECNT *)0xF0101B0Cu)

/** \\brief  1B28, TIM channel 0 extended control register */
#define GTM_TIM1_CH6_ECTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECTRL *)0xF0101B28u)

/** \\brief  1B3C, TIM channel 0 error interrupt enable register */
#define GTM_TIM1_CH6_EIRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_EIRQ_EN *)0xF0101B3Cu)

/** \\brief  1B20, TIM channel 0 filter parameter 1 register */
#define GTM_TIM1_CH6_FLT_FE            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_FE *)0xF0101B20u)

/** \\brief  1B1C, TIM channel 0 filter parameter 0 register */
#define GTM_TIM1_CH6_FLT_RE            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_RE *)0xF0101B1Cu)

/** \\brief  1B00, TIM channel 0 general purpose 0 register */
#define GTM_TIM1_CH6_GPR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR0 *)0xF0101B00u)

/** \\brief  1B04, TIM channel 0 general purpose 1 register */
#define GTM_TIM1_CH6_GPR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR1 *)0xF0101B04u)

/** \\brief  1B30, TIM channel 0 interrupt enable register */
#define GTM_TIM1_CH6_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_EN *)0xF0101B30u)

/** \\brief  1B34, TIM channel 0 force interrupt register */
#define GTM_TIM1_CH6_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_FORCINT *)0xF0101B34u)

/** \\brief  1B38, TIM channel 0 interrupt mode configuration register */
#define GTM_TIM1_CH6_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_MODE *)0xF0101B38u)

/** \\brief  1B2C, TIM channel 0 interrupt notification register */
#define GTM_TIM1_CH6_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_NOTIFY *)0xF0101B2Cu)

/** \\brief  1B14, TIM channel 0 TDU counter register */
#define GTM_TIM1_CH6_TDUC              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUC *)0xF0101B14u)

/** \\brief  1B18, TIM channel 0 TDU control register */
#define GTM_TIM1_CH6_TDUV              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUV *)0xF0101B18u)

/** \\brief  1B88, TIM channel 0 SMU counter register */
#define GTM_TIM1_CH7_CNT               /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNT *)0xF0101B88u)

/** \\brief  1B90, TIM channel 0 SMU shadow counter register */
#define GTM_TIM1_CH7_CNTS              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNTS *)0xF0101B90u)

/** \\brief  1BA4, TIM channel 0 control register */
#define GTM_TIM1_CH7_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CTRL *)0xF0101BA4u)

/** \\brief  1B8C, TIM channel 0 SMU edge counter register */
#define GTM_TIM1_CH7_ECNT              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECNT *)0xF0101B8Cu)

/** \\brief  1BA8, TIM channel 0 extended control register */
#define GTM_TIM1_CH7_ECTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECTRL *)0xF0101BA8u)

