Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  1BBC, TIM channel 0 error interrupt enable register */
#define GTM_TIM1_CH7_EIRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_EIRQ_EN *)0xF0101BBCu)

/** \\brief  1BA0, TIM channel 0 filter parameter 1 register */
#define GTM_TIM1_CH7_FLT_FE            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_FE *)0xF0101BA0u)

/** \\brief  1B9C, TIM channel 0 filter parameter 0 register */
#define GTM_TIM1_CH7_FLT_RE            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_RE *)0xF0101B9Cu)

/** \\brief  1B80, TIM channel 0 general purpose 0 register */
#define GTM_TIM1_CH7_GPR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR0 *)0xF0101B80u)

/** \\brief  1B84, TIM channel 0 general purpose 1 register */
#define GTM_TIM1_CH7_GPR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR1 *)0xF0101B84u)

/** \\brief  1BB0, TIM channel 0 interrupt enable register */
#define GTM_TIM1_CH7_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_EN *)0xF0101BB0u)

/** \\brief  1BB4, TIM channel 0 force interrupt register */
#define GTM_TIM1_CH7_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_FORCINT *)0xF0101BB4u)

/** \\brief  1BB8, TIM channel 0 interrupt mode configuration register */
#define GTM_TIM1_CH7_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_MODE *)0xF0101BB8u)

/** \\brief  1BAC, TIM channel 0 interrupt notification register */
#define GTM_TIM1_CH7_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_NOTIFY *)0xF0101BACu)

/** \\brief  1B94, TIM channel 0 TDU counter register */
#define GTM_TIM1_CH7_TDUC              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUC *)0xF0101B94u)

/** \\brief  1B98, TIM channel 0 TDU control register */
#define GTM_TIM1_CH7_TDUV              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUV *)0xF0101B98u)

/** \\brief  1878, TIM channel x AUX IN source selection register */
#define GTM_TIM1_IN_SRC                /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_IN_SRC *)0xF0101878u)

/** \\brief  1874, TIM input value observation register */
#define GTM_TIM1_INP_VAL               /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_INP_VAL *)0xF0101874u)

/** \\brief  187C, TIM global software reset register */
#define GTM_TIM1_RST                   /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_RST *)0xF010187Cu)

/** \\brief  2008, TIM channel 0 SMU counter register */
#define GTM_TIM2_CH0_CNT               /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNT *)0xF0102008u)

/** \\brief  2010, TIM channel 0 SMU shadow counter register */
#define GTM_TIM2_CH0_CNTS              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNTS *)0xF0102010u)

/** \\brief  2024, TIM channel 0 control register */
#define GTM_TIM2_CH0_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CTRL *)0xF0102024u)

/** \\brief  200C, TIM channel 0 SMU edge counter register */
#define GTM_TIM2_CH0_ECNT              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECNT *)0xF010200Cu)

/** \\brief  2028, TIM channel 0 extended control register */
#define GTM_TIM2_CH0_ECTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECTRL *)0xF0102028u)

/** \\brief  203C, TIM channel 0 error interrupt enable register */
#define GTM_TIM2_CH0_EIRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_EIRQ_EN *)0xF010203Cu)

/** \\brief  2020, TIM channel 0 filter parameter 1 register */
#define GTM_TIM2_CH0_FLT_FE            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_FE *)0xF0102020u)

/** \\brief  201C, TIM channel 0 filter parameter 0 register */
#define GTM_TIM2_CH0_FLT_RE            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_RE *)0xF010201Cu)

/** \\brief  2000, TIM channel 0 general purpose 0 register */
#define GTM_TIM2_CH0_GPR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR0 *)0xF0102000u)

/** \\brief  2004, TIM channel 0 general purpose 1 register */
#define GTM_TIM2_CH0_GPR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR1 *)0xF0102004u)

/** \\brief  2030, TIM channel 0 interrupt enable register */
#define GTM_TIM2_CH0_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_EN *)0xF0102030u)

/** \\brief  2034, TIM channel 0 force interrupt register */
#define GTM_TIM2_CH0_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_FORCINT *)0xF0102034u)

/** \\brief  2038, TIM channel 0 interrupt mode configuration register */
#define GTM_TIM2_CH0_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_MODE *)0xF0102038u)

/** \\brief  202C, TIM channel 0 interrupt notification register */
#define GTM_TIM2_CH0_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_NOTIFY *)0xF010202Cu)

/** \\brief  2014, TIM channel 0 TDU counter register */
#define GTM_TIM2_CH0_TDUC              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUC *)0xF0102014u)

/** \\brief  2018, TIM channel 0 TDU control register */
#define GTM_TIM2_CH0_TDUV              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUV *)0xF0102018u)

/** \\brief  2088, TIM channel 0 SMU counter register */
#define GTM_TIM2_CH1_CNT               /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNT *)0xF0102088u)

/** \\brief  2090, TIM channel 0 SMU shadow counter register */
#define GTM_TIM2_CH1_CNTS              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNTS *)0xF0102090u)

/** \\brief  20A4, TIM channel 0 control register */
#define GTM_TIM2_CH1_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CTRL *)0xF01020A4u)

/** \\brief  208C, TIM channel 0 SMU edge counter register */
#define GTM_TIM2_CH1_ECNT              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECNT *)0xF010208Cu)

/** \\brief  20A8, TIM channel 0 extended control register */
#define GTM_TIM2_CH1_ECTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECTRL *)0xF01020A8u)

/** \\brief  20BC, TIM channel 0 error interrupt enable register */
#define GTM_TIM2_CH1_EIRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_EIRQ_EN *)0xF01020BCu)

