Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  20A0, TIM channel 0 filter parameter 1 register */
#define GTM_TIM2_CH1_FLT_FE            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_FE *)0xF01020A0u)

/** \\brief  209C, TIM channel 0 filter parameter 0 register */
#define GTM_TIM2_CH1_FLT_RE            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_RE *)0xF010209Cu)

/** \\brief  2080, TIM channel 0 general purpose 0 register */
#define GTM_TIM2_CH1_GPR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR0 *)0xF0102080u)

/** \\brief  2084, TIM channel 0 general purpose 1 register */
#define GTM_TIM2_CH1_GPR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR1 *)0xF0102084u)

/** \\brief  20B0, TIM channel 0 interrupt enable register */
#define GTM_TIM2_CH1_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_EN *)0xF01020B0u)

/** \\brief  20B4, TIM channel 0 force interrupt register */
#define GTM_TIM2_CH1_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_FORCINT *)0xF01020B4u)

/** \\brief  20B8, TIM channel 0 interrupt mode configuration register */
#define GTM_TIM2_CH1_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_MODE *)0xF01020B8u)

/** \\brief  20AC, TIM channel 0 interrupt notification register */
#define GTM_TIM2_CH1_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_NOTIFY *)0xF01020ACu)

/** \\brief  2094, TIM channel 0 TDU counter register */
#define GTM_TIM2_CH1_TDUC              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUC *)0xF0102094u)

/** \\brief  2098, TIM channel 0 TDU control register */
#define GTM_TIM2_CH1_TDUV              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUV *)0xF0102098u)

/** \\brief  2108, TIM channel 0 SMU counter register */
#define GTM_TIM2_CH2_CNT               /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNT *)0xF0102108u)

/** \\brief  2110, TIM channel 0 SMU shadow counter register */
#define GTM_TIM2_CH2_CNTS              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNTS *)0xF0102110u)

/** \\brief  2124, TIM channel 0 control register */
#define GTM_TIM2_CH2_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CTRL *)0xF0102124u)

/** \\brief  210C, TIM channel 0 SMU edge counter register */
#define GTM_TIM2_CH2_ECNT              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECNT *)0xF010210Cu)

/** \\brief  2128, TIM channel 0 extended control register */
#define GTM_TIM2_CH2_ECTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECTRL *)0xF0102128u)

/** \\brief  213C, TIM channel 0 error interrupt enable register */
#define GTM_TIM2_CH2_EIRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_EIRQ_EN *)0xF010213Cu)

/** \\brief  2120, TIM channel 0 filter parameter 1 register */
#define GTM_TIM2_CH2_FLT_FE            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_FE *)0xF0102120u)

/** \\brief  211C, TIM channel 0 filter parameter 0 register */
#define GTM_TIM2_CH2_FLT_RE            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_RE *)0xF010211Cu)

/** \\brief  2100, TIM channel 0 general purpose 0 register */
#define GTM_TIM2_CH2_GPR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR0 *)0xF0102100u)

/** \\brief  2104, TIM channel 0 general purpose 1 register */
#define GTM_TIM2_CH2_GPR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR1 *)0xF0102104u)

/** \\brief  2130, TIM channel 0 interrupt enable register */
#define GTM_TIM2_CH2_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_EN *)0xF0102130u)

/** \\brief  2134, TIM channel 0 force interrupt register */
#define GTM_TIM2_CH2_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_FORCINT *)0xF0102134u)

/** \\brief  2138, TIM channel 0 interrupt mode configuration register */
#define GTM_TIM2_CH2_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_MODE *)0xF0102138u)

/** \\brief  212C, TIM channel 0 interrupt notification register */
#define GTM_TIM2_CH2_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_NOTIFY *)0xF010212Cu)

/** \\brief  2114, TIM channel 0 TDU counter register */
#define GTM_TIM2_CH2_TDUC              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUC *)0xF0102114u)

/** \\brief  2118, TIM channel 0 TDU control register */
#define GTM_TIM2_CH2_TDUV              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUV *)0xF0102118u)

/** \\brief  2188, TIM channel 0 SMU counter register */
#define GTM_TIM2_CH3_CNT               /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNT *)0xF0102188u)

/** \\brief  2190, TIM channel 0 SMU shadow counter register */
#define GTM_TIM2_CH3_CNTS              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNTS *)0xF0102190u)

/** \\brief  21A4, TIM channel 0 control register */
#define GTM_TIM2_CH3_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CTRL *)0xF01021A4u)

/** \\brief  218C, TIM channel 0 SMU edge counter register */
#define GTM_TIM2_CH3_ECNT              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECNT *)0xF010218Cu)

/** \\brief  21A8, TIM channel 0 extended control register */
#define GTM_TIM2_CH3_ECTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECTRL *)0xF01021A8u)

/** \\brief  21BC, TIM channel 0 error interrupt enable register */
#define GTM_TIM2_CH3_EIRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_EIRQ_EN *)0xF01021BCu)

/** \\brief  21A0, TIM channel 0 filter parameter 1 register */
#define GTM_TIM2_CH3_FLT_FE            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_FE *)0xF01021A0u)

/** \\brief  219C, TIM channel 0 filter parameter 0 register */
#define GTM_TIM2_CH3_FLT_RE            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_RE *)0xF010219Cu)

/** \\brief  2180, TIM channel 0 general purpose 0 register */
#define GTM_TIM2_CH3_GPR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR0 *)0xF0102180u)

/** \\brief  2184, TIM channel 0 general purpose 1 register */
#define GTM_TIM2_CH3_GPR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR1 *)0xF0102184u)

/** \\brief  21B0, TIM channel 0 interrupt enable register */
#define GTM_TIM2_CH3_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_EN *)0xF01021B0u)

/** \\brief  21B4, TIM channel 0 force interrupt register */
#define GTM_TIM2_CH3_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_FORCINT *)0xF01021B4u)

/** \\brief  21B8, TIM channel 0 interrupt mode configuration register */
#define GTM_TIM2_CH3_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_MODE *)0xF01021B8u)

/** \\brief  21AC, TIM channel 0 interrupt notification register */
#define GTM_TIM2_CH3_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_NOTIFY *)0xF01021ACu)

/** \\brief  2194, TIM channel 0 TDU counter register */
#define GTM_TIM2_CH3_TDUC              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUC *)0xF0102194u)

/** \\brief  2198, TIM channel 0 TDU control register */
#define GTM_TIM2_CH3_TDUV              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUV *)0xF0102198u)

/** \\brief  2208, TIM channel 0 SMU counter register */
#define GTM_TIM2_CH4_CNT               /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNT *)0xF0102208u)

/** \\brief  2210, TIM channel 0 SMU shadow counter register */
#define GTM_TIM2_CH4_CNTS              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNTS *)0xF0102210u)

/** \\brief  2224, TIM channel 0 control register */
#define GTM_TIM2_CH4_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CTRL *)0xF0102224u)

