Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  220C, TIM channel 0 SMU edge counter register */
#define GTM_TIM2_CH4_ECNT              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECNT *)0xF010220Cu)

/** \\brief  2228, TIM channel 0 extended control register */
#define GTM_TIM2_CH4_ECTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECTRL *)0xF0102228u)

/** \\brief  223C, TIM channel 0 error interrupt enable register */
#define GTM_TIM2_CH4_EIRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_EIRQ_EN *)0xF010223Cu)

/** \\brief  2220, TIM channel 0 filter parameter 1 register */
#define GTM_TIM2_CH4_FLT_FE            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_FE *)0xF0102220u)

/** \\brief  221C, TIM channel 0 filter parameter 0 register */
#define GTM_TIM2_CH4_FLT_RE            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_RE *)0xF010221Cu)

/** \\brief  2200, TIM channel 0 general purpose 0 register */
#define GTM_TIM2_CH4_GPR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR0 *)0xF0102200u)

/** \\brief  2204, TIM channel 0 general purpose 1 register */
#define GTM_TIM2_CH4_GPR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR1 *)0xF0102204u)

/** \\brief  2230, TIM channel 0 interrupt enable register */
#define GTM_TIM2_CH4_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_EN *)0xF0102230u)

/** \\brief  2234, TIM channel 0 force interrupt register */
#define GTM_TIM2_CH4_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_FORCINT *)0xF0102234u)

/** \\brief  2238, TIM channel 0 interrupt mode configuration register */
#define GTM_TIM2_CH4_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_MODE *)0xF0102238u)

/** \\brief  222C, TIM channel 0 interrupt notification register */
#define GTM_TIM2_CH4_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_NOTIFY *)0xF010222Cu)

/** \\brief  2214, TIM channel 0 TDU counter register */
#define GTM_TIM2_CH4_TDUC              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUC *)0xF0102214u)

/** \\brief  2218, TIM channel 0 TDU control register */
#define GTM_TIM2_CH4_TDUV              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUV *)0xF0102218u)

/** \\brief  2288, TIM channel 0 SMU counter register */
#define GTM_TIM2_CH5_CNT               /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNT *)0xF0102288u)

/** \\brief  2290, TIM channel 0 SMU shadow counter register */
#define GTM_TIM2_CH5_CNTS              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNTS *)0xF0102290u)

/** \\brief  22A4, TIM channel 0 control register */
#define GTM_TIM2_CH5_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CTRL *)0xF01022A4u)

/** \\brief  228C, TIM channel 0 SMU edge counter register */
#define GTM_TIM2_CH5_ECNT              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECNT *)0xF010228Cu)

/** \\brief  22A8, TIM channel 0 extended control register */
#define GTM_TIM2_CH5_ECTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECTRL *)0xF01022A8u)

/** \\brief  22BC, TIM channel 0 error interrupt enable register */
#define GTM_TIM2_CH5_EIRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_EIRQ_EN *)0xF01022BCu)

/** \\brief  22A0, TIM channel 0 filter parameter 1 register */
#define GTM_TIM2_CH5_FLT_FE            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_FE *)0xF01022A0u)

/** \\brief  229C, TIM channel 0 filter parameter 0 register */
#define GTM_TIM2_CH5_FLT_RE            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_RE *)0xF010229Cu)

/** \\brief  2280, TIM channel 0 general purpose 0 register */
#define GTM_TIM2_CH5_GPR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR0 *)0xF0102280u)

/** \\brief  2284, TIM channel 0 general purpose 1 register */
#define GTM_TIM2_CH5_GPR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR1 *)0xF0102284u)

/** \\brief  22B0, TIM channel 0 interrupt enable register */
#define GTM_TIM2_CH5_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_EN *)0xF01022B0u)

/** \\brief  22B4, TIM channel 0 force interrupt register */
#define GTM_TIM2_CH5_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_FORCINT *)0xF01022B4u)

/** \\brief  22B8, TIM channel 0 interrupt mode configuration register */
#define GTM_TIM2_CH5_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_MODE *)0xF01022B8u)

/** \\brief  22AC, TIM channel 0 interrupt notification register */
#define GTM_TIM2_CH5_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_NOTIFY *)0xF01022ACu)

/** \\brief  2294, TIM channel 0 TDU counter register */
#define GTM_TIM2_CH5_TDUC              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUC *)0xF0102294u)

/** \\brief  2298, TIM channel 0 TDU control register */
#define GTM_TIM2_CH5_TDUV              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUV *)0xF0102298u)

/** \\brief  2308, TIM channel 0 SMU counter register */
#define GTM_TIM2_CH6_CNT               /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNT *)0xF0102308u)

/** \\brief  2310, TIM channel 0 SMU shadow counter register */
#define GTM_TIM2_CH6_CNTS              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNTS *)0xF0102310u)

/** \\brief  2324, TIM channel 0 control register */
#define GTM_TIM2_CH6_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CTRL *)0xF0102324u)

/** \\brief  230C, TIM channel 0 SMU edge counter register */
#define GTM_TIM2_CH6_ECNT              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECNT *)0xF010230Cu)

/** \\brief  2328, TIM channel 0 extended control register */
#define GTM_TIM2_CH6_ECTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECTRL *)0xF0102328u)

/** \\brief  233C, TIM channel 0 error interrupt enable register */
#define GTM_TIM2_CH6_EIRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_EIRQ_EN *)0xF010233Cu)

/** \\brief  2320, TIM channel 0 filter parameter 1 register */
#define GTM_TIM2_CH6_FLT_FE            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_FE *)0xF0102320u)

/** \\brief  231C, TIM channel 0 filter parameter 0 register */
#define GTM_TIM2_CH6_FLT_RE            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_RE *)0xF010231Cu)

/** \\brief  2300, TIM channel 0 general purpose 0 register */
#define GTM_TIM2_CH6_GPR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR0 *)0xF0102300u)

/** \\brief  2304, TIM channel 0 general purpose 1 register */
#define GTM_TIM2_CH6_GPR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR1 *)0xF0102304u)

