Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  2330, TIM channel 0 interrupt enable register */
#define GTM_TIM2_CH6_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_EN *)0xF0102330u)

/** \\brief  2334, TIM channel 0 force interrupt register */
#define GTM_TIM2_CH6_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_FORCINT *)0xF0102334u)

/** \\brief  2338, TIM channel 0 interrupt mode configuration register */
#define GTM_TIM2_CH6_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_MODE *)0xF0102338u)

/** \\brief  232C, TIM channel 0 interrupt notification register */
#define GTM_TIM2_CH6_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_NOTIFY *)0xF010232Cu)

/** \\brief  2314, TIM channel 0 TDU counter register */
#define GTM_TIM2_CH6_TDUC              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUC *)0xF0102314u)

/** \\brief  2318, TIM channel 0 TDU control register */
#define GTM_TIM2_CH6_TDUV              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUV *)0xF0102318u)

/** \\brief  2388, TIM channel 0 SMU counter register */
#define GTM_TIM2_CH7_CNT               /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNT *)0xF0102388u)

/** \\brief  2390, TIM channel 0 SMU shadow counter register */
#define GTM_TIM2_CH7_CNTS              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNTS *)0xF0102390u)

/** \\brief  23A4, TIM channel 0 control register */
#define GTM_TIM2_CH7_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CTRL *)0xF01023A4u)

/** \\brief  238C, TIM channel 0 SMU edge counter register */
#define GTM_TIM2_CH7_ECNT              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECNT *)0xF010238Cu)

/** \\brief  23A8, TIM channel 0 extended control register */
#define GTM_TIM2_CH7_ECTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECTRL *)0xF01023A8u)

/** \\brief  23BC, TIM channel 0 error interrupt enable register */
#define GTM_TIM2_CH7_EIRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_EIRQ_EN *)0xF01023BCu)

/** \\brief  23A0, TIM channel 0 filter parameter 1 register */
#define GTM_TIM2_CH7_FLT_FE            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_FE *)0xF01023A0u)

/** \\brief  239C, TIM channel 0 filter parameter 0 register */
#define GTM_TIM2_CH7_FLT_RE            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_RE *)0xF010239Cu)

/** \\brief  2380, TIM channel 0 general purpose 0 register */
#define GTM_TIM2_CH7_GPR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR0 *)0xF0102380u)

/** \\brief  2384, TIM channel 0 general purpose 1 register */
#define GTM_TIM2_CH7_GPR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR1 *)0xF0102384u)

/** \\brief  23B0, TIM channel 0 interrupt enable register */
#define GTM_TIM2_CH7_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_EN *)0xF01023B0u)

/** \\brief  23B4, TIM channel 0 force interrupt register */
#define GTM_TIM2_CH7_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_FORCINT *)0xF01023B4u)

/** \\brief  23B8, TIM channel 0 interrupt mode configuration register */
#define GTM_TIM2_CH7_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_MODE *)0xF01023B8u)

/** \\brief  23AC, TIM channel 0 interrupt notification register */
#define GTM_TIM2_CH7_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_NOTIFY *)0xF01023ACu)

/** \\brief  2394, TIM channel 0 TDU counter register */
#define GTM_TIM2_CH7_TDUC              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUC *)0xF0102394u)

/** \\brief  2398, TIM channel 0 TDU control register */
#define GTM_TIM2_CH7_TDUV              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUV *)0xF0102398u)

/** \\brief  2078, TIM channel x AUX IN source selection register */
#define GTM_TIM2_IN_SRC                /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_IN_SRC *)0xF0102078u)

/** \\brief  2074, TIM input value observation register */
#define GTM_TIM2_INP_VAL               /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_INP_VAL *)0xF0102074u)

/** \\brief  207C, TIM global software reset register */
#define GTM_TIM2_RST                   /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_RST *)0xF010207Cu)

/** \\brief  2808, TIM channel 0 SMU counter register */
#define GTM_TIM3_CH0_CNT               /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNT *)0xF0102808u)

/** \\brief  2810, TIM channel 0 SMU shadow counter register */
#define GTM_TIM3_CH0_CNTS              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNTS *)0xF0102810u)

/** \\brief  2824, TIM channel 0 control register */
#define GTM_TIM3_CH0_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CTRL *)0xF0102824u)

/** \\brief  280C, TIM channel 0 SMU edge counter register */
#define GTM_TIM3_CH0_ECNT              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECNT *)0xF010280Cu)

/** \\brief  2828, TIM channel 0 extended control register */
#define GTM_TIM3_CH0_ECTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECTRL *)0xF0102828u)

/** \\brief  283C, TIM channel 0 error interrupt enable register */
#define GTM_TIM3_CH0_EIRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_EIRQ_EN *)0xF010283Cu)

/** \\brief  2820, TIM channel 0 filter parameter 1 register */
#define GTM_TIM3_CH0_FLT_FE            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_FE *)0xF0102820u)

/** \\brief  281C, TIM channel 0 filter parameter 0 register */
#define GTM_TIM3_CH0_FLT_RE            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_RE *)0xF010281Cu)

/** \\brief  2800, TIM channel 0 general purpose 0 register */
#define GTM_TIM3_CH0_GPR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR0 *)0xF0102800u)

/** \\brief  2804, TIM channel 0 general purpose 1 register */
#define GTM_TIM3_CH0_GPR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR1 *)0xF0102804u)

/** \\brief  2830, TIM channel 0 interrupt enable register */
#define GTM_TIM3_CH0_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_EN *)0xF0102830u)

/** \\brief  2834, TIM channel 0 force interrupt register */
#define GTM_TIM3_CH0_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_FORCINT *)0xF0102834u)

/** \\brief  2838, TIM channel 0 interrupt mode configuration register */
#define GTM_TIM3_CH0_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_MODE *)0xF0102838u)

/** \\brief  282C, TIM channel 0 interrupt notification register */
#define GTM_TIM3_CH0_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_NOTIFY *)0xF010282Cu)

/** \\brief  2814, TIM channel 0 TDU counter register */
#define GTM_TIM3_CH0_TDUC              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUC *)0xF0102814u)

