Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  2818, TIM channel 0 TDU control register */
#define GTM_TIM3_CH0_TDUV              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUV *)0xF0102818u)

/** \\brief  2888, TIM channel 0 SMU counter register */
#define GTM_TIM3_CH1_CNT               /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNT *)0xF0102888u)

/** \\brief  2890, TIM channel 0 SMU shadow counter register */
#define GTM_TIM3_CH1_CNTS              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNTS *)0xF0102890u)

/** \\brief  28A4, TIM channel 0 control register */
#define GTM_TIM3_CH1_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CTRL *)0xF01028A4u)

/** \\brief  288C, TIM channel 0 SMU edge counter register */
#define GTM_TIM3_CH1_ECNT              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECNT *)0xF010288Cu)

/** \\brief  28A8, TIM channel 0 extended control register */
#define GTM_TIM3_CH1_ECTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECTRL *)0xF01028A8u)

/** \\brief  28BC, TIM channel 0 error interrupt enable register */
#define GTM_TIM3_CH1_EIRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_EIRQ_EN *)0xF01028BCu)

/** \\brief  28A0, TIM channel 0 filter parameter 1 register */
#define GTM_TIM3_CH1_FLT_FE            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_FE *)0xF01028A0u)

/** \\brief  289C, TIM channel 0 filter parameter 0 register */
#define GTM_TIM3_CH1_FLT_RE            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_RE *)0xF010289Cu)

/** \\brief  2880, TIM channel 0 general purpose 0 register */
#define GTM_TIM3_CH1_GPR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR0 *)0xF0102880u)

/** \\brief  2884, TIM channel 0 general purpose 1 register */
#define GTM_TIM3_CH1_GPR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR1 *)0xF0102884u)

/** \\brief  28B0, TIM channel 0 interrupt enable register */
#define GTM_TIM3_CH1_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_EN *)0xF01028B0u)

/** \\brief  28B4, TIM channel 0 force interrupt register */
#define GTM_TIM3_CH1_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_FORCINT *)0xF01028B4u)

/** \\brief  28B8, TIM channel 0 interrupt mode configuration register */
#define GTM_TIM3_CH1_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_MODE *)0xF01028B8u)

/** \\brief  28AC, TIM channel 0 interrupt notification register */
#define GTM_TIM3_CH1_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_NOTIFY *)0xF01028ACu)

/** \\brief  2894, TIM channel 0 TDU counter register */
#define GTM_TIM3_CH1_TDUC              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUC *)0xF0102894u)

/** \\brief  2898, TIM channel 0 TDU control register */
#define GTM_TIM3_CH1_TDUV              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUV *)0xF0102898u)

/** \\brief  2908, TIM channel 0 SMU counter register */
#define GTM_TIM3_CH2_CNT               /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNT *)0xF0102908u)

/** \\brief  2910, TIM channel 0 SMU shadow counter register */
#define GTM_TIM3_CH2_CNTS              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNTS *)0xF0102910u)

/** \\brief  2924, TIM channel 0 control register */
#define GTM_TIM3_CH2_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CTRL *)0xF0102924u)

/** \\brief  290C, TIM channel 0 SMU edge counter register */
#define GTM_TIM3_CH2_ECNT              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECNT *)0xF010290Cu)

/** \\brief  2928, TIM channel 0 extended control register */
#define GTM_TIM3_CH2_ECTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECTRL *)0xF0102928u)

/** \\brief  293C, TIM channel 0 error interrupt enable register */
#define GTM_TIM3_CH2_EIRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_EIRQ_EN *)0xF010293Cu)

/** \\brief  2920, TIM channel 0 filter parameter 1 register */
#define GTM_TIM3_CH2_FLT_FE            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_FE *)0xF0102920u)

/** \\brief  291C, TIM channel 0 filter parameter 0 register */
#define GTM_TIM3_CH2_FLT_RE            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_RE *)0xF010291Cu)

/** \\brief  2900, TIM channel 0 general purpose 0 register */
#define GTM_TIM3_CH2_GPR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR0 *)0xF0102900u)

/** \\brief  2904, TIM channel 0 general purpose 1 register */
#define GTM_TIM3_CH2_GPR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR1 *)0xF0102904u)

/** \\brief  2930, TIM channel 0 interrupt enable register */
#define GTM_TIM3_CH2_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_EN *)0xF0102930u)

/** \\brief  2934, TIM channel 0 force interrupt register */
#define GTM_TIM3_CH2_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_FORCINT *)0xF0102934u)

/** \\brief  2938, TIM channel 0 interrupt mode configuration register */
#define GTM_TIM3_CH2_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_MODE *)0xF0102938u)

/** \\brief  292C, TIM channel 0 interrupt notification register */
#define GTM_TIM3_CH2_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_NOTIFY *)0xF010292Cu)

/** \\brief  2914, TIM channel 0 TDU counter register */
#define GTM_TIM3_CH2_TDUC              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUC *)0xF0102914u)

/** \\brief  2918, TIM channel 0 TDU control register */
#define GTM_TIM3_CH2_TDUV              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUV *)0xF0102918u)

/** \\brief  2988, TIM channel 0 SMU counter register */
#define GTM_TIM3_CH3_CNT               /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNT *)0xF0102988u)

/** \\brief  2990, TIM channel 0 SMU shadow counter register */
#define GTM_TIM3_CH3_CNTS              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNTS *)0xF0102990u)

/** \\brief  29A4, TIM channel 0 control register */
#define GTM_TIM3_CH3_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CTRL *)0xF01029A4u)

/** \\brief  298C, TIM channel 0 SMU edge counter register */
#define GTM_TIM3_CH3_ECNT              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECNT *)0xF010298Cu)

/** \\brief  29A8, TIM channel 0 extended control register */
#define GTM_TIM3_CH3_ECTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECTRL *)0xF01029A8u)

/** \\brief  29BC, TIM channel 0 error interrupt enable register */
#define GTM_TIM3_CH3_EIRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_EIRQ_EN *)0xF01029BCu)

/** \\brief  29A0, TIM channel 0 filter parameter 1 register */
#define GTM_TIM3_CH3_FLT_FE            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_FE *)0xF01029A0u)

/** \\brief  299C, TIM channel 0 filter parameter 0 register */
#define GTM_TIM3_CH3_FLT_RE            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_RE *)0xF010299Cu)

/** \\brief  2980, TIM channel 0 general purpose 0 register */
#define GTM_TIM3_CH3_GPR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR0 *)0xF0102980u)

/** \\brief  2984, TIM channel 0 general purpose 1 register */
#define GTM_TIM3_CH3_GPR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR1 *)0xF0102984u)

/** \\brief  29B0, TIM channel 0 interrupt enable register */
#define GTM_TIM3_CH3_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_EN *)0xF01029B0u)

