Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  29B4, TIM channel 0 force interrupt register */
#define GTM_TIM3_CH3_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_FORCINT *)0xF01029B4u)

/** \\brief  29B8, TIM channel 0 interrupt mode configuration register */
#define GTM_TIM3_CH3_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_MODE *)0xF01029B8u)

/** \\brief  29AC, TIM channel 0 interrupt notification register */
#define GTM_TIM3_CH3_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_NOTIFY *)0xF01029ACu)

/** \\brief  2994, TIM channel 0 TDU counter register */
#define GTM_TIM3_CH3_TDUC              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUC *)0xF0102994u)

/** \\brief  2998, TIM channel 0 TDU control register */
#define GTM_TIM3_CH3_TDUV              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUV *)0xF0102998u)

/** \\brief  2A08, TIM channel 0 SMU counter register */
#define GTM_TIM3_CH4_CNT               /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNT *)0xF0102A08u)

/** \\brief  2A10, TIM channel 0 SMU shadow counter register */
#define GTM_TIM3_CH4_CNTS              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNTS *)0xF0102A10u)

/** \\brief  2A24, TIM channel 0 control register */
#define GTM_TIM3_CH4_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CTRL *)0xF0102A24u)

/** \\brief  2A0C, TIM channel 0 SMU edge counter register */
#define GTM_TIM3_CH4_ECNT              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECNT *)0xF0102A0Cu)

/** \\brief  2A28, TIM channel 0 extended control register */
#define GTM_TIM3_CH4_ECTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECTRL *)0xF0102A28u)

/** \\brief  2A3C, TIM channel 0 error interrupt enable register */
#define GTM_TIM3_CH4_EIRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_EIRQ_EN *)0xF0102A3Cu)

/** \\brief  2A20, TIM channel 0 filter parameter 1 register */
#define GTM_TIM3_CH4_FLT_FE            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_FE *)0xF0102A20u)

/** \\brief  2A1C, TIM channel 0 filter parameter 0 register */
#define GTM_TIM3_CH4_FLT_RE            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_RE *)0xF0102A1Cu)

/** \\brief  2A00, TIM channel 0 general purpose 0 register */
#define GTM_TIM3_CH4_GPR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR0 *)0xF0102A00u)

/** \\brief  2A04, TIM channel 0 general purpose 1 register */
#define GTM_TIM3_CH4_GPR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR1 *)0xF0102A04u)

/** \\brief  2A30, TIM channel 0 interrupt enable register */
#define GTM_TIM3_CH4_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_EN *)0xF0102A30u)

/** \\brief  2A34, TIM channel 0 force interrupt register */
#define GTM_TIM3_CH4_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_FORCINT *)0xF0102A34u)

/** \\brief  2A38, TIM channel 0 interrupt mode configuration register */
#define GTM_TIM3_CH4_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_MODE *)0xF0102A38u)

/** \\brief  2A2C, TIM channel 0 interrupt notification register */
#define GTM_TIM3_CH4_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_NOTIFY *)0xF0102A2Cu)

/** \\brief  2A14, TIM channel 0 TDU counter register */
#define GTM_TIM3_CH4_TDUC              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUC *)0xF0102A14u)

/** \\brief  2A18, TIM channel 0 TDU control register */
#define GTM_TIM3_CH4_TDUV              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUV *)0xF0102A18u)

/** \\brief  2A88, TIM channel 0 SMU counter register */
#define GTM_TIM3_CH5_CNT               /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNT *)0xF0102A88u)

/** \\brief  2A90, TIM channel 0 SMU shadow counter register */
#define GTM_TIM3_CH5_CNTS              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNTS *)0xF0102A90u)

/** \\brief  2AA4, TIM channel 0 control register */
#define GTM_TIM3_CH5_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CTRL *)0xF0102AA4u)

/** \\brief  2A8C, TIM channel 0 SMU edge counter register */
#define GTM_TIM3_CH5_ECNT              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECNT *)0xF0102A8Cu)

/** \\brief  2AA8, TIM channel 0 extended control register */
#define GTM_TIM3_CH5_ECTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECTRL *)0xF0102AA8u)

/** \\brief  2ABC, TIM channel 0 error interrupt enable register */
#define GTM_TIM3_CH5_EIRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_EIRQ_EN *)0xF0102ABCu)

/** \\brief  2AA0, TIM channel 0 filter parameter 1 register */
#define GTM_TIM3_CH5_FLT_FE            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_FE *)0xF0102AA0u)

/** \\brief  2A9C, TIM channel 0 filter parameter 0 register */
#define GTM_TIM3_CH5_FLT_RE            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_RE *)0xF0102A9Cu)

/** \\brief  2A80, TIM channel 0 general purpose 0 register */
#define GTM_TIM3_CH5_GPR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR0 *)0xF0102A80u)

/** \\brief  2A84, TIM channel 0 general purpose 1 register */
#define GTM_TIM3_CH5_GPR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR1 *)0xF0102A84u)

/** \\brief  2AB0, TIM channel 0 interrupt enable register */
#define GTM_TIM3_CH5_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_EN *)0xF0102AB0u)

/** \\brief  2AB4, TIM channel 0 force interrupt register */
#define GTM_TIM3_CH5_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_FORCINT *)0xF0102AB4u)

/** \\brief  2AB8, TIM channel 0 interrupt mode configuration register */
#define GTM_TIM3_CH5_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_MODE *)0xF0102AB8u)

/** \\brief  2AAC, TIM channel 0 interrupt notification register */
#define GTM_TIM3_CH5_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_NOTIFY *)0xF0102AACu)

/** \\brief  2A94, TIM channel 0 TDU counter register */
#define GTM_TIM3_CH5_TDUC              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUC *)0xF0102A94u)

/** \\brief  2A98, TIM channel 0 TDU control register */
#define GTM_TIM3_CH5_TDUV              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUV *)0xF0102A98u)

/** \\brief  2B08, TIM channel 0 SMU counter register */
#define GTM_TIM3_CH6_CNT               /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNT *)0xF0102B08u)

