Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  2B10, TIM channel 0 SMU shadow counter register */
#define GTM_TIM3_CH6_CNTS              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNTS *)0xF0102B10u)

/** \\brief  2B24, TIM channel 0 control register */
#define GTM_TIM3_CH6_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CTRL *)0xF0102B24u)

/** \\brief  2B0C, TIM channel 0 SMU edge counter register */
#define GTM_TIM3_CH6_ECNT              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECNT *)0xF0102B0Cu)

/** \\brief  2B28, TIM channel 0 extended control register */
#define GTM_TIM3_CH6_ECTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECTRL *)0xF0102B28u)

/** \\brief  2B3C, TIM channel 0 error interrupt enable register */
#define GTM_TIM3_CH6_EIRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_EIRQ_EN *)0xF0102B3Cu)

/** \\brief  2B20, TIM channel 0 filter parameter 1 register */
#define GTM_TIM3_CH6_FLT_FE            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_FE *)0xF0102B20u)

/** \\brief  2B1C, TIM channel 0 filter parameter 0 register */
#define GTM_TIM3_CH6_FLT_RE            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_RE *)0xF0102B1Cu)

/** \\brief  2B00, TIM channel 0 general purpose 0 register */
#define GTM_TIM3_CH6_GPR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR0 *)0xF0102B00u)

/** \\brief  2B04, TIM channel 0 general purpose 1 register */
#define GTM_TIM3_CH6_GPR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR1 *)0xF0102B04u)

/** \\brief  2B30, TIM channel 0 interrupt enable register */
#define GTM_TIM3_CH6_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_EN *)0xF0102B30u)

/** \\brief  2B34, TIM channel 0 force interrupt register */
#define GTM_TIM3_CH6_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_FORCINT *)0xF0102B34u)

/** \\brief  2B38, TIM channel 0 interrupt mode configuration register */
#define GTM_TIM3_CH6_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_MODE *)0xF0102B38u)

/** \\brief  2B2C, TIM channel 0 interrupt notification register */
#define GTM_TIM3_CH6_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_NOTIFY *)0xF0102B2Cu)

/** \\brief  2B14, TIM channel 0 TDU counter register */
#define GTM_TIM3_CH6_TDUC              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUC *)0xF0102B14u)

/** \\brief  2B18, TIM channel 0 TDU control register */
#define GTM_TIM3_CH6_TDUV              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUV *)0xF0102B18u)

/** \\brief  2B88, TIM channel 0 SMU counter register */
#define GTM_TIM3_CH7_CNT               /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNT *)0xF0102B88u)

/** \\brief  2B90, TIM channel 0 SMU shadow counter register */
#define GTM_TIM3_CH7_CNTS              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNTS *)0xF0102B90u)

/** \\brief  2BA4, TIM channel 0 control register */
#define GTM_TIM3_CH7_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CTRL *)0xF0102BA4u)

/** \\brief  2B8C, TIM channel 0 SMU edge counter register */
#define GTM_TIM3_CH7_ECNT              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECNT *)0xF0102B8Cu)

/** \\brief  2BA8, TIM channel 0 extended control register */
#define GTM_TIM3_CH7_ECTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECTRL *)0xF0102BA8u)

/** \\brief  2BBC, TIM channel 0 error interrupt enable register */
#define GTM_TIM3_CH7_EIRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_EIRQ_EN *)0xF0102BBCu)

/** \\brief  2BA0, TIM channel 0 filter parameter 1 register */
#define GTM_TIM3_CH7_FLT_FE            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_FE *)0xF0102BA0u)

/** \\brief  2B9C, TIM channel 0 filter parameter 0 register */
#define GTM_TIM3_CH7_FLT_RE            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_RE *)0xF0102B9Cu)

/** \\brief  2B80, TIM channel 0 general purpose 0 register */
#define GTM_TIM3_CH7_GPR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR0 *)0xF0102B80u)

/** \\brief  2B84, TIM channel 0 general purpose 1 register */
#define GTM_TIM3_CH7_GPR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR1 *)0xF0102B84u)

/** \\brief  2BB0, TIM channel 0 interrupt enable register */
#define GTM_TIM3_CH7_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_EN *)0xF0102BB0u)

/** \\brief  2BB4, TIM channel 0 force interrupt register */
#define GTM_TIM3_CH7_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_FORCINT *)0xF0102BB4u)

/** \\brief  2BB8, TIM channel 0 interrupt mode configuration register */
#define GTM_TIM3_CH7_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_MODE *)0xF0102BB8u)

/** \\brief  2BAC, TIM channel 0 interrupt notification register */
#define GTM_TIM3_CH7_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_NOTIFY *)0xF0102BACu)

/** \\brief  2B94, TIM channel 0 TDU counter register */
#define GTM_TIM3_CH7_TDUC              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUC *)0xF0102B94u)

/** \\brief  2B98, TIM channel 0 TDU control register */
#define GTM_TIM3_CH7_TDUV              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUV *)0xF0102B98u)

/** \\brief  2878, TIM channel x AUX IN source selection register */
#define GTM_TIM3_IN_SRC                /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_IN_SRC *)0xF0102878u)

/** \\brief  2874, TIM input value observation register */
#define GTM_TIM3_INP_VAL               /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_INP_VAL *)0xF0102874u)

/** \\brief  287C, TIM global software reset register */
#define GTM_TIM3_RST                   /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_RST *)0xF010287Cu)

/** \\brief  3008, TIM channel 0 SMU counter register */
#define GTM_TIM4_CH0_CNT               /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNT *)0xF0103008u)

/** \\brief  3010, TIM channel 0 SMU shadow counter register */
#define GTM_TIM4_CH0_CNTS              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNTS *)0xF0103010u)

/** \\brief  3024, TIM channel 0 control register */
#define GTM_TIM4_CH0_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CTRL *)0xF0103024u)

/** \\brief  300C, TIM channel 0 SMU edge counter register */
#define GTM_TIM4_CH0_ECNT              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECNT *)0xF010300Cu)

/** \\brief  3028, TIM channel 0 extended control register */
#define GTM_TIM4_CH0_ECTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECTRL *)0xF0103028u)

/** \\brief  303C, TIM channel 0 error interrupt enable register */
#define GTM_TIM4_CH0_EIRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_EIRQ_EN *)0xF010303Cu)

/** \\brief  3020, TIM channel 0 filter parameter 1 register */
#define GTM_TIM4_CH0_FLT_FE            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_FE *)0xF0103020u)

/** \\brief  301C, TIM channel 0 filter parameter 0 register */
#define GTM_TIM4_CH0_FLT_RE            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_RE *)0xF010301Cu)

/** \\brief  3000, TIM channel 0 general purpose 0 register */
#define GTM_TIM4_CH0_GPR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR0 *)0xF0103000u)

/** \\brief  3004, TIM channel 0 general purpose 1 register */
#define GTM_TIM4_CH0_GPR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR1 *)0xF0103004u)

/** \\brief  3030, TIM channel 0 interrupt enable register */
#define GTM_TIM4_CH0_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_EN *)0xF0103030u)

/** \\brief  3034, TIM channel 0 force interrupt register */
#define GTM_TIM4_CH0_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_FORCINT *)0xF0103034u)

/** \\brief  3038, TIM channel 0 interrupt mode configuration register */
#define GTM_TIM4_CH0_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_MODE *)0xF0103038u)

/** \\brief  302C, TIM channel 0 interrupt notification register */
#define GTM_TIM4_CH0_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_NOTIFY *)0xF010302Cu)

/** \\brief  3014, TIM channel 0 TDU counter register */
#define GTM_TIM4_CH0_TDUC              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUC *)0xF0103014u)

