Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  3018, TIM channel 0 TDU control register */
#define GTM_TIM4_CH0_TDUV              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUV *)0xF0103018u)

/** \\brief  3088, TIM channel 0 SMU counter register */
#define GTM_TIM4_CH1_CNT               /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNT *)0xF0103088u)

/** \\brief  3090, TIM channel 0 SMU shadow counter register */
#define GTM_TIM4_CH1_CNTS              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNTS *)0xF0103090u)

/** \\brief  30A4, TIM channel 0 control register */
#define GTM_TIM4_CH1_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CTRL *)0xF01030A4u)

/** \\brief  308C, TIM channel 0 SMU edge counter register */
#define GTM_TIM4_CH1_ECNT              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECNT *)0xF010308Cu)

/** \\brief  30A8, TIM channel 0 extended control register */
#define GTM_TIM4_CH1_ECTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECTRL *)0xF01030A8u)

/** \\brief  30BC, TIM channel 0 error interrupt enable register */
#define GTM_TIM4_CH1_EIRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_EIRQ_EN *)0xF01030BCu)

/** \\brief  30A0, TIM channel 0 filter parameter 1 register */
#define GTM_TIM4_CH1_FLT_FE            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_FE *)0xF01030A0u)

/** \\brief  309C, TIM channel 0 filter parameter 0 register */
#define GTM_TIM4_CH1_FLT_RE            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_RE *)0xF010309Cu)

/** \\brief  3080, TIM channel 0 general purpose 0 register */
#define GTM_TIM4_CH1_GPR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR0 *)0xF0103080u)

/** \\brief  3084, TIM channel 0 general purpose 1 register */
#define GTM_TIM4_CH1_GPR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR1 *)0xF0103084u)

/** \\brief  30B0, TIM channel 0 interrupt enable register */
#define GTM_TIM4_CH1_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_EN *)0xF01030B0u)

/** \\brief  30B4, TIM channel 0 force interrupt register */
#define GTM_TIM4_CH1_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_FORCINT *)0xF01030B4u)

/** \\brief  30B8, TIM channel 0 interrupt mode configuration register */
#define GTM_TIM4_CH1_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_MODE *)0xF01030B8u)

/** \\brief  30AC, TIM channel 0 interrupt notification register */
#define GTM_TIM4_CH1_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_NOTIFY *)0xF01030ACu)

/** \\brief  3094, TIM channel 0 TDU counter register */
#define GTM_TIM4_CH1_TDUC              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUC *)0xF0103094u)

/** \\brief  3098, TIM channel 0 TDU control register */
#define GTM_TIM4_CH1_TDUV              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUV *)0xF0103098u)

/** \\brief  3108, TIM channel 0 SMU counter register */
#define GTM_TIM4_CH2_CNT               /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNT *)0xF0103108u)

/** \\brief  3110, TIM channel 0 SMU shadow counter register */
#define GTM_TIM4_CH2_CNTS              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNTS *)0xF0103110u)

/** \\brief  3124, TIM channel 0 control register */
#define GTM_TIM4_CH2_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CTRL *)0xF0103124u)

/** \\brief  310C, TIM channel 0 SMU edge counter register */
#define GTM_TIM4_CH2_ECNT              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECNT *)0xF010310Cu)

/** \\brief  3128, TIM channel 0 extended control register */
#define GTM_TIM4_CH2_ECTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECTRL *)0xF0103128u)

/** \\brief  313C, TIM channel 0 error interrupt enable register */
#define GTM_TIM4_CH2_EIRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_EIRQ_EN *)0xF010313Cu)

/** \\brief  3120, TIM channel 0 filter parameter 1 register */
#define GTM_TIM4_CH2_FLT_FE            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_FE *)0xF0103120u)

/** \\brief  311C, TIM channel 0 filter parameter 0 register */
#define GTM_TIM4_CH2_FLT_RE            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_RE *)0xF010311Cu)

/** \\brief  3100, TIM channel 0 general purpose 0 register */
#define GTM_TIM4_CH2_GPR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR0 *)0xF0103100u)

/** \\brief  3104, TIM channel 0 general purpose 1 register */
#define GTM_TIM4_CH2_GPR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR1 *)0xF0103104u)

/** \\brief  3130, TIM channel 0 interrupt enable register */
#define GTM_TIM4_CH2_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_EN *)0xF0103130u)

/** \\brief  3134, TIM channel 0 force interrupt register */
#define GTM_TIM4_CH2_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_FORCINT *)0xF0103134u)

/** \\brief  3138, TIM channel 0 interrupt mode configuration register */
#define GTM_TIM4_CH2_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_MODE *)0xF0103138u)

/** \\brief  312C, TIM channel 0 interrupt notification register */
#define GTM_TIM4_CH2_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_NOTIFY *)0xF010312Cu)

/** \\brief  3114, TIM channel 0 TDU counter register */
#define GTM_TIM4_CH2_TDUC              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUC *)0xF0103114u)

/** \\brief  3118, TIM channel 0 TDU control register */
#define GTM_TIM4_CH2_TDUV              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUV *)0xF0103118u)

/** \\brief  3188, TIM channel 0 SMU counter register */
#define GTM_TIM4_CH3_CNT               /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNT *)0xF0103188u)

/** \\brief  3190, TIM channel 0 SMU shadow counter register */
#define GTM_TIM4_CH3_CNTS              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNTS *)0xF0103190u)

/** \\brief  31A4, TIM channel 0 control register */
#define GTM_TIM4_CH3_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CTRL *)0xF01031A4u)

/** \\brief  318C, TIM channel 0 SMU edge counter register */
#define GTM_TIM4_CH3_ECNT              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECNT *)0xF010318Cu)

/** \\brief  31A8, TIM channel 0 extended control register */
#define GTM_TIM4_CH3_ECTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECTRL *)0xF01031A8u)

/** \\brief  31BC, TIM channel 0 error interrupt enable register */
#define GTM_TIM4_CH3_EIRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_EIRQ_EN *)0xF01031BCu)

/** \\brief  31A0, TIM channel 0 filter parameter 1 register */
#define GTM_TIM4_CH3_FLT_FE            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_FE *)0xF01031A0u)

/** \\brief  319C, TIM channel 0 filter parameter 0 register */
#define GTM_TIM4_CH3_FLT_RE            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_RE *)0xF010319Cu)

/** \\brief  3180, TIM channel 0 general purpose 0 register */
#define GTM_TIM4_CH3_GPR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR0 *)0xF0103180u)

/** \\brief  3184, TIM channel 0 general purpose 1 register */
#define GTM_TIM4_CH3_GPR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR1 *)0xF0103184u)

/** \\brief  31B0, TIM channel 0 interrupt enable register */
#define GTM_TIM4_CH3_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_EN *)0xF01031B0u)

/** \\brief  31B4, TIM channel 0 force interrupt register */
#define GTM_TIM4_CH3_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_FORCINT *)0xF01031B4u)

/** \\brief  31B8, TIM channel 0 interrupt mode configuration register */
#define GTM_TIM4_CH3_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_MODE *)0xF01031B8u)

