Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  31AC, TIM channel 0 interrupt notification register */
#define GTM_TIM4_CH3_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_NOTIFY *)0xF01031ACu)

/** \\brief  3194, TIM channel 0 TDU counter register */
#define GTM_TIM4_CH3_TDUC              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUC *)0xF0103194u)

/** \\brief  3198, TIM channel 0 TDU control register */
#define GTM_TIM4_CH3_TDUV              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUV *)0xF0103198u)

/** \\brief  3208, TIM channel 0 SMU counter register */
#define GTM_TIM4_CH4_CNT               /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNT *)0xF0103208u)

/** \\brief  3210, TIM channel 0 SMU shadow counter register */
#define GTM_TIM4_CH4_CNTS              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNTS *)0xF0103210u)

/** \\brief  3224, TIM channel 0 control register */
#define GTM_TIM4_CH4_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CTRL *)0xF0103224u)

/** \\brief  320C, TIM channel 0 SMU edge counter register */
#define GTM_TIM4_CH4_ECNT              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECNT *)0xF010320Cu)

/** \\brief  3228, TIM channel 0 extended control register */
#define GTM_TIM4_CH4_ECTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECTRL *)0xF0103228u)

/** \\brief  323C, TIM channel 0 error interrupt enable register */
#define GTM_TIM4_CH4_EIRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_EIRQ_EN *)0xF010323Cu)

/** \\brief  3220, TIM channel 0 filter parameter 1 register */
#define GTM_TIM4_CH4_FLT_FE            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_FE *)0xF0103220u)

/** \\brief  321C, TIM channel 0 filter parameter 0 register */
#define GTM_TIM4_CH4_FLT_RE            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_RE *)0xF010321Cu)

/** \\brief  3200, TIM channel 0 general purpose 0 register */
#define GTM_TIM4_CH4_GPR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR0 *)0xF0103200u)

/** \\brief  3204, TIM channel 0 general purpose 1 register */
#define GTM_TIM4_CH4_GPR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR1 *)0xF0103204u)

/** \\brief  3230, TIM channel 0 interrupt enable register */
#define GTM_TIM4_CH4_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_EN *)0xF0103230u)

/** \\brief  3234, TIM channel 0 force interrupt register */
#define GTM_TIM4_CH4_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_FORCINT *)0xF0103234u)

/** \\brief  3238, TIM channel 0 interrupt mode configuration register */
#define GTM_TIM4_CH4_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_MODE *)0xF0103238u)

/** \\brief  322C, TIM channel 0 interrupt notification register */
#define GTM_TIM4_CH4_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_NOTIFY *)0xF010322Cu)

/** \\brief  3214, TIM channel 0 TDU counter register */
#define GTM_TIM4_CH4_TDUC              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUC *)0xF0103214u)

/** \\brief  3218, TIM channel 0 TDU control register */
#define GTM_TIM4_CH4_TDUV              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUV *)0xF0103218u)

/** \\brief  3288, TIM channel 0 SMU counter register */
#define GTM_TIM4_CH5_CNT               /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNT *)0xF0103288u)

/** \\brief  3290, TIM channel 0 SMU shadow counter register */
#define GTM_TIM4_CH5_CNTS              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNTS *)0xF0103290u)

/** \\brief  32A4, TIM channel 0 control register */
#define GTM_TIM4_CH5_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CTRL *)0xF01032A4u)

/** \\brief  328C, TIM channel 0 SMU edge counter register */
#define GTM_TIM4_CH5_ECNT              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECNT *)0xF010328Cu)

/** \\brief  32A8, TIM channel 0 extended control register */
#define GTM_TIM4_CH5_ECTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECTRL *)0xF01032A8u)

/** \\brief  32BC, TIM channel 0 error interrupt enable register */
#define GTM_TIM4_CH5_EIRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_EIRQ_EN *)0xF01032BCu)

/** \\brief  32A0, TIM channel 0 filter parameter 1 register */
#define GTM_TIM4_CH5_FLT_FE            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_FE *)0xF01032A0u)

/** \\brief  329C, TIM channel 0 filter parameter 0 register */
#define GTM_TIM4_CH5_FLT_RE            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_RE *)0xF010329Cu)

/** \\brief  3280, TIM channel 0 general purpose 0 register */
#define GTM_TIM4_CH5_GPR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR0 *)0xF0103280u)

/** \\brief  3284, TIM channel 0 general purpose 1 register */
#define GTM_TIM4_CH5_GPR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR1 *)0xF0103284u)

/** \\brief  32B0, TIM channel 0 interrupt enable register */
#define GTM_TIM4_CH5_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_EN *)0xF01032B0u)

/** \\brief  32B4, TIM channel 0 force interrupt register */
#define GTM_TIM4_CH5_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_FORCINT *)0xF01032B4u)

/** \\brief  32B8, TIM channel 0 interrupt mode configuration register */
#define GTM_TIM4_CH5_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_MODE *)0xF01032B8u)

/** \\brief  32AC, TIM channel 0 interrupt notification register */
#define GTM_TIM4_CH5_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_NOTIFY *)0xF01032ACu)

/** \\brief  3294, TIM channel 0 TDU counter register */
#define GTM_TIM4_CH5_TDUC              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUC *)0xF0103294u)

/** \\brief  3298, TIM channel 0 TDU control register */
#define GTM_TIM4_CH5_TDUV              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUV *)0xF0103298u)

/** \\brief  3308, TIM channel 0 SMU counter register */
#define GTM_TIM4_CH6_CNT               /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNT *)0xF0103308u)

/** \\brief  3310, TIM channel 0 SMU shadow counter register */
#define GTM_TIM4_CH6_CNTS              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNTS *)0xF0103310u)

/** \\brief  3324, TIM channel 0 control register */
#define GTM_TIM4_CH6_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CTRL *)0xF0103324u)

/** \\brief  330C, TIM channel 0 SMU edge counter register */
#define GTM_TIM4_CH6_ECNT              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECNT *)0xF010330Cu)

/** \\brief  3328, TIM channel 0 extended control register */
#define GTM_TIM4_CH6_ECTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECTRL *)0xF0103328u)

/** \\brief  333C, TIM channel 0 error interrupt enable register */
#define GTM_TIM4_CH6_EIRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_EIRQ_EN *)0xF010333Cu)

/** \\brief  3320, TIM channel 0 filter parameter 1 register */
#define GTM_TIM4_CH6_FLT_FE            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_FE *)0xF0103320u)

/** \\brief  331C, TIM channel 0 filter parameter 0 register */
#define GTM_TIM4_CH6_FLT_RE            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_RE *)0xF010331Cu)

/** \\brief  3300, TIM channel 0 general purpose 0 register */
#define GTM_TIM4_CH6_GPR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR0 *)0xF0103300u)

/** \\brief  3304, TIM channel 0 general purpose 1 register */
#define GTM_TIM4_CH6_GPR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR1 *)0xF0103304u)

