Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  3330, TIM channel 0 interrupt enable register */
#define GTM_TIM4_CH6_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_EN *)0xF0103330u)

/** \\brief  3334, TIM channel 0 force interrupt register */
#define GTM_TIM4_CH6_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_FORCINT *)0xF0103334u)

/** \\brief  3338, TIM channel 0 interrupt mode configuration register */
#define GTM_TIM4_CH6_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_MODE *)0xF0103338u)

/** \\brief  332C, TIM channel 0 interrupt notification register */
#define GTM_TIM4_CH6_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_NOTIFY *)0xF010332Cu)

/** \\brief  3314, TIM channel 0 TDU counter register */
#define GTM_TIM4_CH6_TDUC              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUC *)0xF0103314u)

/** \\brief  3318, TIM channel 0 TDU control register */
#define GTM_TIM4_CH6_TDUV              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUV *)0xF0103318u)

/** \\brief  3388, TIM channel 0 SMU counter register */
#define GTM_TIM4_CH7_CNT               /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNT *)0xF0103388u)

/** \\brief  3390, TIM channel 0 SMU shadow counter register */
#define GTM_TIM4_CH7_CNTS              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNTS *)0xF0103390u)

/** \\brief  33A4, TIM channel 0 control register */
#define GTM_TIM4_CH7_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CTRL *)0xF01033A4u)

/** \\brief  338C, TIM channel 0 SMU edge counter register */
#define GTM_TIM4_CH7_ECNT              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECNT *)0xF010338Cu)

/** \\brief  33A8, TIM channel 0 extended control register */
#define GTM_TIM4_CH7_ECTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECTRL *)0xF01033A8u)

/** \\brief  33BC, TIM channel 0 error interrupt enable register */
#define GTM_TIM4_CH7_EIRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_EIRQ_EN *)0xF01033BCu)

/** \\brief  33A0, TIM channel 0 filter parameter 1 register */
#define GTM_TIM4_CH7_FLT_FE            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_FE *)0xF01033A0u)

/** \\brief  339C, TIM channel 0 filter parameter 0 register */
#define GTM_TIM4_CH7_FLT_RE            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_RE *)0xF010339Cu)

/** \\brief  3380, TIM channel 0 general purpose 0 register */
#define GTM_TIM4_CH7_GPR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR0 *)0xF0103380u)

/** \\brief  3384, TIM channel 0 general purpose 1 register */
#define GTM_TIM4_CH7_GPR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR1 *)0xF0103384u)

/** \\brief  33B0, TIM channel 0 interrupt enable register */
#define GTM_TIM4_CH7_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_EN *)0xF01033B0u)

/** \\brief  33B4, TIM channel 0 force interrupt register */
#define GTM_TIM4_CH7_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_FORCINT *)0xF01033B4u)

/** \\brief  33B8, TIM channel 0 interrupt mode configuration register */
#define GTM_TIM4_CH7_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_MODE *)0xF01033B8u)

/** \\brief  33AC, TIM channel 0 interrupt notification register */
#define GTM_TIM4_CH7_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_NOTIFY *)0xF01033ACu)

/** \\brief  3394, TIM channel 0 TDU counter register */
#define GTM_TIM4_CH7_TDUC              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUC *)0xF0103394u)

/** \\brief  3398, TIM channel 0 TDU control register */
#define GTM_TIM4_CH7_TDUV              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUV *)0xF0103398u)

/** \\brief  3078, TIM channel x AUX IN source selection register */
#define GTM_TIM4_IN_SRC                /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_IN_SRC *)0xF0103078u)

/** \\brief  3074, TIM input value observation register */
#define GTM_TIM4_INP_VAL               /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_INP_VAL *)0xF0103074u)

/** \\brief  307C, TIM global software reset register */
#define GTM_TIM4_RST                   /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_RST *)0xF010307Cu)

/** \\brief  3808, TIM channel 0 SMU counter register */
#define GTM_TIM5_CH0_CNT               /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNT *)0xF0103808u)

/** \\brief  3810, TIM channel 0 SMU shadow counter register */
#define GTM_TIM5_CH0_CNTS              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNTS *)0xF0103810u)

/** \\brief  3824, TIM channel 0 control register */
#define GTM_TIM5_CH0_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CTRL *)0xF0103824u)

/** \\brief  380C, TIM channel 0 SMU edge counter register */
#define GTM_TIM5_CH0_ECNT              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECNT *)0xF010380Cu)

/** \\brief  3828, TIM channel 0 extended control register */
#define GTM_TIM5_CH0_ECTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECTRL *)0xF0103828u)

/** \\brief  383C, TIM channel 0 error interrupt enable register */
#define GTM_TIM5_CH0_EIRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_EIRQ_EN *)0xF010383Cu)

/** \\brief  3820, TIM channel 0 filter parameter 1 register */
#define GTM_TIM5_CH0_FLT_FE            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_FE *)0xF0103820u)

/** \\brief  381C, TIM channel 0 filter parameter 0 register */
#define GTM_TIM5_CH0_FLT_RE            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_RE *)0xF010381Cu)

/** \\brief  3800, TIM channel 0 general purpose 0 register */
#define GTM_TIM5_CH0_GPR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR0 *)0xF0103800u)

/** \\brief  3804, TIM channel 0 general purpose 1 register */
#define GTM_TIM5_CH0_GPR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR1 *)0xF0103804u)

/** \\brief  3830, TIM channel 0 interrupt enable register */
#define GTM_TIM5_CH0_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_EN *)0xF0103830u)

