Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  3834, TIM channel 0 force interrupt register */
#define GTM_TIM5_CH0_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_FORCINT *)0xF0103834u)

/** \\brief  3838, TIM channel 0 interrupt mode configuration register */
#define GTM_TIM5_CH0_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_MODE *)0xF0103838u)

/** \\brief  382C, TIM channel 0 interrupt notification register */
#define GTM_TIM5_CH0_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_NOTIFY *)0xF010382Cu)

/** \\brief  3814, TIM channel 0 TDU counter register */
#define GTM_TIM5_CH0_TDUC              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUC *)0xF0103814u)

/** \\brief  3818, TIM channel 0 TDU control register */
#define GTM_TIM5_CH0_TDUV              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUV *)0xF0103818u)

/** \\brief  3888, TIM channel 0 SMU counter register */
#define GTM_TIM5_CH1_CNT               /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNT *)0xF0103888u)

/** \\brief  3890, TIM channel 0 SMU shadow counter register */
#define GTM_TIM5_CH1_CNTS              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNTS *)0xF0103890u)

/** \\brief  38A4, TIM channel 0 control register */
#define GTM_TIM5_CH1_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CTRL *)0xF01038A4u)

/** \\brief  388C, TIM channel 0 SMU edge counter register */
#define GTM_TIM5_CH1_ECNT              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECNT *)0xF010388Cu)

/** \\brief  38A8, TIM channel 0 extended control register */
#define GTM_TIM5_CH1_ECTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECTRL *)0xF01038A8u)

/** \\brief  38BC, TIM channel 0 error interrupt enable register */
#define GTM_TIM5_CH1_EIRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_EIRQ_EN *)0xF01038BCu)

/** \\brief  38A0, TIM channel 0 filter parameter 1 register */
#define GTM_TIM5_CH1_FLT_FE            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_FE *)0xF01038A0u)

/** \\brief  389C, TIM channel 0 filter parameter 0 register */
#define GTM_TIM5_CH1_FLT_RE            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_RE *)0xF010389Cu)

/** \\brief  3880, TIM channel 0 general purpose 0 register */
#define GTM_TIM5_CH1_GPR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR0 *)0xF0103880u)

/** \\brief  3884, TIM channel 0 general purpose 1 register */
#define GTM_TIM5_CH1_GPR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR1 *)0xF0103884u)

/** \\brief  38B0, TIM channel 0 interrupt enable register */
#define GTM_TIM5_CH1_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_EN *)0xF01038B0u)

/** \\brief  38B4, TIM channel 0 force interrupt register */
#define GTM_TIM5_CH1_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_FORCINT *)0xF01038B4u)

/** \\brief  38B8, TIM channel 0 interrupt mode configuration register */
#define GTM_TIM5_CH1_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_MODE *)0xF01038B8u)

/** \\brief  38AC, TIM channel 0 interrupt notification register */
#define GTM_TIM5_CH1_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_NOTIFY *)0xF01038ACu)

/** \\brief  3894, TIM channel 0 TDU counter register */
#define GTM_TIM5_CH1_TDUC              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUC *)0xF0103894u)

/** \\brief  3898, TIM channel 0 TDU control register */
#define GTM_TIM5_CH1_TDUV              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUV *)0xF0103898u)

/** \\brief  3908, TIM channel 0 SMU counter register */
#define GTM_TIM5_CH2_CNT               /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNT *)0xF0103908u)

/** \\brief  3910, TIM channel 0 SMU shadow counter register */
#define GTM_TIM5_CH2_CNTS              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNTS *)0xF0103910u)

/** \\brief  3924, TIM channel 0 control register */
#define GTM_TIM5_CH2_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CTRL *)0xF0103924u)

/** \\brief  390C, TIM channel 0 SMU edge counter register */
#define GTM_TIM5_CH2_ECNT              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECNT *)0xF010390Cu)

/** \\brief  3928, TIM channel 0 extended control register */
#define GTM_TIM5_CH2_ECTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECTRL *)0xF0103928u)

/** \\brief  393C, TIM channel 0 error interrupt enable register */
#define GTM_TIM5_CH2_EIRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_EIRQ_EN *)0xF010393Cu)

/** \\brief  3920, TIM channel 0 filter parameter 1 register */
#define GTM_TIM5_CH2_FLT_FE            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_FE *)0xF0103920u)

/** \\brief  391C, TIM channel 0 filter parameter 0 register */
#define GTM_TIM5_CH2_FLT_RE            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_RE *)0xF010391Cu)

/** \\brief  3900, TIM channel 0 general purpose 0 register */
#define GTM_TIM5_CH2_GPR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR0 *)0xF0103900u)

/** \\brief  3904, TIM channel 0 general purpose 1 register */
#define GTM_TIM5_CH2_GPR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR1 *)0xF0103904u)

/** \\brief  3930, TIM channel 0 interrupt enable register */
#define GTM_TIM5_CH2_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_EN *)0xF0103930u)

/** \\brief  3934, TIM channel 0 force interrupt register */
#define GTM_TIM5_CH2_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_FORCINT *)0xF0103934u)

/** \\brief  3938, TIM channel 0 interrupt mode configuration register */
#define GTM_TIM5_CH2_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_MODE *)0xF0103938u)

/** \\brief  392C, TIM channel 0 interrupt notification register */
#define GTM_TIM5_CH2_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_NOTIFY *)0xF010392Cu)

/** \\brief  3914, TIM channel 0 TDU counter register */
#define GTM_TIM5_CH2_TDUC              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUC *)0xF0103914u)

/** \\brief  3918, TIM channel 0 TDU control register */
#define GTM_TIM5_CH2_TDUV              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUV *)0xF0103918u)

