Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  3AA8, TIM channel 0 extended control register */
#define GTM_TIM5_CH5_ECTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECTRL *)0xF0103AA8u)

/** \\brief  3ABC, TIM channel 0 error interrupt enable register */
#define GTM_TIM5_CH5_EIRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_EIRQ_EN *)0xF0103ABCu)

/** \\brief  3AA0, TIM channel 0 filter parameter 1 register */
#define GTM_TIM5_CH5_FLT_FE            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_FE *)0xF0103AA0u)

/** \\brief  3A9C, TIM channel 0 filter parameter 0 register */
#define GTM_TIM5_CH5_FLT_RE            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_RE *)0xF0103A9Cu)

/** \\brief  3A80, TIM channel 0 general purpose 0 register */
#define GTM_TIM5_CH5_GPR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR0 *)0xF0103A80u)

/** \\brief  3A84, TIM channel 0 general purpose 1 register */
#define GTM_TIM5_CH5_GPR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR1 *)0xF0103A84u)

/** \\brief  3AB0, TIM channel 0 interrupt enable register */
#define GTM_TIM5_CH5_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_EN *)0xF0103AB0u)

/** \\brief  3AB4, TIM channel 0 force interrupt register */
#define GTM_TIM5_CH5_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_FORCINT *)0xF0103AB4u)

/** \\brief  3AB8, TIM channel 0 interrupt mode configuration register */
#define GTM_TIM5_CH5_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_MODE *)0xF0103AB8u)

/** \\brief  3AAC, TIM channel 0 interrupt notification register */
#define GTM_TIM5_CH5_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_NOTIFY *)0xF0103AACu)

/** \\brief  3A94, TIM channel 0 TDU counter register */
#define GTM_TIM5_CH5_TDUC              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUC *)0xF0103A94u)

/** \\brief  3A98, TIM channel 0 TDU control register */
#define GTM_TIM5_CH5_TDUV              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUV *)0xF0103A98u)

/** \\brief  3B08, TIM channel 0 SMU counter register */
#define GTM_TIM5_CH6_CNT               /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNT *)0xF0103B08u)

/** \\brief  3B10, TIM channel 0 SMU shadow counter register */
#define GTM_TIM5_CH6_CNTS              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNTS *)0xF0103B10u)

/** \\brief  3B24, TIM channel 0 control register */
#define GTM_TIM5_CH6_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CTRL *)0xF0103B24u)

/** \\brief  3B0C, TIM channel 0 SMU edge counter register */
#define GTM_TIM5_CH6_ECNT              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECNT *)0xF0103B0Cu)

/** \\brief  3B28, TIM channel 0 extended control register */
#define GTM_TIM5_CH6_ECTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECTRL *)0xF0103B28u)

/** \\brief  3B3C, TIM channel 0 error interrupt enable register */
#define GTM_TIM5_CH6_EIRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_EIRQ_EN *)0xF0103B3Cu)

/** \\brief  3B20, TIM channel 0 filter parameter 1 register */
#define GTM_TIM5_CH6_FLT_FE            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_FE *)0xF0103B20u)

/** \\brief  3B1C, TIM channel 0 filter parameter 0 register */
#define GTM_TIM5_CH6_FLT_RE            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_RE *)0xF0103B1Cu)

/** \\brief  3B00, TIM channel 0 general purpose 0 register */
#define GTM_TIM5_CH6_GPR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR0 *)0xF0103B00u)

/** \\brief  3B04, TIM channel 0 general purpose 1 register */
#define GTM_TIM5_CH6_GPR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR1 *)0xF0103B04u)

/** \\brief  3B30, TIM channel 0 interrupt enable register */
#define GTM_TIM5_CH6_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_EN *)0xF0103B30u)

/** \\brief  3B34, TIM channel 0 force interrupt register */
#define GTM_TIM5_CH6_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_FORCINT *)0xF0103B34u)

/** \\brief  3B38, TIM channel 0 interrupt mode configuration register */
#define GTM_TIM5_CH6_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_MODE *)0xF0103B38u)

/** \\brief  3B2C, TIM channel 0 interrupt notification register */
#define GTM_TIM5_CH6_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_NOTIFY *)0xF0103B2Cu)

/** \\brief  3B14, TIM channel 0 TDU counter register */
#define GTM_TIM5_CH6_TDUC              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUC *)0xF0103B14u)

/** \\brief  3B18, TIM channel 0 TDU control register */
#define GTM_TIM5_CH6_TDUV              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUV *)0xF0103B18u)

/** \\brief  3B88, TIM channel 0 SMU counter register */
#define GTM_TIM5_CH7_CNT               /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNT *)0xF0103B88u)

/** \\brief  3B90, TIM channel 0 SMU shadow counter register */
#define GTM_TIM5_CH7_CNTS              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNTS *)0xF0103B90u)

/** \\brief  3BA4, TIM channel 0 control register */
#define GTM_TIM5_CH7_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CTRL *)0xF0103BA4u)

/** \\brief  3B8C, TIM channel 0 SMU edge counter register */
#define GTM_TIM5_CH7_ECNT              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECNT *)0xF0103B8Cu)

/** \\brief  3BA8, TIM channel 0 extended control register */
#define GTM_TIM5_CH7_ECTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECTRL *)0xF0103BA8u)

/** \\brief  3BBC, TIM channel 0 error interrupt enable register */
#define GTM_TIM5_CH7_EIRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_EIRQ_EN *)0xF0103BBCu)

/** \\brief  3BA0, TIM channel 0 filter parameter 1 register */
#define GTM_TIM5_CH7_FLT_FE            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_FE *)0xF0103BA0u)

/** \\brief  3B9C, TIM channel 0 filter parameter 0 register */
#define GTM_TIM5_CH7_FLT_RE            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_RE *)0xF0103B9Cu)

