Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  3B80, TIM channel 0 general purpose 0 register */
#define GTM_TIM5_CH7_GPR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR0 *)0xF0103B80u)

/** \\brief  3B84, TIM channel 0 general purpose 1 register */
#define GTM_TIM5_CH7_GPR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR1 *)0xF0103B84u)

/** \\brief  3BB0, TIM channel 0 interrupt enable register */
#define GTM_TIM5_CH7_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_EN *)0xF0103BB0u)

/** \\brief  3BB4, TIM channel 0 force interrupt register */
#define GTM_TIM5_CH7_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_FORCINT *)0xF0103BB4u)

/** \\brief  3BB8, TIM channel 0 interrupt mode configuration register */
#define GTM_TIM5_CH7_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_MODE *)0xF0103BB8u)

/** \\brief  3BAC, TIM channel 0 interrupt notification register */
#define GTM_TIM5_CH7_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_NOTIFY *)0xF0103BACu)

/** \\brief  3B94, TIM channel 0 TDU counter register */
#define GTM_TIM5_CH7_TDUC              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUC *)0xF0103B94u)

/** \\brief  3B98, TIM channel 0 TDU control register */
#define GTM_TIM5_CH7_TDUV              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUV *)0xF0103B98u)

/** \\brief  3878, TIM channel x AUX IN source selection register */
#define GTM_TIM5_IN_SRC                /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_IN_SRC *)0xF0103878u)

/** \\brief  3874, TIM input value observation register */
#define GTM_TIM5_INP_VAL               /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_INP_VAL *)0xF0103874u)

/** \\brief  387C, TIM global software reset register */
#define GTM_TIM5_RST                   /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_RST *)0xF010387Cu)

/** \\brief  4008, TIM channel 0 SMU counter register */
#define GTM_TIM6_CH0_CNT               /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNT *)0xF0104008u)

/** \\brief  4010, TIM channel 0 SMU shadow counter register */
#define GTM_TIM6_CH0_CNTS              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNTS *)0xF0104010u)

/** \\brief  4024, TIM channel 0 control register */
#define GTM_TIM6_CH0_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CTRL *)0xF0104024u)

/** \\brief  400C, TIM channel 0 SMU edge counter register */
#define GTM_TIM6_CH0_ECNT              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECNT *)0xF010400Cu)

/** \\brief  4028, TIM channel 0 extended control register */
#define GTM_TIM6_CH0_ECTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECTRL *)0xF0104028u)

/** \\brief  403C, TIM channel 0 error interrupt enable register */
#define GTM_TIM6_CH0_EIRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_EIRQ_EN *)0xF010403Cu)

/** \\brief  4020, TIM channel 0 filter parameter 1 register */
#define GTM_TIM6_CH0_FLT_FE            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_FE *)0xF0104020u)

/** \\brief  401C, TIM channel 0 filter parameter 0 register */
#define GTM_TIM6_CH0_FLT_RE            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_RE *)0xF010401Cu)

/** \\brief  4000, TIM channel 0 general purpose 0 register */
#define GTM_TIM6_CH0_GPR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR0 *)0xF0104000u)

/** \\brief  4004, TIM channel 0 general purpose 1 register */
#define GTM_TIM6_CH0_GPR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR1 *)0xF0104004u)

/** \\brief  4030, TIM channel 0 interrupt enable register */
#define GTM_TIM6_CH0_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_EN *)0xF0104030u)

/** \\brief  4034, TIM channel 0 force interrupt register */
#define GTM_TIM6_CH0_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_FORCINT *)0xF0104034u)

/** \\brief  4038, TIM channel 0 interrupt mode configuration register */
#define GTM_TIM6_CH0_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_MODE *)0xF0104038u)

/** \\brief  402C, TIM channel 0 interrupt notification register */
#define GTM_TIM6_CH0_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_NOTIFY *)0xF010402Cu)

/** \\brief  4014, TIM channel 0 TDU counter register */
#define GTM_TIM6_CH0_TDUC              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUC *)0xF0104014u)

/** \\brief  4018, TIM channel 0 TDU control register */
#define GTM_TIM6_CH0_TDUV              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUV *)0xF0104018u)

/** \\brief  4088, TIM channel 0 SMU counter register */
#define GTM_TIM6_CH1_CNT               /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNT *)0xF0104088u)

/** \\brief  4090, TIM channel 0 SMU shadow counter register */
#define GTM_TIM6_CH1_CNTS              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNTS *)0xF0104090u)

/** \\brief  40A4, TIM channel 0 control register */
#define GTM_TIM6_CH1_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CTRL *)0xF01040A4u)

/** \\brief  408C, TIM channel 0 SMU edge counter register */
#define GTM_TIM6_CH1_ECNT              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECNT *)0xF010408Cu)

/** \\brief  40A8, TIM channel 0 extended control register */
#define GTM_TIM6_CH1_ECTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECTRL *)0xF01040A8u)

/** \\brief  40BC, TIM channel 0 error interrupt enable register */
#define GTM_TIM6_CH1_EIRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_EIRQ_EN *)0xF01040BCu)

/** \\brief  40A0, TIM channel 0 filter parameter 1 register */
#define GTM_TIM6_CH1_FLT_FE            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_FE *)0xF01040A0u)

/** \\brief  409C, TIM channel 0 filter parameter 0 register */
#define GTM_TIM6_CH1_FLT_RE            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_RE *)0xF010409Cu)

/** \\brief  4080, TIM channel 0 general purpose 0 register */
#define GTM_TIM6_CH1_GPR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR0 *)0xF0104080u)

