Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  4084, TIM channel 0 general purpose 1 register */
#define GTM_TIM6_CH1_GPR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR1 *)0xF0104084u)

/** \\brief  40B0, TIM channel 0 interrupt enable register */
#define GTM_TIM6_CH1_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_EN *)0xF01040B0u)

/** \\brief  40B4, TIM channel 0 force interrupt register */
#define GTM_TIM6_CH1_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_FORCINT *)0xF01040B4u)

/** \\brief  40B8, TIM channel 0 interrupt mode configuration register */
#define GTM_TIM6_CH1_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_MODE *)0xF01040B8u)

/** \\brief  40AC, TIM channel 0 interrupt notification register */
#define GTM_TIM6_CH1_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_NOTIFY *)0xF01040ACu)

/** \\brief  4094, TIM channel 0 TDU counter register */
#define GTM_TIM6_CH1_TDUC              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUC *)0xF0104094u)

/** \\brief  4098, TIM channel 0 TDU control register */
#define GTM_TIM6_CH1_TDUV              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUV *)0xF0104098u)

/** \\brief  4108, TIM channel 0 SMU counter register */
#define GTM_TIM6_CH2_CNT               /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNT *)0xF0104108u)

/** \\brief  4110, TIM channel 0 SMU shadow counter register */
#define GTM_TIM6_CH2_CNTS              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNTS *)0xF0104110u)

/** \\brief  4124, TIM channel 0 control register */
#define GTM_TIM6_CH2_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CTRL *)0xF0104124u)

/** \\brief  410C, TIM channel 0 SMU edge counter register */
#define GTM_TIM6_CH2_ECNT              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECNT *)0xF010410Cu)

/** \\brief  4128, TIM channel 0 extended control register */
#define GTM_TIM6_CH2_ECTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECTRL *)0xF0104128u)

/** \\brief  413C, TIM channel 0 error interrupt enable register */
#define GTM_TIM6_CH2_EIRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_EIRQ_EN *)0xF010413Cu)

/** \\brief  4120, TIM channel 0 filter parameter 1 register */
#define GTM_TIM6_CH2_FLT_FE            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_FE *)0xF0104120u)

/** \\brief  411C, TIM channel 0 filter parameter 0 register */
#define GTM_TIM6_CH2_FLT_RE            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_RE *)0xF010411Cu)

/** \\brief  4100, TIM channel 0 general purpose 0 register */
#define GTM_TIM6_CH2_GPR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR0 *)0xF0104100u)

/** \\brief  4104, TIM channel 0 general purpose 1 register */
#define GTM_TIM6_CH2_GPR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR1 *)0xF0104104u)

/** \\brief  4130, TIM channel 0 interrupt enable register */
#define GTM_TIM6_CH2_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_EN *)0xF0104130u)

/** \\brief  4134, TIM channel 0 force interrupt register */
#define GTM_TIM6_CH2_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_FORCINT *)0xF0104134u)

/** \\brief  4138, TIM channel 0 interrupt mode configuration register */
#define GTM_TIM6_CH2_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_MODE *)0xF0104138u)

/** \\brief  412C, TIM channel 0 interrupt notification register */
#define GTM_TIM6_CH2_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_NOTIFY *)0xF010412Cu)

/** \\brief  4114, TIM channel 0 TDU counter register */
#define GTM_TIM6_CH2_TDUC              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUC *)0xF0104114u)

/** \\brief  4118, TIM channel 0 TDU control register */
#define GTM_TIM6_CH2_TDUV              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUV *)0xF0104118u)

/** \\brief  4188, TIM channel 0 SMU counter register */
#define GTM_TIM6_CH3_CNT               /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNT *)0xF0104188u)

/** \\brief  4190, TIM channel 0 SMU shadow counter register */
#define GTM_TIM6_CH3_CNTS              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNTS *)0xF0104190u)

/** \\brief  41A4, TIM channel 0 control register */
#define GTM_TIM6_CH3_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CTRL *)0xF01041A4u)

/** \\brief  418C, TIM channel 0 SMU edge counter register */
#define GTM_TIM6_CH3_ECNT              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECNT *)0xF010418Cu)

/** \\brief  41A8, TIM channel 0 extended control register */
#define GTM_TIM6_CH3_ECTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECTRL *)0xF01041A8u)

/** \\brief  41BC, TIM channel 0 error interrupt enable register */
#define GTM_TIM6_CH3_EIRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_EIRQ_EN *)0xF01041BCu)

/** \\brief  41A0, TIM channel 0 filter parameter 1 register */
#define GTM_TIM6_CH3_FLT_FE            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_FE *)0xF01041A0u)

/** \\brief  419C, TIM channel 0 filter parameter 0 register */
#define GTM_TIM6_CH3_FLT_RE            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_RE *)0xF010419Cu)

/** \\brief  4180, TIM channel 0 general purpose 0 register */
#define GTM_TIM6_CH3_GPR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR0 *)0xF0104180u)

/** \\brief  4184, TIM channel 0 general purpose 1 register */
#define GTM_TIM6_CH3_GPR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR1 *)0xF0104184u)

/** \\brief  41B0, TIM channel 0 interrupt enable register */
#define GTM_TIM6_CH3_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_EN *)0xF01041B0u)

/** \\brief  41B4, TIM channel 0 force interrupt register */
#define GTM_TIM6_CH3_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_FORCINT *)0xF01041B4u)

/** \\brief  41B8, TIM channel 0 interrupt mode configuration register */
#define GTM_TIM6_CH3_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_MODE *)0xF01041B8u)

/** \\brief  41AC, TIM channel 0 interrupt notification register */
#define GTM_TIM6_CH3_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_NOTIFY *)0xF01041ACu)

