Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  4194, TIM channel 0 TDU counter register */
#define GTM_TIM6_CH3_TDUC              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUC *)0xF0104194u)

/** \\brief  4198, TIM channel 0 TDU control register */
#define GTM_TIM6_CH3_TDUV              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUV *)0xF0104198u)

/** \\brief  4208, TIM channel 0 SMU counter register */
#define GTM_TIM6_CH4_CNT               /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNT *)0xF0104208u)

/** \\brief  4210, TIM channel 0 SMU shadow counter register */
#define GTM_TIM6_CH4_CNTS              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNTS *)0xF0104210u)

/** \\brief  4224, TIM channel 0 control register */
#define GTM_TIM6_CH4_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CTRL *)0xF0104224u)

/** \\brief  420C, TIM channel 0 SMU edge counter register */
#define GTM_TIM6_CH4_ECNT              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECNT *)0xF010420Cu)

/** \\brief  4228, TIM channel 0 extended control register */
#define GTM_TIM6_CH4_ECTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECTRL *)0xF0104228u)

/** \\brief  423C, TIM channel 0 error interrupt enable register */
#define GTM_TIM6_CH4_EIRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_EIRQ_EN *)0xF010423Cu)

/** \\brief  4220, TIM channel 0 filter parameter 1 register */
#define GTM_TIM6_CH4_FLT_FE            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_FE *)0xF0104220u)

/** \\brief  421C, TIM channel 0 filter parameter 0 register */
#define GTM_TIM6_CH4_FLT_RE            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_RE *)0xF010421Cu)

/** \\brief  4200, TIM channel 0 general purpose 0 register */
#define GTM_TIM6_CH4_GPR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR0 *)0xF0104200u)

/** \\brief  4204, TIM channel 0 general purpose 1 register */
#define GTM_TIM6_CH4_GPR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR1 *)0xF0104204u)

/** \\brief  4230, TIM channel 0 interrupt enable register */
#define GTM_TIM6_CH4_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_EN *)0xF0104230u)

/** \\brief  4234, TIM channel 0 force interrupt register */
#define GTM_TIM6_CH4_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_FORCINT *)0xF0104234u)

/** \\brief  4238, TIM channel 0 interrupt mode configuration register */
#define GTM_TIM6_CH4_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_MODE *)0xF0104238u)

/** \\brief  422C, TIM channel 0 interrupt notification register */
#define GTM_TIM6_CH4_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_NOTIFY *)0xF010422Cu)

/** \\brief  4214, TIM channel 0 TDU counter register */
#define GTM_TIM6_CH4_TDUC              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUC *)0xF0104214u)

/** \\brief  4218, TIM channel 0 TDU control register */
#define GTM_TIM6_CH4_TDUV              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUV *)0xF0104218u)

/** \\brief  4288, TIM channel 0 SMU counter register */
#define GTM_TIM6_CH5_CNT               /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNT *)0xF0104288u)

/** \\brief  4290, TIM channel 0 SMU shadow counter register */
#define GTM_TIM6_CH5_CNTS              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNTS *)0xF0104290u)

/** \\brief  42A4, TIM channel 0 control register */
#define GTM_TIM6_CH5_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CTRL *)0xF01042A4u)

/** \\brief  428C, TIM channel 0 SMU edge counter register */
#define GTM_TIM6_CH5_ECNT              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECNT *)0xF010428Cu)

/** \\brief  42A8, TIM channel 0 extended control register */
#define GTM_TIM6_CH5_ECTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECTRL *)0xF01042A8u)

/** \\brief  42BC, TIM channel 0 error interrupt enable register */
#define GTM_TIM6_CH5_EIRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_EIRQ_EN *)0xF01042BCu)

/** \\brief  42A0, TIM channel 0 filter parameter 1 register */
#define GTM_TIM6_CH5_FLT_FE            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_FE *)0xF01042A0u)

/** \\brief  429C, TIM channel 0 filter parameter 0 register */
#define GTM_TIM6_CH5_FLT_RE            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_RE *)0xF010429Cu)

/** \\brief  4280, TIM channel 0 general purpose 0 register */
#define GTM_TIM6_CH5_GPR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR0 *)0xF0104280u)

/** \\brief  4284, TIM channel 0 general purpose 1 register */
#define GTM_TIM6_CH5_GPR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR1 *)0xF0104284u)

/** \\brief  42B0, TIM channel 0 interrupt enable register */
#define GTM_TIM6_CH5_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_EN *)0xF01042B0u)

/** \\brief  42B4, TIM channel 0 force interrupt register */
#define GTM_TIM6_CH5_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_FORCINT *)0xF01042B4u)

/** \\brief  42B8, TIM channel 0 interrupt mode configuration register */
#define GTM_TIM6_CH5_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_MODE *)0xF01042B8u)

/** \\brief  42AC, TIM channel 0 interrupt notification register */
#define GTM_TIM6_CH5_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_NOTIFY *)0xF01042ACu)

/** \\brief  4294, TIM channel 0 TDU counter register */
#define GTM_TIM6_CH5_TDUC              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUC *)0xF0104294u)

/** \\brief  4298, TIM channel 0 TDU control register */
#define GTM_TIM6_CH5_TDUV              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUV *)0xF0104298u)

/** \\brief  4308, TIM channel 0 SMU counter register */
#define GTM_TIM6_CH6_CNT               /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNT *)0xF0104308u)

/** \\brief  4310, TIM channel 0 SMU shadow counter register */
#define GTM_TIM6_CH6_CNTS              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNTS *)0xF0104310u)

