Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  4324, TIM channel 0 control register */
#define GTM_TIM6_CH6_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CTRL *)0xF0104324u)

/** \\brief  430C, TIM channel 0 SMU edge counter register */
#define GTM_TIM6_CH6_ECNT              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECNT *)0xF010430Cu)

/** \\brief  4328, TIM channel 0 extended control register */
#define GTM_TIM6_CH6_ECTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECTRL *)0xF0104328u)

/** \\brief  433C, TIM channel 0 error interrupt enable register */
#define GTM_TIM6_CH6_EIRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_EIRQ_EN *)0xF010433Cu)

/** \\brief  4320, TIM channel 0 filter parameter 1 register */
#define GTM_TIM6_CH6_FLT_FE            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_FE *)0xF0104320u)

/** \\brief  431C, TIM channel 0 filter parameter 0 register */
#define GTM_TIM6_CH6_FLT_RE            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_RE *)0xF010431Cu)

/** \\brief  4300, TIM channel 0 general purpose 0 register */
#define GTM_TIM6_CH6_GPR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR0 *)0xF0104300u)

/** \\brief  4304, TIM channel 0 general purpose 1 register */
#define GTM_TIM6_CH6_GPR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR1 *)0xF0104304u)

/** \\brief  4330, TIM channel 0 interrupt enable register */
#define GTM_TIM6_CH6_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_EN *)0xF0104330u)

/** \\brief  4334, TIM channel 0 force interrupt register */
#define GTM_TIM6_CH6_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_FORCINT *)0xF0104334u)

/** \\brief  4338, TIM channel 0 interrupt mode configuration register */
#define GTM_TIM6_CH6_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_MODE *)0xF0104338u)

/** \\brief  432C, TIM channel 0 interrupt notification register */
#define GTM_TIM6_CH6_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_NOTIFY *)0xF010432Cu)

/** \\brief  4314, TIM channel 0 TDU counter register */
#define GTM_TIM6_CH6_TDUC              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUC *)0xF0104314u)

/** \\brief  4318, TIM channel 0 TDU control register */
#define GTM_TIM6_CH6_TDUV              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUV *)0xF0104318u)

/** \\brief  4388, TIM channel 0 SMU counter register */
#define GTM_TIM6_CH7_CNT               /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNT *)0xF0104388u)

/** \\brief  4390, TIM channel 0 SMU shadow counter register */
#define GTM_TIM6_CH7_CNTS              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNTS *)0xF0104390u)

/** \\brief  43A4, TIM channel 0 control register */
#define GTM_TIM6_CH7_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CTRL *)0xF01043A4u)

/** \\brief  438C, TIM channel 0 SMU edge counter register */
#define GTM_TIM6_CH7_ECNT              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECNT *)0xF010438Cu)

/** \\brief  43A8, TIM channel 0 extended control register */
#define GTM_TIM6_CH7_ECTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECTRL *)0xF01043A8u)

/** \\brief  43BC, TIM channel 0 error interrupt enable register */
#define GTM_TIM6_CH7_EIRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_EIRQ_EN *)0xF01043BCu)

/** \\brief  43A0, TIM channel 0 filter parameter 1 register */
#define GTM_TIM6_CH7_FLT_FE            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_FE *)0xF01043A0u)

/** \\brief  439C, TIM channel 0 filter parameter 0 register */
#define GTM_TIM6_CH7_FLT_RE            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_RE *)0xF010439Cu)

/** \\brief  4380, TIM channel 0 general purpose 0 register */
#define GTM_TIM6_CH7_GPR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR0 *)0xF0104380u)

/** \\brief  4384, TIM channel 0 general purpose 1 register */
#define GTM_TIM6_CH7_GPR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR1 *)0xF0104384u)

/** \\brief  43B0, TIM channel 0 interrupt enable register */
#define GTM_TIM6_CH7_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_EN *)0xF01043B0u)

/** \\brief  43B4, TIM channel 0 force interrupt register */
#define GTM_TIM6_CH7_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_FORCINT *)0xF01043B4u)

/** \\brief  43B8, TIM channel 0 interrupt mode configuration register */
#define GTM_TIM6_CH7_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_MODE *)0xF01043B8u)

/** \\brief  43AC, TIM channel 0 interrupt notification register */
#define GTM_TIM6_CH7_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_NOTIFY *)0xF01043ACu)

/** \\brief  4394, TIM channel 0 TDU counter register */
#define GTM_TIM6_CH7_TDUC              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUC *)0xF0104394u)

/** \\brief  4398, TIM channel 0 TDU control register */
#define GTM_TIM6_CH7_TDUV              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUV *)0xF0104398u)

/** \\brief  4078, TIM channel x AUX IN source selection register */
#define GTM_TIM6_IN_SRC                /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_IN_SRC *)0xF0104078u)

/** \\brief  4074, TIM input value observation register */
#define GTM_TIM6_INP_VAL               /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_INP_VAL *)0xF0104074u)

/** \\brief  407C, TIM global software reset register */
#define GTM_TIM6_RST                   /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_RST *)0xF010407Cu)

/** \\brief  4808, TIM channel 0 SMU counter register */
#define GTM_TIM7_CH0_CNT               /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNT *)0xF0104808u)

/** \\brief  4810, TIM channel 0 SMU shadow counter register */
#define GTM_TIM7_CH0_CNTS              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNTS *)0xF0104810u)

/** \\brief  4824, TIM channel 0 control register */
#define GTM_TIM7_CH0_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CTRL *)0xF0104824u)

