Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  480C, TIM channel 0 SMU edge counter register */
#define GTM_TIM7_CH0_ECNT              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECNT *)0xF010480Cu)

/** \\brief  4828, TIM channel 0 extended control register */
#define GTM_TIM7_CH0_ECTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECTRL *)0xF0104828u)

/** \\brief  483C, TIM channel 0 error interrupt enable register */
#define GTM_TIM7_CH0_EIRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_EIRQ_EN *)0xF010483Cu)

/** \\brief  4820, TIM channel 0 filter parameter 1 register */
#define GTM_TIM7_CH0_FLT_FE            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_FE *)0xF0104820u)

/** \\brief  481C, TIM channel 0 filter parameter 0 register */
#define GTM_TIM7_CH0_FLT_RE            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_RE *)0xF010481Cu)

/** \\brief  4800, TIM channel 0 general purpose 0 register */
#define GTM_TIM7_CH0_GPR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR0 *)0xF0104800u)

/** \\brief  4804, TIM channel 0 general purpose 1 register */
#define GTM_TIM7_CH0_GPR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR1 *)0xF0104804u)

/** \\brief  4830, TIM channel 0 interrupt enable register */
#define GTM_TIM7_CH0_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_EN *)0xF0104830u)

/** \\brief  4834, TIM channel 0 force interrupt register */
#define GTM_TIM7_CH0_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_FORCINT *)0xF0104834u)

/** \\brief  4838, TIM channel 0 interrupt mode configuration register */
#define GTM_TIM7_CH0_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_MODE *)0xF0104838u)

/** \\brief  482C, TIM channel 0 interrupt notification register */
#define GTM_TIM7_CH0_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_NOTIFY *)0xF010482Cu)

/** \\brief  4814, TIM channel 0 TDU counter register */
#define GTM_TIM7_CH0_TDUC              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUC *)0xF0104814u)

/** \\brief  4818, TIM channel 0 TDU control register */
#define GTM_TIM7_CH0_TDUV              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUV *)0xF0104818u)

/** \\brief  4888, TIM channel 0 SMU counter register */
#define GTM_TIM7_CH1_CNT               /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNT *)0xF0104888u)

/** \\brief  4890, TIM channel 0 SMU shadow counter register */
#define GTM_TIM7_CH1_CNTS              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNTS *)0xF0104890u)

/** \\brief  48A4, TIM channel 0 control register */
#define GTM_TIM7_CH1_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CTRL *)0xF01048A4u)

/** \\brief  488C, TIM channel 0 SMU edge counter register */
#define GTM_TIM7_CH1_ECNT              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECNT *)0xF010488Cu)

/** \\brief  48A8, TIM channel 0 extended control register */
#define GTM_TIM7_CH1_ECTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECTRL *)0xF01048A8u)

/** \\brief  48BC, TIM channel 0 error interrupt enable register */
#define GTM_TIM7_CH1_EIRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_EIRQ_EN *)0xF01048BCu)

/** \\brief  48A0, TIM channel 0 filter parameter 1 register */
#define GTM_TIM7_CH1_FLT_FE            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_FE *)0xF01048A0u)

/** \\brief  489C, TIM channel 0 filter parameter 0 register */
#define GTM_TIM7_CH1_FLT_RE            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_RE *)0xF010489Cu)

/** \\brief  4880, TIM channel 0 general purpose 0 register */
#define GTM_TIM7_CH1_GPR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR0 *)0xF0104880u)

/** \\brief  4884, TIM channel 0 general purpose 1 register */
#define GTM_TIM7_CH1_GPR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR1 *)0xF0104884u)

/** \\brief  48B0, TIM channel 0 interrupt enable register */
#define GTM_TIM7_CH1_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_EN *)0xF01048B0u)

/** \\brief  48B4, TIM channel 0 force interrupt register */
#define GTM_TIM7_CH1_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_FORCINT *)0xF01048B4u)

/** \\brief  48B8, TIM channel 0 interrupt mode configuration register */
#define GTM_TIM7_CH1_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_MODE *)0xF01048B8u)

/** \\brief  48AC, TIM channel 0 interrupt notification register */
#define GTM_TIM7_CH1_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_NOTIFY *)0xF01048ACu)

/** \\brief  4894, TIM channel 0 TDU counter register */
#define GTM_TIM7_CH1_TDUC              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUC *)0xF0104894u)

/** \\brief  4898, TIM channel 0 TDU control register */
#define GTM_TIM7_CH1_TDUV              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUV *)0xF0104898u)

/** \\brief  4908, TIM channel 0 SMU counter register */
#define GTM_TIM7_CH2_CNT               /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNT *)0xF0104908u)

/** \\brief  4910, TIM channel 0 SMU shadow counter register */
#define GTM_TIM7_CH2_CNTS              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNTS *)0xF0104910u)

/** \\brief  4924, TIM channel 0 control register */
#define GTM_TIM7_CH2_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CTRL *)0xF0104924u)

/** \\brief  490C, TIM channel 0 SMU edge counter register */
#define GTM_TIM7_CH2_ECNT              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECNT *)0xF010490Cu)

/** \\brief  4928, TIM channel 0 extended control register */
#define GTM_TIM7_CH2_ECTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECTRL *)0xF0104928u)

/** \\brief  493C, TIM channel 0 error interrupt enable register */
#define GTM_TIM7_CH2_EIRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_EIRQ_EN *)0xF010493Cu)

/** \\brief  4920, TIM channel 0 filter parameter 1 register */
#define GTM_TIM7_CH2_FLT_FE            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_FE *)0xF0104920u)

/** \\brief  491C, TIM channel 0 filter parameter 0 register */
#define GTM_TIM7_CH2_FLT_RE            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_RE *)0xF010491Cu)

/** \\brief  4900, TIM channel 0 general purpose 0 register */
#define GTM_TIM7_CH2_GPR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR0 *)0xF0104900u)

/** \\brief  4904, TIM channel 0 general purpose 1 register */
#define GTM_TIM7_CH2_GPR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR1 *)0xF0104904u)

