Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  4930, TIM channel 0 interrupt enable register */
#define GTM_TIM7_CH2_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_EN *)0xF0104930u)

/** \\brief  4934, TIM channel 0 force interrupt register */
#define GTM_TIM7_CH2_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_FORCINT *)0xF0104934u)

/** \\brief  4938, TIM channel 0 interrupt mode configuration register */
#define GTM_TIM7_CH2_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_MODE *)0xF0104938u)

/** \\brief  492C, TIM channel 0 interrupt notification register */
#define GTM_TIM7_CH2_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_NOTIFY *)0xF010492Cu)

/** \\brief  4914, TIM channel 0 TDU counter register */
#define GTM_TIM7_CH2_TDUC              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUC *)0xF0104914u)

/** \\brief  4918, TIM channel 0 TDU control register */
#define GTM_TIM7_CH2_TDUV              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUV *)0xF0104918u)

/** \\brief  4988, TIM channel 0 SMU counter register */
#define GTM_TIM7_CH3_CNT               /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNT *)0xF0104988u)

/** \\brief  4990, TIM channel 0 SMU shadow counter register */
#define GTM_TIM7_CH3_CNTS              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNTS *)0xF0104990u)

/** \\brief  49A4, TIM channel 0 control register */
#define GTM_TIM7_CH3_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CTRL *)0xF01049A4u)

/** \\brief  498C, TIM channel 0 SMU edge counter register */
#define GTM_TIM7_CH3_ECNT              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECNT *)0xF010498Cu)

/** \\brief  49A8, TIM channel 0 extended control register */
#define GTM_TIM7_CH3_ECTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECTRL *)0xF01049A8u)

/** \\brief  49BC, TIM channel 0 error interrupt enable register */
#define GTM_TIM7_CH3_EIRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_EIRQ_EN *)0xF01049BCu)

/** \\brief  49A0, TIM channel 0 filter parameter 1 register */
#define GTM_TIM7_CH3_FLT_FE            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_FE *)0xF01049A0u)

/** \\brief  499C, TIM channel 0 filter parameter 0 register */
#define GTM_TIM7_CH3_FLT_RE            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_RE *)0xF010499Cu)

/** \\brief  4980, TIM channel 0 general purpose 0 register */
#define GTM_TIM7_CH3_GPR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR0 *)0xF0104980u)

/** \\brief  4984, TIM channel 0 general purpose 1 register */
#define GTM_TIM7_CH3_GPR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR1 *)0xF0104984u)

/** \\brief  49B0, TIM channel 0 interrupt enable register */
#define GTM_TIM7_CH3_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_EN *)0xF01049B0u)

/** \\brief  49B4, TIM channel 0 force interrupt register */
#define GTM_TIM7_CH3_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_FORCINT *)0xF01049B4u)

/** \\brief  49B8, TIM channel 0 interrupt mode configuration register */
#define GTM_TIM7_CH3_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_MODE *)0xF01049B8u)

/** \\brief  49AC, TIM channel 0 interrupt notification register */
#define GTM_TIM7_CH3_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_NOTIFY *)0xF01049ACu)

/** \\brief  4994, TIM channel 0 TDU counter register */
#define GTM_TIM7_CH3_TDUC              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUC *)0xF0104994u)

/** \\brief  4998, TIM channel 0 TDU control register */
#define GTM_TIM7_CH3_TDUV              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUV *)0xF0104998u)

/** \\brief  4A08, TIM channel 0 SMU counter register */
#define GTM_TIM7_CH4_CNT               /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNT *)0xF0104A08u)

/** \\brief  4A10, TIM channel 0 SMU shadow counter register */
#define GTM_TIM7_CH4_CNTS              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNTS *)0xF0104A10u)

/** \\brief  4A24, TIM channel 0 control register */
#define GTM_TIM7_CH4_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CTRL *)0xF0104A24u)

/** \\brief  4A0C, TIM channel 0 SMU edge counter register */
#define GTM_TIM7_CH4_ECNT              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECNT *)0xF0104A0Cu)

/** \\brief  4A28, TIM channel 0 extended control register */
#define GTM_TIM7_CH4_ECTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECTRL *)0xF0104A28u)

/** \\brief  4A3C, TIM channel 0 error interrupt enable register */
#define GTM_TIM7_CH4_EIRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_EIRQ_EN *)0xF0104A3Cu)

/** \\brief  4A20, TIM channel 0 filter parameter 1 register */
#define GTM_TIM7_CH4_FLT_FE            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_FE *)0xF0104A20u)

/** \\brief  4A1C, TIM channel 0 filter parameter 0 register */
#define GTM_TIM7_CH4_FLT_RE            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_RE *)0xF0104A1Cu)

/** \\brief  4A00, TIM channel 0 general purpose 0 register */
#define GTM_TIM7_CH4_GPR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR0 *)0xF0104A00u)

/** \\brief  4A04, TIM channel 0 general purpose 1 register */
#define GTM_TIM7_CH4_GPR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR1 *)0xF0104A04u)

/** \\brief  4A30, TIM channel 0 interrupt enable register */
#define GTM_TIM7_CH4_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_EN *)0xF0104A30u)

/** \\brief  4A34, TIM channel 0 force interrupt register */
#define GTM_TIM7_CH4_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_FORCINT *)0xF0104A34u)

/** \\brief  4A38, TIM channel 0 interrupt mode configuration register */
#define GTM_TIM7_CH4_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_MODE *)0xF0104A38u)

/** \\brief  4A2C, TIM channel 0 interrupt notification register */
#define GTM_TIM7_CH4_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_NOTIFY *)0xF0104A2Cu)

/** \\brief  4A14, TIM channel 0 TDU counter register */
#define GTM_TIM7_CH4_TDUC              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUC *)0xF0104A14u)

