Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  4A18, TIM channel 0 TDU control register */
#define GTM_TIM7_CH4_TDUV              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUV *)0xF0104A18u)

/** \\brief  4A88, TIM channel 0 SMU counter register */
#define GTM_TIM7_CH5_CNT               /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNT *)0xF0104A88u)

/** \\brief  4A90, TIM channel 0 SMU shadow counter register */
#define GTM_TIM7_CH5_CNTS              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNTS *)0xF0104A90u)

/** \\brief  4AA4, TIM channel 0 control register */
#define GTM_TIM7_CH5_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CTRL *)0xF0104AA4u)

/** \\brief  4A8C, TIM channel 0 SMU edge counter register */
#define GTM_TIM7_CH5_ECNT              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECNT *)0xF0104A8Cu)

/** \\brief  4AA8, TIM channel 0 extended control register */
#define GTM_TIM7_CH5_ECTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECTRL *)0xF0104AA8u)

/** \\brief  4ABC, TIM channel 0 error interrupt enable register */
#define GTM_TIM7_CH5_EIRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_EIRQ_EN *)0xF0104ABCu)

/** \\brief  4AA0, TIM channel 0 filter parameter 1 register */
#define GTM_TIM7_CH5_FLT_FE            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_FE *)0xF0104AA0u)

/** \\brief  4A9C, TIM channel 0 filter parameter 0 register */
#define GTM_TIM7_CH5_FLT_RE            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_RE *)0xF0104A9Cu)

/** \\brief  4A80, TIM channel 0 general purpose 0 register */
#define GTM_TIM7_CH5_GPR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR0 *)0xF0104A80u)

/** \\brief  4A84, TIM channel 0 general purpose 1 register */
#define GTM_TIM7_CH5_GPR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR1 *)0xF0104A84u)

/** \\brief  4AB0, TIM channel 0 interrupt enable register */
#define GTM_TIM7_CH5_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_EN *)0xF0104AB0u)

/** \\brief  4AB4, TIM channel 0 force interrupt register */
#define GTM_TIM7_CH5_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_FORCINT *)0xF0104AB4u)

/** \\brief  4AB8, TIM channel 0 interrupt mode configuration register */
#define GTM_TIM7_CH5_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_MODE *)0xF0104AB8u)

/** \\brief  4AAC, TIM channel 0 interrupt notification register */
#define GTM_TIM7_CH5_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_NOTIFY *)0xF0104AACu)

/** \\brief  4A94, TIM channel 0 TDU counter register */
#define GTM_TIM7_CH5_TDUC              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUC *)0xF0104A94u)

/** \\brief  4A98, TIM channel 0 TDU control register */
#define GTM_TIM7_CH5_TDUV              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUV *)0xF0104A98u)

/** \\brief  4B08, TIM channel 0 SMU counter register */
#define GTM_TIM7_CH6_CNT               /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNT *)0xF0104B08u)

/** \\brief  4B10, TIM channel 0 SMU shadow counter register */
#define GTM_TIM7_CH6_CNTS              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNTS *)0xF0104B10u)

/** \\brief  4B24, TIM channel 0 control register */
#define GTM_TIM7_CH6_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CTRL *)0xF0104B24u)

/** \\brief  4B0C, TIM channel 0 SMU edge counter register */
#define GTM_TIM7_CH6_ECNT              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECNT *)0xF0104B0Cu)

/** \\brief  4B28, TIM channel 0 extended control register */
#define GTM_TIM7_CH6_ECTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECTRL *)0xF0104B28u)

/** \\brief  4B3C, TIM channel 0 error interrupt enable register */
#define GTM_TIM7_CH6_EIRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_EIRQ_EN *)0xF0104B3Cu)

/** \\brief  4B20, TIM channel 0 filter parameter 1 register */
#define GTM_TIM7_CH6_FLT_FE            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_FE *)0xF0104B20u)

/** \\brief  4B1C, TIM channel 0 filter parameter 0 register */
#define GTM_TIM7_CH6_FLT_RE            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_RE *)0xF0104B1Cu)

/** \\brief  4B00, TIM channel 0 general purpose 0 register */
#define GTM_TIM7_CH6_GPR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR0 *)0xF0104B00u)

/** \\brief  4B04, TIM channel 0 general purpose 1 register */
#define GTM_TIM7_CH6_GPR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR1 *)0xF0104B04u)

/** \\brief  4B30, TIM channel 0 interrupt enable register */
#define GTM_TIM7_CH6_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_EN *)0xF0104B30u)

/** \\brief  4B34, TIM channel 0 force interrupt register */
#define GTM_TIM7_CH6_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_FORCINT *)0xF0104B34u)

/** \\brief  4B38, TIM channel 0 interrupt mode configuration register */
#define GTM_TIM7_CH6_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_MODE *)0xF0104B38u)

/** \\brief  4B2C, TIM channel 0 interrupt notification register */
#define GTM_TIM7_CH6_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_NOTIFY *)0xF0104B2Cu)

/** \\brief  4B14, TIM channel 0 TDU counter register */
#define GTM_TIM7_CH6_TDUC              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUC *)0xF0104B14u)

/** \\brief  4B18, TIM channel 0 TDU control register */
#define GTM_TIM7_CH6_TDUV              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUV *)0xF0104B18u)

/** \\brief  4B88, TIM channel 0 SMU counter register */
#define GTM_TIM7_CH7_CNT               /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNT *)0xF0104B88u)

/** \\brief  4B90, TIM channel 0 SMU shadow counter register */
#define GTM_TIM7_CH7_CNTS              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNTS *)0xF0104B90u)

/** \\brief  4BA4, TIM channel 0 control register */
#define GTM_TIM7_CH7_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CTRL *)0xF0104BA4u)

/** \\brief  4B8C, TIM channel 0 SMU edge counter register */
#define GTM_TIM7_CH7_ECNT              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECNT *)0xF0104B8Cu)

/** \\brief  4BA8, TIM channel 0 extended control register */
#define GTM_TIM7_CH7_ECTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECTRL *)0xF0104BA8u)

/** \\brief  4BBC, TIM channel 0 error interrupt enable register */
#define GTM_TIM7_CH7_EIRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_EIRQ_EN *)0xF0104BBCu)

/** \\brief  4BA0, TIM channel 0 filter parameter 1 register */
#define GTM_TIM7_CH7_FLT_FE            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_FE *)0xF0104BA0u)

/** \\brief  4B9C, TIM channel 0 filter parameter 0 register */
#define GTM_TIM7_CH7_FLT_RE            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_RE *)0xF0104B9Cu)

/** \\brief  4B80, TIM channel 0 general purpose 0 register */
#define GTM_TIM7_CH7_GPR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR0 *)0xF0104B80u)

/** \\brief  4B84, TIM channel 0 general purpose 1 register */
#define GTM_TIM7_CH7_GPR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR1 *)0xF0104B84u)

/** \\brief  4BB0, TIM channel 0 interrupt enable register */
#define GTM_TIM7_CH7_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_EN *)0xF0104BB0u)

/** \\brief  4BB4, TIM channel 0 force interrupt register */
#define GTM_TIM7_CH7_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_FORCINT *)0xF0104BB4u)

