Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  4BB8, TIM channel 0 interrupt mode configuration register */
#define GTM_TIM7_CH7_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_MODE *)0xF0104BB8u)

/** \\brief  4BAC, TIM channel 0 interrupt notification register */
#define GTM_TIM7_CH7_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_NOTIFY *)0xF0104BACu)

/** \\brief  4B94, TIM channel 0 TDU counter register */
#define GTM_TIM7_CH7_TDUC              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUC *)0xF0104B94u)

/** \\brief  4B98, TIM channel 0 TDU control register */
#define GTM_TIM7_CH7_TDUV              /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUV *)0xF0104B98u)

/** \\brief  4878, TIM channel x AUX IN source selection register */
#define GTM_TIM7_IN_SRC                /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_IN_SRC *)0xF0104878u)

/** \\brief  4874, TIM input value observation register */
#define GTM_TIM7_INP_VAL               /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_INP_VAL *)0xF0104874u)

/** \\brief  487C, TIM global software reset register */
#define GTM_TIM7_RST                   /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_RST *)0xF010487Cu)

/** \\brief  40, GTM TIM   module AUX_IN source selection register */
#define GTM_TIM_AUX_IN_SRC0            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_AUX_IN_SRC *)0xF0100040u)

/** Alias (User Manual Name) for GTM_TIM_AUX_IN_SRC0.
 * To use register names with standard convension, please use GTM_TIM_AUX_IN_SRC0.
 */
#define GTM_TIM0_AUX_IN_SRC            (GTM_TIM_AUX_IN_SRC0)

/** Alias (User Manual Name) for GTM_TIM_AUX_IN_SRC0.
 * To use register names with standard convension, please use GTM_TIM_AUX_IN_SRC0.
 */
#define GTM_TIM0_AUX_IN_SRC            (GTM_TIM_AUX_IN_SRC0)

/** \\brief  44, GTM TIM   module AUX_IN source selection register */
#define GTM_TIM_AUX_IN_SRC1            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_AUX_IN_SRC *)0xF0100044u)

/** Alias (User Manual Name) for GTM_TIM_AUX_IN_SRC1.
 * To use register names with standard convension, please use GTM_TIM_AUX_IN_SRC1.
 */
#define GTM_TIM1_AUX_IN_SRC            (GTM_TIM_AUX_IN_SRC1)

/** Alias (User Manual Name) for GTM_TIM_AUX_IN_SRC1.
 * To use register names with standard convension, please use GTM_TIM_AUX_IN_SRC1.
 */
#define GTM_TIM1_AUX_IN_SRC            (GTM_TIM_AUX_IN_SRC1)

/** \\brief  48, GTM TIM   module AUX_IN source selection register */
#define GTM_TIM_AUX_IN_SRC2            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_AUX_IN_SRC *)0xF0100048u)

/** Alias (User Manual Name) for GTM_TIM_AUX_IN_SRC2.
 * To use register names with standard convension, please use GTM_TIM_AUX_IN_SRC2.
 */
#define GTM_TIM2_AUX_IN_SRC            (GTM_TIM_AUX_IN_SRC2)

/** Alias (User Manual Name) for GTM_TIM_AUX_IN_SRC2.
 * To use register names with standard convension, please use GTM_TIM_AUX_IN_SRC2.
 */
#define GTM_TIM2_AUX_IN_SRC            (GTM_TIM_AUX_IN_SRC2)

/** \\brief  4C, GTM TIM   module AUX_IN source selection register */
#define GTM_TIM_AUX_IN_SRC3            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_AUX_IN_SRC *)0xF010004Cu)

/** Alias (User Manual Name) for GTM_TIM_AUX_IN_SRC3.
 * To use register names with standard convension, please use GTM_TIM_AUX_IN_SRC3.
 */
#define GTM_TIM3_AUX_IN_SRC            (GTM_TIM_AUX_IN_SRC3)

/** Alias (User Manual Name) for GTM_TIM_AUX_IN_SRC3.
 * To use register names with standard convension, please use GTM_TIM_AUX_IN_SRC3.
 */
#define GTM_TIM3_AUX_IN_SRC            (GTM_TIM_AUX_IN_SRC3)

/** \\brief  50, GTM TIM   module AUX_IN source selection register */
#define GTM_TIM_AUX_IN_SRC4            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_AUX_IN_SRC *)0xF0100050u)

/** Alias (User Manual Name) for GTM_TIM_AUX_IN_SRC4.
 * To use register names with standard convension, please use GTM_TIM_AUX_IN_SRC4.
 */
#define GTM_TIM4_AUX_IN_SRC            (GTM_TIM_AUX_IN_SRC4)

/** Alias (User Manual Name) for GTM_TIM_AUX_IN_SRC4.
 * To use register names with standard convension, please use GTM_TIM_AUX_IN_SRC4.
 */
#define GTM_TIM4_AUX_IN_SRC            (GTM_TIM_AUX_IN_SRC4)

/** \\brief  54, GTM TIM   module AUX_IN source selection register */
#define GTM_TIM_AUX_IN_SRC5            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_AUX_IN_SRC *)0xF0100054u)

/** Alias (User Manual Name) for GTM_TIM_AUX_IN_SRC5.
 * To use register names with standard convension, please use GTM_TIM_AUX_IN_SRC5.
 */
#define GTM_TIM5_AUX_IN_SRC            (GTM_TIM_AUX_IN_SRC5)

/** Alias (User Manual Name) for GTM_TIM_AUX_IN_SRC5.
 * To use register names with standard convension, please use GTM_TIM_AUX_IN_SRC5.
 */
#define GTM_TIM5_AUX_IN_SRC            (GTM_TIM_AUX_IN_SRC5)

/** \\brief  58, GTM TIM   module AUX_IN source selection register */
#define GTM_TIM_AUX_IN_SRC6            /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_AUX_IN_SRC *)0xF0100058u)

/** Alias (User Manual Name) for GTM_TIM_AUX_IN_SRC6.
 * To use register names with standard convension, please use GTM_TIM_AUX_IN_SRC6.
 */
#define GTM_TIM6_AUX_IN_SRC            (GTM_TIM_AUX_IN_SRC6)

/** Alias (User Manual Name) for GTM_TIM_AUX_IN_SRC6.
 * To use register names with standard convension, please use GTM_TIM_AUX_IN_SRC6.
 */
#define GTM_TIM6_AUX_IN_SRC            (GTM_TIM_AUX_IN_SRC6)

/** \\brief  800C, TOM channel 0 CCU0 compare register */
#define GTM_TOM0_CH0_CM0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM0 *)0xF010800Cu)

/** \\brief  8010, TOM channel 0 CCU1 compare register */
#define GTM_TOM0_CH0_CM1               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM1 *)0xF0108010u)

/** \\brief  8014, TOM channel 0 CCU0 counter register */
#define GTM_TOM0_CH0_CN0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CN0 *)0xF0108014u)

/** \\brief  8000, TOM channel 0 control register */
#define GTM_TOM0_CH0_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL *)0xF0108000u)

/** \\brief  8020, TOM channel 0 interrupt enable register */
#define GTM_TOM0_CH0_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN *)0xF0108020u)

/** \\brief  8024, TOM channel 0 force interrupt register */
#define GTM_TOM0_CH0_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT *)0xF0108024u)

/** \\brief  8028, TOM channel 0 interrupt mode register */
#define GTM_TOM0_CH0_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE *)0xF0108028u)

/** \\brief  801C, TOM channel 0 interrupt notification register */
#define GTM_TOM0_CH0_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY *)0xF010801Cu)

/** \\brief  8004, TOM channel 0 CCU0 compare shadow register */
#define GTM_TOM0_CH0_SR0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR0 *)0xF0108004u)

/** \\brief  8008, TOM channel 0 CCU1 compare shadow register */
#define GTM_TOM0_CH0_SR1               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR1 *)0xF0108008u)

/** \\brief  8018, TOM channel 0 status register */
#define GTM_TOM0_CH0_STAT              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_STAT *)0xF0108018u)

/** \\brief  828C, TOM channel 0 CCU0 compare register */
#define GTM_TOM0_CH10_CM0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM0 *)0xF010828Cu)

