Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  8290, TOM channel 0 CCU1 compare register */
#define GTM_TOM0_CH10_CM1              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM1 *)0xF0108290u)

/** \\brief  8294, TOM channel 0 CCU0 counter register */
#define GTM_TOM0_CH10_CN0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CN0 *)0xF0108294u)

/** \\brief  8280, TOM channel 0 control register */
#define GTM_TOM0_CH10_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL *)0xF0108280u)

/** \\brief  82A0, TOM channel 0 interrupt enable register */
#define GTM_TOM0_CH10_IRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN *)0xF01082A0u)

/** \\brief  82A4, TOM channel 0 force interrupt register */
#define GTM_TOM0_CH10_IRQ_FORCINT      /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT *)0xF01082A4u)

/** \\brief  82A8, TOM channel 0 interrupt mode register */
#define GTM_TOM0_CH10_IRQ_MODE         /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE *)0xF01082A8u)

/** \\brief  829C, TOM channel 0 interrupt notification register */
#define GTM_TOM0_CH10_IRQ_NOTIFY       /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY *)0xF010829Cu)

/** \\brief  8284, TOM channel 0 CCU0 compare shadow register */
#define GTM_TOM0_CH10_SR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR0 *)0xF0108284u)

/** \\brief  8288, TOM channel 0 CCU1 compare shadow register */
#define GTM_TOM0_CH10_SR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR1 *)0xF0108288u)

/** \\brief  8298, TOM channel 0 status register */
#define GTM_TOM0_CH10_STAT             /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_STAT *)0xF0108298u)

/** \\brief  82CC, TOM channel 0 CCU0 compare register */
#define GTM_TOM0_CH11_CM0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM0 *)0xF01082CCu)

/** \\brief  82D0, TOM channel 0 CCU1 compare register */
#define GTM_TOM0_CH11_CM1              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM1 *)0xF01082D0u)

/** \\brief  82D4, TOM channel 0 CCU0 counter register */
#define GTM_TOM0_CH11_CN0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CN0 *)0xF01082D4u)

/** \\brief  82C0, TOM channel 0 control register */
#define GTM_TOM0_CH11_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL *)0xF01082C0u)

/** \\brief  82E0, TOM channel 0 interrupt enable register */
#define GTM_TOM0_CH11_IRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN *)0xF01082E0u)

/** \\brief  82E4, TOM channel 0 force interrupt register */
#define GTM_TOM0_CH11_IRQ_FORCINT      /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT *)0xF01082E4u)

/** \\brief  82E8, TOM channel 0 interrupt mode register */
#define GTM_TOM0_CH11_IRQ_MODE         /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE *)0xF01082E8u)

/** \\brief  82DC, TOM channel 0 interrupt notification register */
#define GTM_TOM0_CH11_IRQ_NOTIFY       /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY *)0xF01082DCu)

/** \\brief  82C4, TOM channel 0 CCU0 compare shadow register */
#define GTM_TOM0_CH11_SR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR0 *)0xF01082C4u)

/** \\brief  82C8, TOM channel 0 CCU1 compare shadow register */
#define GTM_TOM0_CH11_SR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR1 *)0xF01082C8u)

/** \\brief  82D8, TOM channel 0 status register */
#define GTM_TOM0_CH11_STAT             /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_STAT *)0xF01082D8u)

/** \\brief  830C, TOM channel 0 CCU0 compare register */
#define GTM_TOM0_CH12_CM0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM0 *)0xF010830Cu)

/** \\brief  8310, TOM channel 0 CCU1 compare register */
#define GTM_TOM0_CH12_CM1              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM1 *)0xF0108310u)

/** \\brief  8314, TOM channel 0 CCU0 counter register */
#define GTM_TOM0_CH12_CN0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CN0 *)0xF0108314u)

/** \\brief  8300, TOM channel 0 control register */
#define GTM_TOM0_CH12_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL *)0xF0108300u)

/** \\brief  8320, TOM channel 0 interrupt enable register */
#define GTM_TOM0_CH12_IRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN *)0xF0108320u)

/** \\brief  8324, TOM channel 0 force interrupt register */
#define GTM_TOM0_CH12_IRQ_FORCINT      /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT *)0xF0108324u)

/** \\brief  8328, TOM channel 0 interrupt mode register */
#define GTM_TOM0_CH12_IRQ_MODE         /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE *)0xF0108328u)

/** \\brief  831C, TOM channel 0 interrupt notification register */
#define GTM_TOM0_CH12_IRQ_NOTIFY       /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY *)0xF010831Cu)

/** \\brief  8304, TOM channel 0 CCU0 compare shadow register */
#define GTM_TOM0_CH12_SR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR0 *)0xF0108304u)

/** \\brief  8308, TOM channel 0 CCU1 compare shadow register */
#define GTM_TOM0_CH12_SR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR1 *)0xF0108308u)

/** \\brief  8318, TOM channel 0 status register */
#define GTM_TOM0_CH12_STAT             /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_STAT *)0xF0108318u)

/** \\brief  834C, TOM channel 0 CCU0 compare register */
#define GTM_TOM0_CH13_CM0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM0 *)0xF010834Cu)

/** \\brief  8350, TOM channel 0 CCU1 compare register */
#define GTM_TOM0_CH13_CM1              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM1 *)0xF0108350u)

/** \\brief  8354, TOM channel 0 CCU0 counter register */
#define GTM_TOM0_CH13_CN0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CN0 *)0xF0108354u)

/** \\brief  8340, TOM channel 0 control register */
#define GTM_TOM0_CH13_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL *)0xF0108340u)

/** \\brief  8360, TOM channel 0 interrupt enable register */
#define GTM_TOM0_CH13_IRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN *)0xF0108360u)

/** \\brief  8364, TOM channel 0 force interrupt register */
#define GTM_TOM0_CH13_IRQ_FORCINT      /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT *)0xF0108364u)

/** \\brief  8368, TOM channel 0 interrupt mode register */
#define GTM_TOM0_CH13_IRQ_MODE         /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE *)0xF0108368u)

/** \\brief  835C, TOM channel 0 interrupt notification register */
#define GTM_TOM0_CH13_IRQ_NOTIFY       /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY *)0xF010835Cu)

