Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  8344, TOM channel 0 CCU0 compare shadow register */
#define GTM_TOM0_CH13_SR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR0 *)0xF0108344u)

/** \\brief  8348, TOM channel 0 CCU1 compare shadow register */
#define GTM_TOM0_CH13_SR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR1 *)0xF0108348u)

/** \\brief  8358, TOM channel 0 status register */
#define GTM_TOM0_CH13_STAT             /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_STAT *)0xF0108358u)

/** \\brief  838C, TOM channel 0 CCU0 compare register */
#define GTM_TOM0_CH14_CM0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM0 *)0xF010838Cu)

/** \\brief  8390, TOM channel 0 CCU1 compare register */
#define GTM_TOM0_CH14_CM1              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM1 *)0xF0108390u)

/** \\brief  8394, TOM channel 0 CCU0 counter register */
#define GTM_TOM0_CH14_CN0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CN0 *)0xF0108394u)

/** \\brief  8380, TOM channel 0 control register */
#define GTM_TOM0_CH14_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL *)0xF0108380u)

/** \\brief  83A0, TOM channel 0 interrupt enable register */
#define GTM_TOM0_CH14_IRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN *)0xF01083A0u)

/** \\brief  83A4, TOM channel 0 force interrupt register */
#define GTM_TOM0_CH14_IRQ_FORCINT      /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT *)0xF01083A4u)

/** \\brief  83A8, TOM channel 0 interrupt mode register */
#define GTM_TOM0_CH14_IRQ_MODE         /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE *)0xF01083A8u)

/** \\brief  839C, TOM channel 0 interrupt notification register */
#define GTM_TOM0_CH14_IRQ_NOTIFY       /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY *)0xF010839Cu)

/** \\brief  8384, TOM channel 0 CCU0 compare shadow register */
#define GTM_TOM0_CH14_SR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR0 *)0xF0108384u)

/** \\brief  8388, TOM channel 0 CCU1 compare shadow register */
#define GTM_TOM0_CH14_SR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR1 *)0xF0108388u)

/** \\brief  8398, TOM channel 0 status register */
#define GTM_TOM0_CH14_STAT             /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_STAT *)0xF0108398u)

/** \\brief  83CC, TOM channel 0 CCU0 compare register */
#define GTM_TOM0_CH15_CM0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM0 *)0xF01083CCu)

/** \\brief  83D0, TOM channel 0 CCU1 compare register */
#define GTM_TOM0_CH15_CM1              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM1 *)0xF01083D0u)

/** \\brief  83D4, TOM channel 0 CCU0 counter register */
#define GTM_TOM0_CH15_CN0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CN0 *)0xF01083D4u)

/** \\brief  83C0, TOM channel 0 control register */
#define GTM_TOM0_CH15_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL *)0xF01083C0u)

/** \\brief  83E0, TOM channel 0 interrupt enable register */
#define GTM_TOM0_CH15_IRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN *)0xF01083E0u)

/** \\brief  83E4, TOM channel 0 force interrupt register */
#define GTM_TOM0_CH15_IRQ_FORCINT      /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT *)0xF01083E4u)

/** \\brief  83E8, TOM channel 0 interrupt mode register */
#define GTM_TOM0_CH15_IRQ_MODE         /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE *)0xF01083E8u)

/** \\brief  83DC, TOM channel 0 interrupt notification register */
#define GTM_TOM0_CH15_IRQ_NOTIFY       /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY *)0xF01083DCu)

/** \\brief  83C4, TOM channel 0 CCU0 compare shadow register */
#define GTM_TOM0_CH15_SR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR0 *)0xF01083C4u)

/** \\brief  83C8, TOM channel 0 CCU1 compare shadow register */
#define GTM_TOM0_CH15_SR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR1 *)0xF01083C8u)

/** \\brief  83D8, TOM channel 0 status register */
#define GTM_TOM0_CH15_STAT             /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_STAT *)0xF01083D8u)

/** \\brief  804C, TOM channel 0 CCU0 compare register */
#define GTM_TOM0_CH1_CM0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM0 *)0xF010804Cu)

/** \\brief  8050, TOM channel 0 CCU1 compare register */
#define GTM_TOM0_CH1_CM1               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM1 *)0xF0108050u)

/** \\brief  8054, TOM channel 0 CCU0 counter register */
#define GTM_TOM0_CH1_CN0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CN0 *)0xF0108054u)

/** \\brief  8040, TOM channel 0 control register */
#define GTM_TOM0_CH1_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL *)0xF0108040u)

/** \\brief  8060, TOM channel 0 interrupt enable register */
#define GTM_TOM0_CH1_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN *)0xF0108060u)

/** \\brief  8064, TOM channel 0 force interrupt register */
#define GTM_TOM0_CH1_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT *)0xF0108064u)

/** \\brief  8068, TOM channel 0 interrupt mode register */
#define GTM_TOM0_CH1_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE *)0xF0108068u)

/** \\brief  805C, TOM channel 0 interrupt notification register */
#define GTM_TOM0_CH1_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY *)0xF010805Cu)

/** \\brief  8044, TOM channel 0 CCU0 compare shadow register */
#define GTM_TOM0_CH1_SR0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR0 *)0xF0108044u)

/** \\brief  8048, TOM channel 0 CCU1 compare shadow register */
#define GTM_TOM0_CH1_SR1               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR1 *)0xF0108048u)

/** \\brief  8058, TOM channel 0 status register */
#define GTM_TOM0_CH1_STAT              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_STAT *)0xF0108058u)

/** \\brief  808C, TOM channel 0 CCU0 compare register */
#define GTM_TOM0_CH2_CM0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM0 *)0xF010808Cu)

/** \\brief  8090, TOM channel 0 CCU1 compare register */
#define GTM_TOM0_CH2_CM1               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM1 *)0xF0108090u)

/** \\brief  8094, TOM channel 0 CCU0 counter register */
#define GTM_TOM0_CH2_CN0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CN0 *)0xF0108094u)

