Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  8080, TOM channel 0 control register */
#define GTM_TOM0_CH2_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL *)0xF0108080u)

/** \\brief  80A0, TOM channel 0 interrupt enable register */
#define GTM_TOM0_CH2_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN *)0xF01080A0u)

/** \\brief  80A4, TOM channel 0 force interrupt register */
#define GTM_TOM0_CH2_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT *)0xF01080A4u)

/** \\brief  80A8, TOM channel 0 interrupt mode register */
#define GTM_TOM0_CH2_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE *)0xF01080A8u)

/** \\brief  809C, TOM channel 0 interrupt notification register */
#define GTM_TOM0_CH2_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY *)0xF010809Cu)

/** \\brief  8084, TOM channel 0 CCU0 compare shadow register */
#define GTM_TOM0_CH2_SR0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR0 *)0xF0108084u)

/** \\brief  8088, TOM channel 0 CCU1 compare shadow register */
#define GTM_TOM0_CH2_SR1               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR1 *)0xF0108088u)

/** \\brief  8098, TOM channel 0 status register */
#define GTM_TOM0_CH2_STAT              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_STAT *)0xF0108098u)

/** \\brief  80CC, TOM channel 0 CCU0 compare register */
#define GTM_TOM0_CH3_CM0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM0 *)0xF01080CCu)

/** \\brief  80D0, TOM channel 0 CCU1 compare register */
#define GTM_TOM0_CH3_CM1               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM1 *)0xF01080D0u)

/** \\brief  80D4, TOM channel 0 CCU0 counter register */
#define GTM_TOM0_CH3_CN0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CN0 *)0xF01080D4u)

/** \\brief  80C0, TOM channel 0 control register */
#define GTM_TOM0_CH3_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL *)0xF01080C0u)

/** \\brief  80E0, TOM channel 0 interrupt enable register */
#define GTM_TOM0_CH3_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN *)0xF01080E0u)

/** \\brief  80E4, TOM channel 0 force interrupt register */
#define GTM_TOM0_CH3_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT *)0xF01080E4u)

/** \\brief  80E8, TOM channel 0 interrupt mode register */
#define GTM_TOM0_CH3_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE *)0xF01080E8u)

/** \\brief  80DC, TOM channel 0 interrupt notification register */
#define GTM_TOM0_CH3_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY *)0xF01080DCu)

/** \\brief  80C4, TOM channel 0 CCU0 compare shadow register */
#define GTM_TOM0_CH3_SR0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR0 *)0xF01080C4u)

/** \\brief  80C8, TOM channel 0 CCU1 compare shadow register */
#define GTM_TOM0_CH3_SR1               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR1 *)0xF01080C8u)

/** \\brief  80D8, TOM channel 0 status register */
#define GTM_TOM0_CH3_STAT              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_STAT *)0xF01080D8u)

/** \\brief  810C, TOM channel 0 CCU0 compare register */
#define GTM_TOM0_CH4_CM0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM0 *)0xF010810Cu)

/** \\brief  8110, TOM channel 0 CCU1 compare register */
#define GTM_TOM0_CH4_CM1               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM1 *)0xF0108110u)

/** \\brief  8114, TOM channel 0 CCU0 counter register */
#define GTM_TOM0_CH4_CN0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CN0 *)0xF0108114u)

/** \\brief  8100, TOM channel 0 control register */
#define GTM_TOM0_CH4_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL *)0xF0108100u)

/** \\brief  8120, TOM channel 0 interrupt enable register */
#define GTM_TOM0_CH4_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN *)0xF0108120u)

/** \\brief  8124, TOM channel 0 force interrupt register */
#define GTM_TOM0_CH4_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT *)0xF0108124u)

/** \\brief  8128, TOM channel 0 interrupt mode register */
#define GTM_TOM0_CH4_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE *)0xF0108128u)

/** \\brief  811C, TOM channel 0 interrupt notification register */
#define GTM_TOM0_CH4_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY *)0xF010811Cu)

/** \\brief  8104, TOM channel 0 CCU0 compare shadow register */
#define GTM_TOM0_CH4_SR0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR0 *)0xF0108104u)

/** \\brief  8108, TOM channel 0 CCU1 compare shadow register */
#define GTM_TOM0_CH4_SR1               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR1 *)0xF0108108u)

/** \\brief  8118, TOM channel 0 status register */
#define GTM_TOM0_CH4_STAT              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_STAT *)0xF0108118u)

/** \\brief  814C, TOM channel 0 CCU0 compare register */
#define GTM_TOM0_CH5_CM0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM0 *)0xF010814Cu)

/** \\brief  8150, TOM channel 0 CCU1 compare register */
#define GTM_TOM0_CH5_CM1               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM1 *)0xF0108150u)

/** \\brief  8154, TOM channel 0 CCU0 counter register */
#define GTM_TOM0_CH5_CN0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CN0 *)0xF0108154u)

/** \\brief  8140, TOM channel 0 control register */
#define GTM_TOM0_CH5_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL *)0xF0108140u)

/** \\brief  8160, TOM channel 0 interrupt enable register */
#define GTM_TOM0_CH5_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN *)0xF0108160u)

/** \\brief  8164, TOM channel 0 force interrupt register */
#define GTM_TOM0_CH5_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT *)0xF0108164u)

/** \\brief  8168, TOM channel 0 interrupt mode register */
#define GTM_TOM0_CH5_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE *)0xF0108168u)

/** \\brief  815C, TOM channel 0 interrupt notification register */
#define GTM_TOM0_CH5_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY *)0xF010815Cu)

/** \\brief  8144, TOM channel 0 CCU0 compare shadow register */
#define GTM_TOM0_CH5_SR0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR0 *)0xF0108144u)

/** \\brief  8148, TOM channel 0 CCU1 compare shadow register */
#define GTM_TOM0_CH5_SR1               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR1 *)0xF0108148u)

/** \\brief  8158, TOM channel 0 status register */
#define GTM_TOM0_CH5_STAT              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_STAT *)0xF0108158u)

/** \\brief  818C, TOM channel 0 CCU0 compare register */
#define GTM_TOM0_CH6_CM0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM0 *)0xF010818Cu)

/** \\brief  8190, TOM channel 0 CCU1 compare register */
#define GTM_TOM0_CH6_CM1               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM1 *)0xF0108190u)

/** \\brief  8194, TOM channel 0 CCU0 counter register */
#define GTM_TOM0_CH6_CN0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CN0 *)0xF0108194u)

/** \\brief  8180, TOM channel 0 control register */
#define GTM_TOM0_CH6_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL *)0xF0108180u)

/** \\brief  81A0, TOM channel 0 interrupt enable register */
#define GTM_TOM0_CH6_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN *)0xF01081A0u)

/** \\brief  81A4, TOM channel 0 force interrupt register */
#define GTM_TOM0_CH6_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT *)0xF01081A4u)

/** \\brief  81A8, TOM channel 0 interrupt mode register */
#define GTM_TOM0_CH6_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE *)0xF01081A8u)

