Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  819C, TOM channel 0 interrupt notification register */
#define GTM_TOM0_CH6_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY *)0xF010819Cu)

/** \\brief  8184, TOM channel 0 CCU0 compare shadow register */
#define GTM_TOM0_CH6_SR0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR0 *)0xF0108184u)

/** \\brief  8188, TOM channel 0 CCU1 compare shadow register */
#define GTM_TOM0_CH6_SR1               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR1 *)0xF0108188u)

/** \\brief  8198, TOM channel 0 status register */
#define GTM_TOM0_CH6_STAT              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_STAT *)0xF0108198u)

/** \\brief  81CC, TOM channel 0 CCU0 compare register */
#define GTM_TOM0_CH7_CM0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM0 *)0xF01081CCu)

/** \\brief  81D0, TOM channel 0 CCU1 compare register */
#define GTM_TOM0_CH7_CM1               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM1 *)0xF01081D0u)

/** \\brief  81D4, TOM channel 0 CCU0 counter register */
#define GTM_TOM0_CH7_CN0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CN0 *)0xF01081D4u)

/** \\brief  81C0, TOM channel 0 control register */
#define GTM_TOM0_CH7_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL *)0xF01081C0u)

/** \\brief  81E0, TOM channel 0 interrupt enable register */
#define GTM_TOM0_CH7_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN *)0xF01081E0u)

/** \\brief  81E4, TOM channel 0 force interrupt register */
#define GTM_TOM0_CH7_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT *)0xF01081E4u)

/** \\brief  81E8, TOM channel 0 interrupt mode register */
#define GTM_TOM0_CH7_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE *)0xF01081E8u)

/** \\brief  81DC, TOM channel 0 interrupt notification register */
#define GTM_TOM0_CH7_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY *)0xF01081DCu)

/** \\brief  81C4, TOM channel 0 CCU0 compare shadow register */
#define GTM_TOM0_CH7_SR0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR0 *)0xF01081C4u)

/** \\brief  81C8, TOM channel 0 CCU1 compare shadow register */
#define GTM_TOM0_CH7_SR1               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR1 *)0xF01081C8u)

/** \\brief  81D8, TOM channel 0 status register */
#define GTM_TOM0_CH7_STAT              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_STAT *)0xF01081D8u)

/** \\brief  820C, TOM channel 0 CCU0 compare register */
#define GTM_TOM0_CH8_CM0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM0 *)0xF010820Cu)

/** \\brief  8210, TOM channel 0 CCU1 compare register */
#define GTM_TOM0_CH8_CM1               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM1 *)0xF0108210u)

/** \\brief  8214, TOM channel 0 CCU0 counter register */
#define GTM_TOM0_CH8_CN0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CN0 *)0xF0108214u)

/** \\brief  8200, TOM channel 0 control register */
#define GTM_TOM0_CH8_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL *)0xF0108200u)

/** \\brief  8220, TOM channel 0 interrupt enable register */
#define GTM_TOM0_CH8_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN *)0xF0108220u)

/** \\brief  8224, TOM channel 0 force interrupt register */
#define GTM_TOM0_CH8_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT *)0xF0108224u)

/** \\brief  8228, TOM channel 0 interrupt mode register */
#define GTM_TOM0_CH8_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE *)0xF0108228u)

/** \\brief  821C, TOM channel 0 interrupt notification register */
#define GTM_TOM0_CH8_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY *)0xF010821Cu)

/** \\brief  8204, TOM channel 0 CCU0 compare shadow register */
#define GTM_TOM0_CH8_SR0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR0 *)0xF0108204u)

/** \\brief  8208, TOM channel 0 CCU1 compare shadow register */
#define GTM_TOM0_CH8_SR1               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR1 *)0xF0108208u)

/** \\brief  8218, TOM channel 0 status register */
#define GTM_TOM0_CH8_STAT              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_STAT *)0xF0108218u)

/** \\brief  824C, TOM channel 0 CCU0 compare register */
#define GTM_TOM0_CH9_CM0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM0 *)0xF010824Cu)

/** \\brief  8250, TOM channel 0 CCU1 compare register */
#define GTM_TOM0_CH9_CM1               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM1 *)0xF0108250u)

/** \\brief  8254, TOM channel 0 CCU0 counter register */
#define GTM_TOM0_CH9_CN0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CN0 *)0xF0108254u)

/** \\brief  8240, TOM channel 0 control register */
#define GTM_TOM0_CH9_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL *)0xF0108240u)

/** \\brief  8260, TOM channel 0 interrupt enable register */
#define GTM_TOM0_CH9_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN *)0xF0108260u)

/** \\brief  8264, TOM channel 0 force interrupt register */
#define GTM_TOM0_CH9_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT *)0xF0108264u)

/** \\brief  8268, TOM channel 0 interrupt mode register */
#define GTM_TOM0_CH9_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE *)0xF0108268u)

/** \\brief  825C, TOM channel 0 interrupt notification register */
#define GTM_TOM0_CH9_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY *)0xF010825Cu)

/** \\brief  8244, TOM channel 0 CCU0 compare shadow register */
#define GTM_TOM0_CH9_SR0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR0 *)0xF0108244u)

/** \\brief  8248, TOM channel 0 CCU1 compare shadow register */
#define GTM_TOM0_CH9_SR1               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR1 *)0xF0108248u)

/** \\brief  8258, TOM channel 0 status register */
#define GTM_TOM0_CH9_STAT              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_STAT *)0xF0108258u)

