Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  8034, TOM TGC 0 action time base register */
#define GTM_TOM0_TGC0_ACT_TB           /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_TGC0_ACT_TB *)0xF0108034u)

/** \\brief  8070, TOM TGC 0 enable/disable control register */
#define GTM_TOM0_TGC0_ENDIS_CTRL       /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_TGC0_ENDIS_CTRL *)0xF0108070u)

/** \\brief  8074, TOM TGC 0 enable/disable status register */
#define GTM_TOM0_TGC0_ENDIS_STAT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_TGC0_ENDIS_STAT *)0xF0108074u)

/** \\brief  8038, TOM TGC 0 force update control register */
#define GTM_TOM0_TGC0_FUPD_CTRL        /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_TGC0_FUPD_CTRL *)0xF0108038u)

/** \\brief  8030, TOM TGC 0 global control register */
#define GTM_TOM0_TGC0_GLB_CTRL         /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_TGC0_GLB_CTRL *)0xF0108030u)

/** \\brief  803C, TOM TGC 0 internal trigger control register */
#define GTM_TOM0_TGC0_INT_TRIG         /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_TGC0_INT_TRIG *)0xF010803Cu)

/** \\brief  8078, TOM TGC 0 output enable control register */
#define GTM_TOM0_TGC0_OUTEN_CTRL       /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_TGC0_OUTEN_CTRL *)0xF0108078u)

/** \\brief  807C, TOM TGC 0 output enable status register */
#define GTM_TOM0_TGC0_OUTEN_STAT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_TGC0_OUTEN_STAT *)0xF010807Cu)

/** \\brief  8234, TOM TGC 1 action time base register */
#define GTM_TOM0_TGC1_ACT_TB           /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_TGC1_ACT_TB *)0xF0108234u)

/** \\brief  8270, TOM TGC 1 enable/disable control register */
#define GTM_TOM0_TGC1_ENDIS_CTRL       /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_TGC1_ENDIS_CTRL *)0xF0108270u)

/** \\brief  8274, TOM TGC 1 enable/disable status register */
#define GTM_TOM0_TGC1_ENDIS_STAT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_TGC1_ENDIS_STAT *)0xF0108274u)

/** \\brief  8238, TOM TGC 1 force update control register */
#define GTM_TOM0_TGC1_FUPD_CTRL        /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_TGC1_FUPD_CTRL *)0xF0108238u)

/** \\brief  8230, TOM TGC 1 global control register */
#define GTM_TOM0_TGC1_GLB_CTRL         /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_TGC1_GLB_CTRL *)0xF0108230u)

/** \\brief  823C, TOM TGC 1 internal trigger control register */
#define GTM_TOM0_TGC1_INT_TRIG         /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_TGC1_INT_TRIG *)0xF010823Cu)

/** \\brief  8278, TOM TGC 1 output enable control register */
#define GTM_TOM0_TGC1_OUTEN_CTRL       /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_TGC1_OUTEN_CTRL *)0xF0108278u)

/** \\brief  827C, TOM TGC 1 output enable status register */
#define GTM_TOM0_TGC1_OUTEN_STAT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_TGC1_OUTEN_STAT *)0xF010827Cu)

/** \\brief  880C, TOM channel 0 CCU0 compare register */
#define GTM_TOM1_CH0_CM0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM0 *)0xF010880Cu)

/** \\brief  8810, TOM channel 0 CCU1 compare register */
#define GTM_TOM1_CH0_CM1               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM1 *)0xF0108810u)

/** \\brief  8814, TOM channel 0 CCU0 counter register */
#define GTM_TOM1_CH0_CN0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CN0 *)0xF0108814u)

/** \\brief  8800, TOM channel 0 control register */
#define GTM_TOM1_CH0_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL *)0xF0108800u)

/** \\brief  8820, TOM channel 0 interrupt enable register */
#define GTM_TOM1_CH0_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN *)0xF0108820u)

/** \\brief  8824, TOM channel 0 force interrupt register */
#define GTM_TOM1_CH0_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT *)0xF0108824u)

/** \\brief  8828, TOM channel 0 interrupt mode register */
#define GTM_TOM1_CH0_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE *)0xF0108828u)

/** \\brief  881C, TOM channel 0 interrupt notification register */
#define GTM_TOM1_CH0_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY *)0xF010881Cu)

/** \\brief  8804, TOM channel 0 CCU0 compare shadow register */
#define GTM_TOM1_CH0_SR0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR0 *)0xF0108804u)

/** \\brief  8808, TOM channel 0 CCU1 compare shadow register */
#define GTM_TOM1_CH0_SR1               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR1 *)0xF0108808u)

/** \\brief  8818, TOM channel 0 status register */
#define GTM_TOM1_CH0_STAT              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_STAT *)0xF0108818u)

/** \\brief  8A8C, TOM channel 0 CCU0 compare register */
#define GTM_TOM1_CH10_CM0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM0 *)0xF0108A8Cu)

/** \\brief  8A90, TOM channel 0 CCU1 compare register */
#define GTM_TOM1_CH10_CM1              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM1 *)0xF0108A90u)

/** \\brief  8A94, TOM channel 0 CCU0 counter register */
#define GTM_TOM1_CH10_CN0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CN0 *)0xF0108A94u)

/** \\brief  8A80, TOM channel 0 control register */
#define GTM_TOM1_CH10_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL *)0xF0108A80u)

/** \\brief  8AA0, TOM channel 0 interrupt enable register */
#define GTM_TOM1_CH10_IRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN *)0xF0108AA0u)

/** \\brief  8AA4, TOM channel 0 force interrupt register */
#define GTM_TOM1_CH10_IRQ_FORCINT      /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT *)0xF0108AA4u)

/** \\brief  8AA8, TOM channel 0 interrupt mode register */
#define GTM_TOM1_CH10_IRQ_MODE         /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE *)0xF0108AA8u)

/** \\brief  8A9C, TOM channel 0 interrupt notification register */
#define GTM_TOM1_CH10_IRQ_NOTIFY       /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY *)0xF0108A9Cu)

/** \\brief  8A84, TOM channel 0 CCU0 compare shadow register */
#define GTM_TOM1_CH10_SR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR0 *)0xF0108A84u)

/** \\brief  8A88, TOM channel 0 CCU1 compare shadow register */
#define GTM_TOM1_CH10_SR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR1 *)0xF0108A88u)

/** \\brief  8A98, TOM channel 0 status register */
#define GTM_TOM1_CH10_STAT             /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_STAT *)0xF0108A98u)

