Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  8ACC, TOM channel 0 CCU0 compare register */
#define GTM_TOM1_CH11_CM0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM0 *)0xF0108ACCu)

/** \\brief  8AD0, TOM channel 0 CCU1 compare register */
#define GTM_TOM1_CH11_CM1              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM1 *)0xF0108AD0u)

/** \\brief  8AD4, TOM channel 0 CCU0 counter register */
#define GTM_TOM1_CH11_CN0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CN0 *)0xF0108AD4u)

/** \\brief  8AC0, TOM channel 0 control register */
#define GTM_TOM1_CH11_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL *)0xF0108AC0u)

/** \\brief  8AE0, TOM channel 0 interrupt enable register */
#define GTM_TOM1_CH11_IRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN *)0xF0108AE0u)

/** \\brief  8AE4, TOM channel 0 force interrupt register */
#define GTM_TOM1_CH11_IRQ_FORCINT      /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT *)0xF0108AE4u)

/** \\brief  8AE8, TOM channel 0 interrupt mode register */
#define GTM_TOM1_CH11_IRQ_MODE         /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE *)0xF0108AE8u)

/** \\brief  8ADC, TOM channel 0 interrupt notification register */
#define GTM_TOM1_CH11_IRQ_NOTIFY       /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY *)0xF0108ADCu)

/** \\brief  8AC4, TOM channel 0 CCU0 compare shadow register */
#define GTM_TOM1_CH11_SR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR0 *)0xF0108AC4u)

/** \\brief  8AC8, TOM channel 0 CCU1 compare shadow register */
#define GTM_TOM1_CH11_SR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR1 *)0xF0108AC8u)

/** \\brief  8AD8, TOM channel 0 status register */
#define GTM_TOM1_CH11_STAT             /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_STAT *)0xF0108AD8u)

/** \\brief  8B0C, TOM channel 0 CCU0 compare register */
#define GTM_TOM1_CH12_CM0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM0 *)0xF0108B0Cu)

/** \\brief  8B10, TOM channel 0 CCU1 compare register */
#define GTM_TOM1_CH12_CM1              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM1 *)0xF0108B10u)

/** \\brief  8B14, TOM channel 0 CCU0 counter register */
#define GTM_TOM1_CH12_CN0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CN0 *)0xF0108B14u)

/** \\brief  8B00, TOM channel 0 control register */
#define GTM_TOM1_CH12_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL *)0xF0108B00u)

/** \\brief  8B20, TOM channel 0 interrupt enable register */
#define GTM_TOM1_CH12_IRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN *)0xF0108B20u)

/** \\brief  8B24, TOM channel 0 force interrupt register */
#define GTM_TOM1_CH12_IRQ_FORCINT      /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT *)0xF0108B24u)

/** \\brief  8B28, TOM channel 0 interrupt mode register */
#define GTM_TOM1_CH12_IRQ_MODE         /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE *)0xF0108B28u)

/** \\brief  8B1C, TOM channel 0 interrupt notification register */
#define GTM_TOM1_CH12_IRQ_NOTIFY       /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY *)0xF0108B1Cu)

/** \\brief  8B04, TOM channel 0 CCU0 compare shadow register */
#define GTM_TOM1_CH12_SR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR0 *)0xF0108B04u)

/** \\brief  8B08, TOM channel 0 CCU1 compare shadow register */
#define GTM_TOM1_CH12_SR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR1 *)0xF0108B08u)

/** \\brief  8B18, TOM channel 0 status register */
#define GTM_TOM1_CH12_STAT             /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_STAT *)0xF0108B18u)

/** \\brief  8B4C, TOM channel 0 CCU0 compare register */
#define GTM_TOM1_CH13_CM0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM0 *)0xF0108B4Cu)

/** \\brief  8B50, TOM channel 0 CCU1 compare register */
#define GTM_TOM1_CH13_CM1              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM1 *)0xF0108B50u)

/** \\brief  8B54, TOM channel 0 CCU0 counter register */
#define GTM_TOM1_CH13_CN0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CN0 *)0xF0108B54u)

/** \\brief  8B40, TOM channel 0 control register */
#define GTM_TOM1_CH13_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL *)0xF0108B40u)

/** \\brief  8B60, TOM channel 0 interrupt enable register */
#define GTM_TOM1_CH13_IRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN *)0xF0108B60u)

/** \\brief  8B64, TOM channel 0 force interrupt register */
#define GTM_TOM1_CH13_IRQ_FORCINT      /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT *)0xF0108B64u)

/** \\brief  8B68, TOM channel 0 interrupt mode register */
#define GTM_TOM1_CH13_IRQ_MODE         /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE *)0xF0108B68u)

/** \\brief  8B5C, TOM channel 0 interrupt notification register */
#define GTM_TOM1_CH13_IRQ_NOTIFY       /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY *)0xF0108B5Cu)

/** \\brief  8B44, TOM channel 0 CCU0 compare shadow register */
#define GTM_TOM1_CH13_SR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR0 *)0xF0108B44u)

/** \\brief  8B48, TOM channel 0 CCU1 compare shadow register */
#define GTM_TOM1_CH13_SR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR1 *)0xF0108B48u)

/** \\brief  8B58, TOM channel 0 status register */
#define GTM_TOM1_CH13_STAT             /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_STAT *)0xF0108B58u)

/** \\brief  8B8C, TOM channel 0 CCU0 compare register */
#define GTM_TOM1_CH14_CM0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM0 *)0xF0108B8Cu)

/** \\brief  8B90, TOM channel 0 CCU1 compare register */
#define GTM_TOM1_CH14_CM1              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM1 *)0xF0108B90u)

/** \\brief  8B94, TOM channel 0 CCU0 counter register */
#define GTM_TOM1_CH14_CN0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CN0 *)0xF0108B94u)

/** \\brief  8B80, TOM channel 0 control register */
#define GTM_TOM1_CH14_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL *)0xF0108B80u)

/** \\brief  8BA0, TOM channel 0 interrupt enable register */
#define GTM_TOM1_CH14_IRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN *)0xF0108BA0u)

