Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  8BA4, TOM channel 0 force interrupt register */
#define GTM_TOM1_CH14_IRQ_FORCINT      /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT *)0xF0108BA4u)

/** \\brief  8BA8, TOM channel 0 interrupt mode register */
#define GTM_TOM1_CH14_IRQ_MODE         /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE *)0xF0108BA8u)

/** \\brief  8B9C, TOM channel 0 interrupt notification register */
#define GTM_TOM1_CH14_IRQ_NOTIFY       /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY *)0xF0108B9Cu)

/** \\brief  8B84, TOM channel 0 CCU0 compare shadow register */
#define GTM_TOM1_CH14_SR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR0 *)0xF0108B84u)

/** \\brief  8B88, TOM channel 0 CCU1 compare shadow register */
#define GTM_TOM1_CH14_SR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR1 *)0xF0108B88u)

/** \\brief  8B98, TOM channel 0 status register */
#define GTM_TOM1_CH14_STAT             /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_STAT *)0xF0108B98u)

/** \\brief  8BCC, TOM channel 0 CCU0 compare register */
#define GTM_TOM1_CH15_CM0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM0 *)0xF0108BCCu)

/** \\brief  8BD0, TOM channel 0 CCU1 compare register */
#define GTM_TOM1_CH15_CM1              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM1 *)0xF0108BD0u)

/** \\brief  8BD4, TOM channel 0 CCU0 counter register */
#define GTM_TOM1_CH15_CN0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CN0 *)0xF0108BD4u)

/** \\brief  8BC0, TOM channel 0 control register */
#define GTM_TOM1_CH15_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL *)0xF0108BC0u)

/** \\brief  8BE0, TOM channel 0 interrupt enable register */
#define GTM_TOM1_CH15_IRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN *)0xF0108BE0u)

/** \\brief  8BE4, TOM channel 0 force interrupt register */
#define GTM_TOM1_CH15_IRQ_FORCINT      /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT *)0xF0108BE4u)

/** \\brief  8BE8, TOM channel 0 interrupt mode register */
#define GTM_TOM1_CH15_IRQ_MODE         /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE *)0xF0108BE8u)

/** \\brief  8BDC, TOM channel 0 interrupt notification register */
#define GTM_TOM1_CH15_IRQ_NOTIFY       /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY *)0xF0108BDCu)

/** \\brief  8BC4, TOM channel 0 CCU0 compare shadow register */
#define GTM_TOM1_CH15_SR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR0 *)0xF0108BC4u)

/** \\brief  8BC8, TOM channel 0 CCU1 compare shadow register */
#define GTM_TOM1_CH15_SR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR1 *)0xF0108BC8u)

/** \\brief  8BD8, TOM channel 0 status register */
#define GTM_TOM1_CH15_STAT             /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_STAT *)0xF0108BD8u)

/** \\brief  884C, TOM channel 0 CCU0 compare register */
#define GTM_TOM1_CH1_CM0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM0 *)0xF010884Cu)

/** \\brief  8850, TOM channel 0 CCU1 compare register */
#define GTM_TOM1_CH1_CM1               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM1 *)0xF0108850u)

/** \\brief  8854, TOM channel 0 CCU0 counter register */
#define GTM_TOM1_CH1_CN0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CN0 *)0xF0108854u)

/** \\brief  8840, TOM channel 0 control register */
#define GTM_TOM1_CH1_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL *)0xF0108840u)

/** \\brief  8860, TOM channel 0 interrupt enable register */
#define GTM_TOM1_CH1_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN *)0xF0108860u)

/** \\brief  8864, TOM channel 0 force interrupt register */
#define GTM_TOM1_CH1_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT *)0xF0108864u)

/** \\brief  8868, TOM channel 0 interrupt mode register */
#define GTM_TOM1_CH1_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE *)0xF0108868u)

/** \\brief  885C, TOM channel 0 interrupt notification register */
#define GTM_TOM1_CH1_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY *)0xF010885Cu)

/** \\brief  8844, TOM channel 0 CCU0 compare shadow register */
#define GTM_TOM1_CH1_SR0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR0 *)0xF0108844u)

/** \\brief  8848, TOM channel 0 CCU1 compare shadow register */
#define GTM_TOM1_CH1_SR1               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR1 *)0xF0108848u)

/** \\brief  8858, TOM channel 0 status register */
#define GTM_TOM1_CH1_STAT              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_STAT *)0xF0108858u)

/** \\brief  888C, TOM channel 0 CCU0 compare register */
#define GTM_TOM1_CH2_CM0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM0 *)0xF010888Cu)

/** \\brief  8890, TOM channel 0 CCU1 compare register */
#define GTM_TOM1_CH2_CM1               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM1 *)0xF0108890u)

/** \\brief  8894, TOM channel 0 CCU0 counter register */
#define GTM_TOM1_CH2_CN0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CN0 *)0xF0108894u)

/** \\brief  8880, TOM channel 0 control register */
#define GTM_TOM1_CH2_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL *)0xF0108880u)

/** \\brief  88A0, TOM channel 0 interrupt enable register */
#define GTM_TOM1_CH2_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN *)0xF01088A0u)

/** \\brief  88A4, TOM channel 0 force interrupt register */
#define GTM_TOM1_CH2_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT *)0xF01088A4u)

/** \\brief  88A8, TOM channel 0 interrupt mode register */
#define GTM_TOM1_CH2_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE *)0xF01088A8u)

/** \\brief  889C, TOM channel 0 interrupt notification register */
#define GTM_TOM1_CH2_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY *)0xF010889Cu)

/** \\brief  8884, TOM channel 0 CCU0 compare shadow register */
#define GTM_TOM1_CH2_SR0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR0 *)0xF0108884u)

/** \\brief  8888, TOM channel 0 CCU1 compare shadow register */
#define GTM_TOM1_CH2_SR1               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR1 *)0xF0108888u)

/** \\brief  8898, TOM channel 0 status register */
#define GTM_TOM1_CH2_STAT              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_STAT *)0xF0108898u)

