Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  88CC, TOM channel 0 CCU0 compare register */
#define GTM_TOM1_CH3_CM0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM0 *)0xF01088CCu)

/** \\brief  88D0, TOM channel 0 CCU1 compare register */
#define GTM_TOM1_CH3_CM1               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM1 *)0xF01088D0u)

/** \\brief  88D4, TOM channel 0 CCU0 counter register */
#define GTM_TOM1_CH3_CN0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CN0 *)0xF01088D4u)

/** \\brief  88C0, TOM channel 0 control register */
#define GTM_TOM1_CH3_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL *)0xF01088C0u)

/** \\brief  88E0, TOM channel 0 interrupt enable register */
#define GTM_TOM1_CH3_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN *)0xF01088E0u)

/** \\brief  88E4, TOM channel 0 force interrupt register */
#define GTM_TOM1_CH3_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT *)0xF01088E4u)

/** \\brief  88E8, TOM channel 0 interrupt mode register */
#define GTM_TOM1_CH3_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE *)0xF01088E8u)

/** \\brief  88DC, TOM channel 0 interrupt notification register */
#define GTM_TOM1_CH3_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY *)0xF01088DCu)

/** \\brief  88C4, TOM channel 0 CCU0 compare shadow register */
#define GTM_TOM1_CH3_SR0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR0 *)0xF01088C4u)

/** \\brief  88C8, TOM channel 0 CCU1 compare shadow register */
#define GTM_TOM1_CH3_SR1               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR1 *)0xF01088C8u)

/** \\brief  88D8, TOM channel 0 status register */
#define GTM_TOM1_CH3_STAT              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_STAT *)0xF01088D8u)

/** \\brief  890C, TOM channel 0 CCU0 compare register */
#define GTM_TOM1_CH4_CM0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM0 *)0xF010890Cu)

/** \\brief  8910, TOM channel 0 CCU1 compare register */
#define GTM_TOM1_CH4_CM1               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM1 *)0xF0108910u)

/** \\brief  8914, TOM channel 0 CCU0 counter register */
#define GTM_TOM1_CH4_CN0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CN0 *)0xF0108914u)

/** \\brief  8900, TOM channel 0 control register */
#define GTM_TOM1_CH4_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL *)0xF0108900u)

/** \\brief  8920, TOM channel 0 interrupt enable register */
#define GTM_TOM1_CH4_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN *)0xF0108920u)

/** \\brief  8924, TOM channel 0 force interrupt register */
#define GTM_TOM1_CH4_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT *)0xF0108924u)

/** \\brief  8928, TOM channel 0 interrupt mode register */
#define GTM_TOM1_CH4_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE *)0xF0108928u)

/** \\brief  891C, TOM channel 0 interrupt notification register */
#define GTM_TOM1_CH4_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY *)0xF010891Cu)

/** \\brief  8904, TOM channel 0 CCU0 compare shadow register */
#define GTM_TOM1_CH4_SR0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR0 *)0xF0108904u)

/** \\brief  8908, TOM channel 0 CCU1 compare shadow register */
#define GTM_TOM1_CH4_SR1               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR1 *)0xF0108908u)

/** \\brief  8918, TOM channel 0 status register */
#define GTM_TOM1_CH4_STAT              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_STAT *)0xF0108918u)

/** \\brief  894C, TOM channel 0 CCU0 compare register */
#define GTM_TOM1_CH5_CM0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM0 *)0xF010894Cu)

/** \\brief  8950, TOM channel 0 CCU1 compare register */
#define GTM_TOM1_CH5_CM1               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM1 *)0xF0108950u)

/** \\brief  8954, TOM channel 0 CCU0 counter register */
#define GTM_TOM1_CH5_CN0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CN0 *)0xF0108954u)

/** \\brief  8940, TOM channel 0 control register */
#define GTM_TOM1_CH5_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL *)0xF0108940u)

/** \\brief  8960, TOM channel 0 interrupt enable register */
#define GTM_TOM1_CH5_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN *)0xF0108960u)

/** \\brief  8964, TOM channel 0 force interrupt register */
#define GTM_TOM1_CH5_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT *)0xF0108964u)

/** \\brief  8968, TOM channel 0 interrupt mode register */
#define GTM_TOM1_CH5_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE *)0xF0108968u)

/** \\brief  895C, TOM channel 0 interrupt notification register */
#define GTM_TOM1_CH5_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY *)0xF010895Cu)

/** \\brief  8944, TOM channel 0 CCU0 compare shadow register */
#define GTM_TOM1_CH5_SR0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR0 *)0xF0108944u)

/** \\brief  8948, TOM channel 0 CCU1 compare shadow register */
#define GTM_TOM1_CH5_SR1               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR1 *)0xF0108948u)

/** \\brief  8958, TOM channel 0 status register */
#define GTM_TOM1_CH5_STAT              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_STAT *)0xF0108958u)

/** \\brief  898C, TOM channel 0 CCU0 compare register */
#define GTM_TOM1_CH6_CM0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM0 *)0xF010898Cu)

/** \\brief  8990, TOM channel 0 CCU1 compare register */
#define GTM_TOM1_CH6_CM1               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM1 *)0xF0108990u)

/** \\brief  8994, TOM channel 0 CCU0 counter register */
#define GTM_TOM1_CH6_CN0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CN0 *)0xF0108994u)

/** \\brief  8980, TOM channel 0 control register */
#define GTM_TOM1_CH6_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL *)0xF0108980u)

