Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  89A0, TOM channel 0 interrupt enable register */
#define GTM_TOM1_CH6_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN *)0xF01089A0u)

/** \\brief  89A4, TOM channel 0 force interrupt register */
#define GTM_TOM1_CH6_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT *)0xF01089A4u)

/** \\brief  89A8, TOM channel 0 interrupt mode register */
#define GTM_TOM1_CH6_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE *)0xF01089A8u)

/** \\brief  899C, TOM channel 0 interrupt notification register */
#define GTM_TOM1_CH6_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY *)0xF010899Cu)

/** \\brief  8984, TOM channel 0 CCU0 compare shadow register */
#define GTM_TOM1_CH6_SR0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR0 *)0xF0108984u)

/** \\brief  8988, TOM channel 0 CCU1 compare shadow register */
#define GTM_TOM1_CH6_SR1               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR1 *)0xF0108988u)

/** \\brief  8998, TOM channel 0 status register */
#define GTM_TOM1_CH6_STAT              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_STAT *)0xF0108998u)

/** \\brief  89CC, TOM channel 0 CCU0 compare register */
#define GTM_TOM1_CH7_CM0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM0 *)0xF01089CCu)

/** \\brief  89D0, TOM channel 0 CCU1 compare register */
#define GTM_TOM1_CH7_CM1               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM1 *)0xF01089D0u)

/** \\brief  89D4, TOM channel 0 CCU0 counter register */
#define GTM_TOM1_CH7_CN0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CN0 *)0xF01089D4u)

/** \\brief  89C0, TOM channel 0 control register */
#define GTM_TOM1_CH7_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL *)0xF01089C0u)

/** \\brief  89E0, TOM channel 0 interrupt enable register */
#define GTM_TOM1_CH7_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN *)0xF01089E0u)

/** \\brief  89E4, TOM channel 0 force interrupt register */
#define GTM_TOM1_CH7_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT *)0xF01089E4u)

/** \\brief  89E8, TOM channel 0 interrupt mode register */
#define GTM_TOM1_CH7_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE *)0xF01089E8u)

/** \\brief  89DC, TOM channel 0 interrupt notification register */
#define GTM_TOM1_CH7_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY *)0xF01089DCu)

/** \\brief  89C4, TOM channel 0 CCU0 compare shadow register */
#define GTM_TOM1_CH7_SR0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR0 *)0xF01089C4u)

/** \\brief  89C8, TOM channel 0 CCU1 compare shadow register */
#define GTM_TOM1_CH7_SR1               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR1 *)0xF01089C8u)

/** \\brief  89D8, TOM channel 0 status register */
#define GTM_TOM1_CH7_STAT              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_STAT *)0xF01089D8u)

/** \\brief  8A0C, TOM channel 0 CCU0 compare register */
#define GTM_TOM1_CH8_CM0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM0 *)0xF0108A0Cu)

/** \\brief  8A10, TOM channel 0 CCU1 compare register */
#define GTM_TOM1_CH8_CM1               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM1 *)0xF0108A10u)

/** \\brief  8A14, TOM channel 0 CCU0 counter register */
#define GTM_TOM1_CH8_CN0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CN0 *)0xF0108A14u)

/** \\brief  8A00, TOM channel 0 control register */
#define GTM_TOM1_CH8_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL *)0xF0108A00u)

/** \\brief  8A20, TOM channel 0 interrupt enable register */
#define GTM_TOM1_CH8_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN *)0xF0108A20u)

/** \\brief  8A24, TOM channel 0 force interrupt register */
#define GTM_TOM1_CH8_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT *)0xF0108A24u)

/** \\brief  8A28, TOM channel 0 interrupt mode register */
#define GTM_TOM1_CH8_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE *)0xF0108A28u)

/** \\brief  8A1C, TOM channel 0 interrupt notification register */
#define GTM_TOM1_CH8_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY *)0xF0108A1Cu)

/** \\brief  8A04, TOM channel 0 CCU0 compare shadow register */
#define GTM_TOM1_CH8_SR0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR0 *)0xF0108A04u)

/** \\brief  8A08, TOM channel 0 CCU1 compare shadow register */
#define GTM_TOM1_CH8_SR1               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR1 *)0xF0108A08u)

/** \\brief  8A18, TOM channel 0 status register */
#define GTM_TOM1_CH8_STAT              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_STAT *)0xF0108A18u)

/** \\brief  8A4C, TOM channel 0 CCU0 compare register */
#define GTM_TOM1_CH9_CM0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM0 *)0xF0108A4Cu)

/** \\brief  8A50, TOM channel 0 CCU1 compare register */
#define GTM_TOM1_CH9_CM1               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM1 *)0xF0108A50u)

/** \\brief  8A54, TOM channel 0 CCU0 counter register */
#define GTM_TOM1_CH9_CN0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CN0 *)0xF0108A54u)

/** \\brief  8A40, TOM channel 0 control register */
#define GTM_TOM1_CH9_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL *)0xF0108A40u)

/** \\brief  8A60, TOM channel 0 interrupt enable register */
#define GTM_TOM1_CH9_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN *)0xF0108A60u)

/** \\brief  8A64, TOM channel 0 force interrupt register */
#define GTM_TOM1_CH9_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT *)0xF0108A64u)

/** \\brief  8A68, TOM channel 0 interrupt mode register */
#define GTM_TOM1_CH9_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE *)0xF0108A68u)

/** \\brief  8A5C, TOM channel 0 interrupt notification register */
#define GTM_TOM1_CH9_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY *)0xF0108A5Cu)

