Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  8A44, TOM channel 0 CCU0 compare shadow register */
#define GTM_TOM1_CH9_SR0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR0 *)0xF0108A44u)

/** \\brief  8A48, TOM channel 0 CCU1 compare shadow register */
#define GTM_TOM1_CH9_SR1               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR1 *)0xF0108A48u)

/** \\brief  8A58, TOM channel 0 status register */
#define GTM_TOM1_CH9_STAT              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_STAT *)0xF0108A58u)

/** \\brief  8834, TOM TGC 0 action time base register */
#define GTM_TOM1_TGC0_ACT_TB           /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_TGC0_ACT_TB *)0xF0108834u)

/** \\brief  8870, TOM TGC 0 enable/disable control register */
#define GTM_TOM1_TGC0_ENDIS_CTRL       /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_TGC0_ENDIS_CTRL *)0xF0108870u)

/** \\brief  8874, TOM TGC 0 enable/disable status register */
#define GTM_TOM1_TGC0_ENDIS_STAT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_TGC0_ENDIS_STAT *)0xF0108874u)

/** \\brief  8838, TOM TGC 0 force update control register */
#define GTM_TOM1_TGC0_FUPD_CTRL        /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_TGC0_FUPD_CTRL *)0xF0108838u)

/** \\brief  8830, TOM TGC 0 global control register */
#define GTM_TOM1_TGC0_GLB_CTRL         /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_TGC0_GLB_CTRL *)0xF0108830u)

/** \\brief  883C, TOM TGC 0 internal trigger control register */
#define GTM_TOM1_TGC0_INT_TRIG         /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_TGC0_INT_TRIG *)0xF010883Cu)

/** \\brief  8878, TOM TGC 0 output enable control register */
#define GTM_TOM1_TGC0_OUTEN_CTRL       /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_TGC0_OUTEN_CTRL *)0xF0108878u)

/** \\brief  887C, TOM TGC 0 output enable status register */
#define GTM_TOM1_TGC0_OUTEN_STAT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_TGC0_OUTEN_STAT *)0xF010887Cu)

/** \\brief  8A34, TOM TGC 1 action time base register */
#define GTM_TOM1_TGC1_ACT_TB           /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_TGC1_ACT_TB *)0xF0108A34u)

/** \\brief  8A70, TOM TGC 1 enable/disable control register */
#define GTM_TOM1_TGC1_ENDIS_CTRL       /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_TGC1_ENDIS_CTRL *)0xF0108A70u)

/** \\brief  8A74, TOM TGC 1 enable/disable status register */
#define GTM_TOM1_TGC1_ENDIS_STAT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_TGC1_ENDIS_STAT *)0xF0108A74u)

/** \\brief  8A38, TOM TGC 1 force update control register */
#define GTM_TOM1_TGC1_FUPD_CTRL        /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_TGC1_FUPD_CTRL *)0xF0108A38u)

/** \\brief  8A30, TOM TGC 1 global control register */
#define GTM_TOM1_TGC1_GLB_CTRL         /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_TGC1_GLB_CTRL *)0xF0108A30u)

/** \\brief  8A3C, TOM TGC 1 internal trigger control register */
#define GTM_TOM1_TGC1_INT_TRIG         /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_TGC1_INT_TRIG *)0xF0108A3Cu)

/** \\brief  8A78, TOM TGC 1 output enable control register */
#define GTM_TOM1_TGC1_OUTEN_CTRL       /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_TGC1_OUTEN_CTRL *)0xF0108A78u)

/** \\brief  8A7C, TOM TGC 1 output enable status register */
#define GTM_TOM1_TGC1_OUTEN_STAT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_TGC1_OUTEN_STAT *)0xF0108A7Cu)

/** \\brief  900C, TOM channel 0 CCU0 compare register */
#define GTM_TOM2_CH0_CM0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM0 *)0xF010900Cu)

/** \\brief  9010, TOM channel 0 CCU1 compare register */
#define GTM_TOM2_CH0_CM1               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM1 *)0xF0109010u)

/** \\brief  9014, TOM channel 0 CCU0 counter register */
#define GTM_TOM2_CH0_CN0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CN0 *)0xF0109014u)

/** \\brief  9000, TOM channel 0 control register */
#define GTM_TOM2_CH0_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL *)0xF0109000u)

/** \\brief  9020, TOM channel 0 interrupt enable register */
#define GTM_TOM2_CH0_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN *)0xF0109020u)

/** \\brief  9024, TOM channel 0 force interrupt register */
#define GTM_TOM2_CH0_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT *)0xF0109024u)

/** \\brief  9028, TOM channel 0 interrupt mode register */
#define GTM_TOM2_CH0_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE *)0xF0109028u)

/** \\brief  901C, TOM channel 0 interrupt notification register */
#define GTM_TOM2_CH0_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY *)0xF010901Cu)

/** \\brief  9004, TOM channel 0 CCU0 compare shadow register */
#define GTM_TOM2_CH0_SR0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR0 *)0xF0109004u)

/** \\brief  9008, TOM channel 0 CCU1 compare shadow register */
#define GTM_TOM2_CH0_SR1               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR1 *)0xF0109008u)

/** \\brief  9018, TOM channel 0 status register */
#define GTM_TOM2_CH0_STAT              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_STAT *)0xF0109018u)

/** \\brief  928C, TOM channel 0 CCU0 compare register */
#define GTM_TOM2_CH10_CM0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM0 *)0xF010928Cu)

/** \\brief  9290, TOM channel 0 CCU1 compare register */
#define GTM_TOM2_CH10_CM1              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM1 *)0xF0109290u)

/** \\brief  9294, TOM channel 0 CCU0 counter register */
#define GTM_TOM2_CH10_CN0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CN0 *)0xF0109294u)

/** \\brief  9280, TOM channel 0 control register */
#define GTM_TOM2_CH10_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL *)0xF0109280u)

/** \\brief  92A0, TOM channel 0 interrupt enable register */
#define GTM_TOM2_CH10_IRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN *)0xF01092A0u)

/** \\brief  92A4, TOM channel 0 force interrupt register */
#define GTM_TOM2_CH10_IRQ_FORCINT      /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT *)0xF01092A4u)

