Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  92A8, TOM channel 0 interrupt mode register */
#define GTM_TOM2_CH10_IRQ_MODE         /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE *)0xF01092A8u)

/** \\brief  929C, TOM channel 0 interrupt notification register */
#define GTM_TOM2_CH10_IRQ_NOTIFY       /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY *)0xF010929Cu)

/** \\brief  9284, TOM channel 0 CCU0 compare shadow register */
#define GTM_TOM2_CH10_SR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR0 *)0xF0109284u)

/** \\brief  9288, TOM channel 0 CCU1 compare shadow register */
#define GTM_TOM2_CH10_SR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR1 *)0xF0109288u)

/** \\brief  9298, TOM channel 0 status register */
#define GTM_TOM2_CH10_STAT             /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_STAT *)0xF0109298u)

/** \\brief  92CC, TOM channel 0 CCU0 compare register */
#define GTM_TOM2_CH11_CM0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM0 *)0xF01092CCu)

/** \\brief  92D0, TOM channel 0 CCU1 compare register */
#define GTM_TOM2_CH11_CM1              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM1 *)0xF01092D0u)

/** \\brief  92D4, TOM channel 0 CCU0 counter register */
#define GTM_TOM2_CH11_CN0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CN0 *)0xF01092D4u)

/** \\brief  92C0, TOM channel 0 control register */
#define GTM_TOM2_CH11_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL *)0xF01092C0u)

/** \\brief  92E0, TOM channel 0 interrupt enable register */
#define GTM_TOM2_CH11_IRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN *)0xF01092E0u)

/** \\brief  92E4, TOM channel 0 force interrupt register */
#define GTM_TOM2_CH11_IRQ_FORCINT      /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT *)0xF01092E4u)

/** \\brief  92E8, TOM channel 0 interrupt mode register */
#define GTM_TOM2_CH11_IRQ_MODE         /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE *)0xF01092E8u)

/** \\brief  92DC, TOM channel 0 interrupt notification register */
#define GTM_TOM2_CH11_IRQ_NOTIFY       /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY *)0xF01092DCu)

/** \\brief  92C4, TOM channel 0 CCU0 compare shadow register */
#define GTM_TOM2_CH11_SR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR0 *)0xF01092C4u)

/** \\brief  92C8, TOM channel 0 CCU1 compare shadow register */
#define GTM_TOM2_CH11_SR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR1 *)0xF01092C8u)

/** \\brief  92D8, TOM channel 0 status register */
#define GTM_TOM2_CH11_STAT             /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_STAT *)0xF01092D8u)

/** \\brief  930C, TOM channel 0 CCU0 compare register */
#define GTM_TOM2_CH12_CM0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM0 *)0xF010930Cu)

/** \\brief  9310, TOM channel 0 CCU1 compare register */
#define GTM_TOM2_CH12_CM1              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM1 *)0xF0109310u)

/** \\brief  9314, TOM channel 0 CCU0 counter register */
#define GTM_TOM2_CH12_CN0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CN0 *)0xF0109314u)

/** \\brief  9300, TOM channel 0 control register */
#define GTM_TOM2_CH12_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL *)0xF0109300u)

/** \\brief  9320, TOM channel 0 interrupt enable register */
#define GTM_TOM2_CH12_IRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN *)0xF0109320u)

/** \\brief  9324, TOM channel 0 force interrupt register */
#define GTM_TOM2_CH12_IRQ_FORCINT      /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT *)0xF0109324u)

/** \\brief  9328, TOM channel 0 interrupt mode register */
#define GTM_TOM2_CH12_IRQ_MODE         /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE *)0xF0109328u)

/** \\brief  931C, TOM channel 0 interrupt notification register */
#define GTM_TOM2_CH12_IRQ_NOTIFY       /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY *)0xF010931Cu)

/** \\brief  9304, TOM channel 0 CCU0 compare shadow register */
#define GTM_TOM2_CH12_SR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR0 *)0xF0109304u)

/** \\brief  9308, TOM channel 0 CCU1 compare shadow register */
#define GTM_TOM2_CH12_SR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR1 *)0xF0109308u)

/** \\brief  9318, TOM channel 0 status register */
#define GTM_TOM2_CH12_STAT             /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_STAT *)0xF0109318u)

/** \\brief  934C, TOM channel 0 CCU0 compare register */
#define GTM_TOM2_CH13_CM0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM0 *)0xF010934Cu)

/** \\brief  9350, TOM channel 0 CCU1 compare register */
#define GTM_TOM2_CH13_CM1              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM1 *)0xF0109350u)

/** \\brief  9354, TOM channel 0 CCU0 counter register */
#define GTM_TOM2_CH13_CN0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CN0 *)0xF0109354u)

/** \\brief  9340, TOM channel 0 control register */
#define GTM_TOM2_CH13_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL *)0xF0109340u)

/** \\brief  9360, TOM channel 0 interrupt enable register */
#define GTM_TOM2_CH13_IRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN *)0xF0109360u)

/** \\brief  9364, TOM channel 0 force interrupt register */
#define GTM_TOM2_CH13_IRQ_FORCINT      /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT *)0xF0109364u)

/** \\brief  9368, TOM channel 0 interrupt mode register */
#define GTM_TOM2_CH13_IRQ_MODE         /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE *)0xF0109368u)

/** \\brief  935C, TOM channel 0 interrupt notification register */
#define GTM_TOM2_CH13_IRQ_NOTIFY       /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY *)0xF010935Cu)

/** \\brief  9344, TOM channel 0 CCU0 compare shadow register */
#define GTM_TOM2_CH13_SR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR0 *)0xF0109344u)

/** \\brief  9348, TOM channel 0 CCU1 compare shadow register */
#define GTM_TOM2_CH13_SR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR1 *)0xF0109348u)

/** \\brief  9358, TOM channel 0 status register */
#define GTM_TOM2_CH13_STAT             /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_STAT *)0xF0109358u)

/** \\brief  938C, TOM channel 0 CCU0 compare register */
#define GTM_TOM2_CH14_CM0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM0 *)0xF010938Cu)

/** \\brief  9390, TOM channel 0 CCU1 compare register */
#define GTM_TOM2_CH14_CM1              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM1 *)0xF0109390u)

/** \\brief  9394, TOM channel 0 CCU0 counter register */
#define GTM_TOM2_CH14_CN0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CN0 *)0xF0109394u)

/** \\brief  9380, TOM channel 0 control register */
#define GTM_TOM2_CH14_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL *)0xF0109380u)

