Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  93A0, TOM channel 0 interrupt enable register */
#define GTM_TOM2_CH14_IRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN *)0xF01093A0u)

/** \\brief  93A4, TOM channel 0 force interrupt register */
#define GTM_TOM2_CH14_IRQ_FORCINT      /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT *)0xF01093A4u)

/** \\brief  93A8, TOM channel 0 interrupt mode register */
#define GTM_TOM2_CH14_IRQ_MODE         /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE *)0xF01093A8u)

/** \\brief  939C, TOM channel 0 interrupt notification register */
#define GTM_TOM2_CH14_IRQ_NOTIFY       /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY *)0xF010939Cu)

/** \\brief  9384, TOM channel 0 CCU0 compare shadow register */
#define GTM_TOM2_CH14_SR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR0 *)0xF0109384u)

/** \\brief  9388, TOM channel 0 CCU1 compare shadow register */
#define GTM_TOM2_CH14_SR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR1 *)0xF0109388u)

/** \\brief  9398, TOM channel 0 status register */
#define GTM_TOM2_CH14_STAT             /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_STAT *)0xF0109398u)

/** \\brief  93CC, TOM channel 0 CCU0 compare register */
#define GTM_TOM2_CH15_CM0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM0 *)0xF01093CCu)

/** \\brief  93D0, TOM channel 0 CCU1 compare register */
#define GTM_TOM2_CH15_CM1              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM1 *)0xF01093D0u)

/** \\brief  93D4, TOM channel 0 CCU0 counter register */
#define GTM_TOM2_CH15_CN0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CN0 *)0xF01093D4u)

/** \\brief  93C0, TOM channel 0 control register */
#define GTM_TOM2_CH15_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL *)0xF01093C0u)

/** \\brief  93E0, TOM channel 0 interrupt enable register */
#define GTM_TOM2_CH15_IRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN *)0xF01093E0u)

/** \\brief  93E4, TOM channel 0 force interrupt register */
#define GTM_TOM2_CH15_IRQ_FORCINT      /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT *)0xF01093E4u)

/** \\brief  93E8, TOM channel 0 interrupt mode register */
#define GTM_TOM2_CH15_IRQ_MODE         /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE *)0xF01093E8u)

/** \\brief  93DC, TOM channel 0 interrupt notification register */
#define GTM_TOM2_CH15_IRQ_NOTIFY       /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY *)0xF01093DCu)

/** \\brief  93C4, TOM channel 0 CCU0 compare shadow register */
#define GTM_TOM2_CH15_SR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR0 *)0xF01093C4u)

/** \\brief  93C8, TOM channel 0 CCU1 compare shadow register */
#define GTM_TOM2_CH15_SR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR1 *)0xF01093C8u)

/** \\brief  93D8, TOM channel 0 status register */
#define GTM_TOM2_CH15_STAT             /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_STAT *)0xF01093D8u)

/** \\brief  904C, TOM channel 0 CCU0 compare register */
#define GTM_TOM2_CH1_CM0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM0 *)0xF010904Cu)

/** \\brief  9050, TOM channel 0 CCU1 compare register */
#define GTM_TOM2_CH1_CM1               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM1 *)0xF0109050u)

/** \\brief  9054, TOM channel 0 CCU0 counter register */
#define GTM_TOM2_CH1_CN0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CN0 *)0xF0109054u)

/** \\brief  9040, TOM channel 0 control register */
#define GTM_TOM2_CH1_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL *)0xF0109040u)

/** \\brief  9060, TOM channel 0 interrupt enable register */
#define GTM_TOM2_CH1_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN *)0xF0109060u)

/** \\brief  9064, TOM channel 0 force interrupt register */
#define GTM_TOM2_CH1_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT *)0xF0109064u)

/** \\brief  9068, TOM channel 0 interrupt mode register */
#define GTM_TOM2_CH1_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE *)0xF0109068u)

/** \\brief  905C, TOM channel 0 interrupt notification register */
#define GTM_TOM2_CH1_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY *)0xF010905Cu)

/** \\brief  9044, TOM channel 0 CCU0 compare shadow register */
#define GTM_TOM2_CH1_SR0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR0 *)0xF0109044u)

/** \\brief  9048, TOM channel 0 CCU1 compare shadow register */
#define GTM_TOM2_CH1_SR1               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR1 *)0xF0109048u)

/** \\brief  9058, TOM channel 0 status register */
#define GTM_TOM2_CH1_STAT              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_STAT *)0xF0109058u)

/** \\brief  908C, TOM channel 0 CCU0 compare register */
#define GTM_TOM2_CH2_CM0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM0 *)0xF010908Cu)

/** \\brief  9090, TOM channel 0 CCU1 compare register */
#define GTM_TOM2_CH2_CM1               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM1 *)0xF0109090u)

/** \\brief  9094, TOM channel 0 CCU0 counter register */
#define GTM_TOM2_CH2_CN0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CN0 *)0xF0109094u)

/** \\brief  9080, TOM channel 0 control register */
#define GTM_TOM2_CH2_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL *)0xF0109080u)

/** \\brief  90A0, TOM channel 0 interrupt enable register */
#define GTM_TOM2_CH2_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN *)0xF01090A0u)

/** \\brief  90A4, TOM channel 0 force interrupt register */
#define GTM_TOM2_CH2_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT *)0xF01090A4u)

/** \\brief  90A8, TOM channel 0 interrupt mode register */
#define GTM_TOM2_CH2_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE *)0xF01090A8u)

/** \\brief  909C, TOM channel 0 interrupt notification register */
#define GTM_TOM2_CH2_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY *)0xF010909Cu)

