Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  9084, TOM channel 0 CCU0 compare shadow register */
#define GTM_TOM2_CH2_SR0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR0 *)0xF0109084u)

/** \\brief  9088, TOM channel 0 CCU1 compare shadow register */
#define GTM_TOM2_CH2_SR1               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR1 *)0xF0109088u)

/** \\brief  9098, TOM channel 0 status register */
#define GTM_TOM2_CH2_STAT              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_STAT *)0xF0109098u)

/** \\brief  90CC, TOM channel 0 CCU0 compare register */
#define GTM_TOM2_CH3_CM0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM0 *)0xF01090CCu)

/** \\brief  90D0, TOM channel 0 CCU1 compare register */
#define GTM_TOM2_CH3_CM1               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM1 *)0xF01090D0u)

/** \\brief  90D4, TOM channel 0 CCU0 counter register */
#define GTM_TOM2_CH3_CN0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CN0 *)0xF01090D4u)

/** \\brief  90C0, TOM channel 0 control register */
#define GTM_TOM2_CH3_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL *)0xF01090C0u)

/** \\brief  90E0, TOM channel 0 interrupt enable register */
#define GTM_TOM2_CH3_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN *)0xF01090E0u)

/** \\brief  90E4, TOM channel 0 force interrupt register */
#define GTM_TOM2_CH3_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT *)0xF01090E4u)

/** \\brief  90E8, TOM channel 0 interrupt mode register */
#define GTM_TOM2_CH3_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE *)0xF01090E8u)

/** \\brief  90DC, TOM channel 0 interrupt notification register */
#define GTM_TOM2_CH3_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY *)0xF01090DCu)

/** \\brief  90C4, TOM channel 0 CCU0 compare shadow register */
#define GTM_TOM2_CH3_SR0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR0 *)0xF01090C4u)

/** \\brief  90C8, TOM channel 0 CCU1 compare shadow register */
#define GTM_TOM2_CH3_SR1               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR1 *)0xF01090C8u)

/** \\brief  90D8, TOM channel 0 status register */
#define GTM_TOM2_CH3_STAT              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_STAT *)0xF01090D8u)

/** \\brief  910C, TOM channel 0 CCU0 compare register */
#define GTM_TOM2_CH4_CM0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM0 *)0xF010910Cu)

/** \\brief  9110, TOM channel 0 CCU1 compare register */
#define GTM_TOM2_CH4_CM1               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM1 *)0xF0109110u)

/** \\brief  9114, TOM channel 0 CCU0 counter register */
#define GTM_TOM2_CH4_CN0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CN0 *)0xF0109114u)

/** \\brief  9100, TOM channel 0 control register */
#define GTM_TOM2_CH4_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL *)0xF0109100u)

/** \\brief  9120, TOM channel 0 interrupt enable register */
#define GTM_TOM2_CH4_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN *)0xF0109120u)

/** \\brief  9124, TOM channel 0 force interrupt register */
#define GTM_TOM2_CH4_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT *)0xF0109124u)

/** \\brief  9128, TOM channel 0 interrupt mode register */
#define GTM_TOM2_CH4_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE *)0xF0109128u)

/** \\brief  911C, TOM channel 0 interrupt notification register */
#define GTM_TOM2_CH4_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY *)0xF010911Cu)

/** \\brief  9104, TOM channel 0 CCU0 compare shadow register */
#define GTM_TOM2_CH4_SR0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR0 *)0xF0109104u)

/** \\brief  9108, TOM channel 0 CCU1 compare shadow register */
#define GTM_TOM2_CH4_SR1               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR1 *)0xF0109108u)

/** \\brief  9118, TOM channel 0 status register */
#define GTM_TOM2_CH4_STAT              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_STAT *)0xF0109118u)

/** \\brief  914C, TOM channel 0 CCU0 compare register */
#define GTM_TOM2_CH5_CM0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM0 *)0xF010914Cu)

/** \\brief  9150, TOM channel 0 CCU1 compare register */
#define GTM_TOM2_CH5_CM1               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM1 *)0xF0109150u)

/** \\brief  9154, TOM channel 0 CCU0 counter register */
#define GTM_TOM2_CH5_CN0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CN0 *)0xF0109154u)

/** \\brief  9140, TOM channel 0 control register */
#define GTM_TOM2_CH5_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL *)0xF0109140u)

/** \\brief  9160, TOM channel 0 interrupt enable register */
#define GTM_TOM2_CH5_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN *)0xF0109160u)

/** \\brief  9164, TOM channel 0 force interrupt register */
#define GTM_TOM2_CH5_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT *)0xF0109164u)

/** \\brief  9168, TOM channel 0 interrupt mode register */
#define GTM_TOM2_CH5_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE *)0xF0109168u)

/** \\brief  915C, TOM channel 0 interrupt notification register */
#define GTM_TOM2_CH5_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY *)0xF010915Cu)

/** \\brief  9144, TOM channel 0 CCU0 compare shadow register */
#define GTM_TOM2_CH5_SR0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR0 *)0xF0109144u)

/** \\brief  9148, TOM channel 0 CCU1 compare shadow register */
#define GTM_TOM2_CH5_SR1               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR1 *)0xF0109148u)

/** \\brief  9158, TOM channel 0 status register */
#define GTM_TOM2_CH5_STAT              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_STAT *)0xF0109158u)

/** \\brief  918C, TOM channel 0 CCU0 compare register */
#define GTM_TOM2_CH6_CM0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM0 *)0xF010918Cu)

/** \\brief  9190, TOM channel 0 CCU1 compare register */
#define GTM_TOM2_CH6_CM1               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM1 *)0xF0109190u)

/** \\brief  9194, TOM channel 0 CCU0 counter register */
#define GTM_TOM2_CH6_CN0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CN0 *)0xF0109194u)

/** \\brief  9180, TOM channel 0 control register */
#define GTM_TOM2_CH6_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL *)0xF0109180u)

/** \\brief  91A0, TOM channel 0 interrupt enable register */
#define GTM_TOM2_CH6_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN *)0xF01091A0u)

/** \\brief  91A4, TOM channel 0 force interrupt register */
#define GTM_TOM2_CH6_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT *)0xF01091A4u)

/** \\brief  91A8, TOM channel 0 interrupt mode register */
#define GTM_TOM2_CH6_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE *)0xF01091A8u)

/** \\brief  919C, TOM channel 0 interrupt notification register */
#define GTM_TOM2_CH6_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY *)0xF010919Cu)

/** \\brief  9184, TOM channel 0 CCU0 compare shadow register */
#define GTM_TOM2_CH6_SR0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR0 *)0xF0109184u)

/** \\brief  9188, TOM channel 0 CCU1 compare shadow register */
#define GTM_TOM2_CH6_SR1               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR1 *)0xF0109188u)

/** \\brief  9198, TOM channel 0 status register */
#define GTM_TOM2_CH6_STAT              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_STAT *)0xF0109198u)

/** \\brief  91CC, TOM channel 0 CCU0 compare register */
#define GTM_TOM2_CH7_CM0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM0 *)0xF01091CCu)

/** \\brief  91D0, TOM channel 0 CCU1 compare register */
#define GTM_TOM2_CH7_CM1               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM1 *)0xF01091D0u)

/** \\brief  91D4, TOM channel 0 CCU0 counter register */
#define GTM_TOM2_CH7_CN0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CN0 *)0xF01091D4u)

/** \\brief  91C0, TOM channel 0 control register */
#define GTM_TOM2_CH7_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL *)0xF01091C0u)

/** \\brief  91E0, TOM channel 0 interrupt enable register */
#define GTM_TOM2_CH7_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN *)0xF01091E0u)

/** \\brief  91E4, TOM channel 0 force interrupt register */
#define GTM_TOM2_CH7_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT *)0xF01091E4u)

/** \\brief  91E8, TOM channel 0 interrupt mode register */
#define GTM_TOM2_CH7_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE *)0xF01091E8u)

/** \\brief  91DC, TOM channel 0 interrupt notification register */
#define GTM_TOM2_CH7_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY *)0xF01091DCu)

/** \\brief  91C4, TOM channel 0 CCU0 compare shadow register */
#define GTM_TOM2_CH7_SR0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR0 *)0xF01091C4u)

/** \\brief  91C8, TOM channel 0 CCU1 compare shadow register */
#define GTM_TOM2_CH7_SR1               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR1 *)0xF01091C8u)

/** \\brief  91D8, TOM channel 0 status register */
#define GTM_TOM2_CH7_STAT              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_STAT *)0xF01091D8u)

/** \\brief  920C, TOM channel 0 CCU0 compare register */
#define GTM_TOM2_CH8_CM0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM0 *)0xF010920Cu)

/** \\brief  9210, TOM channel 0 CCU1 compare register */
#define GTM_TOM2_CH8_CM1               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM1 *)0xF0109210u)

/** \\brief  9214, TOM channel 0 CCU0 counter register */
#define GTM_TOM2_CH8_CN0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CN0 *)0xF0109214u)

/** \\brief  9200, TOM channel 0 control register */
#define GTM_TOM2_CH8_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL *)0xF0109200u)

/** \\brief  9220, TOM channel 0 interrupt enable register */
#define GTM_TOM2_CH8_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN *)0xF0109220u)

