Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  9224, TOM channel 0 force interrupt register */
#define GTM_TOM2_CH8_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT *)0xF0109224u)

/** \\brief  9228, TOM channel 0 interrupt mode register */
#define GTM_TOM2_CH8_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE *)0xF0109228u)

/** \\brief  921C, TOM channel 0 interrupt notification register */
#define GTM_TOM2_CH8_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY *)0xF010921Cu)

/** \\brief  9204, TOM channel 0 CCU0 compare shadow register */
#define GTM_TOM2_CH8_SR0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR0 *)0xF0109204u)

/** \\brief  9208, TOM channel 0 CCU1 compare shadow register */
#define GTM_TOM2_CH8_SR1               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR1 *)0xF0109208u)

/** \\brief  9218, TOM channel 0 status register */
#define GTM_TOM2_CH8_STAT              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_STAT *)0xF0109218u)

/** \\brief  924C, TOM channel 0 CCU0 compare register */
#define GTM_TOM2_CH9_CM0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM0 *)0xF010924Cu)

/** \\brief  9250, TOM channel 0 CCU1 compare register */
#define GTM_TOM2_CH9_CM1               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM1 *)0xF0109250u)

/** \\brief  9254, TOM channel 0 CCU0 counter register */
#define GTM_TOM2_CH9_CN0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CN0 *)0xF0109254u)

/** \\brief  9240, TOM channel 0 control register */
#define GTM_TOM2_CH9_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL *)0xF0109240u)

/** \\brief  9260, TOM channel 0 interrupt enable register */
#define GTM_TOM2_CH9_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN *)0xF0109260u)

/** \\brief  9264, TOM channel 0 force interrupt register */
#define GTM_TOM2_CH9_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT *)0xF0109264u)

/** \\brief  9268, TOM channel 0 interrupt mode register */
#define GTM_TOM2_CH9_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE *)0xF0109268u)

/** \\brief  925C, TOM channel 0 interrupt notification register */
#define GTM_TOM2_CH9_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY *)0xF010925Cu)

/** \\brief  9244, TOM channel 0 CCU0 compare shadow register */
#define GTM_TOM2_CH9_SR0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR0 *)0xF0109244u)

/** \\brief  9248, TOM channel 0 CCU1 compare shadow register */
#define GTM_TOM2_CH9_SR1               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR1 *)0xF0109248u)

/** \\brief  9258, TOM channel 0 status register */
#define GTM_TOM2_CH9_STAT              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_STAT *)0xF0109258u)

/** \\brief  9034, TOM TGC 0 action time base register */
#define GTM_TOM2_TGC0_ACT_TB           /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_TGC0_ACT_TB *)0xF0109034u)

/** \\brief  9070, TOM TGC 0 enable/disable control register */
#define GTM_TOM2_TGC0_ENDIS_CTRL       /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_TGC0_ENDIS_CTRL *)0xF0109070u)

/** \\brief  9074, TOM TGC 0 enable/disable status register */
#define GTM_TOM2_TGC0_ENDIS_STAT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_TGC0_ENDIS_STAT *)0xF0109074u)

/** \\brief  9038, TOM TGC 0 force update control register */
#define GTM_TOM2_TGC0_FUPD_CTRL        /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_TGC0_FUPD_CTRL *)0xF0109038u)

/** \\brief  9030, TOM TGC 0 global control register */
#define GTM_TOM2_TGC0_GLB_CTRL         /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_TGC0_GLB_CTRL *)0xF0109030u)

/** \\brief  903C, TOM TGC 0 internal trigger control register */
#define GTM_TOM2_TGC0_INT_TRIG         /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_TGC0_INT_TRIG *)0xF010903Cu)

/** \\brief  9078, TOM TGC 0 output enable control register */
#define GTM_TOM2_TGC0_OUTEN_CTRL       /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_TGC0_OUTEN_CTRL *)0xF0109078u)

/** \\brief  907C, TOM TGC 0 output enable status register */
#define GTM_TOM2_TGC0_OUTEN_STAT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_TGC0_OUTEN_STAT *)0xF010907Cu)

/** \\brief  9234, TOM TGC 1 action time base register */
#define GTM_TOM2_TGC1_ACT_TB           /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_TGC1_ACT_TB *)0xF0109234u)

/** \\brief  9270, TOM TGC 1 enable/disable control register */
#define GTM_TOM2_TGC1_ENDIS_CTRL       /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_TGC1_ENDIS_CTRL *)0xF0109270u)

/** \\brief  9274, TOM TGC 1 enable/disable status register */
#define GTM_TOM2_TGC1_ENDIS_STAT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_TGC1_ENDIS_STAT *)0xF0109274u)

/** \\brief  9238, TOM TGC 1 force update control register */
#define GTM_TOM2_TGC1_FUPD_CTRL        /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_TGC1_FUPD_CTRL *)0xF0109238u)

/** \\brief  9230, TOM TGC 1 global control register */
#define GTM_TOM2_TGC1_GLB_CTRL         /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_TGC1_GLB_CTRL *)0xF0109230u)

/** \\brief  923C, TOM TGC 1 internal trigger control register */
#define GTM_TOM2_TGC1_INT_TRIG         /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_TGC1_INT_TRIG *)0xF010923Cu)

/** \\brief  9278, TOM TGC 1 output enable control register */
#define GTM_TOM2_TGC1_OUTEN_CTRL       /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_TGC1_OUTEN_CTRL *)0xF0109278u)

/** \\brief  927C, TOM TGC 1 output enable status register */
#define GTM_TOM2_TGC1_OUTEN_STAT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_TGC1_OUTEN_STAT *)0xF010927Cu)

/** \\brief  980C, TOM channel 0 CCU0 compare register */
#define GTM_TOM3_CH0_CM0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM0 *)0xF010980Cu)

/** \\brief  9810, TOM channel 0 CCU1 compare register */
#define GTM_TOM3_CH0_CM1               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM1 *)0xF0109810u)

/** \\brief  9814, TOM channel 0 CCU0 counter register */
#define GTM_TOM3_CH0_CN0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CN0 *)0xF0109814u)

/** \\brief  9800, TOM channel 0 control register */
#define GTM_TOM3_CH0_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL *)0xF0109800u)

/** \\brief  9820, TOM channel 0 interrupt enable register */
#define GTM_TOM3_CH0_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN *)0xF0109820u)

