Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  9824, TOM channel 0 force interrupt register */
#define GTM_TOM3_CH0_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT *)0xF0109824u)

/** \\brief  9828, TOM channel 0 interrupt mode register */
#define GTM_TOM3_CH0_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE *)0xF0109828u)

/** \\brief  981C, TOM channel 0 interrupt notification register */
#define GTM_TOM3_CH0_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY *)0xF010981Cu)

/** \\brief  9804, TOM channel 0 CCU0 compare shadow register */
#define GTM_TOM3_CH0_SR0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR0 *)0xF0109804u)

/** \\brief  9808, TOM channel 0 CCU1 compare shadow register */
#define GTM_TOM3_CH0_SR1               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR1 *)0xF0109808u)

/** \\brief  9818, TOM channel 0 status register */
#define GTM_TOM3_CH0_STAT              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_STAT *)0xF0109818u)

/** \\brief  9A8C, TOM channel 0 CCU0 compare register */
#define GTM_TOM3_CH10_CM0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM0 *)0xF0109A8Cu)

/** \\brief  9A90, TOM channel 0 CCU1 compare register */
#define GTM_TOM3_CH10_CM1              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM1 *)0xF0109A90u)

/** \\brief  9A94, TOM channel 0 CCU0 counter register */
#define GTM_TOM3_CH10_CN0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CN0 *)0xF0109A94u)

/** \\brief  9A80, TOM channel 0 control register */
#define GTM_TOM3_CH10_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL *)0xF0109A80u)

/** \\brief  9AA0, TOM channel 0 interrupt enable register */
#define GTM_TOM3_CH10_IRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN *)0xF0109AA0u)

/** \\brief  9AA4, TOM channel 0 force interrupt register */
#define GTM_TOM3_CH10_IRQ_FORCINT      /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT *)0xF0109AA4u)

/** \\brief  9AA8, TOM channel 0 interrupt mode register */
#define GTM_TOM3_CH10_IRQ_MODE         /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE *)0xF0109AA8u)

/** \\brief  9A9C, TOM channel 0 interrupt notification register */
#define GTM_TOM3_CH10_IRQ_NOTIFY       /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY *)0xF0109A9Cu)

/** \\brief  9A84, TOM channel 0 CCU0 compare shadow register */
#define GTM_TOM3_CH10_SR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR0 *)0xF0109A84u)

/** \\brief  9A88, TOM channel 0 CCU1 compare shadow register */
#define GTM_TOM3_CH10_SR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR1 *)0xF0109A88u)

/** \\brief  9A98, TOM channel 0 status register */
#define GTM_TOM3_CH10_STAT             /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_STAT *)0xF0109A98u)

/** \\brief  9ACC, TOM channel 0 CCU0 compare register */
#define GTM_TOM3_CH11_CM0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM0 *)0xF0109ACCu)

/** \\brief  9AD0, TOM channel 0 CCU1 compare register */
#define GTM_TOM3_CH11_CM1              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM1 *)0xF0109AD0u)

/** \\brief  9AD4, TOM channel 0 CCU0 counter register */
#define GTM_TOM3_CH11_CN0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CN0 *)0xF0109AD4u)

/** \\brief  9AC0, TOM channel 0 control register */
#define GTM_TOM3_CH11_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL *)0xF0109AC0u)

/** \\brief  9AE0, TOM channel 0 interrupt enable register */
#define GTM_TOM3_CH11_IRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN *)0xF0109AE0u)

/** \\brief  9AE4, TOM channel 0 force interrupt register */
#define GTM_TOM3_CH11_IRQ_FORCINT      /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT *)0xF0109AE4u)

/** \\brief  9AE8, TOM channel 0 interrupt mode register */
#define GTM_TOM3_CH11_IRQ_MODE         /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE *)0xF0109AE8u)

/** \\brief  9ADC, TOM channel 0 interrupt notification register */
#define GTM_TOM3_CH11_IRQ_NOTIFY       /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY *)0xF0109ADCu)

/** \\brief  9AC4, TOM channel 0 CCU0 compare shadow register */
#define GTM_TOM3_CH11_SR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR0 *)0xF0109AC4u)

/** \\brief  9AC8, TOM channel 0 CCU1 compare shadow register */
#define GTM_TOM3_CH11_SR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR1 *)0xF0109AC8u)

/** \\brief  9AD8, TOM channel 0 status register */
#define GTM_TOM3_CH11_STAT             /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_STAT *)0xF0109AD8u)

/** \\brief  9B0C, TOM channel 0 CCU0 compare register */
#define GTM_TOM3_CH12_CM0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM0 *)0xF0109B0Cu)

/** \\brief  9B10, TOM channel 0 CCU1 compare register */
#define GTM_TOM3_CH12_CM1              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM1 *)0xF0109B10u)

/** \\brief  9B14, TOM channel 0 CCU0 counter register */
#define GTM_TOM3_CH12_CN0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CN0 *)0xF0109B14u)

/** \\brief  9B00, TOM channel 0 control register */
#define GTM_TOM3_CH12_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL *)0xF0109B00u)

/** \\brief  9B20, TOM channel 0 interrupt enable register */
#define GTM_TOM3_CH12_IRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN *)0xF0109B20u)

/** \\brief  9B24, TOM channel 0 force interrupt register */
#define GTM_TOM3_CH12_IRQ_FORCINT      /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT *)0xF0109B24u)

/** \\brief  9B28, TOM channel 0 interrupt mode register */
#define GTM_TOM3_CH12_IRQ_MODE         /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE *)0xF0109B28u)

/** \\brief  9B1C, TOM channel 0 interrupt notification register */
#define GTM_TOM3_CH12_IRQ_NOTIFY       /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY *)0xF0109B1Cu)

/** \\brief  9B04, TOM channel 0 CCU0 compare shadow register */
#define GTM_TOM3_CH12_SR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR0 *)0xF0109B04u)

/** \\brief  9B08, TOM channel 0 CCU1 compare shadow register */
#define GTM_TOM3_CH12_SR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR1 *)0xF0109B08u)

/** \\brief  9B18, TOM channel 0 status register */
#define GTM_TOM3_CH12_STAT             /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_STAT *)0xF0109B18u)

/** \\brief  9B4C, TOM channel 0 CCU0 compare register */
#define GTM_TOM3_CH13_CM0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM0 *)0xF0109B4Cu)

/** \\brief  9B50, TOM channel 0 CCU1 compare register */
#define GTM_TOM3_CH13_CM1              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM1 *)0xF0109B50u)

/** \\brief  9B54, TOM channel 0 CCU0 counter register */
#define GTM_TOM3_CH13_CN0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CN0 *)0xF0109B54u)

