Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  9B40, TOM channel 0 control register */
#define GTM_TOM3_CH13_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL *)0xF0109B40u)

/** \\brief  9B60, TOM channel 0 interrupt enable register */
#define GTM_TOM3_CH13_IRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN *)0xF0109B60u)

/** \\brief  9B64, TOM channel 0 force interrupt register */
#define GTM_TOM3_CH13_IRQ_FORCINT      /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT *)0xF0109B64u)

/** \\brief  9B68, TOM channel 0 interrupt mode register */
#define GTM_TOM3_CH13_IRQ_MODE         /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE *)0xF0109B68u)

/** \\brief  9B5C, TOM channel 0 interrupt notification register */
#define GTM_TOM3_CH13_IRQ_NOTIFY       /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY *)0xF0109B5Cu)

/** \\brief  9B44, TOM channel 0 CCU0 compare shadow register */
#define GTM_TOM3_CH13_SR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR0 *)0xF0109B44u)

/** \\brief  9B48, TOM channel 0 CCU1 compare shadow register */
#define GTM_TOM3_CH13_SR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR1 *)0xF0109B48u)

/** \\brief  9B58, TOM channel 0 status register */
#define GTM_TOM3_CH13_STAT             /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_STAT *)0xF0109B58u)

/** \\brief  9B8C, TOM channel 0 CCU0 compare register */
#define GTM_TOM3_CH14_CM0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM0 *)0xF0109B8Cu)

/** \\brief  9B90, TOM channel 0 CCU1 compare register */
#define GTM_TOM3_CH14_CM1              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM1 *)0xF0109B90u)

/** \\brief  9B94, TOM channel 0 CCU0 counter register */
#define GTM_TOM3_CH14_CN0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CN0 *)0xF0109B94u)

/** \\brief  9B80, TOM channel 0 control register */
#define GTM_TOM3_CH14_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL *)0xF0109B80u)

/** \\brief  9BA0, TOM channel 0 interrupt enable register */
#define GTM_TOM3_CH14_IRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN *)0xF0109BA0u)

/** \\brief  9BA4, TOM channel 0 force interrupt register */
#define GTM_TOM3_CH14_IRQ_FORCINT      /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT *)0xF0109BA4u)

/** \\brief  9BA8, TOM channel 0 interrupt mode register */
#define GTM_TOM3_CH14_IRQ_MODE         /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE *)0xF0109BA8u)

/** \\brief  9B9C, TOM channel 0 interrupt notification register */
#define GTM_TOM3_CH14_IRQ_NOTIFY       /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY *)0xF0109B9Cu)

/** \\brief  9B84, TOM channel 0 CCU0 compare shadow register */
#define GTM_TOM3_CH14_SR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR0 *)0xF0109B84u)

/** \\brief  9B88, TOM channel 0 CCU1 compare shadow register */
#define GTM_TOM3_CH14_SR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR1 *)0xF0109B88u)

/** \\brief  9B98, TOM channel 0 status register */
#define GTM_TOM3_CH14_STAT             /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_STAT *)0xF0109B98u)

/** \\brief  9BCC, TOM channel 0 CCU0 compare register */
#define GTM_TOM3_CH15_CM0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM0 *)0xF0109BCCu)

/** \\brief  9BD0, TOM channel 0 CCU1 compare register */
#define GTM_TOM3_CH15_CM1              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM1 *)0xF0109BD0u)

/** \\brief  9BD4, TOM channel 0 CCU0 counter register */
#define GTM_TOM3_CH15_CN0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CN0 *)0xF0109BD4u)

/** \\brief  9BC0, TOM channel 0 control register */
#define GTM_TOM3_CH15_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL *)0xF0109BC0u)

/** \\brief  9BE0, TOM channel 0 interrupt enable register */
#define GTM_TOM3_CH15_IRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN *)0xF0109BE0u)

/** \\brief  9BE4, TOM channel 0 force interrupt register */
#define GTM_TOM3_CH15_IRQ_FORCINT      /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT *)0xF0109BE4u)

/** \\brief  9BE8, TOM channel 0 interrupt mode register */
#define GTM_TOM3_CH15_IRQ_MODE         /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE *)0xF0109BE8u)

/** \\brief  9BDC, TOM channel 0 interrupt notification register */
#define GTM_TOM3_CH15_IRQ_NOTIFY       /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY *)0xF0109BDCu)

/** \\brief  9BC4, TOM channel 0 CCU0 compare shadow register */
#define GTM_TOM3_CH15_SR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR0 *)0xF0109BC4u)

/** \\brief  9BC8, TOM channel 0 CCU1 compare shadow register */
#define GTM_TOM3_CH15_SR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR1 *)0xF0109BC8u)

/** \\brief  9BD8, TOM channel 0 status register */
#define GTM_TOM3_CH15_STAT             /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_STAT *)0xF0109BD8u)

/** \\brief  984C, TOM channel 0 CCU0 compare register */
#define GTM_TOM3_CH1_CM0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM0 *)0xF010984Cu)

/** \\brief  9850, TOM channel 0 CCU1 compare register */
#define GTM_TOM3_CH1_CM1               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM1 *)0xF0109850u)

/** \\brief  9854, TOM channel 0 CCU0 counter register */
#define GTM_TOM3_CH1_CN0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CN0 *)0xF0109854u)

/** \\brief  9840, TOM channel 0 control register */
#define GTM_TOM3_CH1_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL *)0xF0109840u)

/** \\brief  9860, TOM channel 0 interrupt enable register */
#define GTM_TOM3_CH1_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN *)0xF0109860u)

/** \\brief  9864, TOM channel 0 force interrupt register */
#define GTM_TOM3_CH1_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT *)0xF0109864u)

/** \\brief  9868, TOM channel 0 interrupt mode register */
#define GTM_TOM3_CH1_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE *)0xF0109868u)

/** \\brief  985C, TOM channel 0 interrupt notification register */
#define GTM_TOM3_CH1_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY *)0xF010985Cu)

/** \\brief  9844, TOM channel 0 CCU0 compare shadow register */
#define GTM_TOM3_CH1_SR0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR0 *)0xF0109844u)

/** \\brief  9848, TOM channel 0 CCU1 compare shadow register */
#define GTM_TOM3_CH1_SR1               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR1 *)0xF0109848u)

/** \\brief  9858, TOM channel 0 status register */
#define GTM_TOM3_CH1_STAT              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_STAT *)0xF0109858u)

