Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  988C, TOM channel 0 CCU0 compare register */
#define GTM_TOM3_CH2_CM0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM0 *)0xF010988Cu)

/** \\brief  9890, TOM channel 0 CCU1 compare register */
#define GTM_TOM3_CH2_CM1               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM1 *)0xF0109890u)

/** \\brief  9894, TOM channel 0 CCU0 counter register */
#define GTM_TOM3_CH2_CN0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CN0 *)0xF0109894u)

/** \\brief  9880, TOM channel 0 control register */
#define GTM_TOM3_CH2_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL *)0xF0109880u)

/** \\brief  98A0, TOM channel 0 interrupt enable register */
#define GTM_TOM3_CH2_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN *)0xF01098A0u)

/** \\brief  98A4, TOM channel 0 force interrupt register */
#define GTM_TOM3_CH2_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT *)0xF01098A4u)

/** \\brief  98A8, TOM channel 0 interrupt mode register */
#define GTM_TOM3_CH2_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE *)0xF01098A8u)

/** \\brief  989C, TOM channel 0 interrupt notification register */
#define GTM_TOM3_CH2_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY *)0xF010989Cu)

/** \\brief  9884, TOM channel 0 CCU0 compare shadow register */
#define GTM_TOM3_CH2_SR0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR0 *)0xF0109884u)

/** \\brief  9888, TOM channel 0 CCU1 compare shadow register */
#define GTM_TOM3_CH2_SR1               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR1 *)0xF0109888u)

/** \\brief  9898, TOM channel 0 status register */
#define GTM_TOM3_CH2_STAT              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_STAT *)0xF0109898u)

/** \\brief  98CC, TOM channel 0 CCU0 compare register */
#define GTM_TOM3_CH3_CM0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM0 *)0xF01098CCu)

/** \\brief  98D0, TOM channel 0 CCU1 compare register */
#define GTM_TOM3_CH3_CM1               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM1 *)0xF01098D0u)

/** \\brief  98D4, TOM channel 0 CCU0 counter register */
#define GTM_TOM3_CH3_CN0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CN0 *)0xF01098D4u)

/** \\brief  98C0, TOM channel 0 control register */
#define GTM_TOM3_CH3_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL *)0xF01098C0u)

/** \\brief  98E0, TOM channel 0 interrupt enable register */
#define GTM_TOM3_CH3_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN *)0xF01098E0u)

/** \\brief  98E4, TOM channel 0 force interrupt register */
#define GTM_TOM3_CH3_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT *)0xF01098E4u)

/** \\brief  98E8, TOM channel 0 interrupt mode register */
#define GTM_TOM3_CH3_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE *)0xF01098E8u)

/** \\brief  98DC, TOM channel 0 interrupt notification register */
#define GTM_TOM3_CH3_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY *)0xF01098DCu)

/** \\brief  98C4, TOM channel 0 CCU0 compare shadow register */
#define GTM_TOM3_CH3_SR0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR0 *)0xF01098C4u)

/** \\brief  98C8, TOM channel 0 CCU1 compare shadow register */
#define GTM_TOM3_CH3_SR1               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR1 *)0xF01098C8u)

/** \\brief  98D8, TOM channel 0 status register */
#define GTM_TOM3_CH3_STAT              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_STAT *)0xF01098D8u)

/** \\brief  990C, TOM channel 0 CCU0 compare register */
#define GTM_TOM3_CH4_CM0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM0 *)0xF010990Cu)

/** \\brief  9910, TOM channel 0 CCU1 compare register */
#define GTM_TOM3_CH4_CM1               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM1 *)0xF0109910u)

/** \\brief  9914, TOM channel 0 CCU0 counter register */
#define GTM_TOM3_CH4_CN0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CN0 *)0xF0109914u)

/** \\brief  9900, TOM channel 0 control register */
#define GTM_TOM3_CH4_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL *)0xF0109900u)

/** \\brief  9920, TOM channel 0 interrupt enable register */
#define GTM_TOM3_CH4_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN *)0xF0109920u)

/** \\brief  9924, TOM channel 0 force interrupt register */
#define GTM_TOM3_CH4_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT *)0xF0109924u)

/** \\brief  9928, TOM channel 0 interrupt mode register */
#define GTM_TOM3_CH4_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE *)0xF0109928u)

/** \\brief  991C, TOM channel 0 interrupt notification register */
#define GTM_TOM3_CH4_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY *)0xF010991Cu)

/** \\brief  9904, TOM channel 0 CCU0 compare shadow register */
#define GTM_TOM3_CH4_SR0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR0 *)0xF0109904u)

/** \\brief  9908, TOM channel 0 CCU1 compare shadow register */
#define GTM_TOM3_CH4_SR1               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR1 *)0xF0109908u)

/** \\brief  9918, TOM channel 0 status register */
#define GTM_TOM3_CH4_STAT              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_STAT *)0xF0109918u)

/** \\brief  994C, TOM channel 0 CCU0 compare register */
#define GTM_TOM3_CH5_CM0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM0 *)0xF010994Cu)

/** \\brief  9950, TOM channel 0 CCU1 compare register */
#define GTM_TOM3_CH5_CM1               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM1 *)0xF0109950u)

/** \\brief  9954, TOM channel 0 CCU0 counter register */
#define GTM_TOM3_CH5_CN0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CN0 *)0xF0109954u)

/** \\brief  9940, TOM channel 0 control register */
#define GTM_TOM3_CH5_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL *)0xF0109940u)

/** \\brief  9960, TOM channel 0 interrupt enable register */
#define GTM_TOM3_CH5_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN *)0xF0109960u)

