Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  9964, TOM channel 0 force interrupt register */
#define GTM_TOM3_CH5_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT *)0xF0109964u)

/** \\brief  9968, TOM channel 0 interrupt mode register */
#define GTM_TOM3_CH5_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE *)0xF0109968u)

/** \\brief  995C, TOM channel 0 interrupt notification register */
#define GTM_TOM3_CH5_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY *)0xF010995Cu)

/** \\brief  9944, TOM channel 0 CCU0 compare shadow register */
#define GTM_TOM3_CH5_SR0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR0 *)0xF0109944u)

/** \\brief  9948, TOM channel 0 CCU1 compare shadow register */
#define GTM_TOM3_CH5_SR1               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR1 *)0xF0109948u)

/** \\brief  9958, TOM channel 0 status register */
#define GTM_TOM3_CH5_STAT              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_STAT *)0xF0109958u)

/** \\brief  998C, TOM channel 0 CCU0 compare register */
#define GTM_TOM3_CH6_CM0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM0 *)0xF010998Cu)

/** \\brief  9990, TOM channel 0 CCU1 compare register */
#define GTM_TOM3_CH6_CM1               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM1 *)0xF0109990u)

/** \\brief  9994, TOM channel 0 CCU0 counter register */
#define GTM_TOM3_CH6_CN0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CN0 *)0xF0109994u)

/** \\brief  9980, TOM channel 0 control register */
#define GTM_TOM3_CH6_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL *)0xF0109980u)

/** \\brief  99A0, TOM channel 0 interrupt enable register */
#define GTM_TOM3_CH6_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN *)0xF01099A0u)

/** \\brief  99A4, TOM channel 0 force interrupt register */
#define GTM_TOM3_CH6_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT *)0xF01099A4u)

/** \\brief  99A8, TOM channel 0 interrupt mode register */
#define GTM_TOM3_CH6_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE *)0xF01099A8u)

/** \\brief  999C, TOM channel 0 interrupt notification register */
#define GTM_TOM3_CH6_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY *)0xF010999Cu)

/** \\brief  9984, TOM channel 0 CCU0 compare shadow register */
#define GTM_TOM3_CH6_SR0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR0 *)0xF0109984u)

/** \\brief  9988, TOM channel 0 CCU1 compare shadow register */
#define GTM_TOM3_CH6_SR1               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR1 *)0xF0109988u)

/** \\brief  9998, TOM channel 0 status register */
#define GTM_TOM3_CH6_STAT              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_STAT *)0xF0109998u)

/** \\brief  99CC, TOM channel 0 CCU0 compare register */
#define GTM_TOM3_CH7_CM0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM0 *)0xF01099CCu)

/** \\brief  99D0, TOM channel 0 CCU1 compare register */
#define GTM_TOM3_CH7_CM1               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM1 *)0xF01099D0u)

/** \\brief  99D4, TOM channel 0 CCU0 counter register */
#define GTM_TOM3_CH7_CN0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CN0 *)0xF01099D4u)

/** \\brief  99C0, TOM channel 0 control register */
#define GTM_TOM3_CH7_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL *)0xF01099C0u)

/** \\brief  99E0, TOM channel 0 interrupt enable register */
#define GTM_TOM3_CH7_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN *)0xF01099E0u)

/** \\brief  99E4, TOM channel 0 force interrupt register */
#define GTM_TOM3_CH7_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT *)0xF01099E4u)

/** \\brief  99E8, TOM channel 0 interrupt mode register */
#define GTM_TOM3_CH7_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE *)0xF01099E8u)

/** \\brief  99DC, TOM channel 0 interrupt notification register */
#define GTM_TOM3_CH7_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY *)0xF01099DCu)

/** \\brief  99C4, TOM channel 0 CCU0 compare shadow register */
#define GTM_TOM3_CH7_SR0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR0 *)0xF01099C4u)

/** \\brief  99C8, TOM channel 0 CCU1 compare shadow register */
#define GTM_TOM3_CH7_SR1               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR1 *)0xF01099C8u)

/** \\brief  99D8, TOM channel 0 status register */
#define GTM_TOM3_CH7_STAT              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_STAT *)0xF01099D8u)

/** \\brief  9A0C, TOM channel 0 CCU0 compare register */
#define GTM_TOM3_CH8_CM0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM0 *)0xF0109A0Cu)

/** \\brief  9A10, TOM channel 0 CCU1 compare register */
#define GTM_TOM3_CH8_CM1               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM1 *)0xF0109A10u)

/** \\brief  9A14, TOM channel 0 CCU0 counter register */
#define GTM_TOM3_CH8_CN0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CN0 *)0xF0109A14u)

/** \\brief  9A00, TOM channel 0 control register */
#define GTM_TOM3_CH8_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL *)0xF0109A00u)

/** \\brief  9A20, TOM channel 0 interrupt enable register */
#define GTM_TOM3_CH8_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN *)0xF0109A20u)

/** \\brief  9A24, TOM channel 0 force interrupt register */
#define GTM_TOM3_CH8_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT *)0xF0109A24u)

/** \\brief  9A28, TOM channel 0 interrupt mode register */
#define GTM_TOM3_CH8_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE *)0xF0109A28u)

/** \\brief  9A1C, TOM channel 0 interrupt notification register */
#define GTM_TOM3_CH8_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY *)0xF0109A1Cu)

