Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  9A04, TOM channel 0 CCU0 compare shadow register */
#define GTM_TOM3_CH8_SR0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR0 *)0xF0109A04u)

/** \\brief  9A08, TOM channel 0 CCU1 compare shadow register */
#define GTM_TOM3_CH8_SR1               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR1 *)0xF0109A08u)

/** \\brief  9A18, TOM channel 0 status register */
#define GTM_TOM3_CH8_STAT              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_STAT *)0xF0109A18u)

/** \\brief  9A4C, TOM channel 0 CCU0 compare register */
#define GTM_TOM3_CH9_CM0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM0 *)0xF0109A4Cu)

/** \\brief  9A50, TOM channel 0 CCU1 compare register */
#define GTM_TOM3_CH9_CM1               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM1 *)0xF0109A50u)

/** \\brief  9A54, TOM channel 0 CCU0 counter register */
#define GTM_TOM3_CH9_CN0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CN0 *)0xF0109A54u)

/** \\brief  9A40, TOM channel 0 control register */
#define GTM_TOM3_CH9_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL *)0xF0109A40u)

/** \\brief  9A60, TOM channel 0 interrupt enable register */
#define GTM_TOM3_CH9_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN *)0xF0109A60u)

/** \\brief  9A64, TOM channel 0 force interrupt register */
#define GTM_TOM3_CH9_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT *)0xF0109A64u)

/** \\brief  9A68, TOM channel 0 interrupt mode register */
#define GTM_TOM3_CH9_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE *)0xF0109A68u)

/** \\brief  9A5C, TOM channel 0 interrupt notification register */
#define GTM_TOM3_CH9_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY *)0xF0109A5Cu)

/** \\brief  9A44, TOM channel 0 CCU0 compare shadow register */
#define GTM_TOM3_CH9_SR0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR0 *)0xF0109A44u)

/** \\brief  9A48, TOM channel 0 CCU1 compare shadow register */
#define GTM_TOM3_CH9_SR1               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR1 *)0xF0109A48u)

/** \\brief  9A58, TOM channel 0 status register */
#define GTM_TOM3_CH9_STAT              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_STAT *)0xF0109A58u)

/** \\brief  9834, TOM TGC 0 action time base register */
#define GTM_TOM3_TGC0_ACT_TB           /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_TGC0_ACT_TB *)0xF0109834u)

/** \\brief  9870, TOM TGC 0 enable/disable control register */
#define GTM_TOM3_TGC0_ENDIS_CTRL       /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_TGC0_ENDIS_CTRL *)0xF0109870u)

/** \\brief  9874, TOM TGC 0 enable/disable status register */
#define GTM_TOM3_TGC0_ENDIS_STAT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_TGC0_ENDIS_STAT *)0xF0109874u)

/** \\brief  9838, TOM TGC 0 force update control register */
#define GTM_TOM3_TGC0_FUPD_CTRL        /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_TGC0_FUPD_CTRL *)0xF0109838u)

/** \\brief  9830, TOM TGC 0 global control register */
#define GTM_TOM3_TGC0_GLB_CTRL         /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_TGC0_GLB_CTRL *)0xF0109830u)

/** \\brief  983C, TOM TGC 0 internal trigger control register */
#define GTM_TOM3_TGC0_INT_TRIG         /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_TGC0_INT_TRIG *)0xF010983Cu)

/** \\brief  9878, TOM TGC 0 output enable control register */
#define GTM_TOM3_TGC0_OUTEN_CTRL       /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_TGC0_OUTEN_CTRL *)0xF0109878u)

/** \\brief  987C, TOM TGC 0 output enable status register */
#define GTM_TOM3_TGC0_OUTEN_STAT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_TGC0_OUTEN_STAT *)0xF010987Cu)

/** \\brief  9A34, TOM TGC 1 action time base register */
#define GTM_TOM3_TGC1_ACT_TB           /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_TGC1_ACT_TB *)0xF0109A34u)

/** \\brief  9A70, TOM TGC 1 enable/disable control register */
#define GTM_TOM3_TGC1_ENDIS_CTRL       /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_TGC1_ENDIS_CTRL *)0xF0109A70u)

/** \\brief  9A74, TOM TGC 1 enable/disable status register */
#define GTM_TOM3_TGC1_ENDIS_STAT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_TGC1_ENDIS_STAT *)0xF0109A74u)

/** \\brief  9A38, TOM TGC 1 force update control register */
#define GTM_TOM3_TGC1_FUPD_CTRL        /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_TGC1_FUPD_CTRL *)0xF0109A38u)

/** \\brief  9A30, TOM TGC 1 global control register */
#define GTM_TOM3_TGC1_GLB_CTRL         /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_TGC1_GLB_CTRL *)0xF0109A30u)

/** \\brief  9A3C, TOM TGC 1 internal trigger control register */
#define GTM_TOM3_TGC1_INT_TRIG         /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_TGC1_INT_TRIG *)0xF0109A3Cu)

/** \\brief  9A78, TOM TGC 1 output enable control register */
#define GTM_TOM3_TGC1_OUTEN_CTRL       /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_TGC1_OUTEN_CTRL *)0xF0109A78u)

/** \\brief  9A7C, TOM TGC 1 output enable status register */
#define GTM_TOM3_TGC1_OUTEN_STAT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_TGC1_OUTEN_STAT *)0xF0109A7Cu)

/** \\brief  A00C, TOM channel 0 CCU0 compare register */
#define GTM_TOM4_CH0_CM0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM0 *)0xF010A00Cu)

/** \\brief  A010, TOM channel 0 CCU1 compare register */
#define GTM_TOM4_CH0_CM1               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM1 *)0xF010A010u)

/** \\brief  A014, TOM channel 0 CCU0 counter register */
#define GTM_TOM4_CH0_CN0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CN0 *)0xF010A014u)

/** \\brief  A000, TOM channel 0 control register */
#define GTM_TOM4_CH0_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL *)0xF010A000u)

/** \\brief  A020, TOM channel 0 interrupt enable register */
#define GTM_TOM4_CH0_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN *)0xF010A020u)

/** \\brief  A024, TOM channel 0 force interrupt register */
#define GTM_TOM4_CH0_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT *)0xF010A024u)

/** \\brief  A028, TOM channel 0 interrupt mode register */
#define GTM_TOM4_CH0_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE *)0xF010A028u)

/** \\brief  A01C, TOM channel 0 interrupt notification register */
#define GTM_TOM4_CH0_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY *)0xF010A01Cu)

/** \\brief  A004, TOM channel 0 CCU0 compare shadow register */
#define GTM_TOM4_CH0_SR0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR0 *)0xF010A004u)

/** \\brief  A008, TOM channel 0 CCU1 compare shadow register */
#define GTM_TOM4_CH0_SR1               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR1 *)0xF010A008u)

/** \\brief  A018, TOM channel 0 status register */
#define GTM_TOM4_CH0_STAT              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_STAT *)0xF010A018u)

/** \\brief  A28C, TOM channel 0 CCU0 compare register */
#define GTM_TOM4_CH10_CM0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM0 *)0xF010A28Cu)

/** \\brief  A290, TOM channel 0 CCU1 compare register */
#define GTM_TOM4_CH10_CM1              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM1 *)0xF010A290u)

/** \\brief  A294, TOM channel 0 CCU0 counter register */
#define GTM_TOM4_CH10_CN0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CN0 *)0xF010A294u)

/** \\brief  A280, TOM channel 0 control register */
#define GTM_TOM4_CH10_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL *)0xF010A280u)

/** \\brief  A2A0, TOM channel 0 interrupt enable register */
#define GTM_TOM4_CH10_IRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN *)0xF010A2A0u)

/** \\brief  A2A4, TOM channel 0 force interrupt register */
#define GTM_TOM4_CH10_IRQ_FORCINT      /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT *)0xF010A2A4u)

