Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  A2A8, TOM channel 0 interrupt mode register */
#define GTM_TOM4_CH10_IRQ_MODE         /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE *)0xF010A2A8u)

/** \\brief  A29C, TOM channel 0 interrupt notification register */
#define GTM_TOM4_CH10_IRQ_NOTIFY       /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY *)0xF010A29Cu)

/** \\brief  A284, TOM channel 0 CCU0 compare shadow register */
#define GTM_TOM4_CH10_SR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR0 *)0xF010A284u)

/** \\brief  A288, TOM channel 0 CCU1 compare shadow register */
#define GTM_TOM4_CH10_SR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR1 *)0xF010A288u)

/** \\brief  A298, TOM channel 0 status register */
#define GTM_TOM4_CH10_STAT             /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_STAT *)0xF010A298u)

/** \\brief  A2CC, TOM channel 0 CCU0 compare register */
#define GTM_TOM4_CH11_CM0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM0 *)0xF010A2CCu)

/** \\brief  A2D0, TOM channel 0 CCU1 compare register */
#define GTM_TOM4_CH11_CM1              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM1 *)0xF010A2D0u)

/** \\brief  A2D4, TOM channel 0 CCU0 counter register */
#define GTM_TOM4_CH11_CN0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CN0 *)0xF010A2D4u)

/** \\brief  A2C0, TOM channel 0 control register */
#define GTM_TOM4_CH11_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL *)0xF010A2C0u)

/** \\brief  A2E0, TOM channel 0 interrupt enable register */
#define GTM_TOM4_CH11_IRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN *)0xF010A2E0u)

/** \\brief  A2E4, TOM channel 0 force interrupt register */
#define GTM_TOM4_CH11_IRQ_FORCINT      /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT *)0xF010A2E4u)

/** \\brief  A2E8, TOM channel 0 interrupt mode register */
#define GTM_TOM4_CH11_IRQ_MODE         /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE *)0xF010A2E8u)

/** \\brief  A2DC, TOM channel 0 interrupt notification register */
#define GTM_TOM4_CH11_IRQ_NOTIFY       /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY *)0xF010A2DCu)

/** \\brief  A2C4, TOM channel 0 CCU0 compare shadow register */
#define GTM_TOM4_CH11_SR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR0 *)0xF010A2C4u)

/** \\brief  A2C8, TOM channel 0 CCU1 compare shadow register */
#define GTM_TOM4_CH11_SR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR1 *)0xF010A2C8u)

/** \\brief  A2D8, TOM channel 0 status register */
#define GTM_TOM4_CH11_STAT             /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_STAT *)0xF010A2D8u)

/** \\brief  A30C, TOM channel 0 CCU0 compare register */
#define GTM_TOM4_CH12_CM0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM0 *)0xF010A30Cu)

/** \\brief  A310, TOM channel 0 CCU1 compare register */
#define GTM_TOM4_CH12_CM1              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM1 *)0xF010A310u)

/** \\brief  A314, TOM channel 0 CCU0 counter register */
#define GTM_TOM4_CH12_CN0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CN0 *)0xF010A314u)

/** \\brief  A300, TOM channel 0 control register */
#define GTM_TOM4_CH12_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL *)0xF010A300u)

/** \\brief  A320, TOM channel 0 interrupt enable register */
#define GTM_TOM4_CH12_IRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN *)0xF010A320u)

/** \\brief  A324, TOM channel 0 force interrupt register */
#define GTM_TOM4_CH12_IRQ_FORCINT      /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT *)0xF010A324u)

/** \\brief  A328, TOM channel 0 interrupt mode register */
#define GTM_TOM4_CH12_IRQ_MODE         /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE *)0xF010A328u)

/** \\brief  A31C, TOM channel 0 interrupt notification register */
#define GTM_TOM4_CH12_IRQ_NOTIFY       /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY *)0xF010A31Cu)

/** \\brief  A304, TOM channel 0 CCU0 compare shadow register */
#define GTM_TOM4_CH12_SR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR0 *)0xF010A304u)

/** \\brief  A308, TOM channel 0 CCU1 compare shadow register */
#define GTM_TOM4_CH12_SR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR1 *)0xF010A308u)

/** \\brief  A318, TOM channel 0 status register */
#define GTM_TOM4_CH12_STAT             /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_STAT *)0xF010A318u)

/** \\brief  A34C, TOM channel 0 CCU0 compare register */
#define GTM_TOM4_CH13_CM0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM0 *)0xF010A34Cu)

/** \\brief  A350, TOM channel 0 CCU1 compare register */
#define GTM_TOM4_CH13_CM1              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM1 *)0xF010A350u)

/** \\brief  A354, TOM channel 0 CCU0 counter register */
#define GTM_TOM4_CH13_CN0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CN0 *)0xF010A354u)

/** \\brief  A340, TOM channel 0 control register */
#define GTM_TOM4_CH13_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL *)0xF010A340u)

/** \\brief  A360, TOM channel 0 interrupt enable register */
#define GTM_TOM4_CH13_IRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN *)0xF010A360u)

/** \\brief  A364, TOM channel 0 force interrupt register */
#define GTM_TOM4_CH13_IRQ_FORCINT      /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT *)0xF010A364u)

/** \\brief  A368, TOM channel 0 interrupt mode register */
#define GTM_TOM4_CH13_IRQ_MODE         /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE *)0xF010A368u)

/** \\brief  A35C, TOM channel 0 interrupt notification register */
#define GTM_TOM4_CH13_IRQ_NOTIFY       /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY *)0xF010A35Cu)

/** \\brief  A344, TOM channel 0 CCU0 compare shadow register */
#define GTM_TOM4_CH13_SR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR0 *)0xF010A344u)

/** \\brief  A348, TOM channel 0 CCU1 compare shadow register */
#define GTM_TOM4_CH13_SR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR1 *)0xF010A348u)

