Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  A358, TOM channel 0 status register */
#define GTM_TOM4_CH13_STAT             /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_STAT *)0xF010A358u)

/** \\brief  A38C, TOM channel 0 CCU0 compare register */
#define GTM_TOM4_CH14_CM0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM0 *)0xF010A38Cu)

/** \\brief  A390, TOM channel 0 CCU1 compare register */
#define GTM_TOM4_CH14_CM1              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM1 *)0xF010A390u)

/** \\brief  A394, TOM channel 0 CCU0 counter register */
#define GTM_TOM4_CH14_CN0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CN0 *)0xF010A394u)

/** \\brief  A380, TOM channel 0 control register */
#define GTM_TOM4_CH14_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL *)0xF010A380u)

/** \\brief  A3A0, TOM channel 0 interrupt enable register */
#define GTM_TOM4_CH14_IRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN *)0xF010A3A0u)

/** \\brief  A3A4, TOM channel 0 force interrupt register */
#define GTM_TOM4_CH14_IRQ_FORCINT      /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT *)0xF010A3A4u)

/** \\brief  A3A8, TOM channel 0 interrupt mode register */
#define GTM_TOM4_CH14_IRQ_MODE         /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE *)0xF010A3A8u)

/** \\brief  A39C, TOM channel 0 interrupt notification register */
#define GTM_TOM4_CH14_IRQ_NOTIFY       /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY *)0xF010A39Cu)

/** \\brief  A384, TOM channel 0 CCU0 compare shadow register */
#define GTM_TOM4_CH14_SR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR0 *)0xF010A384u)

/** \\brief  A388, TOM channel 0 CCU1 compare shadow register */
#define GTM_TOM4_CH14_SR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR1 *)0xF010A388u)

/** \\brief  A398, TOM channel 0 status register */
#define GTM_TOM4_CH14_STAT             /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_STAT *)0xF010A398u)

/** \\brief  A3CC, TOM channel 0 CCU0 compare register */
#define GTM_TOM4_CH15_CM0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM0 *)0xF010A3CCu)

/** \\brief  A3D0, TOM channel 0 CCU1 compare register */
#define GTM_TOM4_CH15_CM1              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM1 *)0xF010A3D0u)

/** \\brief  A3D4, TOM channel 0 CCU0 counter register */
#define GTM_TOM4_CH15_CN0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CN0 *)0xF010A3D4u)

/** \\brief  A3C0, TOM channel 0 control register */
#define GTM_TOM4_CH15_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL *)0xF010A3C0u)

/** \\brief  A3E0, TOM channel 0 interrupt enable register */
#define GTM_TOM4_CH15_IRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN *)0xF010A3E0u)

/** \\brief  A3E4, TOM channel 0 force interrupt register */
#define GTM_TOM4_CH15_IRQ_FORCINT      /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT *)0xF010A3E4u)

/** \\brief  A3E8, TOM channel 0 interrupt mode register */
#define GTM_TOM4_CH15_IRQ_MODE         /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE *)0xF010A3E8u)

/** \\brief  A3DC, TOM channel 0 interrupt notification register */
#define GTM_TOM4_CH15_IRQ_NOTIFY       /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY *)0xF010A3DCu)

/** \\brief  A3C4, TOM channel 0 CCU0 compare shadow register */
#define GTM_TOM4_CH15_SR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR0 *)0xF010A3C4u)

/** \\brief  A3C8, TOM channel 0 CCU1 compare shadow register */
#define GTM_TOM4_CH15_SR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR1 *)0xF010A3C8u)

/** \\brief  A3D8, TOM channel 0 status register */
#define GTM_TOM4_CH15_STAT             /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_STAT *)0xF010A3D8u)

/** \\brief  A04C, TOM channel 0 CCU0 compare register */
#define GTM_TOM4_CH1_CM0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM0 *)0xF010A04Cu)

/** \\brief  A050, TOM channel 0 CCU1 compare register */
#define GTM_TOM4_CH1_CM1               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM1 *)0xF010A050u)

/** \\brief  A054, TOM channel 0 CCU0 counter register */
#define GTM_TOM4_CH1_CN0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CN0 *)0xF010A054u)

/** \\brief  A040, TOM channel 0 control register */
#define GTM_TOM4_CH1_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL *)0xF010A040u)

/** \\brief  A060, TOM channel 0 interrupt enable register */
#define GTM_TOM4_CH1_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN *)0xF010A060u)

/** \\brief  A064, TOM channel 0 force interrupt register */
#define GTM_TOM4_CH1_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT *)0xF010A064u)

/** \\brief  A068, TOM channel 0 interrupt mode register */
#define GTM_TOM4_CH1_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE *)0xF010A068u)

/** \\brief  A05C, TOM channel 0 interrupt notification register */
#define GTM_TOM4_CH1_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY *)0xF010A05Cu)

/** \\brief  A044, TOM channel 0 CCU0 compare shadow register */
#define GTM_TOM4_CH1_SR0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR0 *)0xF010A044u)

/** \\brief  A048, TOM channel 0 CCU1 compare shadow register */
#define GTM_TOM4_CH1_SR1               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR1 *)0xF010A048u)

/** \\brief  A058, TOM channel 0 status register */
#define GTM_TOM4_CH1_STAT              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_STAT *)0xF010A058u)

/** \\brief  A08C, TOM channel 0 CCU0 compare register */
#define GTM_TOM4_CH2_CM0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM0 *)0xF010A08Cu)

/** \\brief  A090, TOM channel 0 CCU1 compare register */
#define GTM_TOM4_CH2_CM1               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM1 *)0xF010A090u)

/** \\brief  A094, TOM channel 0 CCU0 counter register */
#define GTM_TOM4_CH2_CN0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CN0 *)0xF010A094u)

