Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  A080, TOM channel 0 control register */
#define GTM_TOM4_CH2_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL *)0xF010A080u)

/** \\brief  A0A0, TOM channel 0 interrupt enable register */
#define GTM_TOM4_CH2_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN *)0xF010A0A0u)

/** \\brief  A0A4, TOM channel 0 force interrupt register */
#define GTM_TOM4_CH2_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT *)0xF010A0A4u)

/** \\brief  A0A8, TOM channel 0 interrupt mode register */
#define GTM_TOM4_CH2_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE *)0xF010A0A8u)

/** \\brief  A09C, TOM channel 0 interrupt notification register */
#define GTM_TOM4_CH2_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY *)0xF010A09Cu)

/** \\brief  A084, TOM channel 0 CCU0 compare shadow register */
#define GTM_TOM4_CH2_SR0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR0 *)0xF010A084u)

/** \\brief  A088, TOM channel 0 CCU1 compare shadow register */
#define GTM_TOM4_CH2_SR1               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR1 *)0xF010A088u)

/** \\brief  A098, TOM channel 0 status register */
#define GTM_TOM4_CH2_STAT              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_STAT *)0xF010A098u)

/** \\brief  A0CC, TOM channel 0 CCU0 compare register */
#define GTM_TOM4_CH3_CM0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM0 *)0xF010A0CCu)

/** \\brief  A0D0, TOM channel 0 CCU1 compare register */
#define GTM_TOM4_CH3_CM1               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM1 *)0xF010A0D0u)

/** \\brief  A0D4, TOM channel 0 CCU0 counter register */
#define GTM_TOM4_CH3_CN0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CN0 *)0xF010A0D4u)

/** \\brief  A0C0, TOM channel 0 control register */
#define GTM_TOM4_CH3_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL *)0xF010A0C0u)

/** \\brief  A0E0, TOM channel 0 interrupt enable register */
#define GTM_TOM4_CH3_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN *)0xF010A0E0u)

/** \\brief  A0E4, TOM channel 0 force interrupt register */
#define GTM_TOM4_CH3_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT *)0xF010A0E4u)

/** \\brief  A0E8, TOM channel 0 interrupt mode register */
#define GTM_TOM4_CH3_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE *)0xF010A0E8u)

/** \\brief  A0DC, TOM channel 0 interrupt notification register */
#define GTM_TOM4_CH3_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY *)0xF010A0DCu)

/** \\brief  A0C4, TOM channel 0 CCU0 compare shadow register */
#define GTM_TOM4_CH3_SR0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR0 *)0xF010A0C4u)

/** \\brief  A0C8, TOM channel 0 CCU1 compare shadow register */
#define GTM_TOM4_CH3_SR1               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR1 *)0xF010A0C8u)

/** \\brief  A0D8, TOM channel 0 status register */
#define GTM_TOM4_CH3_STAT              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_STAT *)0xF010A0D8u)

/** \\brief  A10C, TOM channel 0 CCU0 compare register */
#define GTM_TOM4_CH4_CM0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM0 *)0xF010A10Cu)

/** \\brief  A110, TOM channel 0 CCU1 compare register */
#define GTM_TOM4_CH4_CM1               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM1 *)0xF010A110u)

/** \\brief  A114, TOM channel 0 CCU0 counter register */
#define GTM_TOM4_CH4_CN0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CN0 *)0xF010A114u)

/** \\brief  A100, TOM channel 0 control register */
#define GTM_TOM4_CH4_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL *)0xF010A100u)

/** \\brief  A120, TOM channel 0 interrupt enable register */
#define GTM_TOM4_CH4_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN *)0xF010A120u)

/** \\brief  A124, TOM channel 0 force interrupt register */
#define GTM_TOM4_CH4_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT *)0xF010A124u)

/** \\brief  A128, TOM channel 0 interrupt mode register */
#define GTM_TOM4_CH4_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE *)0xF010A128u)

/** \\brief  A11C, TOM channel 0 interrupt notification register */
#define GTM_TOM4_CH4_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY *)0xF010A11Cu)

/** \\brief  A104, TOM channel 0 CCU0 compare shadow register */
#define GTM_TOM4_CH4_SR0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR0 *)0xF010A104u)

/** \\brief  A108, TOM channel 0 CCU1 compare shadow register */
#define GTM_TOM4_CH4_SR1               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR1 *)0xF010A108u)

/** \\brief  A118, TOM channel 0 status register */
#define GTM_TOM4_CH4_STAT              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_STAT *)0xF010A118u)

/** \\brief  A14C, TOM channel 0 CCU0 compare register */
#define GTM_TOM4_CH5_CM0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM0 *)0xF010A14Cu)

/** \\brief  A150, TOM channel 0 CCU1 compare register */
#define GTM_TOM4_CH5_CM1               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM1 *)0xF010A150u)

/** \\brief  A154, TOM channel 0 CCU0 counter register */
#define GTM_TOM4_CH5_CN0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CN0 *)0xF010A154u)

/** \\brief  A140, TOM channel 0 control register */
#define GTM_TOM4_CH5_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL *)0xF010A140u)

/** \\brief  A160, TOM channel 0 interrupt enable register */
#define GTM_TOM4_CH5_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN *)0xF010A160u)

/** \\brief  A164, TOM channel 0 force interrupt register */
#define GTM_TOM4_CH5_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT *)0xF010A164u)

/** \\brief  A168, TOM channel 0 interrupt mode register */
#define GTM_TOM4_CH5_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE *)0xF010A168u)

/** \\brief  A15C, TOM channel 0 interrupt notification register */
#define GTM_TOM4_CH5_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY *)0xF010A15Cu)

