Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  A144, TOM channel 0 CCU0 compare shadow register */
#define GTM_TOM4_CH5_SR0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR0 *)0xF010A144u)

/** \\brief  A148, TOM channel 0 CCU1 compare shadow register */
#define GTM_TOM4_CH5_SR1               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR1 *)0xF010A148u)

/** \\brief  A158, TOM channel 0 status register */
#define GTM_TOM4_CH5_STAT              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_STAT *)0xF010A158u)

/** \\brief  A18C, TOM channel 0 CCU0 compare register */
#define GTM_TOM4_CH6_CM0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM0 *)0xF010A18Cu)

/** \\brief  A190, TOM channel 0 CCU1 compare register */
#define GTM_TOM4_CH6_CM1               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM1 *)0xF010A190u)

/** \\brief  A194, TOM channel 0 CCU0 counter register */
#define GTM_TOM4_CH6_CN0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CN0 *)0xF010A194u)

/** \\brief  A180, TOM channel 0 control register */
#define GTM_TOM4_CH6_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL *)0xF010A180u)

/** \\brief  A1A0, TOM channel 0 interrupt enable register */
#define GTM_TOM4_CH6_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN *)0xF010A1A0u)

/** \\brief  A1A4, TOM channel 0 force interrupt register */
#define GTM_TOM4_CH6_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT *)0xF010A1A4u)

/** \\brief  A1A8, TOM channel 0 interrupt mode register */
#define GTM_TOM4_CH6_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE *)0xF010A1A8u)

/** \\brief  A19C, TOM channel 0 interrupt notification register */
#define GTM_TOM4_CH6_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY *)0xF010A19Cu)

/** \\brief  A184, TOM channel 0 CCU0 compare shadow register */
#define GTM_TOM4_CH6_SR0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR0 *)0xF010A184u)

/** \\brief  A188, TOM channel 0 CCU1 compare shadow register */
#define GTM_TOM4_CH6_SR1               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR1 *)0xF010A188u)

/** \\brief  A198, TOM channel 0 status register */
#define GTM_TOM4_CH6_STAT              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_STAT *)0xF010A198u)

/** \\brief  A1CC, TOM channel 0 CCU0 compare register */
#define GTM_TOM4_CH7_CM0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM0 *)0xF010A1CCu)

/** \\brief  A1D0, TOM channel 0 CCU1 compare register */
#define GTM_TOM4_CH7_CM1               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM1 *)0xF010A1D0u)

/** \\brief  A1D4, TOM channel 0 CCU0 counter register */
#define GTM_TOM4_CH7_CN0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CN0 *)0xF010A1D4u)

/** \\brief  A1C0, TOM channel 0 control register */
#define GTM_TOM4_CH7_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL *)0xF010A1C0u)

/** \\brief  A1E0, TOM channel 0 interrupt enable register */
#define GTM_TOM4_CH7_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN *)0xF010A1E0u)

/** \\brief  A1E4, TOM channel 0 force interrupt register */
#define GTM_TOM4_CH7_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT *)0xF010A1E4u)

/** \\brief  A1E8, TOM channel 0 interrupt mode register */
#define GTM_TOM4_CH7_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE *)0xF010A1E8u)

/** \\brief  A1DC, TOM channel 0 interrupt notification register */
#define GTM_TOM4_CH7_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY *)0xF010A1DCu)

/** \\brief  A1C4, TOM channel 0 CCU0 compare shadow register */
#define GTM_TOM4_CH7_SR0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR0 *)0xF010A1C4u)

/** \\brief  A1C8, TOM channel 0 CCU1 compare shadow register */
#define GTM_TOM4_CH7_SR1               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR1 *)0xF010A1C8u)

/** \\brief  A1D8, TOM channel 0 status register */
#define GTM_TOM4_CH7_STAT              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_STAT *)0xF010A1D8u)

/** \\brief  A20C, TOM channel 0 CCU0 compare register */
#define GTM_TOM4_CH8_CM0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM0 *)0xF010A20Cu)

/** \\brief  A210, TOM channel 0 CCU1 compare register */
#define GTM_TOM4_CH8_CM1               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM1 *)0xF010A210u)

/** \\brief  A214, TOM channel 0 CCU0 counter register */
#define GTM_TOM4_CH8_CN0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CN0 *)0xF010A214u)

/** \\brief  A200, TOM channel 0 control register */
#define GTM_TOM4_CH8_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL *)0xF010A200u)

/** \\brief  A220, TOM channel 0 interrupt enable register */
#define GTM_TOM4_CH8_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN *)0xF010A220u)

/** \\brief  A224, TOM channel 0 force interrupt register */
#define GTM_TOM4_CH8_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT *)0xF010A224u)

/** \\brief  A228, TOM channel 0 interrupt mode register */
#define GTM_TOM4_CH8_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE *)0xF010A228u)

/** \\brief  A21C, TOM channel 0 interrupt notification register */
#define GTM_TOM4_CH8_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY *)0xF010A21Cu)

/** \\brief  A204, TOM channel 0 CCU0 compare shadow register */
#define GTM_TOM4_CH8_SR0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR0 *)0xF010A204u)

/** \\brief  A208, TOM channel 0 CCU1 compare shadow register */
#define GTM_TOM4_CH8_SR1               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR1 *)0xF010A208u)

/** \\brief  A218, TOM channel 0 status register */
#define GTM_TOM4_CH8_STAT              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_STAT *)0xF010A218u)

/** \\brief  A24C, TOM channel 0 CCU0 compare register */
#define GTM_TOM4_CH9_CM0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM0 *)0xF010A24Cu)

/** \\brief  A250, TOM channel 0 CCU1 compare register */
#define GTM_TOM4_CH9_CM1               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM1 *)0xF010A250u)

/** \\brief  A254, TOM channel 0 CCU0 counter register */
#define GTM_TOM4_CH9_CN0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CN0 *)0xF010A254u)

