Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  A240, TOM channel 0 control register */
#define GTM_TOM4_CH9_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL *)0xF010A240u)

/** \\brief  A260, TOM channel 0 interrupt enable register */
#define GTM_TOM4_CH9_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN *)0xF010A260u)

/** \\brief  A264, TOM channel 0 force interrupt register */
#define GTM_TOM4_CH9_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT *)0xF010A264u)

/** \\brief  A268, TOM channel 0 interrupt mode register */
#define GTM_TOM4_CH9_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE *)0xF010A268u)

/** \\brief  A25C, TOM channel 0 interrupt notification register */
#define GTM_TOM4_CH9_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY *)0xF010A25Cu)

/** \\brief  A244, TOM channel 0 CCU0 compare shadow register */
#define GTM_TOM4_CH9_SR0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR0 *)0xF010A244u)

/** \\brief  A248, TOM channel 0 CCU1 compare shadow register */
#define GTM_TOM4_CH9_SR1               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR1 *)0xF010A248u)

/** \\brief  A258, TOM channel 0 status register */
#define GTM_TOM4_CH9_STAT              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_STAT *)0xF010A258u)

/** \\brief  A034, TOM TGC 0 action time base register */
#define GTM_TOM4_TGC0_ACT_TB           /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_TGC0_ACT_TB *)0xF010A034u)

/** \\brief  A070, TOM TGC 0 enable/disable control register */
#define GTM_TOM4_TGC0_ENDIS_CTRL       /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_TGC0_ENDIS_CTRL *)0xF010A070u)

/** \\brief  A074, TOM TGC 0 enable/disable status register */
#define GTM_TOM4_TGC0_ENDIS_STAT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_TGC0_ENDIS_STAT *)0xF010A074u)

/** \\brief  A038, TOM TGC 0 force update control register */
#define GTM_TOM4_TGC0_FUPD_CTRL        /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_TGC0_FUPD_CTRL *)0xF010A038u)

/** \\brief  A030, TOM TGC 0 global control register */
#define GTM_TOM4_TGC0_GLB_CTRL         /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_TGC0_GLB_CTRL *)0xF010A030u)

/** \\brief  A03C, TOM TGC 0 internal trigger control register */
#define GTM_TOM4_TGC0_INT_TRIG         /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_TGC0_INT_TRIG *)0xF010A03Cu)

/** \\brief  A078, TOM TGC 0 output enable control register */
#define GTM_TOM4_TGC0_OUTEN_CTRL       /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_TGC0_OUTEN_CTRL *)0xF010A078u)

/** \\brief  A07C, TOM TGC 0 output enable status register */
#define GTM_TOM4_TGC0_OUTEN_STAT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_TGC0_OUTEN_STAT *)0xF010A07Cu)

/** \\brief  A234, TOM TGC 1 action time base register */
#define GTM_TOM4_TGC1_ACT_TB           /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_TGC1_ACT_TB *)0xF010A234u)

/** \\brief  A270, TOM TGC 1 enable/disable control register */
#define GTM_TOM4_TGC1_ENDIS_CTRL       /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_TGC1_ENDIS_CTRL *)0xF010A270u)

/** \\brief  A274, TOM TGC 1 enable/disable status register */
#define GTM_TOM4_TGC1_ENDIS_STAT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_TGC1_ENDIS_STAT *)0xF010A274u)

/** \\brief  A238, TOM TGC 1 force update control register */
#define GTM_TOM4_TGC1_FUPD_CTRL        /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_TGC1_FUPD_CTRL *)0xF010A238u)

/** \\brief  A230, TOM TGC 1 global control register */
#define GTM_TOM4_TGC1_GLB_CTRL         /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_TGC1_GLB_CTRL *)0xF010A230u)

/** \\brief  A23C, TOM TGC 1 internal trigger control register */
#define GTM_TOM4_TGC1_INT_TRIG         /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_TGC1_INT_TRIG *)0xF010A23Cu)

/** \\brief  A278, TOM TGC 1 output enable control register */
#define GTM_TOM4_TGC1_OUTEN_CTRL       /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_TGC1_OUTEN_CTRL *)0xF010A278u)

/** \\brief  A27C, TOM TGC 1 output enable status register */
#define GTM_TOM4_TGC1_OUTEN_STAT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_TGC1_OUTEN_STAT *)0xF010A27Cu)

/** \\brief  A80C, TOM channel 0 CCU0 compare register */
#define GTM_TOM5_CH0_CM0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM0 *)0xF010A80Cu)

/** \\brief  A810, TOM channel 0 CCU1 compare register */
#define GTM_TOM5_CH0_CM1               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM1 *)0xF010A810u)

/** \\brief  A814, TOM channel 0 CCU0 counter register */
#define GTM_TOM5_CH0_CN0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CN0 *)0xF010A814u)

/** \\brief  A800, TOM channel 0 control register */
#define GTM_TOM5_CH0_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL *)0xF010A800u)

/** \\brief  A820, TOM channel 0 interrupt enable register */
#define GTM_TOM5_CH0_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN *)0xF010A820u)

/** \\brief  A824, TOM channel 0 force interrupt register */
#define GTM_TOM5_CH0_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT *)0xF010A824u)

/** \\brief  A828, TOM channel 0 interrupt mode register */
#define GTM_TOM5_CH0_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE *)0xF010A828u)

/** \\brief  A81C, TOM channel 0 interrupt notification register */
#define GTM_TOM5_CH0_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY *)0xF010A81Cu)

/** \\brief  A804, TOM channel 0 CCU0 compare shadow register */
#define GTM_TOM5_CH0_SR0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR0 *)0xF010A804u)

/** \\brief  A808, TOM channel 0 CCU1 compare shadow register */
#define GTM_TOM5_CH0_SR1               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR1 *)0xF010A808u)

/** \\brief  A818, TOM channel 0 status register */
#define GTM_TOM5_CH0_STAT              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_STAT *)0xF010A818u)

/** \\brief  AA8C, TOM channel 0 CCU0 compare register */
#define GTM_TOM5_CH10_CM0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM0 *)0xF010AA8Cu)

