Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  AA90, TOM channel 0 CCU1 compare register */
#define GTM_TOM5_CH10_CM1              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM1 *)0xF010AA90u)

/** \\brief  AA94, TOM channel 0 CCU0 counter register */
#define GTM_TOM5_CH10_CN0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CN0 *)0xF010AA94u)

/** \\brief  AA80, TOM channel 0 control register */
#define GTM_TOM5_CH10_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL *)0xF010AA80u)

/** \\brief  AAA0, TOM channel 0 interrupt enable register */
#define GTM_TOM5_CH10_IRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN *)0xF010AAA0u)

/** \\brief  AAA4, TOM channel 0 force interrupt register */
#define GTM_TOM5_CH10_IRQ_FORCINT      /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT *)0xF010AAA4u)

/** \\brief  AAA8, TOM channel 0 interrupt mode register */
#define GTM_TOM5_CH10_IRQ_MODE         /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE *)0xF010AAA8u)

/** \\brief  AA9C, TOM channel 0 interrupt notification register */
#define GTM_TOM5_CH10_IRQ_NOTIFY       /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY *)0xF010AA9Cu)

/** \\brief  AA84, TOM channel 0 CCU0 compare shadow register */
#define GTM_TOM5_CH10_SR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR0 *)0xF010AA84u)

/** \\brief  AA88, TOM channel 0 CCU1 compare shadow register */
#define GTM_TOM5_CH10_SR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR1 *)0xF010AA88u)

/** \\brief  AA98, TOM channel 0 status register */
#define GTM_TOM5_CH10_STAT             /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_STAT *)0xF010AA98u)

/** \\brief  AACC, TOM channel 0 CCU0 compare register */
#define GTM_TOM5_CH11_CM0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM0 *)0xF010AACCu)

/** \\brief  AAD0, TOM channel 0 CCU1 compare register */
#define GTM_TOM5_CH11_CM1              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM1 *)0xF010AAD0u)

/** \\brief  AAD4, TOM channel 0 CCU0 counter register */
#define GTM_TOM5_CH11_CN0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CN0 *)0xF010AAD4u)

/** \\brief  AAC0, TOM channel 0 control register */
#define GTM_TOM5_CH11_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL *)0xF010AAC0u)

/** \\brief  AAE0, TOM channel 0 interrupt enable register */
#define GTM_TOM5_CH11_IRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN *)0xF010AAE0u)

/** \\brief  AAE4, TOM channel 0 force interrupt register */
#define GTM_TOM5_CH11_IRQ_FORCINT      /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT *)0xF010AAE4u)

/** \\brief  AAE8, TOM channel 0 interrupt mode register */
#define GTM_TOM5_CH11_IRQ_MODE         /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE *)0xF010AAE8u)

/** \\brief  AADC, TOM channel 0 interrupt notification register */
#define GTM_TOM5_CH11_IRQ_NOTIFY       /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY *)0xF010AADCu)

/** \\brief  AAC4, TOM channel 0 CCU0 compare shadow register */
#define GTM_TOM5_CH11_SR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR0 *)0xF010AAC4u)

/** \\brief  AAC8, TOM channel 0 CCU1 compare shadow register */
#define GTM_TOM5_CH11_SR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR1 *)0xF010AAC8u)

/** \\brief  AAD8, TOM channel 0 status register */
#define GTM_TOM5_CH11_STAT             /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_STAT *)0xF010AAD8u)

/** \\brief  AB0C, TOM channel 0 CCU0 compare register */
#define GTM_TOM5_CH12_CM0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM0 *)0xF010AB0Cu)

/** \\brief  AB10, TOM channel 0 CCU1 compare register */
#define GTM_TOM5_CH12_CM1              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM1 *)0xF010AB10u)

/** \\brief  AB14, TOM channel 0 CCU0 counter register */
#define GTM_TOM5_CH12_CN0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CN0 *)0xF010AB14u)

/** \\brief  AB00, TOM channel 0 control register */
#define GTM_TOM5_CH12_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL *)0xF010AB00u)

/** \\brief  AB20, TOM channel 0 interrupt enable register */
#define GTM_TOM5_CH12_IRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN *)0xF010AB20u)

/** \\brief  AB24, TOM channel 0 force interrupt register */
#define GTM_TOM5_CH12_IRQ_FORCINT      /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT *)0xF010AB24u)

/** \\brief  AB28, TOM channel 0 interrupt mode register */
#define GTM_TOM5_CH12_IRQ_MODE         /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE *)0xF010AB28u)

/** \\brief  AB1C, TOM channel 0 interrupt notification register */
#define GTM_TOM5_CH12_IRQ_NOTIFY       /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY *)0xF010AB1Cu)

/** \\brief  AB04, TOM channel 0 CCU0 compare shadow register */
#define GTM_TOM5_CH12_SR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR0 *)0xF010AB04u)

/** \\brief  AB08, TOM channel 0 CCU1 compare shadow register */
#define GTM_TOM5_CH12_SR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR1 *)0xF010AB08u)

/** \\brief  AB18, TOM channel 0 status register */
#define GTM_TOM5_CH12_STAT             /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_STAT *)0xF010AB18u)

/** \\brief  AB4C, TOM channel 0 CCU0 compare register */
#define GTM_TOM5_CH13_CM0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM0 *)0xF010AB4Cu)

/** \\brief  AB50, TOM channel 0 CCU1 compare register */
#define GTM_TOM5_CH13_CM1              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM1 *)0xF010AB50u)

/** \\brief  AB54, TOM channel 0 CCU0 counter register */
#define GTM_TOM5_CH13_CN0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CN0 *)0xF010AB54u)

/** \\brief  AB40, TOM channel 0 control register */
#define GTM_TOM5_CH13_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL *)0xF010AB40u)

/** \\brief  AB60, TOM channel 0 interrupt enable register */
#define GTM_TOM5_CH13_IRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN *)0xF010AB60u)

