Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  AB64, TOM channel 0 force interrupt register */
#define GTM_TOM5_CH13_IRQ_FORCINT      /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT *)0xF010AB64u)

/** \\brief  AB68, TOM channel 0 interrupt mode register */
#define GTM_TOM5_CH13_IRQ_MODE         /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE *)0xF010AB68u)

/** \\brief  AB5C, TOM channel 0 interrupt notification register */
#define GTM_TOM5_CH13_IRQ_NOTIFY       /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY *)0xF010AB5Cu)

/** \\brief  AB44, TOM channel 0 CCU0 compare shadow register */
#define GTM_TOM5_CH13_SR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR0 *)0xF010AB44u)

/** \\brief  AB48, TOM channel 0 CCU1 compare shadow register */
#define GTM_TOM5_CH13_SR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR1 *)0xF010AB48u)

/** \\brief  AB58, TOM channel 0 status register */
#define GTM_TOM5_CH13_STAT             /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_STAT *)0xF010AB58u)

/** \\brief  AB8C, TOM channel 0 CCU0 compare register */
#define GTM_TOM5_CH14_CM0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM0 *)0xF010AB8Cu)

/** \\brief  AB90, TOM channel 0 CCU1 compare register */
#define GTM_TOM5_CH14_CM1              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM1 *)0xF010AB90u)

/** \\brief  AB94, TOM channel 0 CCU0 counter register */
#define GTM_TOM5_CH14_CN0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CN0 *)0xF010AB94u)

/** \\brief  AB80, TOM channel 0 control register */
#define GTM_TOM5_CH14_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL *)0xF010AB80u)

/** \\brief  ABA0, TOM channel 0 interrupt enable register */
#define GTM_TOM5_CH14_IRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN *)0xF010ABA0u)

/** \\brief  ABA4, TOM channel 0 force interrupt register */
#define GTM_TOM5_CH14_IRQ_FORCINT      /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT *)0xF010ABA4u)

/** \\brief  ABA8, TOM channel 0 interrupt mode register */
#define GTM_TOM5_CH14_IRQ_MODE         /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE *)0xF010ABA8u)

/** \\brief  AB9C, TOM channel 0 interrupt notification register */
#define GTM_TOM5_CH14_IRQ_NOTIFY       /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY *)0xF010AB9Cu)

/** \\brief  AB84, TOM channel 0 CCU0 compare shadow register */
#define GTM_TOM5_CH14_SR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR0 *)0xF010AB84u)

/** \\brief  AB88, TOM channel 0 CCU1 compare shadow register */
#define GTM_TOM5_CH14_SR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR1 *)0xF010AB88u)

/** \\brief  AB98, TOM channel 0 status register */
#define GTM_TOM5_CH14_STAT             /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_STAT *)0xF010AB98u)

/** \\brief  ABCC, TOM channel 0 CCU0 compare register */
#define GTM_TOM5_CH15_CM0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM0 *)0xF010ABCCu)

/** \\brief  ABD0, TOM channel 0 CCU1 compare register */
#define GTM_TOM5_CH15_CM1              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM1 *)0xF010ABD0u)

/** \\brief  ABD4, TOM channel 0 CCU0 counter register */
#define GTM_TOM5_CH15_CN0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CN0 *)0xF010ABD4u)

/** \\brief  ABC0, TOM channel 0 control register */
#define GTM_TOM5_CH15_CTRL             /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL *)0xF010ABC0u)

/** \\brief  ABE0, TOM channel 0 interrupt enable register */
#define GTM_TOM5_CH15_IRQ_EN           /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN *)0xF010ABE0u)

/** \\brief  ABE4, TOM channel 0 force interrupt register */
#define GTM_TOM5_CH15_IRQ_FORCINT      /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT *)0xF010ABE4u)

/** \\brief  ABE8, TOM channel 0 interrupt mode register */
#define GTM_TOM5_CH15_IRQ_MODE         /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE *)0xF010ABE8u)

/** \\brief  ABDC, TOM channel 0 interrupt notification register */
#define GTM_TOM5_CH15_IRQ_NOTIFY       /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY *)0xF010ABDCu)

/** \\brief  ABC4, TOM channel 0 CCU0 compare shadow register */
#define GTM_TOM5_CH15_SR0              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR0 *)0xF010ABC4u)

/** \\brief  ABC8, TOM channel 0 CCU1 compare shadow register */
#define GTM_TOM5_CH15_SR1              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR1 *)0xF010ABC8u)

/** \\brief  ABD8, TOM channel 0 status register */
#define GTM_TOM5_CH15_STAT             /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_STAT *)0xF010ABD8u)

/** \\brief  A84C, TOM channel 0 CCU0 compare register */
#define GTM_TOM5_CH1_CM0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM0 *)0xF010A84Cu)

/** \\brief  A850, TOM channel 0 CCU1 compare register */
#define GTM_TOM5_CH1_CM1               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM1 *)0xF010A850u)

/** \\brief  A854, TOM channel 0 CCU0 counter register */
#define GTM_TOM5_CH1_CN0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CN0 *)0xF010A854u)

/** \\brief  A840, TOM channel 0 control register */
#define GTM_TOM5_CH1_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL *)0xF010A840u)

/** \\brief  A860, TOM channel 0 interrupt enable register */
#define GTM_TOM5_CH1_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN *)0xF010A860u)

/** \\brief  A864, TOM channel 0 force interrupt register */
#define GTM_TOM5_CH1_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT *)0xF010A864u)

/** \\brief  A868, TOM channel 0 interrupt mode register */
#define GTM_TOM5_CH1_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE *)0xF010A868u)

/** \\brief  A85C, TOM channel 0 interrupt notification register */
#define GTM_TOM5_CH1_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY *)0xF010A85Cu)

/** \\brief  A844, TOM channel 0 CCU0 compare shadow register */
#define GTM_TOM5_CH1_SR0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR0 *)0xF010A844u)

/** \\brief  A848, TOM channel 0 CCU1 compare shadow register */
#define GTM_TOM5_CH1_SR1               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR1 *)0xF010A848u)

/** \\brief  A858, TOM channel 0 status register */
#define GTM_TOM5_CH1_STAT              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_STAT *)0xF010A858u)

/** \\brief  A88C, TOM channel 0 CCU0 compare register */
#define GTM_TOM5_CH2_CM0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM0 *)0xF010A88Cu)

