Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  A890, TOM channel 0 CCU1 compare register */
#define GTM_TOM5_CH2_CM1               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM1 *)0xF010A890u)

/** \\brief  A894, TOM channel 0 CCU0 counter register */
#define GTM_TOM5_CH2_CN0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CN0 *)0xF010A894u)

/** \\brief  A880, TOM channel 0 control register */
#define GTM_TOM5_CH2_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL *)0xF010A880u)

/** \\brief  A8A0, TOM channel 0 interrupt enable register */
#define GTM_TOM5_CH2_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN *)0xF010A8A0u)

/** \\brief  A8A4, TOM channel 0 force interrupt register */
#define GTM_TOM5_CH2_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT *)0xF010A8A4u)

/** \\brief  A8A8, TOM channel 0 interrupt mode register */
#define GTM_TOM5_CH2_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE *)0xF010A8A8u)

/** \\brief  A89C, TOM channel 0 interrupt notification register */
#define GTM_TOM5_CH2_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY *)0xF010A89Cu)

/** \\brief  A884, TOM channel 0 CCU0 compare shadow register */
#define GTM_TOM5_CH2_SR0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR0 *)0xF010A884u)

/** \\brief  A888, TOM channel 0 CCU1 compare shadow register */
#define GTM_TOM5_CH2_SR1               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR1 *)0xF010A888u)

/** \\brief  A898, TOM channel 0 status register */
#define GTM_TOM5_CH2_STAT              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_STAT *)0xF010A898u)

/** \\brief  A8CC, TOM channel 0 CCU0 compare register */
#define GTM_TOM5_CH3_CM0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM0 *)0xF010A8CCu)

/** \\brief  A8D0, TOM channel 0 CCU1 compare register */
#define GTM_TOM5_CH3_CM1               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM1 *)0xF010A8D0u)

/** \\brief  A8D4, TOM channel 0 CCU0 counter register */
#define GTM_TOM5_CH3_CN0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CN0 *)0xF010A8D4u)

/** \\brief  A8C0, TOM channel 0 control register */
#define GTM_TOM5_CH3_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL *)0xF010A8C0u)

/** \\brief  A8E0, TOM channel 0 interrupt enable register */
#define GTM_TOM5_CH3_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN *)0xF010A8E0u)

/** \\brief  A8E4, TOM channel 0 force interrupt register */
#define GTM_TOM5_CH3_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT *)0xF010A8E4u)

/** \\brief  A8E8, TOM channel 0 interrupt mode register */
#define GTM_TOM5_CH3_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE *)0xF010A8E8u)

/** \\brief  A8DC, TOM channel 0 interrupt notification register */
#define GTM_TOM5_CH3_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY *)0xF010A8DCu)

/** \\brief  A8C4, TOM channel 0 CCU0 compare shadow register */
#define GTM_TOM5_CH3_SR0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR0 *)0xF010A8C4u)

/** \\brief  A8C8, TOM channel 0 CCU1 compare shadow register */
#define GTM_TOM5_CH3_SR1               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR1 *)0xF010A8C8u)

/** \\brief  A8D8, TOM channel 0 status register */
#define GTM_TOM5_CH3_STAT              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_STAT *)0xF010A8D8u)

/** \\brief  A90C, TOM channel 0 CCU0 compare register */
#define GTM_TOM5_CH4_CM0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM0 *)0xF010A90Cu)

/** \\brief  A910, TOM channel 0 CCU1 compare register */
#define GTM_TOM5_CH4_CM1               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM1 *)0xF010A910u)

/** \\brief  A914, TOM channel 0 CCU0 counter register */
#define GTM_TOM5_CH4_CN0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CN0 *)0xF010A914u)

/** \\brief  A900, TOM channel 0 control register */
#define GTM_TOM5_CH4_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL *)0xF010A900u)

/** \\brief  A920, TOM channel 0 interrupt enable register */
#define GTM_TOM5_CH4_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN *)0xF010A920u)

/** \\brief  A924, TOM channel 0 force interrupt register */
#define GTM_TOM5_CH4_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT *)0xF010A924u)

/** \\brief  A928, TOM channel 0 interrupt mode register */
#define GTM_TOM5_CH4_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE *)0xF010A928u)

/** \\brief  A91C, TOM channel 0 interrupt notification register */
#define GTM_TOM5_CH4_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY *)0xF010A91Cu)

/** \\brief  A904, TOM channel 0 CCU0 compare shadow register */
#define GTM_TOM5_CH4_SR0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR0 *)0xF010A904u)

/** \\brief  A908, TOM channel 0 CCU1 compare shadow register */
#define GTM_TOM5_CH4_SR1               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR1 *)0xF010A908u)

/** \\brief  A918, TOM channel 0 status register */
#define GTM_TOM5_CH4_STAT              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_STAT *)0xF010A918u)

/** \\brief  A94C, TOM channel 0 CCU0 compare register */
#define GTM_TOM5_CH5_CM0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM0 *)0xF010A94Cu)

/** \\brief  A950, TOM channel 0 CCU1 compare register */
#define GTM_TOM5_CH5_CM1               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM1 *)0xF010A950u)

/** \\brief  A954, TOM channel 0 CCU0 counter register */
#define GTM_TOM5_CH5_CN0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CN0 *)0xF010A954u)

/** \\brief  A940, TOM channel 0 control register */
#define GTM_TOM5_CH5_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL *)0xF010A940u)

/** \\brief  A960, TOM channel 0 interrupt enable register */
#define GTM_TOM5_CH5_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN *)0xF010A960u)

/** \\brief  A964, TOM channel 0 force interrupt register */
#define GTM_TOM5_CH5_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT *)0xF010A964u)

/** \\brief  A968, TOM channel 0 interrupt mode register */
#define GTM_TOM5_CH5_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE *)0xF010A968u)

/** \\brief  A95C, TOM channel 0 interrupt notification register */
#define GTM_TOM5_CH5_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY *)0xF010A95Cu)

/** \\brief  A944, TOM channel 0 CCU0 compare shadow register */
#define GTM_TOM5_CH5_SR0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR0 *)0xF010A944u)

/** \\brief  A948, TOM channel 0 CCU1 compare shadow register */
#define GTM_TOM5_CH5_SR1               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR1 *)0xF010A948u)

/** \\brief  A958, TOM channel 0 status register */
#define GTM_TOM5_CH5_STAT              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_STAT *)0xF010A958u)

