Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  A98C, TOM channel 0 CCU0 compare register */
#define GTM_TOM5_CH6_CM0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM0 *)0xF010A98Cu)

/** \\brief  A990, TOM channel 0 CCU1 compare register */
#define GTM_TOM5_CH6_CM1               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM1 *)0xF010A990u)

/** \\brief  A994, TOM channel 0 CCU0 counter register */
#define GTM_TOM5_CH6_CN0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CN0 *)0xF010A994u)

/** \\brief  A980, TOM channel 0 control register */
#define GTM_TOM5_CH6_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL *)0xF010A980u)

/** \\brief  A9A0, TOM channel 0 interrupt enable register */
#define GTM_TOM5_CH6_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN *)0xF010A9A0u)

/** \\brief  A9A4, TOM channel 0 force interrupt register */
#define GTM_TOM5_CH6_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT *)0xF010A9A4u)

/** \\brief  A9A8, TOM channel 0 interrupt mode register */
#define GTM_TOM5_CH6_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE *)0xF010A9A8u)

/** \\brief  A99C, TOM channel 0 interrupt notification register */
#define GTM_TOM5_CH6_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY *)0xF010A99Cu)

/** \\brief  A984, TOM channel 0 CCU0 compare shadow register */
#define GTM_TOM5_CH6_SR0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR0 *)0xF010A984u)

/** \\brief  A988, TOM channel 0 CCU1 compare shadow register */
#define GTM_TOM5_CH6_SR1               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR1 *)0xF010A988u)

/** \\brief  A998, TOM channel 0 status register */
#define GTM_TOM5_CH6_STAT              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_STAT *)0xF010A998u)

/** \\brief  A9CC, TOM channel 0 CCU0 compare register */
#define GTM_TOM5_CH7_CM0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM0 *)0xF010A9CCu)

/** \\brief  A9D0, TOM channel 0 CCU1 compare register */
#define GTM_TOM5_CH7_CM1               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM1 *)0xF010A9D0u)

/** \\brief  A9D4, TOM channel 0 CCU0 counter register */
#define GTM_TOM5_CH7_CN0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CN0 *)0xF010A9D4u)

/** \\brief  A9C0, TOM channel 0 control register */
#define GTM_TOM5_CH7_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL *)0xF010A9C0u)

/** \\brief  A9E0, TOM channel 0 interrupt enable register */
#define GTM_TOM5_CH7_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN *)0xF010A9E0u)

/** \\brief  A9E4, TOM channel 0 force interrupt register */
#define GTM_TOM5_CH7_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT *)0xF010A9E4u)

/** \\brief  A9E8, TOM channel 0 interrupt mode register */
#define GTM_TOM5_CH7_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE *)0xF010A9E8u)

/** \\brief  A9DC, TOM channel 0 interrupt notification register */
#define GTM_TOM5_CH7_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY *)0xF010A9DCu)

/** \\brief  A9C4, TOM channel 0 CCU0 compare shadow register */
#define GTM_TOM5_CH7_SR0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR0 *)0xF010A9C4u)

/** \\brief  A9C8, TOM channel 0 CCU1 compare shadow register */
#define GTM_TOM5_CH7_SR1               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR1 *)0xF010A9C8u)

/** \\brief  A9D8, TOM channel 0 status register */
#define GTM_TOM5_CH7_STAT              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_STAT *)0xF010A9D8u)

/** \\brief  AA0C, TOM channel 0 CCU0 compare register */
#define GTM_TOM5_CH8_CM0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM0 *)0xF010AA0Cu)

/** \\brief  AA10, TOM channel 0 CCU1 compare register */
#define GTM_TOM5_CH8_CM1               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM1 *)0xF010AA10u)

/** \\brief  AA14, TOM channel 0 CCU0 counter register */
#define GTM_TOM5_CH8_CN0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CN0 *)0xF010AA14u)

/** \\brief  AA00, TOM channel 0 control register */
#define GTM_TOM5_CH8_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL *)0xF010AA00u)

/** \\brief  AA20, TOM channel 0 interrupt enable register */
#define GTM_TOM5_CH8_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN *)0xF010AA20u)

/** \\brief  AA24, TOM channel 0 force interrupt register */
#define GTM_TOM5_CH8_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT *)0xF010AA24u)

/** \\brief  AA28, TOM channel 0 interrupt mode register */
#define GTM_TOM5_CH8_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE *)0xF010AA28u)

/** \\brief  AA1C, TOM channel 0 interrupt notification register */
#define GTM_TOM5_CH8_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY *)0xF010AA1Cu)

/** \\brief  AA04, TOM channel 0 CCU0 compare shadow register */
#define GTM_TOM5_CH8_SR0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR0 *)0xF010AA04u)

/** \\brief  AA08, TOM channel 0 CCU1 compare shadow register */
#define GTM_TOM5_CH8_SR1               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR1 *)0xF010AA08u)

/** \\brief  AA18, TOM channel 0 status register */
#define GTM_TOM5_CH8_STAT              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_STAT *)0xF010AA18u)

/** \\brief  AA4C, TOM channel 0 CCU0 compare register */
#define GTM_TOM5_CH9_CM0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM0 *)0xF010AA4Cu)

/** \\brief  AA50, TOM channel 0 CCU1 compare register */
#define GTM_TOM5_CH9_CM1               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM1 *)0xF010AA50u)

/** \\brief  AA54, TOM channel 0 CCU0 counter register */
#define GTM_TOM5_CH9_CN0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CN0 *)0xF010AA54u)

/** \\brief  AA40, TOM channel 0 control register */
#define GTM_TOM5_CH9_CTRL              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL *)0xF010AA40u)

/** \\brief  AA60, TOM channel 0 interrupt enable register */
#define GTM_TOM5_CH9_IRQ_EN            /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN *)0xF010AA60u)

/** \\brief  AA64, TOM channel 0 force interrupt register */
#define GTM_TOM5_CH9_IRQ_FORCINT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT *)0xF010AA64u)

/** \\brief  AA68, TOM channel 0 interrupt mode register */
#define GTM_TOM5_CH9_IRQ_MODE          /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE *)0xF010AA68u)

/** \\brief  AA5C, TOM channel 0 interrupt notification register */
#define GTM_TOM5_CH9_IRQ_NOTIFY        /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY *)0xF010AA5Cu)

/** \\brief  AA44, TOM channel 0 CCU0 compare shadow register */
#define GTM_TOM5_CH9_SR0               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR0 *)0xF010AA44u)

/** \\brief  AA48, TOM channel 0 CCU1 compare shadow register */
#define GTM_TOM5_CH9_SR1               /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR1 *)0xF010AA48u)

/** \\brief  AA58, TOM channel 0 status register */
#define GTM_TOM5_CH9_STAT              /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_STAT *)0xF010AA58u)

/** \\brief  A834, TOM TGC 0 action time base register */
#define GTM_TOM5_TGC0_ACT_TB           /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_TGC0_ACT_TB *)0xF010A834u)

