Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxGtm_reg.h
/** \\brief  A870, TOM TGC 0 enable/disable control register */
#define GTM_TOM5_TGC0_ENDIS_CTRL       /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_TGC0_ENDIS_CTRL *)0xF010A870u)

/** \\brief  A874, TOM TGC 0 enable/disable status register */
#define GTM_TOM5_TGC0_ENDIS_STAT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_TGC0_ENDIS_STAT *)0xF010A874u)

/** \\brief  A838, TOM TGC 0 force update control register */
#define GTM_TOM5_TGC0_FUPD_CTRL        /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_TGC0_FUPD_CTRL *)0xF010A838u)

/** \\brief  A830, TOM TGC 0 global control register */
#define GTM_TOM5_TGC0_GLB_CTRL         /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_TGC0_GLB_CTRL *)0xF010A830u)

/** \\brief  A83C, TOM TGC 0 internal trigger control register */
#define GTM_TOM5_TGC0_INT_TRIG         /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_TGC0_INT_TRIG *)0xF010A83Cu)

/** \\brief  A878, TOM TGC 0 output enable control register */
#define GTM_TOM5_TGC0_OUTEN_CTRL       /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_TGC0_OUTEN_CTRL *)0xF010A878u)

/** \\brief  A87C, TOM TGC 0 output enable status register */
#define GTM_TOM5_TGC0_OUTEN_STAT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_TGC0_OUTEN_STAT *)0xF010A87Cu)

/** \\brief  AA34, TOM TGC 1 action time base register */
#define GTM_TOM5_TGC1_ACT_TB           /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_TGC1_ACT_TB *)0xF010AA34u)

/** \\brief  AA70, TOM TGC 1 enable/disable control register */
#define GTM_TOM5_TGC1_ENDIS_CTRL       /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_TGC1_ENDIS_CTRL *)0xF010AA70u)

/** \\brief  AA74, TOM TGC 1 enable/disable status register */
#define GTM_TOM5_TGC1_ENDIS_STAT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_TGC1_ENDIS_STAT *)0xF010AA74u)

/** \\brief  AA38, TOM TGC 1 force update control register */
#define GTM_TOM5_TGC1_FUPD_CTRL        /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_TGC1_FUPD_CTRL *)0xF010AA38u)

/** \\brief  AA30, TOM TGC 1 global control register */
#define GTM_TOM5_TGC1_GLB_CTRL         /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_TGC1_GLB_CTRL *)0xF010AA30u)

/** \\brief  AA3C, TOM TGC 1 internal trigger control register */
#define GTM_TOM5_TGC1_INT_TRIG         /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_TGC1_INT_TRIG *)0xF010AA3Cu)

/** \\brief  AA78, TOM TGC 1 output enable control register */
#define GTM_TOM5_TGC1_OUTEN_CTRL       /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_TGC1_OUTEN_CTRL *)0xF010AA78u)

/** \\brief  AA7C, TOM TGC 1 output enable status register */
#define GTM_TOM5_TGC1_OUTEN_STAT       /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_TGC1_OUTEN_STAT *)0xF010AA7Cu)

/** \\brief  80, GTM TOM   output level */
#define GTM_TOM_OUT0                   /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_OUT *)0xF0100080u)

/** Alias (User Manual Name) for GTM_TOM_OUT0.
 * To use register names with standard convension, please use GTM_TOM_OUT0.
 */
#define GTM_TOM0_OUT                   (GTM_TOM_OUT0)

/** Alias (User Manual Name) for GTM_TOM_OUT0.
 * To use register names with standard convension, please use GTM_TOM_OUT0.
 */
#define GTM_TOM0_OUT                   (GTM_TOM_OUT0)

/** \\brief  84, GTM TOM   output level */
#define GTM_TOM_OUT1                   /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_OUT *)0xF0100084u)

/** Alias (User Manual Name) for GTM_TOM_OUT1.
 * To use register names with standard convension, please use GTM_TOM_OUT1.
 */
#define GTM_TOM1_OUT                   (GTM_TOM_OUT1)

/** Alias (User Manual Name) for GTM_TOM_OUT1.
 * To use register names with standard convension, please use GTM_TOM_OUT1.
 */
#define GTM_TOM1_OUT                   (GTM_TOM_OUT1)

/** \\brief  88, GTM TOM   output level */
#define GTM_TOM_OUT2                   /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_OUT *)0xF0100088u)

/** Alias (User Manual Name) for GTM_TOM_OUT2.
 * To use register names with standard convension, please use GTM_TOM_OUT2.
 */
#define GTM_TOM2_OUT                   (GTM_TOM_OUT2)

/** Alias (User Manual Name) for GTM_TOM_OUT2.
 * To use register names with standard convension, please use GTM_TOM_OUT2.
 */
#define GTM_TOM2_OUT                   (GTM_TOM_OUT2)

/** \\brief  8C, GTM TOM   output level */
#define GTM_TOM_OUT3                   /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_OUT *)0xF010008Cu)

/** Alias (User Manual Name) for GTM_TOM_OUT3.
 * To use register names with standard convension, please use GTM_TOM_OUT3.
 */
#define GTM_TOM3_OUT                   (GTM_TOM_OUT3)

/** Alias (User Manual Name) for GTM_TOM_OUT3.
 * To use register names with standard convension, please use GTM_TOM_OUT3.
 */
#define GTM_TOM3_OUT                   (GTM_TOM_OUT3)

/** \\brief  90, GTM TOM   output level */
#define GTM_TOM_OUT4                   /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_OUT *)0xF0100090u)

/** Alias (User Manual Name) for GTM_TOM_OUT4.
 * To use register names with standard convension, please use GTM_TOM_OUT4.
 */
#define GTM_TOM4_OUT                   (GTM_TOM_OUT4)

/** Alias (User Manual Name) for GTM_TOM_OUT4.
 * To use register names with standard convension, please use GTM_TOM_OUT4.
 */
#define GTM_TOM4_OUT                   (GTM_TOM_OUT4)

/** \\brief  94, GTM TOM   output level */
#define GTM_TOM_OUT5                   /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_OUT *)0xF0100094u)

/** Alias (User Manual Name) for GTM_TOM_OUT5.
 * To use register names with standard convension, please use GTM_TOM_OUT5.
 */
#define GTM_TOM5_OUT                   (GTM_TOM_OUT5)

/** Alias (User Manual Name) for GTM_TOM_OUT5.
 * To use register names with standard convension, please use GTM_TOM_OUT5.
 */
#define GTM_TOM5_OUT                   (GTM_TOM_OUT5)
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXGTM_REG_H */
